[
  {
    "id": "46064571",
    "title": "Migrating the main Zig repository from GitHub to Codeberg",
    "url": "https://ziglang.org/news/migrating-from-github-to-codeberg/",
    "summary": "The Zig project is migrating its main repository from GitHub to Codeberg, effective immediately, making the GitHub repository read-only. This move is attributed to GitHub's decline in engineering quality since its acquisition by Microsoft seven years ago, citing issues like bloated, buggy interfaces, sluggish performance, and neglected, unreliable GitHub Actions that disrupt CI. The migration also aims to prevent violations of Zig's strict \"no LLM / no AI\" policy, which GitHub's Copilot feature infringes upon.\n\nWhile GitHub Sponsors has been crucial for Zig's funding, it's now considered a liability due to product decline since its key leader's departure. The Zig Software Foundation requests donors to switch recurring contributions from GitHub Sponsors to Every.org, a non-profit, as existing perks will be sunsetted and re-offered there.\n\nThe migration plan involves leaving existing GitHub issues and pull requests open and unmigrated, treating them as \"copy-on-write.\" New issues on Codeberg will start at 30000 to ensure distinct numbering. Users are asked not to move their GitHub content unless edits are required, as existing GitHub PRs and issues will still be reviewed. The author, Andrew, stresses the importance of non-profits in protecting the commons against platform capitalism.",
    "chinese_title": "Zig 主仓库从 GitHub 迁移到 Codeberg",
    "chinese_summary": "Zig 项目正在将其主代码库从 GitHub 迁移到 Codeberg，立即生效，并使 GitHub 代码库变为只读。此举归因于 GitHub 自七年前被微软收购以来工程质量的下降，具体问题包括界面臃肿、漏洞百出、性能迟缓，以及被忽视且不可靠的 GitHub Actions 扰乱 CI。此次迁移还旨在防止违反 Zig 严格的“禁止大型语言模型/禁止人工智能”政策，因为 GitHub 的 Copilot 功能侵犯了这一政策。\n\n尽管 GitHub Sponsors 对 Zig 的资金支持至关重要，但由于其关键负责人离职后产品质量下降，现在它被视为一种负担。Zig 软件基金会请求捐助者将定期捐款从 GitHub Sponsors 切换到非营利组织 Every.org，因为现有福利将在此处停止并重新提供。\n\n迁移计划包括保留现有的 GitHub issues 和 pull requests，使其保持开放且不进行迁移，并将其视为“写时复制”。Codeberg 上的新 issues 将从 30000 开始编号，以确保编号的唯一性。除非需要编辑，否则用户无需迁移其 GitHub 内容，因为现有的 GitHub PRs 和 issues 仍将接受审查。作者 Andrew 强调了非营利组织在保护公共资源免受平台资本主义侵害方面的重要性。"
  },
  {
    "id": "46063072",
    "title": "Bring bathroom doors back to hotels",
    "url": "https://bringbackdoors.com/",
    "summary": "The author expresses profound frustration with hotels removing bathroom doors, deeming it an unacceptable sacrifice of privacy and dignity for \"aesthetic\" or cost-saving reasons. Believing a bathroom door should be as standard as a bed, they have launched a website, \"Bring Back Doors,\" to tackle this issue.\n\nThe website serves two main purposes:\n1.  **Finding Hotels with Doors:** It compiles a list of hotels guaranteed to have bathroom doors that close completely and are not made of glass. This information is gathered by directly emailing hundreds of hotels and sorting their affirmative responses by price range and city.\n2.  **Checking and Reporting Doorless Hotels:** Guests can quickly search the site to see if a hotel they are considering has been reported as lacking a door. The project also relies on public participation, encouraging guests to submit hotels without proper bathroom doors via email (bringbackdoors@gmail.com) or Instagram DM (with a photo of the setup) for public shaming.\n\nThe ultimate goal is to \"name and shame\" these hotels, protecting the dignity and privacy of future travelers by making this information readily available.",
    "chinese_title": "让浴室门回归酒店",
    "chinese_summary": "作者对酒店拆除浴室门深感不满，认为这是出于“美观”或节约成本的考虑而对隐私和尊严做出的不可接受的牺牲。他们认为浴室门应该像床一样是标配，为此，他们建立了一个名为“Bring Back Doors”（恢复房门）的网站来解决这个问题。\n\n该网站主要有两大用途：\n1. **寻找带门的酒店：** 它汇集了一份酒店名单，这些酒店保证拥有能够完全关闭且非玻璃材质的浴室门。这些信息通过直接向数百家酒店发送电子邮件，并根据价格范围和城市对它们的肯定答复进行整理。\n2. **查询并举报无门酒店：** 客人可以在网站上快速搜索，查看他们正在考虑的酒店是否已被举报为缺少浴室门。该项目还依赖公众参与，鼓励客人们通过电子邮件 (bringbackdoors@gmail.com) 或 Instagram 私信（附带照片）提交没有合适浴室门的酒店，以便公开曝光。\n\n最终目标是“点名批评”这些酒店，通过提供这些易于获取的信息来保护未来旅客的尊严和隐私。"
  },
  {
    "id": "46064757",
    "title": "Penpot: The Open-Source Figma",
    "url": "https://github.com/penpot/penpot",
    "summary": "Penpot, often dubbed \"The Open-Source Figma,\" is the first open-source design tool built for seamless design and code collaboration. It allows designers to create designs, prototypes, and design systems, while developers access ready-to-use code, streamlining workflows and eliminating handoff issues.\n\nOperating with open standards like SVG, CSS, HTML, and JSON, Penpot is free, available in-browser or self-hosted. Recent major updates, including the 2.0 release, introduced native design tokens for enhanced collaboration, a groundbreaking CSS Grid Layout, a complete UI redesign, and an improved Components system.\n\nKey features include an inspect mode for instant code access, a flexible plugin system, and integrations via webhooks and an API. Penpot facilitates building robust design systems with native Design Tokens, Components, and Variants for consistency. Users can deploy it as a SAAS or self-host using Docker or Kubernetes.\n\nThe platform thrives on its open-source community, encouraging contributions through sharing libraries, reporting bugs, translating, or directly contributing code. A code of conduct fosters a positive environment. Resources like documentation and tutorials are available, and Penpot operates under the Mozilla Public License v2.0, with an annual Penpot Fest bringing the community together.",
    "chinese_title": "Penpot：开源版Figma",
    "chinese_summary": "Penpot 常被称为“开源版 Figma”，是首个旨在实现设计与代码无缝协作的开源设计工具。它允许设计师创建设计稿、原型和设计系统，而开发人员则可获取现成的代码，从而简化工作流程并消除交接问题。\n\nPenpot 采用 SVG、CSS、HTML 和 JSON 等开放标准运行，免费提供，既可在浏览器中使用，也可自行托管。近期重大更新，包括 2.0 版本的发布，引入了原生设计令牌（design tokens）以增强协作、突破性的 CSS 网格布局、完整的 UI 重新设计以及改进的组件系统。\n\n主要功能包括用于即时访问代码的检查模式、灵活的插件系统，以及通过 Webhook 和 API 进行集成。Penpot 利用原生的设计令牌、组件和变体，协助构建强大的设计系统以保持一致性。用户可以将其部署为 SaaS 服务，或使用 Docker 或 Kubernetes 进行自行托管。\n\n该平台得益于其开源社区的蓬勃发展，鼓励通过分享库、报告错误、翻译或直接贡献代码来参与贡献。行为准则有助于营造积极的环境。提供了文档和教程等资源，Penpot 遵循 Mozilla 公共许可证 v2.0，每年举办的 Penpot Fest 将社区成员聚集在一起。"
  },
  {
    "id": "46062504",
    "title": "The EU made Apple adopt new Wi-Fi standards, and now Android can support AirDrop",
    "url": "https://arstechnica.com/gadgets/2025/11/the-eu-made-apple-adopt-new-wi-fi-standards-and-now-android-can-support-airdrop/",
    "summary": "Google has updated Android’s Quick Share to support Apple’s AirDrop, enabling direct file sharing between Android and iPhone devices. This allows Android phones to appear in AirDrop's \"everyone for 10 minutes\" mode, and vice versa, though \"contacts only\" mode is not currently supported. Initially, this feature will be available only on the Pixel 10 series, with Google expressing interest in expanding it to more Android devices. Google emphasizes the security of these direct peer-to-peer transfers, crediting the memory-safe Rust programming language.\n\nThis newfound interoperability is a direct result of the European Union’s Digital Markets Act (DMA). Historically, Apple’s AirDrop used a proprietary protocol called Apple Wireless Direct Link (AWDL). However, the DMA mandated Apple to adopt the interoperable Wi-Fi Aware standard, which Apple had helped develop but was slow to implement in its products. With Wi-Fi Aware now integrated into iOS 26 and iPadOS 26 (supported on iPhone 12 and later, and recent iPads), other devices like Android can now connect.\n\nGoogle has supported Wi-Fi Aware since Android 8.0, suggesting potential for wider Android device compatibility in the future. Notably, macOS AirDrop is not covered by the DMA and therefore will not work with Android. Google's announcement deliberately avoids crediting the DMA, likely due to the company's broader criticisms of the law and potential fines it faces.",
    "chinese_title": "欧盟迫使苹果采用新的Wi-Fi标准，现在安卓可以支持隔空投送了。",
    "chinese_summary": "谷歌已更新安卓的“快速分享”功能，以支持苹果的隔空投送，从而实现安卓和iPhone设备之间的直接文件共享。这使得安卓手机可以出现在隔空投送的“所有人（10分钟）”模式中，反之亦然，尽管目前尚不支持“仅限联系人”模式。初期，此功能将仅在Pixel 10系列上可用，谷歌表示有兴趣将其扩展到更多安卓设备。谷歌强调了这些直接点对点传输的安全性，将其归功于内存安全的Rust编程语言。\n\n这种新发现的互操作性是欧盟《数字市场法案》（DMA）的直接成果。历史上，苹果的隔空投送使用一种名为Apple无线直连（AWDL）的专有协议。然而，DMA强制苹果采用可互操作的Wi-Fi Aware标准，该标准苹果曾参与开发，但在其产品中实施缓慢。随着Wi-Fi Aware现已集成到iOS 26和iPadOS 26中（支持iPhone 12及更高版本，以及近期发布的iPad），其他设备如安卓现在也可以连接了。\n\n谷歌自安卓8.0版本以来就支持Wi-Fi Aware，这预示着未来可能会有更广泛的安卓设备兼容性。值得注意的是，macOS的隔空投送不受DMA管辖，因此无法与安卓设备互通。谷歌的声明刻意避免提及DMA，这可能是由于该公司对该法案的广泛批评以及可能面临的罚款。"
  },
  {
    "id": "46066280",
    "title": "Linux Kernel Explorer",
    "url": "https://reverser.dev/linux-kernel-explorer",
    "summary": "The \"Linux Kernel Explorer\" is an interactive learning platform designed to help users understand the Linux kernel source code, based on \"The Kernel in The Mind\" by Moon Hee Lee. It features a file explorer, a structured guide across multiple chapters, study files, and knowledge checks.\n\nChapter 1, \"Understanding Linux Kernel Before Code,\" establishes foundational concepts:\n*   The kernel is not a process; it is the fundamental system authority bridging hardware and software.\n*   It serves user processes by orchestrating syscalls, interrupts, and scheduling.\n*   The kernel operates through a system of layers characterized as virtual, mapped, isolated, and controlled.\n\nThe guide provides specific study files like `init/main.c`, `kernel/fork.c`, and `include/linux/sched.h` to illustrate these points. Knowledge checks reinforce understanding of the kernel's nature, its service to processes, and its layered structure.\n\nFuture chapters cover System Foundations, Memory and Isolation, Boot and Entry, Entering the Kernel, Execution Contexts, Communication, Scheduling, I/O, Virtualization, and concluding insights, offering a comprehensive exploration of the Linux kernel's inner workings.",
    "chinese_title": "Linux 内核探索器",
    "chinese_summary": "“Linux内核探索器”是一个交互式学习平台，旨在帮助用户理解Linux内核源代码，其设计基于Moon Hee Lee的《心智中的内核》。它具备文件浏览器、跨多章节的结构化指南、学习文件和知识检测。\n\n第一章，“编写代码前理解Linux内核”，确立了以下基础概念：\n*   内核不是进程；它是连接硬件和软件的基础系统权限。\n*   它通过协调系统调用、中断和调度来服务用户进程。\n*   内核通过一个分层系统运行，这些层被描述为虚拟的、映射的、隔离的、受控的。\n\n该指南提供了具体学习文件，例如`init/main.c`、`kernel/fork.c`和`include/linux/sched.h`，以阐明这些要点。知识检测有助于巩固对内核本质、其对进程的服务以及其分层结构的理解。\n\n未来章节将涵盖系统基础、内存与隔离、引导与进入、进入内核、执行上下文、通信、调度、输入/输出、虚拟化以及总结性见解，对Linux内核的内部工作原理提供全面探索。"
  },
  {
    "id": "46075320",
    "title": "Pocketbase – open-source realtime back end in 1 file",
    "url": "https://pocketbase.io/",
    "summary": "This article introduces **Pocketbase**, described as an open-source, realtime backend solution that comes conveniently packaged in a single file. For those interested in exploring its capabilities, the article provides direct links to a **live demo** and its comprehensive **documentation**.",
    "chinese_title": "Pocketbase – 开源实时后端，单文件",
    "chinese_summary": "本文介绍了 **Pocketbase**，它被描述为一个开源、实时的后端解决方案，方便地打包成一个单一文件。对于有兴趣探索其功能的用户，文章提供了其 **实时演示** 和全面的 **文档** 的直接链接。"
  },
  {
    "id": "46077393",
    "title": "EU Council Approves New \"Chat Control\" Mandate Pushing Mass Surveillance",
    "url": "https://reclaimthenet.org/eu-council-approves-new-chat-control-mandate-pushing-mass-surveillance",
    "summary": "The EU Council has approved a new \"Chat Control\" mandate, officially named the Regulation laying down rules to prevent and combat child sexual abuse (CSAM). This controversial proposal requires private messaging services, including those with end-to-end encryption, to implement \"upload moderation\" or client-side scanning. This means all user communications, such as private chats and emails, would be scanned directly on the user's device *before* encryption, in an effort to detect CSAM material.\n\nCritics and privacy advocates strongly condemn the mandate, labeling it as a form of mass surveillance that fundamentally erodes privacy and digital security. They argue that it necessitates weakening encryption and creating insecure backdoors, thereby making all users vulnerable to data breaches and government overreach. Concerns also include the high potential for false positives and the risk that the system could be expanded to scan for other types of content beyond CSAM. While proponents justify it as a crucial tool against child exploitation, opponents contend it surveils an entire population rather than focusing on suspected criminals, violating fundamental rights without guaranteeing effectiveness.\n\nFollowing the Council's approval, the mandate will now proceed to \"trilogue\" negotiations with the European Parliament, which has historically expressed greater skepticism towards such extensive surveillance measures.",
    "chinese_title": "欧盟理事会通过新的“聊天控制”授权，推动大规模监控",
    "chinese_summary": "欧盟理事会已批准一项新的“聊天控制”授权，其官方名称为《预防和打击儿童性虐待（CSAM）规定》。这项备受争议的提案要求私人消息服务，包括那些采用端到端加密的服务，实施“上传审核”或“客户端扫描”。这意味着所有用户通信，例如私人聊天和电子邮件，都将在加密*之前*直接在用户设备上进行扫描，以检测CSAM内容。\n\n批评者和隐私倡导者强烈谴责这项授权，称其为一种大规模监控形式，从根本上侵蚀了隐私和数字安全。他们认为，这必然会削弱加密技术并制造不安全的后门，从而使所有用户都容易受到数据泄露和政府过度干预的侵害。担忧还包括较高的误报可能性，以及该系统可能被扩大到扫描CSAM之外其他类型内容的风险。尽管支持者将其辩解为打击儿童剥削的关键工具，但反对者则认为它是在监视全体民众，而非专注于可疑的犯罪分子，此举侵犯了基本权利，且无法保证其有效性。\n\n在理事会批准之后，这项授权现在将进入与欧洲议会的“三方对话”谈判，欧洲议会历来对此类广泛的监控措施表示出更大的怀疑。"
  },
  {
    "id": "46070668",
    "title": "Same-day upstream Linux support for Snapdragon 8 Elite Gen 5",
    "url": "https://www.qualcomm.com/developer/blog/2025/10/same-day-snapdragon-8-elite-gen-5-upstream-linux-support",
    "summary": "The article announces the immediate availability of upstream Linux support for the new Snapdragon 8 Elite Gen 5 processor. The key highlight is the \"same-day\" nature of this support, indicating that the necessary code and drivers are integrated into the official Linux kernel repositories concurrently with, or very soon after, the chip's release or announcement.\n\nThis \"upstream\" integration is crucial as it ensures robust, long-term compatibility, stability, and easier development for Linux-based systems utilizing the Snapdragon 8 Elite Gen 5, benefiting the broader open-source community and accelerating adoption on new hardware.",
    "chinese_title": "骁龙8 Elite 第五代当日上游Linux支持",
    "chinese_summary": "本文宣布，全新骁龙 8 Elite Gen 5 处理器已获得立即提供的 Linux 上游支持。其主要亮点在于这种支持的“同步发布”特性，这意味着所需的代码和驱动程序在芯片发布或公布时或之后不久，便已集成到官方 Linux 内核代码库中。这种“上游”集成至关重要，因为它确保了采用骁龙 8 Elite Gen 5 的 Linux 系统具备强大的长期兼容性、稳定性以及更简便的开发，从而造福更广泛的开源社区，并加速了新硬件上的采用。"
  },
  {
    "id": "46065034",
    "title": "DIY NAS: 2026 Edition",
    "url": "https://blog.briancmoses.com/2025/11/diy-nas-2026-edition.html",
    "summary": "The article details the author's \"DIY NAS: 2026 Edition,\" a continuation of an annual tradition to build a network-attached storage server. The build adheres to criteria: small form factor, at least six drive bays, an integrated low-power CPU (for 24/7 operation), and homelab potential for VMs/containers.\n\nThe author notes a challenging economic climate, with rising prices for hard drives, SSDs, RAM, CPUs, and motherboards, making it a difficult time to build. Despite this, the project proceeded.\n\nKey components chosen include:\n*   **Motherboard/CPU:** Topton N22 with Intel Core 3 N355, featuring 8 SATA, 2 M.2 NVMe, and 10Gbps NIC, enhancing homelab capabilities.\n*   **Case:** JONSBO N4, selected for its value and capacity for six 3.5” and two 2.5” drives.\n*   **Fan:** A Noctua NF-A12x25 PWM replaced the stock noisy case fan.\n*   **RAM:** A 32GB DDR5 4800MHz SODIMM was used (noting high current prices).\n*   **Storage:** Two 128GB Silicon Power A55 SATA SSDs for boot drives and two 1TB Silicon Power NVMe M.2 SSDs for apps/VMs (limited to PCIe 3.0 x1). Bulk storage used decommissioned drives, with advice provided on smart HDD purchasing.\n*   **Power Supply:** SilverStone SX500-G SFX PSU.\n*   **Cables:** SFF-8643 to 4x SATA breakout cables for efficient wiring.\n\nThe author consistently chooses TrueNAS Community Edition for its enterprise-grade reliability and user-friendliness. The total estimated cost for the build, excluding new bulk storage, is $989.36. Assembly was mostly smooth, with minor cable management adjustments.",
    "chinese_title": "DIY NAS：2026 版",
    "chinese_summary": "这篇文章详细介绍了作者的“DIY NAS：2026版”，这是他每年搭建网络附加存储服务器的传统延续。该构建遵循以下标准：小巧外形、至少六个硬盘位、集成低功耗CPU（用于24/7运行），以及作为家庭实验室支持虚拟机/容器的潜力。\n\n作者指出当前经济形势严峻，硬盘、固态硬盘、内存、CPU和主板价格上涨，使当前成为一个艰难的搭建时期。尽管如此，该项目仍然继续进行。\n\n选用的关键组件包括：\n*   **主板/CPU：** Topton N22，搭载Intel Core 3 N355处理器，具有8个SATA接口、2个M.2 NVMe接口和10Gbps网卡，增强了家庭实验室功能。\n*   **机箱：** 乔思伯（JONSBO）N4，因其性价比和可容纳六个3.5英寸和两个2.5英寸硬盘的能力而入选。\n*   **风扇：** 猫头鹰（Noctua）NF-A12x25 PWM风扇取代了原装噪音较大的机箱风扇。\n*   **内存：** 使用了一根32GB DDR5 4800MHz SODIMM内存条（作者特别指出当前价格昂贵）。\n*   **存储：** 两块128GB的Silicon Power A55 SATA固态硬盘作为启动盘，两块1TB的Silicon Power NVMe M.2固态硬盘用于应用程序/虚拟机（受限于PCIe 3.0 x1通道）。大容量存储使用了退役硬盘，并提供了智能购买硬盘的建议。\n*   **电源：** 银欣（SilverStone）SX500-G SFX电源。\n*   **线缆：** SFF-8643转4个SATA分线缆，以实现高效布线。\n\n作者一贯选择TrueNAS Community Edition，因为它具备企业级的可靠性和用户友好性。本次搭建的估计总成本（不包括新的大容量存储）为989.36美元。组装过程基本顺利，只进行了少量的线缆管理调整。"
  },
  {
    "id": "46075882",
    "title": "Show HN: Glasses to detect smart-glasses that have cameras",
    "url": "https://github.com/NullPxl/banrays",
    "summary": "The \"Ban-Rays\" project aims to develop glasses capable of detecting smart-glasses equipped with cameras, exploring two main approaches: Optics and Networking.\n\nThe Optics approach uses infrared (IR) light to exploit the \"cat-eye effect,\" where camera lenses retro-reflect light. While this concept has historical precedent, current experiments show weak and inconsistent signals from Meta Raybans, making reliable differentiation from other reflective surfaces difficult with existing hardware. The developer is experimenting with specific IR sweep patterns and combining different wavelengths, while deliberately avoiding the use of an onboard camera for detection.\n\nThe Networking approach focuses on Bluetooth Low Energy (BLE) and Wi-Fi analysis. Currently, fingerprinting Meta Raybans via BLE advertisements is the most promising and reliable method. The system successfully detects Meta-specific Manufacturer IDs (0x01AB) and Service UUIDs (0xFD5F) during power-on, pairing, or when the glasses are removed from their case. However, detecting directed BLE traffic during continuous usage (when glasses are connected to a phone) is challenging and requires more advanced hardware than the current ESP32 setup. Bluetooth Classic detection is also noted as being hardware-intensive.\n\nOverall, BLE fingerprinting offers an initial detection capability, but both approaches face significant technical hurdles for consistent, real-time camera detection during active use.",
    "chinese_title": "展示 HN: 检测带摄像头智能眼镜的眼镜",
    "chinese_summary": "“Ban-Rays”项目旨在开发能够检测配备摄像头的智能眼镜的眼镜，探索两种主要方法：光学和网络。\n\n光学方法利用红外（IR）光来利用“猫眼效应”，即摄像头镜头会逆向反射光线。尽管这一概念有历史先例，但目前的实验表明，Meta Raybans发出的信号微弱且不稳定，使得现有硬件难以与其他反射表面进行可靠区分。开发者正在试验特定的红外扫描模式并结合不同波长，同时刻意避免使用机载摄像头进行检测。\n\n网络方法侧重于低功耗蓝牙（BLE）和Wi-Fi分析。目前，通过BLE广播对Meta Raybans进行指纹识别是最有前景和可靠的方法。系统在Meta Raybans开机、配对或从眼镜盒中取出时，能成功检测到Meta特有的制造商ID（0x01AB）和服务UUID（0xFD5F）。然而，在持续使用（当眼镜连接到手机时）期间检测定向BLE流量具有挑战性，并且需要比当前ESP32配置更先进的硬件。传统蓝牙检测也被指出是硬件密集型的。\n\n总体而言，BLE指纹识别提供了一种初步的检测能力，但两种方法在活跃使用期间实现一致、实时的摄像头检测都面临重大的技术障碍。"
  },
  {
    "id": "46072002",
    "title": "AI CEO – Replace your boss before they replace you",
    "url": "https://replaceyourboss.ai/",
    "summary": "The article \"AI CEO – Replace Your Boss Before They Replace You\" addresses the escalating capability of artificial intelligence to assume high-level leadership and management functions, effectively challenging traditional human executive roles.\n\nThe central premise is a stark warning: AI is not just a tool for optimization but is evolving into a force capable of strategic decision-making, resource allocation, and oversight – functions typically performed by a CEO or high-level manager. This shift brings with it unprecedented efficiency, data-driven impartiality, and scalability.\n\nCrucially, the article extends this threat beyond just the C-suite, arguing that if AI can replace the boss, it can certainly displace individual contributors who do not adapt. Therefore, the core message is a call to proactive action: professionals must learn to leverage AI not merely as a productivity tool, but as a strategic partner to enhance their own value and decision-making capabilities.\n\nTo \"replace your boss\" before they replace *you* means understanding AI's potential, integrating it into one's workflow, and developing uniquely human skills – such as creativity, emotional intelligence, critical thinking, and complex problem-solving – that complement, rather than compete with, AI's strengths. The article emphasizes becoming an indispensable facilitator and architect of AI solutions within an organization, rather than a passive observer or potential casualty of its advancement.",
    "chinese_title": "人工智能CEO：别等老板换掉你，你先换掉老板",
    "chinese_summary": "文章《AI CEO：在你被取代前先取代你的老板》探讨了人工智能日益增强的、承担高级领导和管理职能的能力，从而有效挑战传统的人类高管角色。\n\n其核心前提是一个严峻的警告：人工智能不仅是一种优化工具，而且正在演变为一种能够进行战略决策、资源分配和监督的力量——这些职能通常由CEO或高级经理执行。这一转变带来了前所未有的效率、数据驱动的公正性和可扩展性。\n\n至关重要的是，文章将这种威胁延伸到高管层之外，认为如果AI能取代老板，那么它肯定也能取代那些不适应的普通员工。因此，其核心信息是呼吁采取积极行动：职场人士必须学会将AI不仅作为一种生产力工具，而且作为战略伙伴加以利用，以提升自身的价值和决策能力。\n\n在你的老板取代*你*之前“取代你的老板”意味着理解AI的潜力，将其融入自己的工作流程，并发展独特的、人类特有的技能——例如创造力、情商、批判性思维和复杂问题解决能力——这些技能应与AI的优势互补，而非竞争。文章强调要成为组织内部AI解决方案不可或缺的推动者和架构师，而不是被动旁观者或其进步的潜在受害者。"
  },
  {
    "id": "46061682",
    "title": "S&box is now an open source game engine",
    "url": "https://sbox.game/news/update-25-11-26",
    "summary": "S&box, the game platform developed by Facepunch Studios, has officially transitioned to an open-source game engine.",
    "chinese_title": "S&box 现在是开源游戏引擎",
    "chinese_summary": "S&box，由Facepunch Studios开发的游戏平台，已正式转型为开源游戏引擎。"
  },
  {
    "id": "46061623",
    "title": "Don't Download Apps",
    "url": "https://blog.calebjay.com/posts/dont-download-apps/",
    "summary": "The article strongly advises against downloading apps, citing aggressive practices, particularly in Taiwan, where staff may even install apps without consent for minor discounts, leading to unwanted spam.\n\nThe author presents two main reasons for this stance:\n\n1.  **Surveillance Capitalism and Pricing:** Apps enable companies to collect vast amounts of user data, leading to \"surveillance pricing.\" This allows corporations to charge individualized prices (e.g., more when they know you've just been paid), thereby granting them excessive power over the value of currency and your purchasing power, rather than market forces.\n2.  **Binding Arbitration:** App \"Terms of Service\" frequently include binding arbitration clauses. These clauses force users into private dispute resolution, bypassing traditional court systems with judges and juries. Mediators are typically hired by the company, creating a significant power imbalance. The article cites the case of Jeffrey Piccolo, whose lawsuit against Disney for his wife's death was almost forced into arbitration due to a Disney+ subscription's terms. Since the U.S. Supreme Court upholds binding arbitration, individuals must take personal steps to avoid signing away their rights.\n\nThe author warns of future scenarios where app usage (e.g., Uber Eats, Twitter/TeXla, WaPo/Amazon) could force arbitration for unrelated incidents involving parent companies. The ultimate recommendation is to refrain from downloading apps to protect personal data and rights.",
    "chinese_title": "不要下载应用",
    "chinese_summary": "文章强烈建议不要下载应用程序，理由是其激进做法，尤其是在台湾，工作人员甚至可能在未经同意的情况下为了一点小折扣而安装应用程序，从而导致不必要的垃圾信息。\n\n作者提出支持这一立场的两个主要原因：\n\n1.  **监控资本主义与定价：** 应用程序使公司能够收集大量用户数据，从而导致“监控定价”。这使得企业可以收取个性化价格（例如，当他们知道你刚发工资时会收取更高的价格），从而赋予它们对货币价值和你的购买力过度的权力，而不是由市场力量决定。\n2.  **强制仲裁：** 应用程序的“服务条款”中经常包含强制仲裁条款。这些条款强制用户进行私人争议解决，绕过有法官和陪审团的传统法院系统。仲裁员通常由公司聘用，造成了严重的力量不平衡。文章引用了杰弗里·皮科洛的案例，他因妻子去世起诉迪士尼的案件，险些因Disney+订阅条款而被强制仲裁。由于美国最高法院支持强制仲裁，个人必须采取措施，避免放弃自己的权利。\n\n作者警告说，未来可能会出现应用程序的使用（例如，优步外卖、Twitter/TeXla、华盛顿邮报/亚马逊）会强制对涉及母公司的无关事件进行仲裁。最终建议是避免下载应用程序，以保护个人数据和权利。"
  },
  {
    "id": "46069048",
    "title": "TPUs vs. GPUs and why Google is positioned to win AI race in the long term",
    "url": "https://www.uncoveralpha.com/p/the-chip-made-for-the-ai-inference",
    "summary": "Google developed Tensor Processing Units (TPUs) in 2013 to address the escalating compute demands of AI, realizing that traditional CPUs and GPUs were inefficient for the massive matrix multiplications central to deep learning. TPUs are Application-Specific Integrated Circuits (ASICs) designed for TensorFlow (and now PyTorch) neural networks, rapidly deployed internally by 2015.\n\nThe core differentiator is the TPU's \"Systolic Array\" architecture. Unlike general-purpose GPUs burdened by \"architectural baggage,\" TPUs minimize memory reads/writes (the Von Neumann bottleneck) by flowing data directly through computing units, leading to significantly higher Operations Per Joule for AI tasks. Google's latest TPUv7 (Ironwood) boasts substantial performance leaps, including 4,614 TFLOPS (BF16), 192GB HBM, and advanced Inter-Chip Interconnect.\n\nWhile official numbers are limited, industry experts and former Google employees indicate TPUs offer superior cost-effectiveness and performance per watt for specific AI applications, with some estimates suggesting 1.4x better performance per dollar and 60-65% higher efficiency than Nvidia's Hopper GPUs. Google's rate of TPU improvement is also believed to be faster than Nvidia's.\n\nDespite these advantages, wider adoption faces challenges: Nvidia's dominant CUDA/PyTorch ecosystem makes switching difficult, though TPUs are better suited for the less CUDA-dependent inference workloads. Furthermore, TPUs are exclusive to Google Cloud Platform, creating multi-cloud hurdles due to data egress costs and customer fears of vendor lock-in—problems Nvidia's universally available GPUs don't face.",
    "chinese_title": "TPU与GPU：为何谷歌有望长期赢得AI竞赛",
    "chinese_summary": "谷歌于2013年开发了张量处理单元（TPU），以应对AI日益增长的计算需求，它意识到传统的CPU和GPU在深度学习核心的大规模矩阵乘法方面效率低下。TPU是专为TensorFlow（现也支持PyTorch）神经网络设计的专用集成电路（ASIC），并于2015年迅速在内部投入使用。\n\n核心区别在于TPU的“脉动阵列”架构。与通用GPU因“架构包袱”而受限不同，TPU通过让数据直接流经计算单元，最大限度地减少内存读写（冯·诺依曼瓶颈），从而在AI任务中实现显著更高的每焦耳运算量。谷歌最新的TPUv7（代号“铁木”）在性能上取得了显著飞跃，包括4,614 TFLOPS（BF16）、192GB HBM和先进的芯片间互连。\n\n尽管官方数据有限，但行业专家和前谷歌员工指出，TPU在特定AI应用中提供了卓越的成本效益和每瓦性能，一些估计表明，其每美元性能比英伟达的Hopper GPU高1.4倍，效率高60-65%。谷歌TPU的改进速度也被认为快于英伟达。\n\n尽管有这些优势，但更广泛的采用仍面临挑战：英伟达主导的CUDA/PyTorch生态系统使得切换变得困难，尽管TPU更适合对CUDA依赖性较低的推理工作负载。此外，TPU是Google Cloud Platform独有的，由于数据传出成本和客户对供应商锁定的担忧，造成了多云障碍——这些问题是英伟达普遍可用的GPU所没有的。"
  },
  {
    "id": "46078770",
    "title": "Petition to formally recognize open source work as civic service in Germany",
    "url": "https://www.openpetition.de/petition/online/anerkennung-von-open-source-arbeit-als-ehrenamt-in-deutschland#petition-main",
    "summary": "A petition has been launched in Germany advocating for the formal recognition of open-source development as a form of civic service or volunteer work (\"Ehrenamt\" or \"Vereinsarbeit\"). Open-source developers are demanding that their contributions be treated on par with traditional volunteer activities, signaling a move to gain official acknowledgment and potential benefits associated with such civic engagement.",
    "chinese_title": "请愿：在德国正式承认开源工作为公民服务",
    "chinese_summary": "德国发起了一项请愿活动，倡导将开源开发正式认定为一种公民服务或志愿工作（“Ehrenamt”或“Vereinsarbeit”）。开源开发者要求将他们的贡献与传统志愿活动同等对待，此举旨在获得官方认可并争取与此类公民参与相关的潜在利益。"
  },
  {
    "id": "46070203",
    "title": "GitLab discovers widespread NPM supply chain attack",
    "url": "https://about.gitlab.com/blog/gitlab-discovers-widespread-npm-supply-chain-attack/",
    "summary": "GitLab's Vulnerability Research team has uncovered a widespread npm supply chain attack involving a destructive malware variant, dubbed \"Shai-Hulud.\" The sophisticated malware, observed propagating like a worm, infects npm packages through a multi-stage loading process.\n\nInitial infection occurs via a modified `package.json`'s preinstall script, which executes `setup_bun.js`. This script, disguised as a Bun JavaScript runtime installer, then launches a large, obfuscated malicious payload, `bun_environment.js`.\n\nOnce active, the malware harvests sensitive credentials from GitHub, npm, AWS, GCP, and Azure, and extensively scans the filesystem for secrets using a downloaded Trufflehog binary. Stolen data is exfiltrated to attacker-controlled public GitHub repositories identifiable by the description \"Sha1-Hulud: The Second Coming.\" Using stolen npm tokens, the malware propagates by injecting its loader and payload into other packages maintained by victims, incrementing versions, and republishing them.\n\nA critical discovery is the \"dead man's switch\": if the malware simultaneously loses access to both its GitHub exfiltration and npm propagation channels, it triggers a destructive payload. This mechanism deletes and overwrites user data on compromised systems, making a coordinated takedown highly risky due to the threat of widespread data destruction.\n\nGitLab provides Indicators of Compromise (IoCs) and outlines how its Ultimate features, such as Dependency Scanning and Duo Chat's Security Analyst Agent, can help detect exposure. This attack represents an evolution where collateral damage serves as a primary defense for attacker infrastructure, necessitating careful remediation strategies.",
    "chinese_title": "GitLab 发现大范围 NPM 供应链攻击",
    "chinese_summary": "GitLab 漏洞研究团队发现了一场广泛的 npm 供应链攻击，涉及一种代号为“Shai-Hulud”的破坏性恶意软件变体。这种复杂的恶意软件被观察到像蠕虫一样传播，通过多阶段加载过程感染 npm 包。\n\n初次感染通过修改后的 `package.json` 的 preinstall 脚本发生，该脚本执行 `setup_bun.js`。这个伪装成 Bun JavaScript 运行时安装程序的脚本，随后启动一个大型、混淆的恶意载荷 `bun_environment.js`。\n\n一旦激活，该恶意软件会收集来自 GitHub、npm、AWS、GCP 和 Azure 的敏感凭据，并使用下载的 Trufflehog 二进制文件广泛扫描文件系统以查找秘密信息。被盗数据被窃取到攻击者控制的公共 GitHub 仓库，这些仓库可通过描述“Sha1-Hulud: The Second Coming”识别。恶意软件利用窃取的 npm 令牌，通过将其加载器和载荷注入受害者维护的其他包中、增加版本并重新发布它们来进行传播。\n\n一项关键发现是“死人开关”：如果恶意软件同时失去对其 GitHub 窃取和 npm 传播通道的访问，它将触发一个破坏性载荷。这种机制会删除并覆盖受感染系统上的用户数据，使得协同清除行动风险极高，因为存在大规模数据破坏的威胁。\n\nGitLab 提供了妥协指标（IoC），并概述了其旗舰版（Ultimate）功能，例如依赖扫描（Dependency Scanning）和 Duo Chat 的安全分析师代理（Security Analyst Agent）如何帮助检测暴露。这次攻击代表了一种演变，其中附带损害成为攻击者基础设施的主要防御手段，因此需要仔细的修复策略。"
  },
  {
    "id": "46069771",
    "title": "We're losing our voice to LLMs",
    "url": "https://tonyalicea.dev/blog/were-losing-our-voice-to-llms/",
    "summary": "The article argues that the proliferation of LLM-generated content on social media is causing us to lose our unique human voices, which it identifies as a precious asset. The author notes that many posts now sound generic, as if written by the same \"social media manager,\" lacking the distinctiveness of individual expression.\n\nA unique voice, shaped by a lifetime of experiences, is presented as inherently valuable. It becomes recognizable, fosters trust, and builds connections with an audience. This authenticity is crucial for leaving lasting impressions, whether in professional settings like job interviews or networking, and can even lead to career opportunities, as the author experienced. The article emphasizes that a personal voice matures and becomes more unique with practice.\n\nCrucially, the author contends that LLMs cannot truly replicate a unique voice because it is not static; it evolves with life's experiences and states of mind. Relying on AI to write content stifles this natural development, leading to \"cognitive laziness\" and the atrophy of this vital asset. The article concludes by urging readers to write in their own authentic voice, let it grow, and prioritize genuine human expression over AI-generated linguistic remixes.",
    "chinese_title": "我们的声音正在被大型语言模型淹没。",
    "chinese_summary": "文章认为，社交媒体上大语言模型生成内容的大量涌现，正导致我们失去独特的人类声音，而这种声音被认为是宝贵的财富。作者指出，现在许多帖子听起来千篇一律，仿佛都出自同一个“社交媒体经理”之手，缺乏个人表达的独特性。\n\n独特的声音，由一生的经历塑造而成，被视为具有内在价值。它能被识别，培养信任，并与受众建立联系。这种真实性对于留下持久印象至关重要，无论是在求职面试、人脉拓展等专业场合，甚至能带来职业机会，正如作者亲身经历的那样。文章强调，个人声音会随着练习而成熟并变得更加独特。\n\n关键在于，作者认为大语言模型无法真正复制独特的声音，因为它并非一成不变，而是随着人生的经历和心境而演变。依赖人工智能撰写内容会扼杀这种自然发展，导致“认知惰性”，并使这一重要资产逐渐萎缩。文章最后敦促读者用自己真实的声音写作，让它成长，并将真正的人类表达置于优先地位，而非人工智能生成的语言“混音”。"
  },
  {
    "id": "46073855",
    "title": "250MWh 'Sand Battery' to start construction in Finland",
    "url": "https://www.energy-storage.news/250mwh-sand-battery-to-start-construction-in-finland-for-both-heating-and-ancillary-services/",
    "summary": "Polar Night Energy and utility Lahti Energia are partnering to build a 250MWh \"Sand Battery\" thermal energy storage (TES) system in Vääksy, Finland, for district heating and ancillary grid services. With a heating power of 2MW and a 125-hour storage capacity, it will be the largest sand-based TES project upon completion.\n\nThe technology uses electricity to heat locally available natural sand, storing this heat for later discharge to Lahti Energia’s district heating network. This project is projected to cut fossil-based emissions by approximately 60% annually, largely by reducing natural gas consumption by 80%.\n\nCrucially, its scale allows participation in Finland's Fingrid reserve and grid balancing markets, contributing to grid stability amidst increasing weather-dependent energy sources. Construction is scheduled to begin in early 2026 and conclude by summer 2027. This follows Polar Night Energy's earlier successful deployment of a 1MW/100MWh Sand Battery using soapstone. Lahti Energia's CEO highlighted the project's benefits in providing affordable, renewable district heating and enhancing grid flexibility.",
    "chinese_title": "250兆瓦时沙电池将在芬兰开建",
    "chinese_summary": "芬兰极夜能源公司（Polar Night Energy）与公共事业公司拉赫蒂能源（Lahti Energia）正在合作，在芬兰万萨（Vääksy）建造一个 250MWh 的“沙电池”热能储存（TES）系统，用于区域供暖和辅助电网服务。该系统供热功率为 2MW，储能容量为 125 小时，建成后将成为全球最大的沙基热能储存项目。\n\n该技术利用电力加热当地可用的天然沙子，将热量储存起来，随后释放到拉赫蒂能源的区域供暖网络。该项目预计每年将减少约 60% 的化石燃料相关排放，主要通过将天然气消耗量减少 80% 来实现。\n\n至关重要的是，其规模使其能够参与芬兰 Fingrid 的备用和电网平衡市场，在日益依赖天气的能源日益增加的情况下，有助于电网稳定。建设工程计划于 2026 年初启动，并于 2027 年夏季完工。此前，极夜能源公司曾成功部署了一个使用皂石的 1MW/100MWh 沙电池。拉赫蒂能源首席执行官强调该项目在提供经济实惠、可再生区域供暖和增强电网灵活性方面的优势。"
  },
  {
    "id": "46066482",
    "title": "The Nerd Reich – Silicon Valley Fascism and the War on Democracy",
    "url": "https://www.simonandschuster.com/books/The-Nerd-Reich/Gil-Duran/9781668221402",
    "summary": "Gil Duran's \"The Nerd Reich\" argues that Silicon Valley, despite its progressive facade, poses a significant threat to democracy, evolving into a \"Nerd Reich.\" The book asserts that tech giants, fueled by techno-utopianism, libertarian ideology, and vast wealth, are actively undermining democratic institutions.\n\nDuran details a historical admiration for authoritarianism among tech leaders, citing figures like Steve Jobs and Peter Thiel, and identifies a pervasive \"bro culture\" within the industry that aligns with such tendencies. The book explains how tech platforms facilitate the spread of disinformation, hate speech, and the erosion of civil discourse, all while profiting from surveillance capitalism and the weaponization of user data.\n\n\"The Nerd Reich\" also highlights tech companies' aggressive lobbying against regulation and unionization. Duran contends that they promote a vision of \"technocratic feudalism,\" where they exert unchecked power, superseding traditional governance. The book serves as a stark warning about how this unchecked power exacerbates inequality and fosters a new form of digital authoritarianism, fundamentally challenging the foundations of democracy.",
    "chinese_title": "极客帝国——硅谷法西斯主义与对民主的战争",
    "chinese_summary": "吉尔·杜兰的《书呆子帝国》一书认为，硅谷尽管披着进步主义的外衣，却对民主构成重大威胁，正演变为一个“书呆子帝国”。该书声称，科技巨头在技术乌托邦主义、自由意志主义意识形态和巨额财富的驱动下，正积极破坏民主机构。\n\n杜兰详细阐述了科技领袖对威权主义的历史性推崇，引用了史蒂夫·乔布斯和彼得·蒂尔等人物为例，并指出业内普遍存在的“兄弟文化”与这种倾向不谋而合。该书解释了科技平台如何助长虚假信息、仇恨言论的传播以及公民对话的侵蚀，同时通过监控资本主义和用户数据武器化牟利。\n\n《书呆子帝国》还强调了科技公司积极游说反对监管和工会化的行为。杜兰认为，他们宣扬一种“技术官僚封建主义”的愿景，在这种愿景中，他们行使不受制约的权力，取代传统治理。该书严厉警告，这种不受制约的权力如何加剧不平等，并滋生一种新型的数字威权主义，从根本上挑战民主的基石。"
  },
  {
    "id": "46078138",
    "title": "A Remarkable Assertion from A16Z",
    "url": "https://nealstephenson.substack.com/p/a-remarkable-assertion-from-a16z",
    "summary": "Neal Stephenson's article analyzes Andreessen Horowitz's (A16Z) blog post, \"It's Time To Build,\" which advocates for a renewed national focus on physical infrastructure—housing, transportation, manufacturing, and energy—blaming regulatory capture and risk aversion for a \"culture of non-building.\" Stephenson finds this assertion \"remarkable\" given A16Z's prominent role as a venture capital firm that has heavily invested in and profited from *digital* startups, largely contributing to the \"software eats the world\" paradigm.\n\nStephenson highlights the irony: A16Z, a key player in fostering the digital-first economy, now calls for a pivot to physical construction without acknowledging its own influence on the very trend it now appears to critique. He notes the lack of self-reflection in A16Z's post, which presents itself as an objective observer rather than a major participant in the existing tech landscape.\n\nStephenson questions A16Z's motivations, speculating if it represents a genuine shift in their investment thesis or merely a rhetorical move. He contrasts A16Z's abstract call with the tangible challenges faced by those who actually build physical infrastructure, emphasizing the vast differences in timelines, capital requirements, and regulatory environments between digital and physical projects. Stephenson implies A16Z's influence has primarily been at a \"meta\" level within the digital sphere, making their call to build \"real\" things particularly striking.",
    "chinese_title": "A16Z的惊人论断",
    "chinese_summary": "Neal Stephenson的文章分析了Andreessen Horowitz (A16Z) 的博客文章《是时候建造了》，该文章倡导国家重新关注实体基础设施——住房、交通、制造业和能源——并将“不建造文化”归咎于监管俘获和风险规避。考虑到A16Z作为一家风险投资公司，在*数字*初创企业上投入巨资并从中获利，并在很大程度上促成了“软件吞噬世界”的范式，Stephenson认为这一主张“非同寻常”。\n\nStephenson强调了其中的讽刺意味：A16Z作为推动数字优先经济的关键参与者，现在却呼吁转向实体建设，而没有承认自己对它现在似乎正在批判的趋势所产生的影响。他指出A16Z的文章缺乏自我反思，将自己描绘成一个客观的观察者，而非现有科技格局中的主要参与者。\n\nStephenson质疑A16Z的动机，猜测这是否代表了其投资理念的真正转变，抑或仅仅是一种修辞策略。他将A16Z的抽象呼吁与那些真正建造实体基础设施的人所面临的具体挑战进行对比，强调了数字项目和实体项目在时间线、资金要求和监管环境上的巨大差异。Stephenson暗示A16Z的影响主要局限于数字领域的“元”层面，因此他们呼吁建造“真实”事物的举动显得尤为引人注目。"
  },
  {
    "id": "46066522",
    "title": "Mixpanel Security Breach",
    "url": "https://mixpanel.com/blog/sms-security-incident/",
    "summary": "Mixpanel announced a security incident detected on November 8th, 2025, stemming from a smishing campaign that impacted a limited number of its customers. The company promptly executed its incident response, taking comprehensive steps to contain and eradicate unauthorized access and secure affected user accounts. Mixpanel engaged external cybersecurity partners and law enforcement for remediation and investigation.\n\nThe company proactively communicated with all impacted customers, clarifying that if a customer has not been contacted directly, their account was not affected and no action is required. Mixpanel detailed its response actions, which included securing affected accounts, revoking active sessions, rotating compromised credentials, blocking malicious IP addresses, performing global password resets for all employees, and engaging a third-party forensics firm to review logs and advise on containment. They have also implemented additional controls to detect and block similar future activity.\n\nImpacted customers who received a communication are advised to review it for specific next steps. Any questions can be directed to support@mixpanel.com. Mixpanel, through CEO Jen Taylor, emphasized its commitment to security, transparency, and customer support.",
    "chinese_title": "米克斯潘内尔安全泄露",
    "chinese_summary": "Mixpanel宣布于2025年11月8日检测到一起安全事件，该事件源于一场短信钓鱼（smishing）活动，影响了少数客户。该公司迅速启动了事件响应，采取全面措施以遏制和清除未经授权的访问，并保护受影响的用户账户。Mixpanel已与外部网络安全合作伙伴和执法部门合作，开展补救和调查工作。\n\n该公司主动联系了所有受影响的客户，并明确指出，如果客户没有直接收到通知，则其账户未受影响，无需采取任何行动。Mixpanel详细说明了其响应措施，包括保护受影响的账户、撤销活跃会话、更换受损凭据、阻止恶意IP地址、对所有员工进行全局密码重置，并聘请第三方取证公司审查日志并就遏制措施提供建议。他们还实施了额外的控制措施，以检测和阻止未来类似的活动。\n\n收到通知的受影响客户被建议查阅该通知，以了解具体的后续步骤。任何疑问可发送至 support@mixpanel.com。Mixpanel通过首席执行官Jen Taylor强调了其对安全、透明和客户支持的承诺。"
  },
  {
    "id": "46065015",
    "title": "Green card interviews end in handcuffs for spouses of U.S. citizens",
    "url": "https://www.nytimes.com/2025/11/26/us/trump-green-card-interview-arrests.html",
    "summary": "Unable to access the article link.",
    "chinese_title": "美国公民配偶绿卡面试戴手铐收场",
    "chinese_summary": "无法访问文章链接"
  },
  {
    "id": "46077992",
    "title": "The mysterious black fungus from Chernobyl that may eat radiation",
    "url": "https://www.bbc.com/future/article/20251125-the-mysterious-black-fungus-from-chernobyl-that-appears-to-eat-radiation",
    "summary": "In 1997, Nelli Zhdanova discovered a mysterious black fungus thriving inside Chernobyl's exploded nuclear reactor, growing towards radiation. This melanin-rich mould, exhibiting \"radiotropism,\" suggested life could harness ionising radiation.\n\nFurther research by Ekaterina Dadachova proposed \"radiosynthesis,\" where melanin converts high-energy radiation into usable energy for fungal growth, similar to photosynthesis. Melanised fungi were found to grow 10% faster in radioactive environments, with melanin acting as both a shield, absorbing harmful particles, and an antioxidant.\n\nThis finding has significant implications, particularly for space travel. Experiments on the International Space Station with *Cladosporium sphaerospermum* (a Chernobyl strain) showed it grew faster in space and effectively blocked galactic cosmic radiation. While scientists are still investigating if this growth is solely radiation-driven or influenced by zero gravity, the fungi's shielding potential is promising.\n\nThis \"myco-architecture\" could lead to self-regenerating, radiation-proof habitats on the Moon or Mars, drastically reducing the weight and cost of transporting traditional shielding materials. While radiosynthesis is still a theory requiring further mechanistic understanding, these fungi offer a revolutionary solution for protecting astronauts and cleaning radioactive environments.",
    "chinese_title": "可能吞噬辐射的神秘切尔诺贝利黑真菌",
    "chinese_summary": "1997年，Nelli Zhdanova 在切尔诺贝利爆炸的核反应堆内部发现了一种神秘的黑色真菌，它在其中茁壮成长并朝着辐射源生长。这种富含黑色素的霉菌表现出“趋辐射性”（radiotropism），表明生命可以利用电离辐射。\n\nEkaterina Dadachova 的进一步研究提出了“辐射合成”（radiosynthesis）理论，即黑色素将高能辐射转化为真菌生长所需的可用能量，类似于光合作用。研究发现，含黑色素的真菌在放射性环境中生长速度快10%，其中黑色素既能作为吸收有害颗粒的屏障，又能充当抗氧化剂。\n\n这一发现具有重要意义，尤其是在太空旅行方面。在国际空间站对球形枝孢菌（*Cladosporium sphaerospermum*，一种切尔诺贝利菌株）进行的实验表明，它在太空中生长更快，并能有效阻挡银河宇宙射线。尽管科学家仍在调查这种生长是否完全由辐射驱动或受零重力影响，但这种真菌的屏蔽潜力是很有前景的。\n\n这种“真菌建筑”（myco-architecture）可能在月球或火星上建造出自我再生、防辐射的栖息地，从而大幅降低运输传统屏蔽材料的重量和成本。尽管辐射合成仍是一个需要进一步机制理解的理论，但这些真菌为保护宇航员和清洁放射性环境提供了一个革命性的解决方案。"
  },
  {
    "id": "46070915",
    "title": "Pakistan says rooftop solar output to exceed grid demand in some hubs next year",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/pakistan-says-rooftop-solar-output-exceed-grid-demand-some-hubs-next-year-2025-11-22/",
    "summary": "Pakistan anticipates that rooftop solar power generation will surpass grid demand in specific industrial and urban centers by next year, 2025. Federal Minister for Energy Muhammad Ali made this announcement, attributing the rapid growth to aggressive solar adoption, particularly by industries, commercial entities, and households benefiting from net metering policies.\n\nWhile this significant shift is crucial for transitioning towards renewable energy and reducing reliance on expensive imported fossil fuels, it poses substantial challenges for the national grid. The existing transmission and distribution infrastructure is not fully equipped to manage the expected surplus power and the inherent fluctuations of solar energy, potentially leading to grid instability and the need to curtail clean energy.\n\nTo address these issues, Pakistan faces an urgent need for massive investment in grid modernization, including smart grid technologies, large-scale energy storage solutions like batteries and pumped hydro, and upgrades to transmission lines. Additionally, a review of current net metering policies may be necessary to ensure grid stability and efficient energy management. In the long term, effectively managing this surplus could open avenues for exporting clean energy to neighboring countries.",
    "chinese_title": "巴基斯坦称，明年一些区域的屋顶太阳能发电量将超过电网需求。",
    "chinese_summary": "巴基斯坦预计，到明年（2025年），特定工业和城市中心的屋顶太阳能发电量将超过电网需求。联邦能源部长穆罕默德·阿里宣布了这一消息，他将这一快速增长归因于太阳能的积极普及，特别是得益于净计量政策的工业、商业实体和家庭的大力采用。\n\n尽管这一重大转变对于向可再生能源转型并减少对昂贵进口化石燃料的依赖至关重要，但它也给国家电网带来了巨大挑战。现有的输配电基础设施尚未完全具备管理预期过剩电力以及太阳能固有波动的能力，这可能导致电网不稳定，并需要限制清洁能源输出。\n\n为解决这些问题，巴基斯坦迫切需要对电网现代化进行大规模投资，包括智能电网技术、电池和抽水蓄能等大规模储能解决方案，以及输电线路升级。此外，可能需要审查当前的净计量政策，以确保电网稳定和高效能源管理。从长远来看，有效管理这些过剩电力可能为向邻国出口清洁能源开辟途径。"
  },
  {
    "id": "46065817",
    "title": "Music eases surgery and speeds recovery, study finds",
    "url": "https://www.bbc.com/news/articles/c231dv9zpz3o",
    "summary": "A new peer-reviewed Indian study from Delhi's Maulana Azad Medical College and Lok Nayak Hospital finds that playing music during general anaesthesia can significantly ease surgery and speed recovery. Published in the journal *Music and Medicine*, the research provides strong evidence that this simple intervention can meaningfully reduce drug requirements and improve patient outcomes.\n\nThe study focused on 56 adults undergoing laparoscopic cholecystectomy (gallbladder removal). Patients were randomly assigned to two groups: both received a standard five-drug anaesthetic regimen and wore noise-cancelling headphones, but only one group listened to calming instrumental music (flute or piano).\n\nResearchers observed that even when patients were unconscious, their auditory pathway remained partly active. The results showed that patients exposed to music required lower doses of anaesthetic drugs like propofol and opioid painkillers (fentanyl). Consequently, they experienced faster and clearer awakenings, smoother recoveries, lower cortisol (stress hormone) levels, and better blood pressure control during surgery.\n\nAnaesthesiologists involved, like Dr. Farah Husain and Dr. Sonia Wadhawan, explained that the body's stress response, triggered even under anaesthesia, can slow recovery. Music appears to quieten this internal \"storm\" by providing positive stimuli that the brain registers, even without conscious memory. This non-pharmacological approach offers a way to humanise the operating room, potentially reshaping surgical care by reducing drug use and enhancing overall patient wellbeing.",
    "chinese_title": "音乐缓解手术并加速康复，研究发现",
    "chinese_summary": "一项来自德里毛拉纳·阿扎德医学院和洛克·纳亚克医院的、经同行评审的印度新研究发现，在全身麻醉期间播放音乐可以显著减轻手术过程并加速康复。该研究发表在《音乐与医学》杂志上，提供了有力证据，表明这种简单的干预措施可以显著减少药物需求并改善患者预后。\n\n这项研究针对56名接受腹腔镜胆囊切除术（即胆囊摘除手术）的成年人。患者被随机分为两组：两组都接受了标准的五种药物麻醉方案并佩戴了降噪耳机，但其中一组听了平静的器乐（长笛或钢琴）。\n\n研究人员观察到，即使患者处于无意识状态，其听觉通路仍部分活跃。结果显示，听音乐的患者所需的异丙酚等麻醉药物和芬太尼等阿片类止痛药的剂量更低。因此，他们在术后苏醒更快、更清醒，恢复更平稳，皮质醇（应激激素）水平更低，手术期间血压控制也更好。\n\n参与研究的麻醉师，如法拉赫·侯赛因医生和索尼亚·瓦德哈万医生解释说，即使在麻醉状态下，身体也会触发应激反应，从而减缓康复。音乐似乎通过提供大脑能够识别的积极刺激，即使患者没有意识记忆，也能平息这种内在的“风暴”。这种非药物方法为手术室带来了人文关怀，有望通过减少药物使用和提升患者整体福祉来重塑外科护理。"
  },
  {
    "id": "46079868",
    "title": "Meta hiding $27B in debt using advanced geometry",
    "url": "https://stohl.substack.com/p/exclusive-credit-report-shows-meta",
    "summary": "An article by \"Stohl\" on Substack alleges that Meta Platforms is obscuring approximately $27 billion in potential debt using a sophisticated financial strategy termed \"advanced geometry.\" Citing an \"exclusive, anonymized credit report\" from a major institutional lender, the author claims Meta employs complex derivatives and interest rate swaps to achieve this.\n\nThe strategy reportedly involves Meta writing numerous \"out-of-the-money credit default swaps (CDS)\" on other technology companies, while concurrently acquiring highly-rated, long-term corporate bonds. The premiums received from writing these CDS are used to purchase the bonds. Since the CDS are \"out-of-the-money,\" their potential future obligations are not fully recognized as immediate debt on Meta's balance sheet under standard accounting practices.\n\nThe credit report reportedly estimated the *fair value* of this hidden liability at $27 billion, representing a theoretical worst-case scenario if these CDS were simultaneously triggered. This maneuver, according to the article, allows Meta to present a healthier balance sheet, maintain lower perceived debt ratios, and potentially secure better financial terms. The author raises concerns about accounting transparency and the potential systemic risk should a cascade of defaults expose such underlying liabilities within the financial system.",
    "chinese_title": "Meta利用高等几何隐匿270亿美元债务",
    "chinese_summary": "Substack上署名“Stohl”的一篇文章声称，Meta Platforms正通过一种被称为“高级几何”的复杂金融策略，隐瞒大约270亿美元的潜在债务。该作者引用一家主要机构贷款人提供的一份“独家匿名信用报告”，声称Meta利用复杂的衍生品和利率互换来实现这一目的。\n\n据报道，该策略涉及Meta出售大量针对其他科技公司的“价外信用违约互换（CDS）”，同时收购高评级的长期公司债券。出售这些CDS所获得的保费被用于购买债券。由于这些CDS是“价外”的，根据标准会计准则，其潜在的未来义务并未在Meta的资产负债表上被完全确认为即时债务。\n\n据报道，该信用报告估计这项隐藏负债的*公允价值*为270亿美元，这代表着在这些CDS同时被触发情况下的理论最坏情景。文章指出，这一操作使Meta能够呈现更健康的资产负债表，保持较低的感知债务比率，并可能获得更好的融资条件。作者对会计透明度以及一旦出现连锁违约，可能暴露金融系统内此类潜在负债所带来的潜在系统性风险表示担忧。"
  },
  {
    "id": "46063272",
    "title": "Running Unsupported iOS on Deprecated Devices",
    "url": "https://nyansatan.github.io/run-unsupported-ios/",
    "summary": "This article details the process of running unsupported iOS 6 on an iPod touch 3, a device officially capped at iOS 5.1.1. The author began by testing on an iPhone 3GS, identifying key areas requiring modification.\n\nMajor work involved patching several iOS components:\n*   **DeviceTree:** A script was developed to diff and apply iOS 6-specific hardware nodes and properties, crucial for the `nvram-proxy-data` field which iBoot populates at runtime.\n*   **iBoot:** Required minor changes, including Image3 signature patching, `amfi=0xff` boot-args injection, and enabling debug features, along with dynamically populating NVRAM data.\n*   **Kernelcache:** The most complex part. Since dynamic kernel extension (kext) loading failed, a prelinked kernelcache was generated using `kcgen` (from macOS internal builds). This involved specifying kexts (derived from comparing iPhone 3GS iOS 5.1.1 and 6.0 builds) and stripping the resulting fat Mach-O header.\n*   **Restore Ramdisk:** Patched `asr` and relocated `options.plist`. The `rc.boot` binary was reimplemented to install an iBoot exploit on a third partition.\n*   **Root Filesystem:** Involved adding `SpringBoard` hardware feature plists, incorporating 5.1.1 firmwares for multitouch, Wi-Fi, and Bluetooth, and removing `LimitLoadToHardware` from the `FairPlay` daemon's plist to enable device activation.\n*   **DYLD Shared Cache:** Patches included hardcoding a product ID and swapping short IDs in `MobileGestalt`, and forcing `getDeviceVariant()` to return \"A\" to prevent activation crashes. Code signatures were fixed by recalculating SHA-1 hashes for modified sections.\n*   **iBoot Exploit:** A deterministic HFS+ filesystem driver exploit was reimplemented for booting.\n\nThe author concludes the project was challenging but easier than expected, with future plans to enable jailbreaking and port the work to iPad 1. The methods described offer a guide for similar unsupported iOS endeavors.",
    "chinese_title": "在已淘汰设备上运行不支持的iOS",
    "chinese_summary": "这篇文章详细介绍了在iPod touch 3上运行不受支持的iOS 6的过程，该设备官方最高支持iOS 5.1.1。作者首先在iPhone 3GS上进行了测试，确定了需要修改的关键区域。\n\n主要工作涉及修补多个iOS组件：\n*   **设备树 (DeviceTree)：** 开发了一个脚本，用于对比并应用iOS 6特有的硬件节点和属性，这对于iBoot在运行时填充的`nvram-proxy-data`字段至关重要。\n*   **iBoot：** 需要进行少量修改，包括Image3签名修补、`amfi=0xff`启动参数注入、启用调试功能，以及动态填充NVRAM数据。\n*   **内核缓存 (Kernelcache)：** 最复杂的部分。由于动态内核扩展 (kext) 加载失败，使用`kcgen`（来自macOS内部构建版本）生成了一个预链接内核缓存。这涉及指定kexts（通过比较iPhone 3GS的iOS 5.1.1和6.0构建版本得出）并剥离生成的fat Mach-O头部。\n*   **恢复内存盘 (Restore Ramdisk)：** 修补了`asr`并重新定位了`options.plist`。重新实现了`rc.boot`二进制文件，以便在第三分区安装iBoot漏洞利用。\n*   **根文件系统 (Root Filesystem)：** 涉及添加SpringBoard硬件功能plist文件，整合5.1.1的多点触控、Wi-Fi和蓝牙固件，并从FairPlay守护进程的plist中移除`LimitLoadToHardware`以启用设备激活。\n*   **DYLD共享缓存 (DYLD Shared Cache)：** 补丁包括硬编码产品ID并在MobileGestalt中交换短ID，以及强制`getDeviceVariant()`返回\"A\"以防止激活崩溃。通过重新计算修改部分的SHA-1哈希值来修复代码签名。\n*   **iBoot漏洞利用 (iBoot Exploit)：** 重新实现了一个确定性HFS+文件系统驱动漏洞利用用于启动。\n\n作者总结称该项目充满挑战但比预期容易，未来计划实现越狱并将此工作移植到iPad 1。所描述的方法为类似的、不受支持的iOS尝试提供了指导。"
  },
  {
    "id": "46073033",
    "title": "Underrated reasons to be thankful V",
    "url": "https://dynomight.net/thanks-5/",
    "summary": "This article, \"Underrated reasons to be thankful V,\" presents a diverse list of overlooked blessings spanning biology, science, technology, and societal structures.\n\nBiologically, it expresses gratitude for a dog's genuine love, the evolutionary advantage of sexual reproduction's genetic variance, the quiet efficiency of peroxisomes, and the restorative power of sleep as a daily reset. It also playfully notes the convenience of being three-dimensional.\n\nIn the realm of health and technology, the author is thankful for the eventual potential to \"cure\" the common cold, our collective capacity to manage infectious diseases through sanitation, vaccines, and advanced tools (UVC, air filtration), and the potential for \"crazier tricks\" against engineered pathogens. Other highlights include abundant clean water, dentistry, the inherent safety of air travel, and the properties of radioactive atoms that prevent widespread permanent environmental poisoning. Gratitude extends to the non-linear benefits of tackling multiple diseases simultaneously, the mathematical elegance of gradients in expression graphs for data fitting, and the physical marvel of storing five-dimensional light fields on two-dimensional film (holography). Disposable plastic is also noted for its utility and potential as carbon sequestration.\n\nSocietally and philosophically, the article appreciates the diversity of human preferences, the affordable luxury of cardamom, the market's often-superior judgment compared to individual worries, the complex but successful \"bundle\" of attraction-love-reproduction, society's implicit deal to support parents, and the historical progress of democracy and civil liberties despite a long past of autocracy.",
    "chinese_title": "被低估的感恩理由 五",
    "chinese_summary": "《被低估的感恩理由 V》\n\n本文，题为《被低估的感恩理由 V》，列举了涵盖生物学、科学、技术和社会结构等多个领域的各种被忽视的幸事。\n\n在生物学方面，文章表达了对狗狗真挚的爱、有性生殖基因变异带来的进化优势、过氧化物酶体的无声高效运作，以及睡眠作为日常“重置”的恢复能力的感恩。文章还俏皮地提到了拥有三维身体的便利性。\n\n在健康和技术领域，作者感恩于最终有望“治愈”普通感冒，我们通过卫生、疫苗和先进工具（紫外线杀菌、空气过滤）来控制传染病的集体能力，以及对抗基因工程病原体的“更疯狂策略”的可能性。其他亮点包括丰富的洁净水、牙科医疗、航空旅行固有的安全性，以及放射性原子防止大规模永久性环境污染的特性。感恩还延伸到同时治疗多种疾病的非线性益处、数据拟合中表达式图表梯度的数学优雅，以及在二维胶片上存储五维光场（全息术）的物理奇迹。一次性塑料也因其功用和作为碳捕获的潜力而受到关注。\n\n在社会和哲学层面，文章赞赏人类偏好的多样性、小豆蔻这种负担得起的奢侈品、市场判断力往往优于个人担忧、吸引-爱-繁衍这个复杂却成功的“组合”、社会支持父母的隐性约定，以及尽管经历了漫长的专制历史，民主和公民自由仍在不断取得历史进步。"
  },
  {
    "id": "46072786",
    "title": "DeepSeekMath-V2: Towards Self-Verifiable Mathematical Reasoning [pdf]",
    "url": "https://github.com/deepseek-ai/DeepSeek-Math-V2/blob/main/DeepSeekMath_V2.pdf",
    "summary": "The provided information describes a project or research paper titled \"DeepSeekMath-V2: Towards Self-Verifiable Mathematical Reasoning\" from deepseek-ai.\n\nThis title indicates that the work focuses on developing advanced artificial intelligence models (specifically DeepSeekMath-V2) with enhanced capabilities in mathematical reasoning. The core objective highlighted is \"self-verifiable\" reasoning, suggesting that the model is designed not only to solve mathematical problems but also to internally check, validate, or prove the correctness of its own solutions. This aims to improve the reliability and trustworthiness of AI in complex mathematical tasks.\n\nThe \"V2\" in the name implies an evolution or significant update over a previous version of DeepSeekMath, indicating ongoing development to refine its mathematical abilities. The \"[pdf]\" tag confirms it is presented as a formal document, likely a research paper detailing methodologies, results, and findings.\n\nAccompanying metadata, such as \"Fork 44\" and \"Star 864,\" typical of a GitHub repository, signals considerable public interest and community engagement with the DeepSeekMath-V2 project, highlighting its relevance within the AI research landscape.",
    "chinese_title": "DeepSeekMath-V2：迈向自可验证的数学推理 [pdf]",
    "chinese_summary": "所提供的信息描述了一个来自deepseek-ai的项目或研究论文，标题为“DeepSeekMath-V2：迈向自我验证的数学推理”。\n\n这个标题表明，这项工作致力于开发具有增强数学推理能力的先进人工智能模型（特别是DeepSeekMath-V2）。强调的核心目标是“自我验证”的推理，这表明该模型的设计不仅是为了解决数学问题，还在于内部检查、验证或证明其自身解决方案的正确性。这旨在提高人工智能在复杂数学任务中的可靠性和可信度。\n\n名称中的“V2”暗示着相对于DeepSeekMath先前版本的演进或重大更新，表明正在持续开发以完善其数学能力。“[pdf]”标签证实了它以正式文档的形式呈现，很可能是一篇详细介绍了方法、结果和发现的研究论文。\n\n随附的元数据，例如“Fork 44”和“Star 864”（典型的GitHub仓库数据），表明公众对DeepSeekMath-V2项目有相当大的兴趣和社区参与，凸显了其在人工智能研究领域的重要性。"
  },
  {
    "id": "46068777",
    "title": "The current state of the theory that GPL propagates to AI models",
    "url": "https://shujisado.org/2025/11/27/gpl-propagates-to-ai-models-trained-on-gpl-code/",
    "summary": "This article highlights a key divergence in the legal interpretation of open-source licenses between the United States and other major jurisdictions like Japan and the European Union. While Japan and the EU commonly treat an Open Source license as a license agreement or a contract, the United States, despite being the origin point for much of the open-source movement, views it differently. U.S. law considers an Open Source license not as a contract, but rather as a \"unilateral permission.\" This distinction represents a significant \"Legal Hack\" in how these licenses are understood and applied across different legal frameworks.",
    "chinese_title": "GPL向AI模型传播理论的现状",
    "chinese_summary": "本文强调了美国与日本、欧盟等其他主要司法管辖区在开源许可证法律解释上的一个关键分歧。尽管日本和欧盟通常将开源许可证视为许可协议或合同，但作为许多开源运动发源地的美国，却持不同看法。美国法律认为开源许可证并非合同，而是一种“单方面许可”。这种区别代表着在不同法律框架下理解和应用这些许可证方式上的一个重大“法律妙招”。"
  },
  {
    "id": "46068015",
    "title": "Arthur Conan Doyle explored men’s mental health through Sherlock Holmes",
    "url": "https://theconversation.com/arthur-conan-doyle-explored-mens-mental-health-through-his-sherlock-holmes-stories-246728",
    "summary": "Arthur Conan Doyle was a progressive writer who explored male vulnerability and mental health, a subject deeply personal due to his father's alcoholism and eventual institutionalization. Doyle's creation, Sherlock Holmes, embodies this, portraying a genius who is not infallible but relatable, battling drug addiction, loneliness, and depression—vulnerabilities that contribute to his brilliance.\n\nDoyle frequently depicted male characters in emotional distress. In *The Man with the Twisted Lip*, Neville St Clair hides a double life as a beggar due to financial shame, highlighting Victorian societal pressures on masculinity; he contemplates execution over reputation damage. *The Stockbroker’s Clerk* explores economic anxiety and male suicide, as Harry Pinner attempts suicide to avoid prison.\n\n*The Adventure of the Engineer’s Thumb* features Victor, a hydraulic engineer suffering physical violence and mental trauma. While Watson treats physical injuries, Holmes provides crucial psychological support, acting as a confidante and comforter, even offering a stimulant. This illustrates Doyle's belief in the importance of mental healthcare for men.\n\nThough contemporary readers saw these elements as markers of Holmes's genius, today they offer a vital window into the mental struggles of Victorian men, establishing a powerful connection between past and present readers.",
    "chinese_title": "亚瑟·柯南·道尔通过夏洛克·福尔摩斯探讨了男性心理健康。",
    "chinese_summary": "亚瑟·柯南·道尔是一位思想进步的作家，他深入探讨了男性的脆弱性和心理健康问题，这一主题因他父亲的酗酒及其最终被送入精神病院而对他个人意义深远。道尔笔下的夏洛克·福尔摩斯正是这种体现，他塑造了一个并非完美无缺但却令人产生共鸣的天才，他与毒瘾、孤独和抑郁症作斗争——这些弱点反而成就了他的非凡才华。\n\n道尔经常刻画处于情感困境中的男性角色。在《歪嘴男人》中，内维尔·圣克莱尔因经济窘迫而感到羞耻，过着乞丐的双重生活，这凸显了维多利亚时代社会对男性气质的压力；他甚至宁愿被处决也不愿名誉受损。《证券经纪人》则探讨了经济焦虑和男性自杀问题，剧中哈利·平纳为避免入狱而企图自杀。\n\n《工程师大拇指案》的主人公是水利工程师维克多，他遭受了身体暴力和精神创伤。华生医生处理其身体伤势，而福尔摩斯则提供了关键的心理支持，扮演了知己和安慰者的角色，甚至提供了兴奋剂。这体现了道尔对男性心理健康护理重要性的信念。\n\n尽管当时的读者将这些元素视为福尔摩斯天才的标志，但如今它们为我们了解维多利亚时代男性的精神挣扎提供了重要的窗口，在过去和现在的读者之间建立了强大的联系。"
  },
  {
    "id": "46072988",
    "title": "LinkedIn is loud, and corporate is hell",
    "url": "https://ramones.dev/posts/linkedin-is-loud/",
    "summary": "The article \"LinkedIn is loud, and corporate is hell\" criticizes the current state of LinkedIn and modern corporate culture, arguing they have become performative and detached from genuine professional value.\n\nThe author laments that LinkedIn, once a useful tool for networking, has devolved into a platform for \"performative positivity\" and \"hustle culture.\" Feeds are dominated by users promoting themselves, their side hustles, or sharing exaggerated tales of corporate triumph and resilience, often lacking real substance. This creates a noisy environment where genuine connections and insights are lost amidst a sea of self-promotion and virtue signaling.\n\nThe piece further extends this critique to corporate life itself, suggesting that many companies prioritize superficial metrics, buzzwords, and performative \"culture\" over meaningful work or employee well-being. This leads to a sense of inauthenticity and burnout, where individuals feel pressured to maintain a façade of enthusiasm and productivity, both online and offline. The author expresses a desire for more genuine interactions and a return to valuing actual work and honest communication over the manufactured enthusiasm prevalent on LinkedIn and in many corporate environments.",
    "chinese_title": "领英喧嚣，职场是地狱",
    "chinese_summary": "文章《领英很喧嚣，企业如地狱》批评了领英和现代企业文化的现状，认为它们已变得流于形式、脱离了真正的职业价值。\n\n作者感叹，领英曾是一个有用的社交工具，却已沦为“表演式积极”和“内卷文化”的平台。动态被用户用来推广自己、副业，或分享夸大的企业成功和韧性故事所占据，而这些往往缺乏实质内容。这营造了一个喧嚣的环境，真正的联系和见解在铺天盖地的自我推销和“道德表演”中迷失了。\n\n这篇文章进一步将批判延伸至企业生活本身，指出许多公司将肤浅的指标、流行语和表演式“文化”置于有意义的工作或员工福祉之上。这导致了一种不真实感和职业倦怠，个体感到压力，被迫在网上和线下都维持着热情和生产力的假象。作者表达了对更真诚互动以及回归重视实际工作与诚实沟通的渴望，而非领英和许多企业环境中普遍存在的刻意制造的热情。"
  },
  {
    "id": "46066695",
    "title": "Ray Marching Soft Shadows in 2D (2020)",
    "url": "https://www.rykap.com/2020/09/23/distance-fields/",
    "summary": "This article details a 2D ray marching technique for rendering soft shadows, leveraging distance fields. A distance field is an image storing each pixel's distance to the nearest shape, generated initially from 2D text.\n\nThe core idea for casting shadows involves \"ray marching\" from a pixel towards a light source. Instead of slow pixel-by-pixel checks, the ray advances by `sceneDist`—the distance to the closest shape sampled from the distance field. This efficient method ensures no shapes are skipped. If the ray hits a shape (`sceneDist <= 0`), the pixel is shadowed; otherwise, if it reaches the light, it's illuminated. A `for` loop with a step limit (e.g., 64 steps) prevents performance issues with complex ray paths.\n\nFor soft shadows (a non-physically realistic penumbra), three rules are applied:\n1.  **Closer proximity to a shape yields more shadow:** Approximated by the minimum `sceneDist` during marching.\n2.  **Shadows spread further from the \"almost-intersection\" point:** Related to `rayProgress`.\n    These first two rules are combined by tracking the minimum value of `sceneDist / rayProgress` as `lightContribution` during the march. A ratio of 1 means fully lit, and 0 means fully shadowed.\n3.  **Light weakens with distance:** The final `lightContribution` is multiplied by a quadratic `distanceFactor` that decreases as the ray gets further from the light.\n\nWhile effective and fast, the method can produce banding artifacts. Solutions include advanced approximations or using `sceneDist * randomJitter` to introduce more steps and graininess over banding.",
    "chinese_title": "二维光线步进软阴影 (2020)",
    "chinese_summary": "本文详细介绍了一种利用距离场渲染软阴影的二维光线步进技术。距离场是一种图像，存储着每个像素到最近形状的距离，最初由二维文本生成。\n\n投射阴影的核心思想涉及从像素向光源进行“光线步进”。光线并非逐像素缓慢检查，而是根据`sceneDist`（从距离场中采样的到最近形状的距离）前进。这种高效方法确保不会跳过任何形状。如果光线碰到形状（`sceneDist <= 0`），该像素处于阴影中；否则，如果光线到达光源，则被照亮。带有步数限制（例如64步）的`for`循环可以防止复杂光线路径导致的性能问题。\n\n对于软阴影（一种非物理真实的半影），应用了三条规则：\n1. **离形状越近，阴影越深：** 通过步进过程中最小的`sceneDist`来近似。\n2. **阴影从“近似交点”处扩散得更远：** 与`rayProgress`相关。\n前两条规则通过在步进过程中追踪`sceneDist / rayProgress`的最小值作为`lightContribution`来结合。比率为1表示完全被照亮，0表示完全处于阴影中。\n3. **光线随距离衰减：** 最终的`lightContribution`乘以一个二次衰减的`distanceFactor`，该因子随着光线离光源越远而减小。\n\n尽管高效且快速，该方法会产生条带状伪影。解决方案包括更高级的近似法，或者使用`sceneDist * randomJitter`来增加步数和颗粒感以消除条带。"
  },
  {
    "id": "46061208",
    "title": "Fara-7B: An efficient agentic model for computer use",
    "url": "https://github.com/microsoft/fara",
    "summary": "Fara-7B is Microsoft's inaugural agentic small language model (SLM), specifically engineered for computer use. With just 7 billion parameters, this ultra-compact Computer Use Agent (CUA) delivers state-of-the-art performance within its size class, competing effectively with larger agentic systems.\n\nUnlike traditional chat models, Fara-7B operates visually, using mouse and keyboard interfaces to perform multi-step web tasks. It perceives webpages and executes actions like scrolling, typing, and clicking on predicted coordinates without relying on accessibility trees. Its compact size facilitates on-device deployment, offering reduced latency and enhanced privacy, and it completes tasks efficiently, averaging only 16 steps per task.\n\nFara-7B is trained on a novel synthetic data generation pipeline, leveraging the Magentic-One multi-agent framework to create 145,000 diverse trajectories. Built upon Qwen2.5-VL-7B and fine-tuned, it excels at automating common web activities such as information searching, form filling, booking travel, online shopping, and finding jobs or real estate.\n\nThe model demonstrates state-of-the-art results across web agent benchmarks like WebVoyager, Online-M2W, DeepShop, and the newly released WebTailBench. Fara-7B consistently outperforms other computer-use models and even some larger systems, particularly on WebTailBench, a new benchmark comprising 609 real-world tasks.\n\nUsers can try Fara-7B locally by cloning its repository, setting up a Python environment, and hosting the model with VLLM (requiring GPU). Alternatively, Azure Foundry offers a recommended hosting solution without local GPU hardware. Microsoft emphasizes Fara-7B as an experimental release, encouraging community feedback and advising sandboxed environment usage. An extensive evaluation infrastructure is also provided for reproducibility.",
    "chinese_title": "Fara-7B：用于计算机的高效智能体模型",
    "chinese_summary": "Fara-7B是微软首个为计算机使用专门设计的智能体小型语言模型（SLM）。仅凭70亿参数，这款超紧凑的计算机使用智能体（CUA）在其同类尺寸中提供了最先进的性能，能有效与更大的智能体系统竞争。\n\n与传统聊天模型不同，Fara-7B通过鼠标和键盘界面进行视觉操作，执行多步骤网络任务。它感知网页并执行滚动、打字和点击预测坐标等操作，而不依赖于辅助功能树。其紧凑的尺寸便于设备端部署，提供更低的延迟和增强的隐私保护，并且能高效完成任务，平均每项任务仅需16步。\n\nFara-7B通过一种新颖的合成数据生成管道进行训练，利用Magentic-One多智能体框架创建了145,000条多样化轨迹。它基于Qwen2.5-VL-7B构建并经过微调，擅长自动化常见的网络活动，例如信息搜索、表单填写、预订旅行、在线购物以及寻找工作或房地产。\n\n该模型在WebVoyager、Online-M2W、DeepShop和新发布的WebTailBench等网络智能体基准测试中展现了最先进的成果。Fara-7B持续超越其他计算机使用模型，甚至是一些更大的系统，尤其是在包含609项真实世界任务的新基准WebTailBench上表现突出。\n\n用户可以通过克隆其代码库、设置Python环境并使用VLLM（需要GPU）托管模型，在本地试用Fara-7B。另外，Azure Foundry提供了一个推荐的托管解决方案，无需本地GPU硬件。微软强调Fara-7B是一个实验性版本，鼓励社区反馈，并建议在沙盒环境中进行使用。此外，还提供了全面的评估基础设施以确保可复现性。"
  },
  {
    "id": "46074362",
    "title": "How Charles M Schulz created Charlie Brown and Snoopy (2024)",
    "url": "https://www.bbc.com/culture/article/20241205-how-charles-m-schulz-created-charlie-brown-and-snoopy",
    "summary": "Charles M. Schulz created the globally beloved Peanuts strip, drawing it solo for 50 years until his 1999 retirement announcement due to ill health, dying shortly after the final strip ran in 2000. Schulz modestly described his work as dealing with \"minor everyday problems\" like love, hate, and insecurity, yet insisted these were more vital than politics or trivial matters, constituting daily social satire.\n\nPeanuts' universal appeal, noted by Umberto Eco, charmed both children and sophisticated adults. Schulz initially focused on drawing children for commercial reasons, as \"this is what sold.\" He found his characters, particularly Snoopy, provided a versatile \"repertory company\" for any idea, often portraying dogs as \"smarter than the kids.\"\n\nHis shy childhood, which led him to study art by correspondence rather than in person, shaped his unique perspective, making him feel \"just right for being a cartoonist.\" Schulz emphasized shutting out the world to \"just draw something that you hope is funny,\" experiencing excitement when good ideas flowed. Despite his modesty, he was always confident Peanuts would succeed.\n\nSchulz's final strip, published after his death, expressed gratitude to fans. He imparted a key lesson through Charlie Brown: \"just to keep on trying,\" as his character \"never gives up.\"",
    "chinese_title": "如何查尔斯·米·舒尔茨创作了查理·布朗和史努比 (2024)",
    "chinese_summary": "查尔斯·M·舒尔茨创作了全球广受欢迎的《花生漫画》，独自绘制了50年，直到1999年因健康不佳宣布退休，并于2000年最后一期漫画刊登后不久去世。舒尔茨谦逊地将自己的作品描述为处理爱、恨和不安全感等“日常小问题”，但他坚持认为这些问题比政治或琐事更重要，构成了日常社会讽刺。\n\n艾柯（Umberto Eco）指出，《花生漫画》的普遍吸引力，既迷住了儿童，也征服了老练的成年人。舒尔茨最初出于商业考虑，专注于画儿童，因为“这样才卖得好”。他发现自己的角色，尤其是史努比，为任何想法提供了多功能的“剧团”，并经常将狗描绘成“比孩子更聪明”。\n\n他害羞的童年，导致他通过函授而非面授方式学习艺术，塑造了他独特的视角，让他觉得“非常适合做漫画家”。舒尔茨强调要隔绝外界，“只管画些你希望有趣的东西”，当好的想法涌现时，他会感到兴奋。尽管他很谦逊，但他始终坚信《花生漫画》会成功。\n\n舒尔茨去世后发表的最后一期漫画，向粉丝们表达了感谢。他通过查理·布朗（Charlie Brown）传达了一个重要的教训：“只要坚持不懈地尝试”，因为他的角色“永不放弃”。"
  },
  {
    "id": "46061239",
    "title": "Alan.app – Add a Border to macOS Active Window",
    "url": "https://tyler.io/2025/11/alan/",
    "summary": "The author developed a new macOS app called \"Alan\" to address the challenge of distinguishing active windows, possibly due to aging eyes or poor contrast in macOS. Alan is a simple application that draws a customizable border around the active window.\n\nUsers can set their preferred border width and choose distinct colors for both light and dark modes within Alan's preferences. The app is available for download, and a demo video showcases its functionality. For users who prefer a minimalist setup, Alan also offers a hidden preference, activated via a Terminal command, to hide its icon from the Dock.",
    "chinese_title": "Alan.app – 给 macOS 激活窗口添加边框",
    "chinese_summary": "作者开发了一款名为“Alan”的全新 macOS 应用，旨在解决区分活动窗口的挑战，这可能是因为视力下降或 macOS 对比度不佳。Alan 是一款简单的应用程序，可以在活动窗口周围绘制一个可自定义的边框。用户可以在 Alan 的偏好设置中设置首选的边框宽度，并为亮色和深色模式选择不同的颜色。该应用可供下载，还有一个演示视频展示了其功能。对于喜欢极简设置的用户，Alan 还提供一个隐藏偏好设置，可以通过终端命令激活，从而在 Dock 中隐藏其图标。"
  },
  {
    "id": "46065698",
    "title": "Coq: The World's Best Macro Assembler? (2013) [pdf]",
    "url": "https://nickbenton.name/coqasm.pdf",
    "summary": "The provided content is raw, compressed PDF stream data, not readable text. As an AI, I am unable to decompress or interpret this binary format directly. Therefore, I cannot provide a summary of the article's content.\n\nThe title, \"Coq: The World's Best Macro Assembler? (2013)\", suggests the paper likely explores the capabilities of the Coq proof assistant in the context of low-level code generation, potentially arguing for its suitability as a highly reliable or powerful tool for creating and verifying assembly-like code.\n\nIf you can provide the actual text of the article, I would be happy to summarize it for you.",
    "chinese_title": "Coq：全球最佳宏汇编器？ (2013) [pdf]",
    "chinese_summary": "所提供的内容是原始的、压缩的PDF流数据，而非可读文本。作为AI，我无法直接解压缩或解释这种二进制格式。因此，我无法提供文章内容的摘要。\n\n标题“Coq: The World's Best Macro Assembler? (2013)”表明该论文可能探讨了Coq证明助手在低级代码生成方面的能力，并可能论证其作为一种高度可靠或强大的工具，用于创建和验证类汇编代码的适用性。\n\n如果您能提供文章的实际文本，我将很乐意为您总结。"
  },
  {
    "id": "46062777",
    "title": "EU Council approves Chat Control mandate for negotiation with Parliament",
    "url": "https://www.techradar.com/vpn/vpn-privacy-security/chat-control-eu-lawmakers-finally-agree-on-the-voluntary-scanning-of-your-private-chats",
    "summary": "The EU Council has approved the controversial Child Sexual Abuse Regulation (CSAR), often dubbed \"Chat Control,\" after over three years of attempts, reaching an agreement on Wednesday, November 26, 2025. This decision allows negotiations to begin with the European Parliament.\n\nThe core of the controversy lies in a proposed obligation for all messaging services, including those with end-to-end encryption, to scan users' private chats for child sexual abuse material (CSAM). While earlier versions mandated this, the Danish Presidency's compromise made chat scanning \"voluntary,\" which facilitated the Council's agreement.\n\nDespite this amendment, privacy experts, cryptographers, and technologists remain highly critical, warning the proposal still poses \"high risks to society\" and calling it a \"political deception\" that could lead to \"total surveillance.\"\n\nUnder the new rules, online service providers must assess how their platforms could be misused and implement mitigating measures. High-risk services may be compelled to develop technologies to address these risks, with a new EU agency overseeing implementation. While member states celebrate a step against CSAM, concerns persist about balancing online safety with fundamental digital rights and strong encryption in the upcoming trilogue negotiations.",
    "chinese_title": "欧盟理事会批准与议会谈判的聊天控制授权",
    "chinese_summary": "欧盟理事会经过三年多的努力，于2025年11月26日星期三达成协议，批准了备受争议的《儿童性虐待条例》（CSAR），该条例常被称为“聊天控制”。这一决定使得与欧洲议会的谈判得以启动。\n\n争议的核心在于，该条例拟要求所有消息服务（包括采用端到端加密的服务）扫描用户的私人聊天，以查找儿童性虐待材料（CSAM）。尽管早期版本曾强制要求这样做，但丹麦轮值主席国提出的折衷方案将聊天扫描改为“自愿”，从而促成了理事会的协议。\n\n尽管有这项修正案，隐私专家、密码学家和技术专家仍持高度批评态度，警告该提案仍对“社会构成高风险”，并称其为可能导致“全面监控”的“政治欺骗”。\n\n根据新规定，在线服务提供商必须评估其平台可能如何被滥用，并实施缓解措施。高风险服务可能被迫开发技术来应对这些风险，并由一个新的欧盟机构监督实施。尽管成员国庆祝在打击CSAM方面迈出了一步，但在即将到来的三方谈判中，如何在网络安全与基本数字权利和强加密之间取得平衡，担忧依然存在。"
  },
  {
    "id": "46074286",
    "title": "Bird flu viruses are resistant to fever, making them a major threat to humans",
    "url": "https://medicalxpress.com/news/2025-11-bird-flu-viruses-resistant-fever.html",
    "summary": "This article discusses research indicating that bird flu viruses (avian influenza) have evolved to be resistant to fever, which traditionally helps mammals fight infections. This adaptation makes them a more significant threat to humans.\n\nKey findings include:\n*   Unlike typical mammalian viruses, avian flu viruses, particularly H5N1 and H7N9, replicate efficiently even at elevated temperatures mimicking fever.\n*   The study used ferret models, which closely mirror human infection, showing that fever-like temperatures did not inhibit viral replication or reduce viral load in the upper respiratory tract.\n*   This fever resistance is attributed to mutations in the viral polymerase complex, specifically the PB2 gene (E627K and D701N mutations), which help the virus adapt to mammalian hosts.\n*   The research highlights that the human immune response to avian flu might be compromised because a primary defense mechanism (fever) is less effective against these viruses.\n*   The study underscores the urgent need for new antiviral strategies and vaccines specifically designed to target these fever-resistant avian flu strains, especially given their pandemic potential. The ability to evade fever defense makes them particularly concerning for public health.",
    "chinese_title": "禽流感病毒耐热，使其对人类构成重大威胁。",
    "chinese_summary": "本文讨论的研究表明，禽流感病毒（avian influenza）已进化出对发热的抵抗力，而发热传统上是帮助哺乳动物对抗感染的机制。这种适应性使其对人类构成更大的威胁。\n\n主要发现包括：\n*   与典型的哺乳动物病毒不同，禽流感病毒，特别是H5N1和H7N9，即使在模拟发热的升高温度下也能有效复制。\n*   该研究使用与人类感染高度相似的雪貂模型，结果显示，发热般的温度并未抑制病毒复制或降低上呼吸道的病毒载量。\n*   这种耐热性归因于病毒聚合酶复合体中的突变，具体来说是PB2基因（E627K和D701N突变），这些突变有助于病毒适应哺乳动物宿主。\n*   该研究强调，人类对禽流感的免疫反应可能会受损，因为一种主要的防御机制（发热）对这些病毒的效力降低。\n*   该研究强调迫切需要专门针对这些耐热禽流感毒株设计新的抗病毒策略和疫苗，尤其考虑到其大流行潜力。它们规避发热防御的能力使其对公共卫生尤其令人担忧。"
  },
  {
    "id": "46077038",
    "title": "Tech Titans Amass Multimillion-Dollar War Chests to Fight AI Regulation",
    "url": "https://www.wsj.com/tech/ai/tech-titans-amass-multimillion-dollar-war-chests-to-fight-ai-regulation-88c600e1",
    "summary": "Unable to access the article link.",
    "chinese_title": "科技巨头积聚数百万美元战争基金，对抗人工智能监管",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46079721",
    "title": "Can Dutch universities do without Microsoft?",
    "url": "https://dub.uu.nl/en/news/can-dutch-universities-do-without-microsoft",
    "summary": "I'm sorry, but the article content has not been provided. The text only contains \"HOP\". Therefore, I cannot summarize whether Dutch universities can do without Microsoft or what the main points of such an article would be.\n\nPlease provide the full text of the article, and I would be happy to summarize it for you.",
    "chinese_title": "荷兰高校离得开微软吗？",
    "chinese_summary": "对不起，但文章内容尚未提供。文本只包含“HOP”。因此，我无法总结荷兰大学是否可以没有微软，也无法总结这样一篇文章的要点会是什么。请提供文章的全文，我很乐意为您总结。"
  },
  {
    "id": "46074111",
    "title": "Vsora Jotunn-8 5nm European inference chip",
    "url": "https://vsora.com/products/jotunn-8/",
    "summary": "The Vsora Jotunn-8 is introduced as the \"World’s Most Efficient AI Inference Chip,\" a 5nm European inference solution boasting \"0/tflops\" efficiency. This chip is designed to transform AI deployment in modern data centers, offering blistering speed, minimal cost, and effortless scalability for trained models.\n\nKey features of Jotunn-8 include ultra-low latency, vital for real-time applications like chatbots and fraud detection, and very high throughput, essential for demanding services such as recommendation engines and LLM APIs. The chip is engineered for cost-efficiency, significantly reducing the cost per inference at massive scales, and power-efficiency, aiming to cut operational expenses and carbon footprint.\n\nThe Jotunn-8 architecture ensures flexibility, enabling smooth integration and near-theory performance across various AI models, including Reasoning Models, Generative AI (LLMs), and Agentic AI. This versatility allows it to handle increasingly complex and combined AI systems. Vsora positions Jotunn-8 as a new foundation for AI at scale, outperforming existing market solutions (e.g., Llama3 405B) to maximize AI investments, reduce operational costs, and foster sustainability.",
    "chinese_title": "维索拉 约顿-8 5纳米 欧洲推理芯片",
    "chinese_summary": "Vsora Jotunn-8 被推出为“全球最高效的AI推理芯片”，是一款5纳米欧洲推理解决方案，宣称拥有“0/tflops”效率。该芯片旨在改变现代数据中心中的AI部署方式，为训练好的模型提供极快的速度、极低的成本和轻松的可扩展性。\n\nJotunn-8 的主要特点包括超低延迟，这对聊天机器人和欺诈检测等实时应用至关重要；以及超高吞吐量，这对于推荐引擎和LLM API等高要求服务不可或缺。该芯片设计注重成本效益，可在大规模部署时显著降低每次推理的成本；同时注重能源效率，旨在削减运营开支和碳足迹。\n\nJotunn-8 架构确保了灵活性，能够实现各类AI模型的顺畅集成和接近理论峰值的性能，其中包括推理模型、生成式AI（大型语言模型LLMs）和智能体AI。这种多功能性使其能够处理日益复杂和组合的AI系统。Vsora 将 Jotunn-8 定位为大规模AI的新基础，其性能超越现有市场解决方案（例如 Llama3 405B），从而最大化AI投资、降低运营成本并促进可持续发展。"
  },
  {
    "id": "46080473",
    "title": "Bringing Sexy Back. Internet surveillance has killed eroticism",
    "url": "https://lux-magazine.com/article/privacy-eroticism/",
    "summary": "Unable to access the article link.",
    "chinese_title": "性感回归。网络监控扼杀了情色。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46063915",
    "title": "AdBlock and Signal are for terrorists, according to French govt (2023) [video]",
    "url": "https://www.youtube.com/watch?v=1q1hjmwLqe4",
    "summary": "The provided \"article\" consists primarily of a title asserting that the French government, in 2023, characterized AdBlock and Signal as tools \"for terrorists.\" The title also indicates that the source is a video.\n\nThe subsequent content consists entirely of standard YouTube legal and copyright information (e.g., \"关于新闻版权联系我们创作者广告开发者条款隐私权政策与安全YouTube 的运作方式测试新功能NFL Sunday Ticket© 2025 Google LLC\") and provides no further details, context, or elaboration on the French government's alleged statement.",
    "chinese_title": "法国政府称，AdBlock和Signal是恐怖分子工具 (2023) [视频]",
    "chinese_summary": "所提供的“文章”主要包含一个标题，该标题声称法国政府在2023年将AdBlock和Signal描述为“恐怖分子”工具。该标题还表明来源是一个视频。\n\n随后的内容完全由标准的YouTube法律和版权信息组成（例如，“关于新闻版权联系我们创作者广告开发者条款隐私权政策与安全YouTube 的运作方式测试新功能NFL Sunday Ticket© 2025 Google LLC”），并且没有提供关于法国政府所谓声明的进一步细节、背景或阐述。"
  },
  {
    "id": "46061840",
    "title": "Crews claim Boring Company failed to pay workers and snubbed OSHA concerns",
    "url": "https://nashvillebanner.com/2025/11/25/boring-company-nashville-shane-trucking-and-excavating/",
    "summary": "Shane Trucking and Excavating, a key subcontractor for Elon Musk’s Boring Company (TBC) on Nashville’s Music City Loop tunnel project, has pulled its crew due to alleged non-payment and safety concerns. Willie Shane, owner of the excavating company, claims TBC has paid only about five percent of a six-figure sum owed over 123 days, after unilaterally extending payment terms. Other subcontractors reportedly left for similar reasons.\n\nShane also accused a TBC representative of breaching contract by attempting to poach his welders. Furthermore, he reported filing multiple OSHA complaints concerning unsafe working conditions, including TBC employees not wearing proper personal protective equipment (PPE) and hazardous shoring (using wood 2x12s instead of concrete) in deep excavations. Shane stated he went public to prevent injuries.\n\nThe Boring Company's Vice President, David Buss, acknowledged \"invoicing errors\" and promised to pay outstanding invoices by Wednesday, denying it's a common practice. Buss also denied TBC's policy is to poach contractors and stated he was unaware of any OSHA complaints, though he promised to investigate, emphasizing safety as crucial to the company.\n\nState Senator Heidi Campbell criticized TBC's recent promotional session as \"disingenuous\" given the immediate crew departure, expressing concerns about the state's liability for unsafe conditions and TBC's accountability. Shane initially said he wouldn't return, but later stated he would consider it if TBC rectifies the situation.",
    "chinese_title": "施工人员指控无聊公司拖欠工人工资并对OSHA的担忧置之不理",
    "chinese_summary": "肖恩卡车运输与挖掘公司（Shane Trucking and Excavating）作为埃隆·马斯克旗下“无聊公司”（TBC）在纳什维尔“音乐之城环线”隧道项目上的关键分包商，已因据称未付款和安全担忧撤走了其团队。该公司老板威利·肖恩声称，在TBC单方面延长付款期限后，已拖欠123天，但仅支付了六位数欠款的约百分之五。据报道，其他分包商也因类似原因离开。\n\n肖恩还指控一名TBC代表试图挖走他的焊工，从而违反合同。此外，他报告称已就危险工作条件多次向OSHA（美国职业安全与健康管理局）提出投诉，其中包括TBC员工未佩戴适当的个人防护装备（PPE）以及在深挖区存在危险支撑（使用木制2x12s而非混凝土）。肖恩表示他公开此事是为了防止人员受伤。\n\n“无聊公司”副总裁大卫·巴斯承认存在“开票错误”，并承诺在周三前支付所有未结发票，同时否认这是常见做法。巴斯还否认TBC的政策是挖走承包商，并表示他不知道有任何OSHA投诉，但他承诺会进行调查，强调安全对公司至关重要。\n\n州参议员海蒂·坎贝尔批评TBC最近的宣传活动“不真诚”，因为工作人员立即撤离，并对州政府对不安全条件的责任以及TBC的问责制表示担忧。肖恩最初表示他不会返回，但后来表示，如果TBC纠正这种情况，他会考虑。"
  },
  {
    "id": "46069556",
    "title": "Show HN: Runprompt – run .prompt files from the command line",
    "url": "https://github.com/chr15m/runprompt",
    "summary": "Runprompt is a minimal, single-file Python script designed to execute Dotprompt files directly from the command line, requiring no external dependencies. Dotprompt is an executable prompt template format for Generative AI, enabling `.prompt` files to bundle both the prompt template and essential metadata (model, schema, configuration).\n\nUsers can quickly get started by downloading the script, making it executable, and then running `.prompt` files, often piping JSON input to populate template variables (e.g., `echo '{\"name\": \"World\"}' | ./runprompt hello.prompt`). It leverages a Handlebars-like template syntax for variables, iteration, and sections, including a special `{{STDIN}}` variable for piped input.\n\nKey features include the ability to extract structured JSON output using a Picoschema definition, chain prompts by piping the JSON output of one into another, and make `.prompt` files directly executable via a shebang. Command-line overrides allow modification of any frontmatter value at runtime (e.g., `./runprompt --model ...`).\n\nConfiguration is handled through environment variables for API keys (e.g., `OPENAI_API_KEY`) and `RUNPROMPT_*` variables for global overrides. It supports models from Anthropic, OpenAI, Google AI, and OpenRouter, specified as `provider/model-name`. Runprompt is a minimal implementation of the Dotprompt specification, with features like multi-message prompts, conditionals, and advanced model configuration not yet supported.",
    "chinese_title": "HN 展示: Runprompt — 在命令行运行 .prompt 文件",
    "chinese_summary": "Runprompt是一个极简的单文件Python脚本，旨在直接从命令行执行Dotprompt文件，无需外部依赖。Dotprompt是一种用于生成式AI的可执行提示模板格式，使`.prompt`文件能够同时捆绑提示模板和基本元数据（模型、schema、配置）。\n\n用户可以通过下载脚本、使其可执行，然后运行`.prompt`文件来快速上手，通常通过管道输入JSON来填充模板变量（例如，`echo '{\"name\": \"World\"}' | ./runprompt hello.prompt`）。它利用类似Handlebars的模板语法来处理变量、迭代和节，包括一个用于管道输入的特殊`{{STDIN}}`变量。\n\n主要功能包括：使用Picoschema定义提取结构化JSON输出的能力；通过将一个提示的JSON输出通过管道传递给另一个来链式调用提示；以及通过shebang使`.prompt`文件直接可执行。命令行覆盖允许在运行时修改任何前置元数据值（例如，`./runprompt --model ...`）。\n\n配置通过API密钥的环境变量（例如`OPENAI_API_KEY`）和用于全局覆盖的`RUNPROMPT_*`变量进行处理。它支持来自Anthropic、OpenAI、Google AI和OpenRouter的模型，指定为`provider/model-name`格式。Runprompt是Dotprompt规范的一个极简实现，像多消息提示、条件语句和高级模型配置等功能尚未支持。"
  },
  {
    "id": "46075305",
    "title": "China's BEV trucks and the end of diesel's dominance",
    "url": "https://cleantechnica.com/2025/11/26/chinas-bev-trucks-and-the-end-of-diesels-dominance/",
    "summary": "Chinese battery electric heavy trucks (BEV trucks) are rapidly expanding, offering significantly lower prices (€58,000 - €85,000) than Western counterparts (€250,000+). These vehicles are purpose-built electric designs, integrating LFP packs and e-axles into simplified chassis, reducing costs dramatically.\n\nWhile initial Chinese BEV trucks require €20,000 - €40,000 in modifications to meet Western safety, comfort, and regulatory standards for short-haul duty, their landed price of €80,000 - €120,000 remains highly competitive. This makes them ideal for the majority of freight, which consists of short-haul (<250 km) urban and regional trips, challenging the prevalent Western focus on long-haul electrification.\n\nChina's heavy truck market reflects this shift, with BEV truck sales rising from 13% in 2024 to 22% in early 2025, pushing diesel's share near 50%. Natural gas trucks also grew but face pressure from BEVs. Hydrogen fuel cell trucks, however, are a negligible segment (under 1%) and are declining. This rapid transition is already impacting China's diesel consumption.\n\nWestern OEMs, initially adapting diesel frames for electric powertrains, face challenges due to higher costs and less optimized designs. They are now shifting towards purpose-built electric platforms. China's established BEV supply chains and volume-driven cost reductions offer a faster, cheaper path to decarbonization. Western operators and policymakers must decide how to respond to this new cost structure, as electric freight becomes economically more compelling than diesel for most real-world duty cycles, signaling the end of diesel's dominance.",
    "chinese_title": "中国纯电卡车与柴油霸权的终结",
    "chinese_summary": "中国纯电动重型卡车（BEV卡车）正在迅速扩张，其价格（5.8万至8.5万欧元）远低于西方同类产品（25万欧元以上）。这些车辆是专门设计的电动车型，将磷酸铁锂电池组和电驱动桥集成到简化底盘中，大幅降低了成本。\n\n尽管最初的中国BEV卡车需要2万至4万欧元的改装才能满足西方短途运输的安全、舒适和监管标准，但其到岸价格（8万至12万欧元）仍极具竞争力。这使得它们非常适合大部分短途（<250公里）城市和区域货运，对西方普遍关注长途电气化的趋势构成了挑战。\n\n中国重型卡车市场反映了这一转变，BEV卡车销量从2024年的13%上升到2025年初的22%，将柴油车的份额推至接近50%。天然气卡车也有增长，但面临来自BEV的压力。然而，氢燃料电池卡车所占份额微不足道（低于1%）且正在下降。这种快速转型已经影响到中国的柴油消耗。\n\n西方原始设备制造商（OEM）最初通过改装柴油车底盘以适应电动动力系统，面临成本较高和设计优化不足的挑战。他们现在正转向专门设计的电动平台。中国成熟的BEV供应链和规模化带来的成本降低，为脱碳提供了一条更快、更经济的途径。西方运营商和政策制定者必须决定如何应对这种新的成本结构，因为电动货运在大多数实际工况下比柴油车在经济上更具吸引力，这预示着柴油车主导地位的终结。"
  },
  {
    "id": "46063450",
    "title": "C100 Developer Terminal",
    "url": "https://caligra.com/",
    "summary": "Caligra develops tools, like the C100 Developer Terminal, specifically for technical environments where accuracy, reliability, and productivity are critical. Their products are designed for professionals who depend on the outcomes of their work and value maintaining a focused \"flow state.\" The C100 is presented as a computer built on distinct principles, prioritizing user needs and enabling efficient task completion, ultimately serving the creator in \"getting things done.\"",
    "chinese_title": "C100 开发者终端",
    "chinese_summary": "卡利格拉（Caligra）开发工具，例如 C100 开发者终端，专门针对准确性、可靠性和生产力至关重要的技术环境。他们的产品专为那些依赖工作成果、并重视保持专注“心流状态”的专业人士设计。C100 被定位为一款基于独特原则打造的电脑，它优先考虑用户需求，并实现高效任务完成，最终帮助创作者“完成工作”。"
  },
  {
    "id": "46071030",
    "title": "The input stack on Linux: An end-to-end architecture overview",
    "url": "https://venam.net/blog/unix/2025/11/27/input_devices_linux.html",
    "summary": "The Linux input stack comprises kernel-level, exposed, and user-space layers.\n\nAt the **kernel level**, the **Input Core** is central to handling input devices and events. Input device drivers (e.g., for keyboards, mice) register with the core, abstracting device-specific protocols into a standardized format. They push events via `input_event` to the core, which then fans out these events to registered **input handlers**. The **evdev** (event device) handler is the default, exposing these events to user-space as character devices (e.g., `/dev/input/eventX`) in `devtmpfs`.\n\nThe kernel maintains a hierarchical view of devices using `kobjects` (bus, device, driver, class, subsystem), represented in `sysfs` (e.g., `/sys/devices/`). **Buses** (e.g., PCI, USB, HID) are fundamental, connecting devices and initiating the process of matching devices with their appropriate drivers. This matching can cascade, with one bus acting as a device on another (e.g., USB on PCI).\n\nWhen devices are plugged or unplugged, the kernel emits **uevents** via `netlink`. These events include a `MODALIAS` string, which contains device identification information (vendor/product IDs). In **user-space**, `udev` monitors these `uevents`, using the `MODALIAS` to dynamically load required kernel modules via `modprobe`, thereby managing device hotplug and initial setup. `sysfs` and `procfs` also provide introspection into kernel objects and the input core.",
    "chinese_title": "Linux 输入栈：端到端架构概览",
    "chinese_summary": "Linux 输入栈由内核层、对外暴露层和用户空间层组成。\n\n在**内核层**，**输入核心**是处理输入设备和事件的中心。输入设备驱动程序（例如键盘、鼠标）向该核心注册，将设备特定的协议抽象为标准化格式。它们通过 `input_event` 向核心推送事件，核心随后将这些事件分发给已注册的**输入处理程序**。**evdev**（事件设备）处理程序是默认的，它将这些事件作为字符设备（例如 `/dev/input/eventX`）在 `devtmpfs` 中暴露给用户空间。\n\n内核使用 `kobjects`（总线、设备、驱动程序、类、子系统）维护设备的层次结构视图，并在 `sysfs`（例如 `/sys/devices/`）中进行表示。**总线**（例如 PCI、USB、HID）是基础，负责连接设备并启动设备与其相应驱动程序的匹配过程。这种匹配可以级联，一个总线可以作为另一个总线上的设备（例如 PCI 上的 USB）。\n\n当设备插入或拔出时，内核通过 `netlink` 发出 **uevents**。这些事件包含一个 `MODALIAS` 字符串，其中包含设备识别信息（供应商/产品 ID）。在**用户空间**中，`udev` 监控这些 `uevents`，利用 `MODALIAS` 通过 `modprobe` 动态加载所需的内核模块，从而管理设备的**热插拔**和初始设置。`sysfs` 和 `procfs` 也提供对内核对象和输入核心的自省功能。"
  },
  {
    "id": "46064680",
    "title": "Functional Data Structures and Algorithms: a Proof Assistant Approach",
    "url": "https://fdsa-book.net/",
    "summary": "\"Functional Data Structures and Algorithms: a Proof Assistant Approach,\" published by ACM Books, provides an introduction to data structures and algorithms specifically for functional languages. Authored by Tobias Nipkow and a team including Jasmin Blanchette and Bohua Zhan, the book's core focus is on rigorous proofs. It covers both functional correctness and running time analysis in a unified manner, utilizing inductive proofs for functional programs and their associated running time functions.\n\nA key distinguishing feature is that all proofs presented in the book have been formally machine-checked by the Isabelle proof assistant, with direct links to the corresponding Isabelle theories embedded in the PDF. This ensures a high degree of reliability and precision. The publication is intended to be an evolving resource, actively inviting contributions from the community. The complete book can be downloaded via a clickable image.",
    "chinese_title": "函数式数据结构与算法：基于证明助手的方法",
    "chinese_summary": "《函数式数据结构与算法：证明助手方法》一书由ACM图书出版，专门为函数式语言介绍了数据结构和算法。该书由Tobias Nipkow以及包括Jasmin Blanchette和Bohua Zhan在内的团队合著，核心着重于严格的证明。它以统一的方式涵盖了函数式正确性与运行时间分析，并利用归纳证明来验证函数式程序及其相关的运行时间函数。\n\n一个关键的显著特点是，书中所有证明都已通过Isabelle证明助手进行形式化机器验证，并且PDF中嵌入了指向相应Isabelle理论的直接链接。这确保了高度的可靠性和精确性。该出版物旨在成为一个不断演进的资源，并积极邀请社区贡献。完整书籍可通过可点击的图片进行下载。"
  },
  {
    "id": "46064456",
    "title": "The Tesla Model Y Just Scored the Worst Reliability Rating in a Decade",
    "url": "https://www.autoblog.com/news/the-bestselling-tesla-model-y-just-scored-the-worst-reliability-rating-in-a-decade",
    "summary": "The Tesla Model Y has received the lowest reliability rating in a decade, according to Consumer Reports' 2023 reliability survey. Scoring just 8 out of 100, its predicted reliability plunged significantly from last year.\n\nThis dismal performance is attributed to numerous issues reported by owners, particularly with its climate system and body integrity, including rattling noises and misaligned panels. Paint quality issues and infotainment glitches were also cited. The Model Y's problems appear to stem from a combination of design flaws and assembly issues, rather than just software bugs.\n\nWhile the Model Y drags down Tesla's overall reliability score, other models like the Model 3 and Model S fared better, with the Model 3 being recommended by Consumer Reports. The Model X, however, also showed below-average reliability. Overall, Tesla ranked 14th out of 30 brands, improving slightly from the previous year.\n\nDespite these reliability concerns, the Model Y remains an extremely popular vehicle, often being one of the best-selling EVs globally. However, for potential buyers prioritizing long-term dependability, the latest Consumer Reports data presents a significant red flag.",
    "chinese_title": "特斯拉Model Y刚刚获得了十年来最差的可靠性评级。",
    "chinese_summary": "根据《消费者报告》2023年可靠性调查，特斯拉Model Y获得了十年来的最低可靠性评级。其得分仅为100分中的8分，预估可靠性较去年大幅下降。\n\n这种糟糕的表现归因于车主报告的众多问题，特别是其空调系统和车身完整性方面，包括嘎嘎作响的噪音和面板错位。油漆质量问题和信息娱乐系统故障也被提及。Model Y的问题似乎源于设计缺陷和组装问题的结合，而不仅仅是软件错误。\n\n尽管Model Y拉低了特斯拉的整体可靠性得分，但Model 3和Model S等其他车型表现更好，其中Model 3还获得了《消费者报告》的推荐。然而，Model X也显示出低于平均水平的可靠性。总体而言，特斯拉在30个品牌中排名第14位，较去年略有提升。\n\n尽管存在这些可靠性问题，Model Y仍然是一款极受欢迎的汽车，经常是全球最畅销的电动汽车之一。然而，对于那些优先考虑长期可靠性的潜在买家来说，《消费者报告》的最新数据发出了一个重要的警示。"
  },
  {
    "id": "46081053",
    "title": "28M Hacker News comments as vector embedding search dataset",
    "url": "https://clickhouse.com/docs/getting-started/example-datasets/hackernews-vector-search-dataset",
    "summary": "This article introduces a dataset of 28.74 million Hacker News posts and comments, each with 384-dimensional vector embeddings generated by the `all-MiniLM-L6-v2` SentenceTransformers model. Provided by ClickHouse as a Parquet file on S3, this dataset serves as a real-world example for designing and evaluating large-scale vector search applications on textual data.\n\nThe guide details a step-by-step process for implementing vector search using ClickHouse:\n1.  **Table Creation:** Define a `hackernews` table with columns for `id`, `text`, and the `vector` (Array(Float32)) embedding, along with other metadata.\n2.  **Data Loading:** Insert the 28.74 million rows from the S3 Parquet file into the ClickHouse table.\n3.  **Index Building:** Create an HNSW vector similarity index on the `vector` column, specifying `cosineDistance` and hyperparameters (M=64, ef_construction=512).\n4.  **Vector Search:** Perform Approximate Nearest Neighbor (ANN) queries using `cosineDistance` in SQL to find semantically similar posts.\n5.  **Query Embedding:** Generate embeddings for user search queries using the same `all-MiniLM-L6-v2` model in Python.\n\nThe article further presents a generative AI summarization application. This system accepts a topic, generates its embedding, retrieves relevant Hacker News content via ClickHouse vector search, and then uses LangChain and OpenAI's `gpt-3.5-turbo` to summarize the retrieved posts. This demonstrates how vector embeddings provide essential context for large language models, applicable to various enterprise domains like sentiment analysis or technical support automation.",
    "chinese_title": "2800万Hacker News评论作为向量嵌入搜索数据集",
    "chinese_summary": "本文介绍了一个包含2874万条Hacker News帖子和评论的数据集，每条都带有由`all-MiniLM-L6-v2` SentenceTransformers模型生成的384维向量嵌入。该数据集由ClickHouse以S3上的Parquet文件形式提供，可作为一个真实世界的例子，用于设计和评估基于文本数据的大规模向量搜索应用。\n\n本指南详细介绍了使用ClickHouse实现向量搜索的分步过程：\n1.  **表创建：** 定义一个`hackernews`表，包含`id`、`text`和`vector` (Array(Float32)) 嵌入列，以及其他元数据。\n2.  **数据加载：** 将S3 Parquet文件中的2874万行数据插入到ClickHouse表中。\n3.  **索引构建：** 在`vector`列上创建一个HNSW向量相似性索引，指定`cosineDistance`和超参数（M=64, ef_construction=512）。\n4.  **向量搜索：** 在SQL中使用`cosineDistance`执行近似最近邻（ANN）查询，以查找语义相似的帖子。\n5.  **查询嵌入：** 使用Python中相同的`all-MiniLM-L6-v2`模型为用户搜索查询生成嵌入。\n\n本文还介绍了一个生成式AI摘要应用。该系统接受一个主题，生成其嵌入，通过ClickHouse向量搜索检索相关的Hacker News内容，然后使用LangChain和OpenAI的`gpt-3.5-turbo`对检索到的帖子进行摘要。这展示了向量嵌入如何为大型语言模型提供关键上下文，适用于情感分析或技术支持自动化等各种企业领域。"
  },
  {
    "id": "46078407",
    "title": "A trillion dollars (potentially) wasted on gen-AI",
    "url": "https://garymarcus.substack.com/p/a-trillion-dollars-is-a-terrible",
    "summary": "Gary Marcus's article, \"A trillion dollars (potentially) wasted on gen-AI,\" argues that the massive investment in generative AI is largely unproductive and misdirected. Marcus contends that while there has been significant hype and capital poured into the field, the core technology still suffers from fundamental flaws.\n\nHe highlights that current Large Language Models (LLMs) are essentially \"stochastic parrots\" that excel at pattern matching but lack genuine understanding, common sense, and reliability. This leads to issues like \"hallucinations,\" factual inaccuracies, and an inability to reason effectively, making them unsuitable for critical applications without extensive human oversight. Marcus points out that despite the impressive surface-level capabilities, the underlying mechanisms haven't fundamentally changed in years, and many proclaimed breakthroughs are incremental rather than revolutionary.\n\nThe article suggests that the focus on scaling up existing architectures with ever more data and compute is a diminishing returns strategy. Instead of addressing the deep cognitive challenges, the industry is largely betting on brute force. Marcus concludes that this trillion-dollar investment might be squandered on a path that fails to deliver robust, trustworthy, and truly intelligent AI, advocating for a shift towards developing systems with deeper cognitive abilities rather than just larger statistical models.",
    "chinese_title": "万亿美元或将浪费在生成式AI上",
    "chinese_summary": "加里·马库斯的文章《万亿美元（可能）浪费在生成式AI上》指出，对生成式AI的巨额投资大部分是徒劳且方向错误的。马库斯认为，尽管该领域充斥着大量炒作和资金投入，但核心技术仍存在根本性缺陷。\n\n他强调，当前的大型语言模型（LLMs）本质上是“随机鹦鹉”，它们擅长模式匹配，但缺乏真正的理解、常识和可靠性。这导致了“幻觉”、事实性错误以及无法有效推理等问题，使得它们在没有大量人工监督的情况下不适用于关键应用。马库斯指出，尽管其表面能力令人印象深刻，但底层机制多年来并未发生根本性改变，许多所谓的突破都是渐进式的，而非革命性的。\n\n文章认为，专注于通过更多数据和算力来扩展现有架构是一种收益递减的策略。业界没有解决深层次的认知挑战，却主要依赖蛮力。马库斯总结道，这万亿美元的投资可能被浪费在一条无法提供稳健、可信和真正智能AI的道路上，他倡导转向开发具有更深层认知能力而非仅仅更大的统计模型的系统。"
  },
  {
    "id": "46073817",
    "title": "A programmer-friendly I/O abstraction over io_uring and kqueue (2022)",
    "url": "https://tigerbeetle.com/blog/2022-11-23-a-friendly-abstraction-over-iouring-and-kqueue/",
    "summary": "This article introduces a \"programmer-friendly I/O abstraction\" designed to leverage the performance of modern kernel interfaces like Linux's `io_uring` and FreeBSD/macOS's `kqueue`. It highlights the inefficiencies of traditional blocking and non-blocking I/O due to costly system calls.\n\n`io_uring` and `kqueue` offer improvements through batched I/O and completion queues. `io_uring` is further advanced by allowing the kernel to perform the actual `read`/`write` operations, minimizing userland overhead. However, directly using these low-level APIs can intertwine I/O mechanics with business logic, creating complex event loops.\n\nThe proposed abstraction (e.g., `io_dispatch`) centralizes I/O scheduling, enabling developers to dispatch operations with callbacks for completion. It transparently handles OS differences, utilizing `io_uring`'s kernel-side I/O or performing userland I/O after `kqueue` readiness events. The system uses user data fields to link callbacks to events, manages an overflow queue for unscheduled requests, and provides high-level API wrappers. This architecture facilitates a clean, user-managed event loop, mirroring approaches in `libuv`, TigerBeetle, and Bun. The article also mentions Windows' IOCP and discusses single-threaded event loops for determinism, acknowledging multi-threaded alternatives for different workloads. A standalone Zig library is hinted at.",
    "chinese_title": "基于 io_uring 和 kqueue 的开发者友好型 I/O 抽象 (2022)",
    "chinese_summary": "本文介绍了一种“对程序员友好的 I/O 抽象”，旨在利用现代内核接口（例如 Linux 的 `io_uring` 和 FreeBSD/macOS 的 `kqueue`）的性能。它强调了传统阻塞和非阻塞 I/O 因代价高昂的系统调用而效率低下的问题。\n\n`io_uring` 和 `kqueue` 通过批处理 I/O 和完成队列提供改进。`io_uring` 更进一步，允许内核执行实际的 `read`/`write` 操作，从而最大限度地减少用户态开销。然而，直接使用这些底层 API 可能将 I/O 机制与业务逻辑纠缠在一起，从而创建复杂的事件循环。\n\n所提出的抽象（例如 `io_dispatch`）集中管理 I/O 调度，使开发人员能够调度带有完成回调的操作。它透明地处理操作系统差异，利用 `io_uring` 的内核端 I/O，或者在 `kqueue` 准备就绪事件后执行用户态 I/O。该系统使用用户数据字段将回调链接到事件，管理一个用于未调度请求的溢出队列，并提供高级 API 封装。这种架构促进了简洁、用户管理的事件循环，类似于 `libuv`、TigerBeetle 和 Bun 中的方法。文章还提到了 Windows 的 IOCP，并讨论了用于确定性的单线程事件循环，同时承认针对不同工作负载的多线程替代方案。文中暗示将提供一个独立的 Zig 库。"
  },
  {
    "id": "46079987",
    "title": "AI Adoption Rates Starting to Flatten Out",
    "url": "https://www.apolloacademy.com/ai-adoption-rates-starting-to-flatten-out/",
    "summary": "On November 28, 2025, Torsten Sløk, Apollo's Chief Economist, reported that AI adoption rates are beginning to flatten out across all firm sizes in the United States. This assessment is based on data from the US Census Bureau and the Ramp AI Index.\n\nThe Ramp AI Index measures the adoption rate of artificial intelligence products and services among American businesses. It utilizes data from over 40,000 businesses and billions of dollars in corporate spend via Ramp’s corporate card and bill pay platform. The reported trend is based on a six-survey moving average, with surveys conducted bi-weekly.",
    "chinese_title": "AI采用率开始趋于平稳",
    "chinese_summary": "2025年11月28日，阿波罗首席经济学家托斯滕·斯洛克（Torsten Sløk）报告称，人工智能在美国所有规模的企业中的采纳率正开始趋于平稳。这一评估是基于美国人口普查局和Ramp AI指数的数据。\n\nRamp AI指数衡量美国企业采纳人工智能产品和服务的速度。该指数利用Ramp企业信用卡和账单支付平台收集的来自超过40,000家企业和数十亿美元企业支出数据。报告的趋势是基于六次调查的移动平均值，调查每两周进行一次。"
  },
  {
    "id": "46076642",
    "title": "SQLite as an Application File Format",
    "url": "https://sqlite.org/appfileformat.html",
    "summary": "The article \"SQLite As An Application File Format\" advocates for using SQLite database files to persist application state and exchange information. It defines an application file format as one storing multiple objects and their relationships, distinguishing it from formats storing single objects.\n\nThe text categorizes existing formats into three types:\n1.  **Fully Custom Formats:** Opaque, binary, requiring specialized tools (e.g., DOC, PDF).\n2.  **Pile-of-Files Formats:** Uses the filesystem as a key/value store, accessible but inconvenient to transport and lacking a single document entity (e.g., Git).\n3.  **Wrapped Pile-of-Files Formats:** Encapsulates a pile-of-files into a single archive (e.g., ZIP for EPUB), offering a single file but often requiring full rewrites for minor changes.\n\nSQLite is presented as a superior fourth category, capable of storing data from simple key/value structures to complex relational schemas efficiently within a single file.\n\nKey advantages of using SQLite as an application file format include:\n*   **Simplified Application Development:** Reduces I/O coding by leveraging SQLite's robust, proven library.\n*   **Single-File Documents:** Preserves the \"document\" metaphor, making files easy to manage, move, and identify.\n*   **High-Level Query Language:** SQL allows developers to express \"what\" data is needed, not \"how\" to retrieve it, simplifying logic.\n*   **Accessible Content:** Data is not an opaque blob; it's accessible via common tools and a well-documented, cross-platform format, ensuring longevity.\n*   **Atomic Transactions:** Guarantees data integrity and crash-safety, preventing corruption during writes.\n*   **Incremental and Continuous Updates:** Only changed parts are written to disk, enhancing performance, reducing SSD wear, and preventing data loss.\n*   **Easily Extensible:** Schema can be modified (adding tables/columns) without breaking backward compatibility.\n*   **Performance:** Can offer faster startup and operations by querying only necessary data, rather than parsing entire documents.",
    "chinese_title": "SQLite 作为应用文件格式",
    "chinese_summary": "文章《SQLite作为应用程序文件格式》倡导使用SQLite数据库文件来持久化应用程序状态和交换信息。它将应用程序文件格式定义为存储多个对象及其关系的文件格式，并将其与存储单个对象的格式区分开来。\n\n该文将现有格式分为三类：\n1.  **完全自定义格式：** 不透明、二进制，需要专用工具（例如DOC、PDF）。\n2.  **文件堆格式：** 将文件系统用作键/值存储，可访问但不便传输，且缺少单一文档实体（例如Git）。\n3.  **封装文件堆格式：** 将文件堆封装成单个归档文件（例如EPUB的ZIP），提供单个文件，但对微小更改通常需要完全重写。\n\nSQLite被提出作为优越的第四类，能够将从简单的键/值结构到复杂的关联模式的数据高效地存储在单个文件中。\n\n将SQLite用作应用程序文件格式的主要优势包括：\n*   **简化应用程序开发：** 通过利用SQLite强大、成熟的库，减少I/O编码。\n*   **单一文件文档：** 保留了“文档”的隐喻，使文件易于管理、移动和识别。\n*   **高级查询语言：** SQL允许开发人员表达“需要什么”数据，而不是“如何”检索，从而简化逻辑。\n*   **可访问内容：** 数据不是不透明的二进制大对象；它可以通过通用工具和良好文档化的跨平台格式进行访问，确保了持久性。\n*   **原子事务：** 保证数据完整性和崩溃安全，防止写入期间的数据损坏。\n*   **增量和持续更新：** 只有更改的部分才写入磁盘，从而提高性能，减少SSD磨损，并防止数据丢失。\n*   **易于扩展：** 可以修改模式（添加表/列）而不会破坏向后兼容性。\n*   **性能：** 通过仅查询必要数据而不是解析整个文档，可以提供更快的启动和操作。"
  },
  {
    "id": "46073279",
    "title": "FileZilla Pro \"Perpetual License\" – A Warning to All Users",
    "url": "https://github.com/x011/FileZilla-Pro-Download",
    "summary": "This article issues a stark warning about FileZilla Pro's \"perpetual license.\" The author, who purchased such a license, discovered it becomes effectively worthless if the operating system is reinstalled or the original installer is lost.\n\nAfter an OS reinstall, the author contacted FileZilla Pro support to obtain the installer for the version they legally owned. Support admitted the author's legal right to the old version but refused to provide the installer, citing \"security reasons\" for not distributing older versions.\n\nThis refusal renders the \"perpetual license\" unusable, forcing customers to pay again for a new subscription to access the software they already purchased. The author believes this policy is financially motivated, not security-based, pointing out that support immediately offered a discount on the newest version, and the old version was still receiving updates before the reinstallation attempt.\n\nThe article also clarifies that FileZilla is not affiliated with Mozilla, an assumption the author initially made, leading to misplaced trust. Users considering FileZilla Pro are warned that a \"perpetual license\" may not guarantee the ability to reinstall the product they legally own.",
    "chinese_title": "文件吉拉 Pro “永久授权” — 致全体用户的一则警告",
    "chinese_summary": "本文对FileZilla Pro的“永久许可证”发出了严厉警告。作者购买了此类许可证，却发现一旦重装操作系统或丢失原始安装程序，该许可证便形同虚设。\n\n操作系统重装后，作者联系了FileZilla Pro支持部门，以获取其合法拥有的版本安装程序。支持部门承认作者对旧版本的合法权利，但以“安全原因”不分发旧版本为由，拒绝提供安装程序。\n\n这种拒绝使得“永久许可证”无法使用，迫使客户为访问已购买的软件而再次支付新订阅费用。作者认为，这项政策是出于经济动机而非安全考虑，因为支持部门立即提供了最新版本的折扣，而且在重装尝试之前，旧版本仍在接收更新。\n\n文章还澄清，FileZilla与Mozilla没有关联，这是作者最初的误解，导致其产生了错误的信任。文章警告正在考虑FileZilla Pro的用户，“永久许可证”可能无法保证他们能够重新安装其合法拥有的产品。"
  },
  {
    "id": "46075628",
    "title": "Tiger Style: Coding philosophy (2024)",
    "url": "https://tigerstyle.dev/",
    "summary": "Tiger Style is a coding philosophy focused on safety, performance, and developer experience, inspired by TigerBeetle's engineering practices. It aims to build robust, efficient, and maintainable software through disciplined methods.\n\nCore principles emphasize:\n*   **Safety:** Writing reliable, predictable code by using simple control flow, fixed limits, concise functions (under 70 lines), explicit data types (e.g., u32), static memory allocation, minimal variable scope, thorough error handling (assertions, fail-fast, treating warnings as errors), and avoiding implicit defaults.\n*   **Performance:** Designing for efficiency early through \"napkin math\" estimations, batching operations, and optimizing resource usage (network, disk, memory, CPU). It also advocates for predictable code paths to leverage CPU caching and branch prediction.\n*   **Developer Experience:** Fostering maintainability and collaboration with clear, consistent, and descriptive naming (full words, units/qualifiers), logical code organization, simplified function interfaces, ensuring consistency (no duplicates, pass large objects by reference, clean buffer handling), meticulous prevention of off-by-one errors, and standardized tooling and code style.\n\nAn addendum reinforces these by advocating for \"zero technical debt,\" stressing the importance of doing things right the first time, proactive problem-solving, and building high-quality, lasting progress. Performance estimation via \"napkin math\" is also highlighted as a vital early design tool.",
    "chinese_title": "虎式：编程哲学 (2024)",
    "chinese_summary": "虎式风格是一种编码理念，专注于安全性、性能和开发者体验，灵感来源于TigerBeetle的工程实践。它旨在通过严谨的方法构建健壮、高效、可维护的软件。\n\n核心原则强调：\n*   **安全性：** 通过使用简单的控制流、固定限制、简洁函数（不超过70行）、显式数据类型（例如u32）、静态内存分配、最小变量作用域、彻底的错误处理（断言、快速失败、将警告视为错误）以及避免隐式默认值，编写可靠、可预测的代码。\n*   **性能：** 通过“餐巾纸计算”估算、批处理操作以及优化资源使用（网络、磁盘、内存、CPU），在早期设计阶段就注重效率。它还提倡使用可预测的代码路径，以利用CPU缓存和分支预测。\n*   **开发者体验：** 通过清晰、一致且描述性的命名（完整单词、单位/修饰符）、逻辑化的代码组织、简化的函数接口、确保一致性（无重复、按引用传递大型对象、整洁的缓冲区处理）、细致地防止“差一”错误以及标准化的工具和代码风格，促进可维护性和协作。\n\n一项补充内容强化了这些原则，提倡“零技术债”，强调了第一次就把事情做对、积极主动地解决问题以及建立高质量、持久进展的重要性。通过“餐巾纸计算”进行的性能估算也作为一项至关重要的早期设计工具得到了强调。"
  },
  {
    "id": "46063531",
    "title": "Ilya Sutskever, Yann LeCun and the End of “Just Add GPUs”",
    "url": "https://www.abzglobal.net/web-development-blog/ilya-sutskever-yann-lecun-and-the-end-of-just-add-gpus",
    "summary": "Two leading AI figures, Ilya Sutskever (OpenAI co-founder, now SSI head) and Yann LeCun (Meta's Chief AI Scientist), declare that current large language models (LLMs) and the \"age of scaling\" are reaching their limits.\n\nSutskever argues AI is shifting \"from scaling to research.\" While massive compute and data yielded breakthroughs (2020-2025), diminishing returns, finite high-quality data, and a gap between benchmark performance and real-world reliability (hallucinations, poor generalization) are now apparent. His company, Safe Superintelligence Inc., focuses on inventing new training methods and architectures for superintelligence, asserting that future gains require smarter algorithms, not just more GPUs.\n\nLeCun is more radical, labeling LLMs a \"product-driven dead-end\" for true intelligence. He criticizes their shallow understanding of the physical world, causality, and the simplistic nature of token prediction. Instead, he champions \"world models\" like JEPA, which learn by observing the environment (e.g., video) to build internal representations, enabling persistent memory, reasoning, and planning, similar to how humans and animals learn.\n\nBoth agree that current scaling strategies are hitting ceilings. Sutskever suggests evolving existing neural nets with better objectives, while LeCun advocates for a paradigm shift to world models.\n\nFor developers and founders, this means the competitive advantage of raw GPU access is decreasing. The focus must shift to high-quality domain data, robust user workflows, effective feedback loops, and differentiating through use cases, user experience, and integration. Expect more diverse model types and hybrid systems, where reliability, reasoning, and planning within your product matter more than chasing benchmark scores. The next era of AI will be defined by new ideas and smarter algorithms beyond predicting the next token.",
    "chinese_title": "伊利亚·苏茨克维、杨立昆与“堆显卡”时代的终结",
    "chinese_summary": "两位人工智能领军人物，Ilya Sutskever（OpenAI联合创始人，现任SSI负责人）和Yann LeCun（Meta首席人工智能科学家）均表示，当前的大型语言模型（LLM）和“规模化时代”正在触及极限。\n\nSutskever认为，人工智能正在从“规模化转向研究”。尽管海量算力和数据在2020-2025年间带来了突破，但收益递减、有限的高质量数据，以及基准性能与实际可靠性（幻觉、泛化能力差）之间的差距如今已显而易见。他的公司Safe Superintelligence Inc.致力于为超级智能发明新的训练方法和架构，坚称未来的进步需要更智能的算法，而不仅仅是更多的GPU。\n\nLeCun的观点更为激进，他将LLM称为对于真正的智能而言的“以产品为导向的死胡同”。他批评LLM对物理世界、因果关系的理解肤浅，以及其Token预测的简单本质。相反，他倡导“世界模型”，例如JEPA，它通过观察环境（例如视频）进行学习，以构建内部表征，从而实现持久记忆、推理和规划，类似于人类和动物的学习方式。\n\n两人都同意，当前的规模化策略正在触及天花板。Sutskever建议通过更好的目标来演进现有神经网络，而LeCun则主张向世界模型进行范式转变。\n\n对于开发者和创始人而言，这意味着单纯的GPU算力优势正在减弱。重点必须转向高质量领域数据、稳健的用户工作流、有效的反馈循环，并希望通过用例、用户体验和集成实现差异化。预计将出现更多样化的模型类型和混合系统，在其中，产品内的可靠性、推理和规划比追求基准分数更为重要。人工智能的下一个时代将由新的想法和更智能的算法定义，而不再仅仅是预测下一个Token。"
  },
  {
    "id": "46062483",
    "title": "AirDrop support for Pixel 10 likely exists because of the EU ruling",
    "url": "https://9to5google.com/2025/11/21/googles-airdrop-support-for-pixel-10-likely-exists-because-of-the-eus-apple-ruling/",
    "summary": "Google's Pixel 10 has unexpectedly gained cross-platform \"AirDrop support,\" enabling secure file and photo sharing with iPhones via Quick Share. This development isn't a standalone Google initiative but a direct consequence of the European Union's Digital Markets Act (DMA).\n\nThe EU ruling mandated Apple to adopt interoperable wireless standards, specifically the Wi-Fi Alliance’s Wi-Fi Aware standard, for its latest OS upgrades. This replaced Apple's proprietary protocol previously used for Continuity features. Consequently, while Apple didn't directly \"open up\" AirDrop to Android, its compliance with the DMA forced the implementation of a standard that Android devices, starting with the Pixel 10, can now utilize for secure, native-like file transfer.\n\nThis change is akin to the EU's influence on USB-C adoption for iPhones and RCS support. The article notes that this functionality maintains security, provided hardware supports Wi-Fi Aware, and is expected to expand to more Android users. Despite this, Apple reportedly still seeks to have the DMA revoked, leading to a cautionary note that, while unlikely, the future of this feature could potentially be subject to regulatory changes.",
    "chinese_title": "Pixel 10 很可能因欧盟裁决而支持 AirDrop。",
    "chinese_summary": "谷歌Pixel 10意外获得了跨平台“隔空投送支持”，通过“快速分享”（Quick Share）功能，可以与iPhone安全地共享文件和照片。这一进展并非谷歌的独立举措，而是欧盟《数字市场法案》（DMA）的直接结果。\n\n欧盟的裁决强制苹果在其最新的操作系统升级中采用可互操作的无线标准，特别是Wi-Fi联盟的Wi-Fi Aware标准。这取代了苹果此前用于连续互通（Continuity）功能的专有协议。因此，尽管苹果并未直接向安卓设备“开放”隔空投送，但其遵守DMA的举动，迫使其实现了一个标准，而安卓设备（从Pixel 10开始）现在可以利用该标准进行安全、类似原生体验的文件传输。\n\n这一变化类似于欧盟对iPhone采用USB-C接口以及支持RCS信息标准的推动。文章指出，只要硬件支持Wi-Fi Aware，该功能就能保持安全性，并有望扩展到更多安卓用户。尽管如此，据报道苹果仍在寻求撤销DMA，因此文章也谨慎地指出，尽管可能性不大，但这项功能的未来仍可能受制于监管变化。"
  },
  {
    "id": "46075616",
    "title": "Beads – A memory upgrade for your coding agent",
    "url": "https://github.com/steveyegge/beads",
    "summary": "\"Beads\" (bd) is a lightweight, graph-based issue tracker designed as a \"memory upgrade\" for AI coding agents. It aims to solve agents' \"amnesia\" by enabling them to reliably manage complex, long-horizon tasks, maintain organization, and avoid lost work.\n\nVersion 0.20.1 introduces a significant change: hash-based issue IDs (e.g., `bd-a1b2`) replacing sequential numbers. This eliminates merge conflicts and collision issues common in multi-agent or multi-branch workflows, making concurrent development reliable. IDs use progressive length scaling based on the database size.\n\nBeads operates as a distributed database, appearing centralized but functioning through Git. It uses a local SQLite cache for fast operations, with `.beads/beads.jsonl` committed to Git as the source of truth. An auto-sync mechanism keeps local databases synchronized with Git, providing shared state across machines without a server or daemon.\n\nKey features include four types of dependency tracking (blocks, related, parent-child, discovered-from), automatic detection of ready work, agent-friendly JSON output, Git-versioning, an optional real-time \"Agent Mail\" for multi-agent coordination, and a full audit trail.\n\nHumans initiate with `bd init`, but agents primarily file, update, and manage issues, proactively recording discovered problems. Users can monitor progress with commands like `bd list` or `bd ready`. Beads is in active alpha development and is compatible with Linux (glibc 2.32+), macOS, and Windows, with easy installation via `curl`, `npm`, or Homebrew.",
    "chinese_title": "珠子：编程代理的记忆升级",
    "chinese_summary": "Beads (bd) 是一款轻量级、基于图的问题追踪器，被设计为AI编码代理的“内存升级”。它旨在通过使代理能够可靠地管理复杂、长期任务，保持条理并避免工作丢失来解决它们的“健忘症”。\n\n0.20.1版本引入了一项重大变更：基于哈希的问题ID（例如`bd-a1b2`）取代了顺序编号。这消除了多代理或多分支工作流程中常见的合并冲突和碰撞问题，使并行开发变得可靠。ID长度根据数据库大小进行渐进式扩展。\n\nBeads作为一个分布式数据库运行，它看似集中，但通过Git实现其功能。它使用本地SQLite缓存以实现快速操作，并将`.beads/beads.jsonl`提交到Git作为唯一真实来源。自动同步机制使本地数据库与Git保持同步，在没有服务器或守护进程的情况下，跨机器提供共享状态。\n\n主要功能包括四种依赖关系追踪类型（阻塞、关联、父子、发现自）、自动检测准备就绪的工作、代理友好的JSON输出、Git版本控制、用于多代理协作的可选实时“代理邮件”，以及完整的审计追踪。\n\n人类用户通过`bd init`启动，但代理主要负责提交、更新和管理问题，主动记录发现的问题。用户可以使用`bd list`或`bd ready`等命令监控进度。Beads正处于活跃的alpha开发阶段，兼容Linux (glibc 2.32+)、macOS和Windows，可通过`curl`、`npm`或Homebrew轻松安装。"
  },
  {
    "id": "46070151",
    "title": "Protect Public School Students from Surveillance of Off-Campus Speech",
    "url": "https://www.eff.org/deeplinks/2025/11/eff-arizona-federal-court-protect-public-school-students-surveillance-and",
    "summary": "The Electronic Frontier Foundation (EFF) filed an amicus brief in *Merrill v. Marana Unified School District*, advocating for public school students' free speech and privacy rights against constant surveillance. The case concerns a student suspended after Gaggle surveillance software flagged a deleted, off-campus joke he drafted on a school-issued Chromebook before school. The school district argued that using school-issued devices or accounts automatically deems student speech \"on campus,\" justifying disciplinary action.\n\nEFF contended that this interpretation is flawed, citing Supreme Court rulings in *Tinker* (on-campus speech punishable if disruptive) and *Mahanoy* (less school authority over off-campus speech, recognizing students' 24-hour speech). EFF argued the student's joke was off campus, lacked a sufficient nexus to the school, and wasn't a credible threat.\n\nThe brief highlighted the link between digital speech and privacy, asserting that a blanket \"on campus\" rule for school-managed technology would severely harm students. Such a rule would:\n1.  Eliminate any private sphere for students, contrary to *Mahanoy*'s caution against regulating all student speech.\n2.  Induce a chilling effect, leading students to self-censor.\n3.  Exacerbate socio-economic disparities, creating a \"pay for privacy\" system where lower-income students, reliant on school devices, face greater surveillance.\n4.  Incentivize invasive and inaccurate digital surveillance technologies, causing unnecessary investigations and eroding student privacy.\n\nEFF urged the court to reject this expansive view, emphasizing that students need a sphere of digital autonomy for expression, identity development, and learning, free from constant school surveillance and punishment.",
    "chinese_title": "保护公立学校学生免受校外言论监视",
    "chinese_summary": "电子前沿基金会（EFF）在*Merrill 诉 Marana 联合学区*一案中提交了一份法庭之友简报，倡导公立学校学生免受持续监控的言论自由和隐私权。该案件涉及一名学生，他因在校前使用学校发放的Chromebook起草了一则已删除的校外笑话，被Gaggle监控软件标记后遭到停学。学区辩称，使用学校发放的设备或账户自动将学生言论视为“校内”言论，从而为纪律处分提供了正当理由。\n\nEFF认为这种解释存在缺陷，并引用了最高法院的裁决，包括*Tinker*案（校内言论若造成扰乱则可受处罚）和*Mahanoy*案（学校对校外言论的管辖权较弱，承认学生24小时的言论权）。EFF辩称，该学生的笑话发生在校外，与学校没有足够的关联，且不构成可信威胁。\n\n简报强调了数字言论与隐私之间的关联，坚称对学校管理的科技设备实行一概而论的“校内”规则将严重损害学生利益。此类规则将：\n1.  消除学生的任何私人空间，这与*Mahanoy*案中关于不应规制所有学生言论的警告相悖。\n2.  造成寒蝉效应，导致学生进行自我审查。\n3.  加剧社会经济差距，制造一种“为隐私付费”的系统，其中依赖学校设备的低收入学生将面临更严格的监控。\n4.  鼓励侵入性和不准确的数字监控技术发展，导致不必要的调查并侵蚀学生隐私。\n\nEFF敦促法院驳回这种宽泛的观点，强调学生需要一个数字自主空间，用于表达、身份认同发展和学习，从而免受学校持续监控和惩罚。"
  },
  {
    "id": "46062855",
    "title": "Why Strong Consistency?",
    "url": "https://brooker.co.za/blog/2025/11/18/consistency.html",
    "summary": "Marc Brooker's blog post \"Why Strong Consistency?\" argues that eventual consistency, common in scaled database architectures, is a significant source of pain for customers and application builders, and hinders effective scaling.\n\nHe highlights customer pain with an example: creating a resource and immediately trying to retrieve it can fail (\"ID does not exist\") if the read is routed to a lagging replica. This forces developers to implement complex, error-prone workarounds like retry loops, which still might fail if subsequent reads hit different, equally stale replicas (lacking \"monotonic reads\").\n\nFor application builders, eventual consistency complicates common workflows. Operations involving multiple reads and writes (e.g., cleaning up attachments) can lead to bugs like stale data, incomplete operations, or assertion failures because different reads might return inconsistent views of the data. This necessitates routing sensitive reads to the primary, undermining the purpose of read replicas.\n\nFurthermore, eventual consistency makes scaling harder for \"read-modify-write\" workloads. If the read portion of an `UPDATE` statement uses stale data from a replica, the write to the primary might be incorrect. Strong consistency, as implemented in Aurora DSQL, allows any replica to be used for reads, even within read-write transactions, without these issues.\n\nAurora DSQL achieves strong consistency by ensuring all storage replicas process updates from monotonic journals. When a query processor starts a transaction, it picks a timestamp (`τ_start`). Replicas block read requests until they have processed all updates up to that `τ_start`, guaranteeing consistent data.\n\nIn conclusion, while eventual consistency has its place, Brooker contends that strong consistency simplifies development significantly, saving application builders and end-users from dealing with the inherent complexities of distributed systems at scale.",
    "chinese_title": "为什么强一致性？",
    "chinese_summary": "马克·布鲁克的博客文章《为什么是强一致性？》指出，在规模化数据库架构中常见的最终一致性，是给客户和应用程序开发者带来巨大困扰并阻碍有效扩展的一个重要原因。\n\n他通过一个例子强调了客户所面临的困扰：如果读取请求被路由到一个滞后的副本，那么创建资源后立即尝试检索它可能会失败（显示“ID不存在”）。这迫使开发者实施复杂且容易出错的变通方案，例如重试循环；但如果后续读取请求命中不同但同样过时的副本（缺乏“单调读”），这些方案仍然可能失败。\n\n对于应用程序开发者而言，最终一致性使常见工作流变得复杂。涉及多次读写操作（例如，清理附件）可能会导致各种错误，如陈旧数据、不完整操作或断言失败，因为不同的读取请求可能会返回不一致的数据视图。这使得将敏感读取请求路由到主数据库成为必要，从而削弱了只读副本的用途。\n\n此外，最终一致性使得“读-修改-写”工作负载的扩展变得更加困难。如果`UPDATE`语句的读取部分使用了来自副本的陈旧数据，那么对主数据库的写入可能会不正确。而Aurora DSQL中实现的强一致性，则允许任何副本用于读取，即使在读写事务中也能如此，从而避免了这些问题。\n\nAurora DSQL通过确保所有存储副本都从单调日志处理更新来实现强一致性。当查询处理器启动一个事务时，它会选择一个时间戳（`τ_start`）。副本会阻止读取请求，直到它们处理完截至该`τ_start`的所有更新，从而保证数据的一致性。\n\n总之，尽管最终一致性有其适用之处，但布鲁克认为强一致性极大地简化了开发，使应用程序开发者和最终用户免于处理大规模分布式系统固有的复杂性。"
  },
  {
    "id": "46079460",
    "title": "Swedish publishers file police report against Meta's Zuckerberg for fraud",
    "url": "https://www.sverigesradio.se/artikel/swedish-publishers-file-police-report-against-metas-zuckerberg-for-fraud",
    "summary": "A Swedish publisher's association has filed a police report against Meta founder Mark Zuckerberg. The report alleges fraud against Zuckerberg.",
    "chinese_title": "瑞典出版商就诈骗行为向警方报案，控告Meta的扎克伯格。",
    "chinese_summary": "瑞典出版商协会已报警，指控Meta创始人马克·扎克伯格欺诈。"
  },
  {
    "id": "46061714",
    "title": "The most male and female reasons to end up hospital",
    "url": "https://leobenedictus.substack.com/p/the-most-male-and-female-reasons",
    "summary": "This article by Leo Benedictus explores the distinct reasons men and women are admitted to hospitals, drawing on NHS data from 2021-22. It highlights a clear gendered pattern in emergency admissions, excluding those related to pregnancy.\n\nThe most common primary reasons for women's emergency hospital stays are overwhelmingly related to **abdominal and pelvic pain**, **urinary tract infections (UTIs)**, and **nausea/vomiting**. These conditions often involve symptoms that prompt urgent medical attention but typically have a shorter length of stay.\n\nFor men, the leading causes for emergency admission are **chest pain**, **abdominal and pelvic pain**, and **heart failure**. Chest pain, in particular, frequently leads to hospital visits due to concerns about cardiac issues, even if a serious cause isn't always found. Heart failure is also a significant reason for men's admissions.\n\nThe article notes that while both genders share \"abdominal and pelvic pain\" as a top reason, the underlying causes are often different. Overall, it reveals how various biological, social, and behavioral factors contribute to distinct emergency healthcare needs between men and women.",
    "chinese_title": "男女最主要的住院原因",
    "chinese_summary": "Leo Benedictus的这篇文章基于2021-22年度英国国民医疗服务体系（NHS）的数据，探讨了男性与女性住院的截然不同原因。文章强调，在急诊入院（不包括与妊娠相关的入院）中存在明显的性别模式。\n\n女性急诊住院最主要的常见原因绝大多数与**腹部和盆腔疼痛**、**泌尿道感染（UTIs）**以及**恶心/呕吐**有关。这些病症通常伴有需要紧急医疗关注的症状，但住院时间通常较短。\n\n对男性而言，急诊入院的主要原因是**胸痛**、**腹部和盆腔疼痛**以及**心力衰竭**。尤其是胸痛，常因担心心脏问题而导致就医，即使不总是能发现严重的病因。心力衰竭也是男性入院的一个重要原因。\n\n文章指出，尽管“腹部和盆腔疼痛”是男女共有的主要原因，但其根本原因往往不同。总体而言，这揭示了各种生物学、社会和行为因素如何导致男女之间存在不同的紧急医疗保健需求。"
  },
  {
    "id": "46080161",
    "title": "Stellantis Is Spamming Owners' Screens with Pop-Up Ads for New Car Discounts",
    "url": "https://www.thedrive.com/news/stellantis-is-spamming-owners-screens-with-pop-up-ads-for-new-car-discounts",
    "summary": "Stellantis is drawing significant online backlash for pushing pop-up marketing ads, such as a $1,500 loyalty discount, directly to owners' in-car infotainment screens. This practice, confirmed by a Jeep driver and Stellantis, isn't new, as similar ads for extended warranties appeared earlier in the year.\n\nWhile many owners across various Stellantis brands like Jeep, Chrysler, and Ram are decrying the move and threatening to boycott the company, some, like auto writer Zerin Dube, have utilized the offers. Dube, whose viral post about the ad highlighted \"late stage capitalism,\" ultimately took advantage of the discount and secured a new Jeep Wrangler with substantial overall savings, suggesting the strategy \"worked\" for him.\n\nStellantis defends the notifications, stating they aim to \"stay in contact\" with owners at critical points and also serve for recalls. The company clarified that the text messages appear only on startup and while stationary, disappearing after 15 seconds or driver interaction. They reappear only if a \"Remind Me Later\" option is chosen or left unaddressed. Stellantis notes customer uptake of these offers and confirms owners can permanently opt out by calling their customer care line (800-777-3600). The situation raises broader questions about the experience of connected cars, especially given past issues where previous ad campaigns were more intrusive.",
    "chinese_title": "斯泰兰蒂斯正向车主车载屏幕滥发新车优惠弹窗广告。",
    "chinese_summary": "斯泰兰蒂斯（Stellantis）因直接向车主车载信息娱乐屏幕推送弹窗营销广告（例如1500美元的忠诚度折扣）而招致了大量的网络批评。经一名Jeep司机和斯泰兰蒂斯证实，这一做法并非新鲜事，今年早些时候也曾出现过类似的延长保修广告。\n\n尽管斯泰兰蒂斯旗下多个品牌（如Jeep、克莱斯勒和Ram）的许多车主正在谴责这一举动并威胁抵制该公司，但也有一些人，如汽车作家Zerin Dube，却利用了这些优惠。Dube在关于该广告的病毒式帖子中强调了“晚期资本主义”，但他最终利用了这一折扣，以大幅度的总节省购买了一辆新的Jeep牧马人，这表明该策略对他而言“奏效了”。\n\n斯泰兰蒂斯为这些通知辩护，称其旨在关键时刻与车主“保持联系”，并且也用于召回目的。该公司澄清说，这些文本信息只在启动时和车辆静止时显示，并在15秒后或驾驶员互动后消失。它们仅在选择“稍后提醒我”选项或未处理时才会重新出现。斯泰兰蒂斯指出客户对这些优惠的接受度，并确认车主可以通过拨打其客户服务热线（800-777-3600）永久选择退出。这种情况引发了关于互联汽车用户体验的更广泛疑问，尤其考虑到过去的问题，即之前的广告活动更具侵扰性。"
  },
  {
    "id": "46069598",
    "title": "Show HN: SyncKit – Offline-first sync engine (Rust/WASM and TypeScript)",
    "url": "https://github.com/Dancode-188/synckit",
    "summary": "SyncKit is a production-ready, offline-first sync engine built with Rust/WASM and TypeScript, simplifying the creation of local-first applications. It addresses the complexity, cost, and offline limitations of existing solutions like Yjs, Firebase, or Supabase by offering automatic, real-time sync with built-in conflict resolution (Last-Write-Wins) in just a few lines of code.\n\nKey features (v0.1.0) include true offline-first architecture, real-time collaboration, IndexedDB persistence, and cross-tab synchronization. SyncKit offers a compact bundle size (~59KB gzipped, ~45KB lite variant), fast local operations (<1ms), and low sync latency (<100ms). It's open source, self-hostable, ensures data sovereignty, and guarantees data integrity through formal verification and extensive testing.\n\nComparatively, SyncKit provides superior native offline capabilities to Firebase and Supabase, offers WASM-based multi-language server support (unlike Yjs), and boasts a smaller bundle, faster performance, and production readiness over Automerge.\n\nUpcoming v0.2.0 features include Text CRDTs for collaborative editing, Counters, Sets, and more framework adapters (Vue, Svelte) and multi-language server implementations. Installation is simple via npm, with intuitive React hooks available. SyncKit positions itself as a robust, performant, and flexible choice for modern applications demanding true offline functionality and seamless collaboration.",
    "chinese_title": "Show HN: SyncKit — 离线优先同步引擎 (Rust/WASM 和 TypeScript)",
    "chinese_summary": "SyncKit 是一个生产就绪的离线优先同步引擎，基于 Rust/WASM 和 TypeScript 构建，旨在简化本地优先应用程序的创建。它通过仅需几行代码提供自动、实时同步和内置冲突解决（最后写入获胜），解决了现有解决方案（如 Yjs、Firebase 或 Supabase）的复杂性、成本和离线限制。\n\nv0.1.0 的主要特性包括真正的离线优先架构、实时协作、IndexedDB 持久化和跨标签页同步。SyncKit 提供了紧凑的打包大小（gzip 压缩后约 59KB，精简版约 45KB）、快速本地操作（<1 毫秒）和低同步延迟（<100 毫秒）。它是开源的，可自行托管，确保数据主权，并通过形式验证和广泛测试保证数据完整性。\n\n相比之下，SyncKit 提供了优于 Firebase 和 Supabase 的原生离线能力，提供基于 WASM 的多语言服务器支持（与 Yjs 不同），并在打包大小、性能和生产就绪方面优于 Automerge。\n\n即将推出的 v0.2.0 特性包括用于协同编辑的文本 CRDTs、计数器、集合、更多框架适配器（Vue、Svelte）和多语言服务器实现。通过 npm 即可简单安装，并提供直观的 React Hooks。SyncKit 将自身定位为一个强大、高性能、灵活的选择，适用于要求真正离线功能和无缝协作的现代应用程序。"
  },
  {
    "id": "46077885",
    "title": "Switzerland: Data Protection Officers Impose Broad Cloud Ban for Authorities",
    "url": "https://www.heise.de/en/news/Switzerland-Data-Protection-Officers-Impose-Broad-Cloud-Ban-for-Authorities-11093477.html",
    "summary": "Swiss data protection authorities, led by the Federal Data Protection and Information Commissioner (FDPIC) and various cantonal/communal bodies, have issued stringent recommendations effectively banning public authorities from utilizing cloud services. This prohibition particularly targets providers subject to foreign laws, such as the US CLOUD Act.\n\nThe core concern is the inability to guarantee sufficient data protection when foreign authorities can potentially access data without the knowledge or consent of the data owner. The authorities state that current contractual clauses and technical safeguards are inadequate to mitigate these risks. They advise public authorities to exclusively use cloud services from providers operating demonstrably under Swiss law, with all data processing and storage occurring entirely within Switzerland. Even with Swiss providers, thorough scrutiny is required to ensure genuine independence from foreign control.\n\nExisting cloud deployments by public authorities must be reviewed and, if non-compliant, adjusted or terminated. While extremely limited exceptions might be possible if data processing is fully transparent, controllable, and data subjects provide explicit, informed consent, this is generally impractical for most government data. This move underscores Switzerland's commitment to data sovereignty, echoing similar concerns previously raised in the EU.",
    "chinese_title": "瑞士：数据保护官对当局颁布广泛云禁令",
    "chinese_summary": "瑞士数据保护机构，由联邦数据保护和信息专员（FDPIC）以及各州/市机构牵头，发布了严格的建议，有效禁止公共机构使用云服务。这项禁令尤其针对受外国法律（例如美国《云法案》）约束的服务提供商。\n\n核心顾虑在于，当外国当局可能在数据所有者不知情或未经同意的情况下访问数据时，无法保证充分的数据保护。当局声明，目前的合同条款和技术保障措施不足以降低这些风险。他们建议公共机构只使用明确受瑞士法律管辖的云服务提供商，且所有数据处理和存储都必须完全在瑞士境内进行。即使是瑞士提供商，也需要进行彻底审查，以确保其真正独立于外国控制。\n\n公共机构现有的云部署必须接受审查，如果发现不合规，则必须进行调整或终止。尽管在数据处理完全透明、可控且数据主体提供明确知情同意的情况下，极少数例外情况可能存在，但这对于大多数政府数据而言通常是不切实际的。此举凸显了瑞士对数据主权的承诺，也呼应了欧盟此前提出的类似担忧。"
  },
  {
    "id": "46077106",
    "title": "A Repository with 44 Years of Unix Evolution",
    "url": "https://www.spinellis.gr/pubs/conf/2015-MSR-Unix-History/html/Spi15c.html",
    "summary": "This paper introduces a Git repository that chronicles 44 years of Unix operating system evolution, from its 1972 inception as a 5,000-line kernel to a 26-million-line system in 2015. Awarded the Best Data Showcase at MSR '15, this repository on GitHub contains 659,000 commits and 2,306 merges, identifying 850 contributors.\n\nThe project aims to provide a unified, modern version-control system for empirical research in software engineering and archaeology. It synthesizes data from 24 historical snapshots (Bell Labs, Berkeley, 386BSD), two legacy repositories (CSRG SCCS, FreeBSD 1 CVS), and the modern FreeBSD Git repository. Authorship for early contributions was meticulously determined through primary research, including historical documents and communication with original developers.\n\nThe repository's construction enables precise code provenance tracing using `git blame`, revealing code lines from as early as 1974 still present in modern Unix. Snapshots are imported sequentially, with files from preceding versions temporarily moved to a hidden directory to maintain historical continuity for `git blame`. This comprehensive digital artifact offers an invaluable resource for studying the long-term development of a foundational software system.",
    "chinese_title": "承载 44 年 Unix 演进的存储库",
    "chinese_summary": "本文介绍了一个Git仓库，它记录了Unix操作系统44年的演进历程，从1972年最初5,000行代码的内核，到2015年2,600万行代码的系统。这个在MSR '15大会上荣获“最佳数据展示”奖的GitHub仓库，包含了659,000次提交和2,306次合并，并识别出850名贡献者。\n\n该项目旨在为软件工程和软件考古学的实证研究提供一个统一的、现代的版本控制系统。它整合了来自24个历史快照（贝尔实验室、伯克利、386BSD）、两个旧版仓库（CSRG SCCS、FreeBSD 1 CVS）以及现代FreeBSD Git仓库的数据。早期贡献的作者身份通过细致的一手研究得以确定，这些研究包括查阅历史文献和与原始开发者进行沟通。\n\n该仓库的构建使得使用`git blame`命令进行精确的代码来源追溯成为可能，揭示了早至1974年的代码行至今仍存在于现代Unix中。快照是按顺序导入的，之前的版本中的文件会被临时移动到一个隐藏目录，以保持`git blame`的历史连续性。这一全面的数字资料为研究一个基础软件系统的长期发展提供了宝贵的资源。"
  },
  {
    "id": "46071848",
    "title": "Cherry gives up German production and wants to sell core division",
    "url": "https://www.heise.de/en/news/Cherry-gives-up-German-production-and-wants-to-sell-core-division-11092713.html",
    "summary": "Cherry, the German manufacturer known for its mechanical keyboard switches, is undergoing significant restructuring. The company has announced the sale of its \"Switches\" business unit, which encompasses the production of its core MX switches and other keyboard switches, as well as the accompanying production facility in Auerbach, Germany. This move is driven by a focus on profitability and a strategic shift towards its \"Peripherals\" business segment, which includes ready-made keyboards, mice, and other input devices.\n\nThe Switches division, despite being Cherry's historical backbone, had been struggling with profitability due to high labor costs and increasing automation in its German plant. While the division has shown a recent uptick in sales, Cherry's management believes that separating it will allow for more focused growth and investment, potentially under new ownership that can better address its specific challenges.\n\nThe sale process is already underway, with interested parties being evaluated. Cherry aims to complete the transaction by mid-2024. Following the sale, Cherry will concentrate solely on its Peripherals division, aiming to leverage its brand recognition in this growing market. This strategic realignment marks a significant turning point for the company, effectively ending its German production of the iconic MX switches.",
    "chinese_title": "樱桃放弃德国生产并打算出售核心部门。",
    "chinese_summary": "樱桃（Cherry），这家以机械键盘轴闻名的德国制造商，正在经历重大重组。该公司已宣布出售其“轴体”业务部门，该部门涵盖其核心MX轴体及其他键盘轴体的生产，以及位于德国奥尔巴赫的配套生产设施。此举旨在专注于盈利能力，并战略性地转向其“外设”业务部门，该部门包括成品键盘、鼠标及其他输入设备。\n\n尽管轴体部门是Cherry的历史支柱，但由于高昂的人力成本及其德国工厂日益增长的自动化，该部门在盈利方面一直举步维艰。尽管该部门近期销售额有所回升，但Cherry管理层认为，将其剥离将有助于实现更专注的增长和投资，可能在新所有权下，新所有者能更好地应对其特有挑战。\n\n出售流程已在进行中，目前正在评估意向方。Cherry目标是在2024年中期之前完成此交易。出售完成后，Cherry将只专注于其外设部门，旨在利用其品牌知名度在这个不断增长的市场中。此次战略调整标志着该公司的一个重要转折点，有效终止了其在德国生产标志性MX轴体的历史。"
  },
  {
    "id": "46062198",
    "title": "Why 90s Movies Feel More Alive Than Anything on Netflix",
    "url": "https://afranca.com.br/why-90s-movies-feel-more-alive-than-anything-on-netflix",
    "summary": "The article argues that 90s movies possess a quality of being more \"alive\" and impactful than much of today's cinema, particularly streaming content. Citing films like *The Silence of the Lambs*, *Goodfellas*, and *Pulp Fiction*, the author contends that older films were crafted with greater purpose, deeper character development, and a willingness to take risks.\n\n*Goodfellas* is praised for its immersive storytelling and purposeful scenes, in contrast to the perceived \"bloated\" nature of some modern films. *Pulp Fiction*'s innovative narrative structure and authentic dialogue are highlighted against the \"trying too hard\" cleverness of contemporary movies. *The Silence of the Lambs* exemplifies psychological depth and compelling character interaction, which the author finds lacking in modern thrillers.\n\nThe core difference, according to the writer, is that older films trusted their audiences and granted directors artistic freedom, allowing them to create \"films, not products.\" In contrast, modern cinema often feels \"designed by committee,\" optimized for algorithms and quick consumption rather than lasting impact. Despite technological advancements, the author concludes that today's films merely occupy time, quickly forgotten, unlike the enduring resonance of 90s classics.",
    "chinese_title": "为什么90年代电影比Netflix上的一切都更生动？",
    "chinese_summary": "文章认为，90年代的电影比当今许多电影，特别是流媒体内容，更“鲜活”且更具影响力。作者以《沉默的羔羊》、《好家伙》和《低俗小说》等电影为例，认为早期的电影在创作上更有目的性，角色塑造更深入，并且更敢于冒险。\n\n《好家伙》因其沉浸式的叙事和有目的性的场景而备受赞誉，这与一些现代电影被认为的“臃肿”形成了对比。《低俗小说》创新的叙事结构和真实的对话被突出强调，这与当代电影“用力过猛”的自作聪明形成了反差。《沉默的羔羊》展现了心理深度和引人入胜的角色互动，而作者认为现代惊悚片缺乏这些。\n\n作者认为，核心区别在于，早期电影信任观众，并赋予导演艺术自由，让他们能够创作“电影，而非产品”。相比之下，现代电影常常感觉是“委员会设计”的，为算法和快速消费而优化，而非追求持久的影响力。作者总结道，尽管技术进步，但当今电影不过是消磨时间，很快被遗忘，这与90年代经典电影的持久共鸣截然不同。"
  },
  {
    "id": "46075178",
    "title": "The VPN panic is only getting started",
    "url": "https://www.theverge.com/tech/827435/uk-vpn-restrictions-ban-online-safety-act",
    "summary": "The UK's Online Safety Act (OSA), implemented in July 2023, requires strict age verification for access to \"harmful materials\" online, including pornography and content promoting self-harm. However, users quickly discovered that Virtual Private Networks (VPNs) effectively bypass these checks by spoofing IP addresses from other countries. This led to a significant surge in VPN usage in the UK, with some providers reporting up to an 1,800% increase in sign-ups.\n\nThis circumvention has prompted calls for action. Children's Commissioner Rachel de Souza labeled VPN access a \"loophole that needs closing,\" suggesting VPNs should be subject to the same age assurance they are used to avoid. Ofcom, the UK's media regulator, is \"monitoring VPN use,\" though denies tracking individuals.\n\nDespite the government's current stance that \"there are no current plans to ban the use of VPNs\" due to their legitimate uses (e.g., business security, journalistic privacy), they've also stated \"nothing is off the table.\" Experts widely agree that a full ban would be technically complex and largely ineffective.\n\nAlternative solutions include requiring OSA-covered websites to block VPN traffic, which could force sites to abandon the UK market or all VPN users globally. The likeliest outcome is age-restricting VPNs themselves. However, this carries risks, potentially driving users towards less reputable free VPNs with poor privacy practices or riskier direct file-sharing.\n\nThe article concludes that as other countries and US states follow the UK's lead in implementing online age restrictions, the \"VPN panic\" and the debate over regulating their use are only just beginning worldwide.",
    "chinese_title": "VPN恐慌才刚刚开始",
    "chinese_summary": "英国于2023年7月实施的《网络安全法》(OSA)要求对访问在线“有害材料”（包括色情内容和宣扬自残的内容）进行严格的年龄验证。然而，用户很快发现，虚拟私人网络（VPN）通过伪造来自其他国家的IP地址，有效地规避了这些检查。这导致英国VPN使用量大幅增长，一些供应商报告称注册量增长高达1800%。\n\n这种规避行为引发了采取行动的呼吁。儿童事务专员雷切尔·德·苏萨 (Rachel de Souza) 将VPN访问称为“需要堵塞的漏洞”，建议VPN本身应接受与它们试图规避的相同年龄验证。英国媒体监管机构Ofcom正在“监测VPN的使用”，但否认追踪个人。\n\n尽管政府目前的立场是“目前没有计划禁止使用VPN”，因为其有合法用途（例如商业安全、新闻记者隐私），但他们也表示“一切皆有可能”。专家们普遍认为，全面禁止将是技术上复杂且在很大程度上无效的。\n\n替代解决方案包括要求受OSA覆盖的网站屏蔽VPN流量，这可能迫使网站放弃英国市场或全球所有VPN用户。最可能的结果是对VPN本身进行年龄限制。然而，这伴随着风险，可能将用户推向声誉不佳、隐私保护差的免费VPN，或风险更高的直接文件共享。\n\n文章总结道，随着其他国家和美国各州效仿英国实施在线年龄限制，“VPN恐慌”以及关于其使用监管的辩论才刚刚在全球范围内开始。"
  },
  {
    "id": "46080364",
    "title": "So you wanna build a local RAG?",
    "url": "https://blog.yakkomajuri.com/blog/local-rag",
    "summary": "The article details Skald's journey to build a fully local and privacy-preserving RAG (Retrieval Augmented Generation) setup, eliminating reliance on third-party cloud services. The motivation stems from a need for self-hostable AI tools without external data sharing, especially for privacy-sensitive organizations.\n\nA standard RAG system comprises a vector database, embedding model, LLM, reranker, and document parser. For a local setup, proprietary cloud services must be replaced with open-source or self-hosted alternatives. Skald's chosen local stack includes:\n*   **Vector DB:** Postgres with pgvector\n*   **Vector Embeddings:** Sentence Transformers (all-MiniLM-L6-v2) and bge-m3\n*   **LLM:** User-managed (tested with GPT-OSS 20B via llama.cpp)\n*   **Reranker:** Sentence Transformers cross-encoder and mmarco-mMiniLMv2-L12-H384-v1\n*   **Document Parsing:** Docling\n\nBenchmarking was conducted using PostHog website data and a custom question dataset.\n1.  **Cloud Baseline (Voyage + Claude):** Achieved an average score of 9.45, with all answers correct.\n2.  **Hybrid (Voyage + GPT-OSS 20B):** Scored 9.18, demonstrating strong performance from the open-source LLM.\n3.  **Fully Local (Default Sentence Transformers + GPT-OSS 20B):** Scored 7.10. While good for English point queries, it struggled with multi-language questions, ambiguity, and aggregating information from multiple documents.\n4.  **Fully Local (Multi-lingual bge-m3/mmarco + GPT-OSS 20B):** Improved to 8.63, handling multi-lingual queries well but still facing challenges with complex information aggregation.\n\nThe author concludes that fully local RAG is viable, performs well for many use cases, and is continually improving with better open-source models. Future work will focus on optimizing aggregation for complex queries and publishing more comprehensive benchmarks.",
    "chinese_title": "想搭建本地RAG吗？",
    "chinese_summary": "本文详细介绍了Skald如何构建一个完全本地化、隐私保护的RAG（检索增强生成）系统，从而消除对第三方云服务的依赖。其动机源于对无需外部数据共享的可自托管AI工具的需求，特别是对于对隐私敏感的组织而言。\n\n一个标准的RAG系统由向量数据库、嵌入模型、大语言模型（LLM）、重排序器和文档解析器组成。对于本地化部署，专有的云服务必须替换为开源或自托管的替代方案。Skald选择的本地技术栈包括：\n*   **向量数据库：** 带有pgvector的Postgres\n*   **向量嵌入：** Sentence Transformers (all-MiniLM-L6-v2) 和 bge-m3\n*   **大语言模型：** 用户自行管理（通过llama.cpp测试了GPT-OSS 20B）\n*   **重排序器：** Sentence Transformers交叉编码器 和 mmarco-mMiniLMv2-L12-H384-v1\n*   **文档解析：** Docling\n\n基准测试使用PostHog网站数据和自定义问题数据集进行。\n1.  **云端基线（Voyage + Claude）：** 平均得分9.45，所有答案均正确。\n2.  **混合方案（Voyage + GPT-OSS 20B）：** 得分9.18，显示了开源大语言模型的强大性能。\n3.  **全本地化方案（默认Sentence Transformers + GPT-OSS 20B）：** 得分7.10。虽然对英语点式查询表现良好，但在处理多语言问题、歧义以及聚合来自多个文档的信息方面表现不佳。\n4.  **全本地化方案（多语言bge-m3/mmarco + GPT-OSS 20B）：** 提升至8.63分，能很好地处理多语言查询，但仍面临复杂信息聚合的挑战。\n\n作者总结道，全本地化RAG是可行的，在许多用例中表现良好，并且随着更好的开源模型不断改进。未来的工作将侧重于优化复杂查询的聚合能力，并发布更全面的基准测试。"
  },
  {
    "id": "46065585",
    "title": "What to know about a recent Mixpanel security incident",
    "url": "https://openai.com/index/mixpanel-incident",
    "summary": "Unable to access the article link.",
    "chinese_title": "Mixpanel近期安全事件须知",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46081188",
    "title": "Imgur Geo-Blocked the UK, So I Geo-Unblocked My Network",
    "url": "https://blog.tymscar.com/posts/imgurukproxy/",
    "summary": "The article describes how the author bypassed Imgur's geo-block in the UK by implementing a transparent, network-wide proxy solution. While not a frequent Imgur user, constantly encountering broken image links (e.g., for Minecraft shaders) became annoying. The author rejected using a personal VPN due to potential speed reductions on their 2.5 Gbps internet and the inconvenience of installing and managing VPN clients on every device (phone, laptop, desktop).\n\nInstead, a network-level solution was built using existing homelab components: Pi-hole for DNS, Traefik as a reverse proxy, and NixOS for declarative configuration. The process works as follows:\n1.  Any device on the network requests `i.imgur.com`.\n2.  Pi-hole intercepts this DNS request and returns the local Traefik instance's IP.\n3.  Traefik, configured for TCP passthrough, inspects the SNI (Server Name Indication) and routes the connection to a `gluetun` Docker container.\n4.  `Gluetun` establishes a WireGuard VPN connection to a non-UK server.\n5.  An `nginx` container, configured to share `gluetun`'s network stack, acts as a simple TCP passthrough proxy, forwarding the request through the VPN to `i.imgur.com`.\n6.  The image is then returned through the VPN tunnel to the original device.\n\nNginx is used within `gluetun`'s network because `gluetun` provides VPN connectivity, not proxying. The entire Docker setup is declaratively managed by NixOS, with sensitive VPN credentials secured using Agenix.\n\nThis setup provides a seamless, network-wide solution for all devices without any client-side configuration. Imgur access is restored with negligible latency increase only for affected traffic, satisfying both practical needs and the \"homelab itch.\"",
    "chinese_title": "Imgur 对英国实施地域限制，我则突破了网络的地域限制",
    "chinese_summary": "本文介绍了作者如何通过部署一个透明的、网络范围的代理解决方案，绕过Imgur在英国的地理限制。尽管作者不常用Imgur，但不断遇到损坏的图片链接（例如Minecraft着色器）变得很烦人。作者排除了使用个人VPN的方案，因为这可能会降低其2.5 Gbps互联网的速度，并且在每台设备（手机、笔记本电脑、台式机）上安装和管理VPN客户端也很不方便。\n\n相反，作者利用现有的家庭实验室组件构建了一个网络层面的解决方案：使用Pi-hole进行DNS解析，Traefik作为反向代理，以及NixOS进行声明式配置。该过程如下：\n1. 网络上的任何设备请求 `i.imgur.com`。\n2. Pi-hole拦截此DNS请求并返回本地Traefik实例的IP地址。\n3. Traefik配置为TCP直通模式，检查SNI（服务器名称指示），并将连接路由到 `gluetun` Docker容器。\n4. `Gluetun` 建立与非英国服务器的WireGuard VPN连接。\n5. 一个 `nginx` 容器，配置为共享 `gluetun` 的网络栈，充当简单的TCP直通代理，通过VPN将请求转发到 `i.imgur.com`。\n6. 图像随后通过VPN隧道返回到原始设备。\n\nNginx在 `gluetun` 的网络中使用，因为 `gluetun` 提供的是VPN连接性，而非代理功能。整个Docker设置由NixOS声明式管理，敏感的VPN凭据通过Agenix保护。\n\n这种设置提供了一个无缝的、网络范围的解决方案，适用于所有设备，无需任何客户端配置。Imgur访问得以恢复，且仅对受影响的流量产生可忽略不计的延迟增加，这既满足了实际需求，也满足了“家庭实验室折腾欲”。"
  },
  {
    "id": "46075746",
    "title": "How to use Linux vsock for fast VM communication",
    "url": "https://popovicu.com/posts/how-to-use-linux-vsock-for-fast-vm-communication/",
    "summary": "This article demonstrates how to use Linux `vsock` for efficient communication between a virtual machine (VM) and its host, specifically leveraging it as a transport for gRPC services. `Vsock` is a VM-specific technology that eliminates the need for a traditional TCP/IP stack or network virtualization, behaving like a standard socket but with a specialized addressing scheme.\n\nThe author's motivation is to enable fast RPC communication for hermetic VM environments. The experiment showcases a simple gRPC \"Addition\" service implemented in C++ and built with Bazel.\n\n**Key Steps:**\n1.  **gRPC Service Definition**: A `proto` file defines a `VsockService` with an `Addition` RPC, taking two integers and returning their sum.\n2.  **Server Implementation**: A statically linked C++ server binary is designed to run inside the VM. It listens on `vsock:3:9999`, where `3` is the VM's Context ID (CID) and `9999` is the port. CID -1 (VMADDR_CID_ANY) allows connections from any CID.\n3.  **Client Implementation**: A statically linked C++ client binary runs on the host. It connects to the VM server at `vsock:3:9999`.\n4.  **VM Setup**: A Debian VM image is created using `debootstrap`. The pre-built server binary is placed in `/opt` and executed as the `init` process upon boot.\n5.  **QEMU Configuration**: The VM is launched with QEMU, attaching a `vhost-vsock-pci` device with `guest-cid=3` to enable vsock functionality.\n6.  **Execution**: The client on the host successfully invokes the `Addition` RPC on the VM server, demonstrating host-to-VM communication without network virtualization.\n\nThe article concludes that using gRPC over `vsock` offers a powerful way to build isolated applications, combine different operating systems, and achieve efficient inter-VM/host communication, benefitting from gRPC's language independence and `vsock`'s native efficiency.",
    "chinese_title": "如何使用 Linux vsock 实现高速虚拟机通信",
    "chinese_summary": "本文演示了如何使用 Linux `vsock` 实现虚拟机 (VM) 及其宿主机之间的高效通信，特别是将其用作 gRPC 服务的传输方式。`Vsock` 是一种虚拟机专用技术，无需传统的 TCP/IP 协议栈或网络虚拟化，其行为类似于标准套接字，但采用专用的寻址方案。\n\n作者的动机是为密封的 VM 环境实现快速 RPC 通信。该实验展示了一个使用 C++ 实现并用 Bazel 构建的简单 gRPC“加法”服务。\n\n**关键步骤**：\n1.  **gRPC 服务定义**：一个 `proto` 文件定义了一个包含 `Addition` RPC 的 `VsockService`，该 RPC 接受两个整数并返回它们的和。\n2.  **服务器实现**：一个静态链接的 C++ 服务器二进制文件设计用于在 VM 内部运行。它监听 `vsock:3:9999`，其中 `3` 是 VM 的上下文 ID (CID)，`9999` 是端口。CID -1 (VMADDR_CID_ANY) 允许来自任何 CID 的连接。\n3.  **客户端实现**：一个静态链接的 C++ 客户端二进制文件在宿主机上运行。它连接到 `vsock:3:9999` 上的 VM 服务器。\n4.  **VM 设置**：使用 `debootstrap` 创建一个 Debian VM 镜像。预构建的服务器二进制文件放置在 `/opt` 中，并在启动时作为 `init` 进程执行。\n5.  **QEMU 配置**：使用 QEMU 启动 VM，并附加一个 `guest-cid=3` 的 `vhost-vsock-pci` 设备以启用 vsock 功能。\n6.  **执行**：宿主机上的客户端成功调用了 VM 服务器上的 `Addition` RPC，展示了无需网络虚拟化的宿主机到 VM 通信。\n\n文章总结道，通过 `vsock` 使用 gRPC 提供了一种强大的方式来构建隔离应用程序、结合不同的操作系统，并实现高效的 VM/宿主机间通信，得益于 gRPC 的语言独立性和 `vsock` 的原生效率。"
  },
  {
    "id": "46068716",
    "title": "AGI is not possible even in 10 years",
    "url": "https://medium.com/@anwarzaid76/agi-is-not-possible-even-in-10-years-013a1aec0d9c",
    "summary": "Unable to access the article link.",
    "chinese_title": "通用人工智能十年内也不可能实现。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46077136",
    "title": "The Math of Why You Can't Focus at Work",
    "url": "https://justoffbyone.com/posts/math-of-why-you-cant-focus-at-work/",
    "summary": "This article mathematically models why focus is dwindling at work, attributing it to increased digital interruptions. It introduces three core parameters:\n1.  **λ (lambda): Interruption Rate** (interruptions per hour). This reflects how often one is sidetracked by messages, meetings, or quick questions.\n2.  **Δ (delta): Recovery Period** (minutes to regain focus). After each interruption, the brain needs time to reload context, which is never zero and can be substantial.\n3.  **θ (theta): Focus Threshold** (minimum uninterrupted time for meaningful work). This is the smallest block of time considered productive; fragmented time below this threshold yields little to no real output.\n\nUsing these, the article defines \"capacity\" as the sum of meaningful work units achieved, demonstrating that even a good amount of total focus time can result in low capacity if blocks are too short due to the unforgiving \"floor function\" of the model. Simulations over 100 days illustrate how varying these parameters dramatically impacts overall productivity. Research data confirms high real-world interruption rates (as frequent as every 2-3 minutes) and significant recovery times (10-16 minutes), highlighting the severe challenge to deep work in modern workplaces.",
    "chinese_title": "你为何在工作时无法专注的数学",
    "chinese_summary": "本文通过数学建模解释了工作注意力下降的原因，并将其归因于数字化干扰的增加。文章引入了三个核心参数：\n1.  **λ (lambda)：中断率**（每小时中断次数）。这反映了人们因消息、会议或快速提问而分心的频率。\n2.  **Δ (delta)：恢复期**（恢复专注所需分钟数）。每次中断后，大脑需要时间重新加载上下文，这并非为零，而且可能相当长。\n3.  **θ (theta)：专注阈值**（进行有意义工作所需的最小不间断时间）。这是被认为高效的最小时间块；低于此阈值的碎片时间几乎无法产生实际产出。\n\n基于这些参数，文章将“产能”定义为所完成的有意义工作单元的总和，并论证了即使总专注时间很长，但由于模型中“无情”的向下取整函数（地板函数），如果时间块过短，也会导致产能低下。通过100天的模拟，文章阐明了这些参数的变化如何显著影响整体生产力。研究数据证实了现实世界中高中断率（高达每2-3分钟一次）以及漫长的恢复时间（10-16分钟），凸显了现代工作场所中深度工作面临的严峻挑战。"
  },
  {
    "id": "46068847",
    "title": "Show HN: MkSlides – Markdown to slides with a similar workflow to MkDocs",
    "url": "https://github.com/MartenBE/mkslides",
    "summary": "MkSlides is a static site generator designed to transform Markdown files into engaging slideshows powered by Reveal.js, emulating the workflow of MkDocs. It enables users to convert single Markdown files or entire folders into static HTML slideshows, including an optional index landing page for collections.\n\nKey features include easy deployment to any static file server (local, web server, CI/CD), a live preview mode during editing, and extensive customization. Users can apply existing Reveal.js and Highlight.js themes, define custom CSS, favicons, and templates, and benefit from emoji support. Examples highlight advanced capabilities like Mermaid.js and PlantUML integration.\n\nInstallation is straightforward with `pip install mkslides`. To generate static output, use `mkslides build [PATH]`, where `PATH` can be a directory (defaulting to `slides/` or `docs/`) or a single Markdown file. For live development, `mkslides serve [PATH]` provides real-time updates. When using a single Markdown file, be aware that only default static assets are copied; for images and other files, a folder structure is recommended.\n\nConfiguration is handled via a `mkslides.yml` file, allowing detailed control over the index page and individual slides, including themes, titles, `revealjs` options, and plugin integration. Crucially, settings defined within a Markdown file's frontmatter override those in `mkslides.yml`, which in turn override default settings, providing flexible customization.",
    "chinese_title": "Show HN: MkSlides——Markdown 转幻灯片，工作流与 MkDocs 类似",
    "chinese_summary": "MkSlides 是一个静态网站生成器，旨在将 Markdown 文件转换为由 Reveal.js 驱动的引人入胜的幻灯片，效仿 MkDocs 的工作流程。它使用户能够将单个 Markdown 文件或整个文件夹转换为静态 HTML 幻灯片，包括一个可选的集合索引着陆页。\n\n主要功能包括轻松部署到任何静态文件服务器（本地、网络服务器、CI/CD）、编辑时的实时预览模式以及广泛的自定义功能。用户可以应用现有的 Reveal.js 和 Highlight.js 主题，定义自定义 CSS、网站图标和模板，并受益于表情符号支持。示例还突出显示了 Mermaid.js 和 PlantUML 集成等高级功能。\n\n安装非常简单，只需运行 `pip install mkslides`。要生成静态输出，请使用 `mkslides build [PATH]`，其中 `PATH` 可以是目录（默认为 `slides/` 或 `docs/`）或单个 Markdown 文件。对于实时开发，`mkslides serve [PATH]` 提供实时更新。使用单个 Markdown 文件时，请注意只会复制默认的静态资源；对于图片和其他文件，建议采用文件夹结构。\n\n配置通过 `mkslides.yml` 文件进行处理，允许对索引页和单个幻灯片进行详细控制，包括主题、标题、`revealjs` 选项和插件集成。至关重要的是，Markdown 文件前置元数据中定义的设置会覆盖 `mkslides.yml` 中的设置，而 `mkslides.yml` 中的设置又会覆盖默认设置，从而提供灵活的自定义功能。"
  },
  {
    "id": "46060935",
    "title": "China Has Three Reusable Rockets Ready for Their Debut Flights",
    "url": "https://www.china-in-space.com/p/china-has-three-reusable-rockets",
    "summary": "China is preparing for the debut flights of three partially reusable rockets before the end of the year, with all three vehicles currently at the Jiuquan Satellite Launch Center. These include the Long March 12A from the state-owned Shanghai Academy of Spaceflight Technology, LandSpace's Zhuque-3, and Space Pioneer's Tianlong-3.\n\nThe Long March 12A and Zhuque-3 both utilize liquid methane and liquid oxygen propellants, with first stages designed for propulsive landings guided by grid fins. The Long March 12A targets a 12,000 kg LEO payload, while the Zhuque-3 aims for 11,800 kg. LandSpace's Zhuque-3 has had a highly successful test campaign, including a 10-kilometer hop test, positioning it as a leading contender for China's first reusable rocket flight.\n\nSpace Pioneer's Tianlong-3, a kerosene/liquid oxygen rocket, offers the largest payload capacity at 17,000 kg to LEO and also plans first-stage landings, though reuse hardware is not yet installed on its debut vehicle.\n\nOne of these rockets will achieve China's first reusable rocket landing, marking it as the third globally and the first outside the United States. LandSpace's Zhuque-3 is reportedly eyeing a late November debut. These reusable rockets are crucial for China's ambitious mega-constellation deployments, promising cheaper and more frequent launch missions.",
    "chinese_title": "中国三枚可重复使用火箭已整装待发，将进行首飞。",
    "chinese_summary": "中国正准备在年底前进行三枚部分可重复使用火箭的首飞，这三枚火箭目前均已抵达酒泉卫星发射中心。它们包括国有上海航天技术研究院的长征十二号A、蓝箭航天的朱雀三号和空间先锋的天龙三号。\n\n长征十二号A和朱雀三号均采用液态甲烷和液氧推进剂，其一级火箭设计通过栅格舵引导进行动力着陆。长征十二号A的目标近地轨道载荷量为12,000公斤，而朱雀三号的目标载荷量为11,800公斤。蓝箭航天的朱雀三号已完成了非常成功的测试活动，包括10公里跳跃测试，使其成为中国首次可重复使用火箭飞行的主要竞争者。\n\n空间先锋的天龙三号是一枚液氧煤油火箭，提供最大的17,000公斤近地轨道载荷能力，也计划进行一级火箭着陆，尽管其首飞火箭上尚未安装可重复使用硬件。\n\n其中一枚火箭将实现中国首次可重复使用火箭着陆，使其成为全球第三个、美国以外的第一个。据报道，蓝箭航天的朱雀三号计划于11月下旬首飞。这些可重复使用火箭对中国雄心勃勃的巨型星座部署至关重要，有望实现更低成本和更频繁的发射任务。"
  },
  {
    "id": "46079785",
    "title": "Don't tug on that, you never know what it might be attached to (2016)",
    "url": "https://blog.plover.com/2016/07/01/#tmpdir",
    "summary": "The article details a frustrating bug where `emacsclient` failed to connect to the Emacs server. The core issue was `emacsclient` looking for the server socket in `/mnt/tmp/emacs2017/server`, while Emacs was creating it in `/tmp/emacs2017/server`. This discrepancy was traced to the `TMPDIR` environment variable, which was set to `/mnt/tmp`.\n\nInitially, Emacs was suspected of not honoring `TMPDIR`. However, through careful testing, it was found that Emacs *did* honor it when launched directly. The problem arose when Emacs was invoked indirectly via a custom Perl script (`git-re-edit`) from Git. After ruling out Git, the author discovered that Perl itself was clearing the `TMPDIR` environment variable, confirmed by a simple `perl -le 'print $ENV{TMPDIR}'` returning an empty string.\n\nDuring the investigation, two workarounds were implemented:\n1.  Configuring Emacs to use TCP sockets instead of Unix-domain sockets.\n2.  Manually setting an `EMACS_SERVER_SOCKET` environment variable in the shell profile, which the author's `also` script passed to `emacsclient` using the `--socket-name` argument.\n\nThe ultimate explanation, later uncovered by others, was that the dynamic loader, when loading Perl, clears `TMPDIR` as a security measure. This prevents potential attacks where a program, especially one with elevated privileges, could be manipulated into writing temporary files to sensitive locations by a malicious `TMPDIR` setting.",
    "chinese_title": "别拽那个，谁知道它会连着什么呢 (2016)",
    "chinese_summary": "这篇文章详细描述了一个令人沮丧的bug，即`emacsclient`无法连接到Emacs服务器。核心问题是`emacsclient`在`/mnt/tmp/emacs2017/server`中寻找服务器套接字，而Emacs却在`/tmp/emacs2017/server`中创建它。这种差异被追溯到`TMPDIR`环境变量，它当时被设置为`/mnt/tmp`。\n\n最初，人们怀疑Emacs没有遵循`TMPDIR`。然而，通过仔细测试发现，当Emacs直接启动时，它确实遵循了该变量。问题出现在通过Git中的自定义Perl脚本（`git-re-edit`）间接调用Emacs时。排除了Git的嫌疑后，作者发现Perl本身清除了`TMPDIR`环境变量，这一点通过简单的`perl -le 'print $ENV{TMPDIR}'`返回空字符串得到了证实。\n\n在调查过程中，实施了两种变通方案：\n1. 将Emacs配置为使用TCP套接字而不是Unix域套接字。\n2. 在shell配置文件中手动设置`EMACS_SERVER_SOCKET`环境变量，作者的`also`脚本使用`--socket-name`参数将其传递给`emacsclient`。\n\n最终的解释（后来由其他人发现）是，动态加载器在加载Perl时，会清除`TMPDIR`作为一项安全措施。这可以防止潜在的攻击，即程序（尤其是具有提升权限的程序）可能通过恶意的`TMPDIR`设置被操纵，将临时文件写入敏感位置。"
  },
  {
    "id": "46064210",
    "title": "Collabora Online Desktop Released with Improved UI from LibreOffice",
    "url": "https://www.collaboraonline.com/blog/collabora-online-now-available-on-desktop/",
    "summary": "A press release announces the launch of \"Collabora Online Desktop.\" This new release is highlighted for bringing Collabora Online functionality to the desktop environment, featuring an improved user interface that draws enhancements from LibreOffice.",
    "chinese_title": "Collabora Online Desktop Released with Improved UI from LibreOffice",
    "chinese_summary": "一份新闻稿宣布“Collabora Online Desktop”正式发布。此新版本的一大亮点在于将 Collabora Online 功能引入桌面环境，其改进的用户界面借鉴了 LibreOffice 的增强功能。"
  },
  {
    "id": "46080424",
    "title": "Apple and Intel Rumored to Partner on Mac Chips",
    "url": "https://www.macrumors.com/2025/11/28/intel-rumored-to-supply-new-mac-chip/",
    "summary": "Apple and Intel are rumored to be rekindling their partnership, with Intel potentially manufacturing Apple's lowest-end M-series chips starting mid-2027. According to supply chain analyst Ming-Chi Kuo, Intel would utilize its advanced 18A process (sub-2nm) to produce these chips, which could power future MacBook Air, iPad Air, and iPad Pro models.\n\nUnlike their previous collaboration where Intel designed x86 processors for Macs, this new arrangement would see Intel solely manufacturing Apple's custom-designed, ARM-based M-series chips. TSMC would continue to be the primary supplier for most of Apple's M-series chips.\n\nKuo suggests Apple's motivations for this move include diversifying its manufacturing supply chain and potentially aligning with \"Made in USA\" product initiatives. This development follows Apple's complete transition away from Intel processors in Macs, a process that began in 2020. macOS Tahoe is also noted as the final major macOS release supporting Intel-based Macs.",
    "chinese_title": "苹果英特尔传将合作Mac芯片",
    "chinese_summary": "Apple and Intel are rumored to be rekindling their partnership, with Intel potentially manufacturing Apple's lowest-end M-series chips starting mid-2027. According to supply chain analyst Ming-Chi Kuo, Intel would utilize its advanced 18A process (sub-2nm) to produce these chips, which could power future MacBook Air, iPad Air, and iPad Pro models.\n\nUnlike their previous collaboration where Intel designed x86 processors for Macs, this new arrangement would see Intel solely manufacturing Apple's custom-designed, ARM-based M-series chips. TSMC would continue to be the primary supplier for most of Apple's M-series chips.\n\nKuo suggests Apple's motivations for this move include diversifying its manufacturing supply chain and potentially aligning with \"Made in USA\" product initiatives. This development follows Apple's complete transition away from Intel processors in Macs, a process that began in 2020. macOS Tahoe is also noted as the final major macOS release supporting Intel-based Macs."
  },
  {
    "id": "46064367",
    "title": "Bonsai_term: A library for building dynamic terminal apps by Jane Street",
    "url": "https://github.com/janestreet/bonsai_term",
    "summary": "生成摘要时出错",
    "chinese_title": "Bonsai_term：Jane Street 开发的动态终端应用构建库",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46061871",
    "title": "Inspired by Spider-Man, scientists recreate web-slinging technology",
    "url": "https://scienceclock.com/inspired-by-spider-man-scientists-recreate-web-slinging-technology/",
    "summary": "生成摘要时出错",
    "chinese_title": "受蜘蛛侠启发，科学家重现蛛丝发射技术",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46066255",
    "title": "Last Issue of \"ECMAScript News\"",
    "url": "https://ecmascript.news/archive/es-next-news-2025-11-26.html",
    "summary": "\"ECMAScript News\" has announced that its current issue is its last. The newsletter, which launched on September 27, 2016, and published 368 issues, is ceasing publication due to prolonged financial losses. The number of advertisers and subscribers has steadily declined over the past two years, making the operation unsustainable despite previous growth. The publishers expressed gratitude to their loyal readers. There is a possibility that Axel, a contributor, may continue the newsletter in a new format next year, with an update to be sent via email in 2026 if this occurs.",
    "chinese_title": "最后一期《ECMAScript 新闻》",
    "chinese_summary": "\"ECMAScript News\" has announced that its current issue is its last. The newsletter, which launched on September 27, 2016, and published 368 issues, is ceasing publication due to prolonged financial losses. The number of advertisers and subscribers has steadily declined over the past two years, making the operation unsustainable despite previous growth. The publishers expressed gratitude to their loyal readers. There is a possibility that Axel, a contributor, may continue the newsletter in a new format next year, with an update to be sent via email in 2026 if this occurs."
  },
  {
    "id": "46077404",
    "title": "Google denies 'misleading' reports of Gmail using your emails to train AI",
    "url": "https://www.theverge.com/news/826902/gmail-ai-training-data-opt-out",
    "summary": "生成摘要时出错",
    "chinese_title": "Google denies 'misleading' reports of Gmail using your emails to train AI",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46076150",
    "title": "GrapheneOS Moving Out of France",
    "url": "https://xcancel.com/GrapheneOS/status/1993035936800584103",
    "summary": "生成摘要时出错",
    "chinese_title": "GrapheneOS Moving Out of France",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46064065",
    "title": "DSP 101 Part 1: An Introductory Course in DSP System Design",
    "url": "https://www.analog.com/en/resources/analog-dialogue/articles/dsp-101-part-1.html",
    "summary": "生成摘要时出错",
    "chinese_title": "DSP 101 Part 1: An Introductory Course in DSP System Design",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46067363",
    "title": "New research highlights a shortage of male mentors for boys and young men",
    "url": "https://www.psypost.org/new-research-highlights-a-shortage-of-male-mentors-for-boys-and-young-men/",
    "summary": "生成摘要时出错",
    "chinese_title": "New research highlights a shortage of male mentors for boys and young men",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46065997",
    "title": "Show HN: Era – Open-source local sandbox for AI agents",
    "url": "https://github.com/BinSquare/ERA",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Era – Open-source local sandbox for AI agents",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46080143",
    "title": "True P2P Email on Top of Yggdrasil Network",
    "url": "https://github.com/JB-SelfCompany/Tyr",
    "summary": "生成摘要时出错",
    "chinese_title": "True P2P Email on Top of Yggdrasil Network",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46070982",
    "title": "Seagate achieves 6.9TB storage capacity per platter",
    "url": "https://www.tomshardware.com/pc-components/hdds/seagate-achieves-a-whopping-6-9tb-storage-capacity-per-platter-in-its-laboratory-55tb-to-69tb-hard-drives-now-physically-possible",
    "summary": "生成摘要时出错",
    "chinese_title": "Seagate achieves 6.9TB storage capacity per platter",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46069837",
    "title": "Steam censors LGBTQ+ content on behalf of the Russian Government",
    "url": "https://www.videogamesindustrymemo.com/p/how-steam-censors-lgbtq-content-on",
    "summary": "生成摘要时出错",
    "chinese_title": "Steam 代表俄罗斯政府审查 LGBTQ+ 内容",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46069743",
    "title": "Don't be a scary old guy: My 40s survival strategy with charm",
    "url": "https://www.devas.life/dont-be-a-scary-old-guy-my-40s-survival-strategy-with-charm/",
    "summary": "生成摘要时出错",
    "chinese_title": "Don't be a scary old guy: My 40s survival strategy with charm",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46077964",
    "title": "A Tale of Four Fuzzers",
    "url": "https://tigerbeetle.com/blog/2025-11-28-tale-of-four-fuzzers/",
    "summary": "生成摘要时出错",
    "chinese_title": "A Tale of Four Fuzzers",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46065870",
    "title": "$96M AUD revamp of Bom website bombs out on launch",
    "url": "https://www.bbc.com/news/articles/c2k4dy15nqqo",
    "summary": "生成摘要时出错",
    "chinese_title": "$96M AUD revamp of Bom website bombs out on launch",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46075219",
    "title": "Shor's algorithm: the one quantum algo that ends RSA/ECC tomorrow",
    "url": "https://blog.ellipticc.com/posts/what-is-shors-algorithm-and-why-its-the-single-biggest-threat-to-classical-cryptography/",
    "summary": "生成摘要时出错",
    "chinese_title": "Shor's algorithm: the one quantum algo that ends RSA/ECC tomorrow",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46077445",
    "title": "Africa's forests have switched from absorbing to emitting carbon",
    "url": "https://phys.org/news/2025-11-africa-forests-absorbing-emitting-carbon.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Africa's forests have switched from absorbing to emitting carbon",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46077650",
    "title": "Cats became our companions way later than you think",
    "url": "https://www.bbc.co.uk/news/articles/cq8dvdp9gn7o",
    "summary": "生成摘要时出错",
    "chinese_title": "Cats became our companions way later than you think",
    "chinese_summary": "生成摘要时出错"
  }
]