[
  {
    "id": "46392736",
    "title": "Show HN: Xcc700: Self-hosting mini C compiler for ESP32 (Xtensa) in 700 lines",
    "url": "https://github.com/valdanylchuk/xcc700",
    "summary": "The \"xcc700\" project presents a remarkable self-hosting mini C compiler for ESP32 (Xtensa), written in just 700 lines of C code. Its primary appeal is its simplicity, making it easy to understand, tweak, and adapt for other languages or purposes.\n\nThis compiler targets the ESP32, taking a single C source file and producing a relocatable ELF output. These ELF files can be run directly by the ESP-IDF `elf_loader`, enabling quick test/debug cycles, hotfixes, or CI on the ESP32 itself. Users can run `xcc700` as a cross-compiler on a PC, compile it directly on an ESP32 (it can self-compile), or integrate it as a function within firmware.\n\n`xcc700` supports a minimal C feature set sufficient for its own construction, including basic control flow (while, if/else), `int`/`char`/pointers/arrays, function calls, and arithmetic/bitwise operators. However, it intentionally omits many advanced C features (e.g., `for`/`do` loops, `struct`s, `float`s, preprocessor, robust error handling, or optimizations), prioritizing simplicity. Performance is sacrificed for this, with the self-compiled version being larger and slower than one compiled by GCC.\n\nReleased under the MIT License, the author encourages forks and extensions for educational purposes, hackathons, or exploring minimal computing. The project serves as an \"artistic statement,\" questioning the need for resource-heavy software and demonstrating the power of simple, tinker-friendly tools on low-power devices like the ESP32.",
    "chinese_title": "Show HN: Xcc700：700行代码实现的ESP32 (Xtensa) 自举迷你C编译器",
    "chinese_summary": "“xcc700”项目呈现了一个卓越的自举式迷你C编译器，专为ESP32 (Xtensa架构)设计，仅用700行C代码编写。其主要吸引力在于简洁性，使其易于理解、修改，并能适应其他语言或用途。\n\n该编译器面向ESP32，接收单个C源文件并生成可重定位的ELF输出。这些ELF文件可由ESP-IDF的`elf_loader`直接运行，从而实现在ESP32上快速测试/调试循环、热修复或持续集成。用户可以在PC上将`xcc700`作为交叉编译器运行，直接在ESP32上编译它（它能自举编译），或者将其作为固件中的一个函数进行集成。\n\n`xcc700`支持一个足以构建自身的最小C特性集，包括基本的控制流（while、if/else）、`int`/`char`/指针/数组、函数调用以及算术/位运算符。然而，它有意省略了许多高级C特性（例如，`for`/`do`循环、`struct`s、`float`s、预处理器、健壮的错误处理或优化），优先考虑简洁性。为此牺牲了性能，自举编译的版本比GCC编译的版本更大且更慢。\n\n该项目根据MIT许可证发布，作者鼓励为教育目的、编程马拉松或探索极简计算而进行分叉和扩展。该项目堪称一份“艺术宣言”，质疑对资源密集型软件的需求，并展示了简单、易于修改的工具在ESP32等低功耗设备上的强大潜力。"
  },
  {
    "id": "46386761",
    "title": "UBlockOrigin and UBlacklist AI Blocklist",
    "url": "https://github.com/laylavish/uBlockOrigin-HUGE-AI-Blocklist",
    "summary": "This article introduces a \"Huge AI Blocklist,\" a manually curated list of over 1000 websites containing AI-generated content, designed to clean image search results on Google, DuckDuckGo, and Bing.\n\nThe blocklist is compatible with various platforms and tools. For PC/Desktop users, it can be easily imported into uBlock Origin or uBlacklist extensions via one-click links or manual URL input. Mobile support is available for iOS/iPadOS through the uBlacklist Safari extension, and for Android via Firefox using either uBlock Origin or uBlacklist. A Hosts file version is also provided for network-wide blocking with Pi-hole and Adguard.\n\nBeyond the main blocklist, an optional \"nuclear list\" targets sites with mixed authentic and AI-generated content (e.g., DeviantArt). Users can customize their experience by allowlisting specific sites in uBlock Origin or uBlacklist. The guide also details \"extended filtering,\" enabling users to block search results based on specific keywords (e.g., \"AI Art,\" \"Midjourney\") using custom filters for uBlock Origin or regular expressions for uBlacklist.\n\nContributions to the list are welcomed via pull requests or issue reporting. The article concludes by listing several related projects addressing SEO spam, AI music, and AI image detection, and includes a message of support for LGBTQ+ rights.",
    "chinese_title": "UBlockOrigin 和 UBlacklist AI 黑名单",
    "chinese_summary": "本文章介绍了一个“巨型AI黑名单”，这是一个手动整理的列表，包含了1000多个包含AI生成内容的网站，旨在清理Google、DuckDuckGo和Bing上的图片搜索结果。\n\n该黑名单兼容各种平台和工具。对于PC/桌面用户，可以通过一键链接或手动URL输入轻松导入到uBlock Origin或uBlacklist扩展中。移动设备支持方面，iOS/iPadOS用户可通过uBlacklist Safari扩展使用，Android用户则可通过Firefox使用uBlock Origin或uBlacklist。此外，还提供了一个Hosts文件版本，用于通过Pi-hole和Adguard进行全网络范围的屏蔽。\n\n除了主黑名单，还有一个可选的“核弹级列表”，专门针对那些混合了真实内容和AI生成内容的网站（例如DeviantArt）。用户可以通过在uBlock Origin或uBlacklist中设置特定网站的白名单来定制自己的体验。该指南还详细介绍了“扩展过滤”功能，使用户能够通过uBlock Origin的自定义过滤器或uBlacklist的正则表达式，根据特定关键词（例如“AI Art”、“Midjourney”）屏蔽搜索结果。\n\n欢迎通过拉取请求或问题报告对列表做出贡献。文章最后列出了几个涉及SEO垃圾邮件、AI音乐和AI图像检测的相关项目，并包含了一条支持LGBTQ+权益的信息。"
  },
  {
    "id": "46393271",
    "title": "Show HN: AutoLISP interpreter in Rust/WASM – a CAD workflow invented 33 yrs ago",
    "url": "https://acadlisp.de/noscript.html",
    "summary": "\"acadlisp\" is an AutoLISP interpreter written in Rust and compiled to WebAssembly, allowing AutoLISP code to execute directly in a web browser without requiring an AutoCAD installation.\n\nThe project is rooted in a CAD workflow invented by the author in 1991 for a German electrical company. This innovative system automated the generation of custom electrical schematics by combining CSV files, templates, and AutoLISP code. Components defined in spreadsheets would generate complete technical drawings automatically. The author built `acadlisp` partly out of nostalgia and partly to preserve this unique workflow, which he believes has been largely forgotten.\n\nThe article also emphasizes LISP's historical significance as an early AI language, highlighting its key features: homoiconicity (code and data share list structures), self-modification, and symbolic processing. The 1991 schematic generator exemplified these, with code capable of writing and modifying itself, triggering further component insertions and template generations.\n\nTechnically, `acadlisp` uses Rust, targets WebAssembly, and supports output formats like SVG and DXF (AutoCAD R12). It implements various common AutoLISP functions, including `defun`, `setq`, control flow statements (`if`, `while`, `cond`), mathematical operations, list manipulation (`car`, `cdr`), and AutoCAD interaction (`command`, `princ`). An interactive demo and source code are available.",
    "chinese_title": "展示HN：基于 Rust/WASM 的 AutoLISP 解释器 — 33 年前发明的 CAD 工作流",
    "chinese_summary": "`acadlisp` 是一个用Rust编写并编译成WebAssembly的AutoLISP解释器，它允许AutoLISP代码直接在网页浏览器中执行，无需安装AutoCAD。\n\n该项目源于作者在1991年为一家德国电气公司发明的一种CAD工作流。这个创新系统结合CSV文件、模板和AutoLISP代码，自动化生成定制电气原理图。在电子表格中定义的组件会自动生成完整的技术图纸。作者创建`acadlisp`，部分是出于怀旧，部分是为了保存这种他认为已在很大程度上被遗忘的独特工作流。\n\n文章还强调了LISP作为早期AI语言的历史意义，强调了其关键特性：同像性（代码和数据共享列表结构）、自修改和符号处理。1991年的原理图生成器就体现了这些特性，其代码能够编写和修改自身，从而触发进一步的组件插入和模板生成。\n\n从技术上讲，`acadlisp`使用Rust，目标是WebAssembly，并支持SVG和DXF（AutoCAD R12）等输出格式。它实现了各种常见的AutoLISP函数，包括`defun`、`setq`、控制流语句（`if`、`while`、`cond`）、数学运算、列表操作（`car`、`cdr`）以及AutoCAD交互（`command`、`princ`）。提供了交互式演示和源代码。"
  },
  {
    "id": "46398752",
    "title": "CEO of Health Care Software Company Sentenced for $1B Fraud Conspiracy",
    "url": "https://www.justice.gov/opa/pr/ceo-health-care-software-company-sentenced-1b-fraud-conspiracy",
    "summary": "**Summary:**\n\nSunny Balwani, former CEO of a health care software company, was sentenced to 13 years in prison for his role in a $1 billion fraud conspiracy related to electronic health records (EHR) incentive programs. Balwani, along with others, orchestrated a scheme to defraud the U.S. government and health care providers.\n\nThe conspiracy involved Balwani and his co-conspirators misrepresenting the capabilities and compliance of their EHR software to secure certification and to induce providers to purchase it. They allegedly paid kickbacks to clients to retain them and hide defects. These actions enabled clients, including doctors and hospitals, to falsely attest to using compliant EHR software, thereby receiving hundreds of millions of dollars in federal incentive payments under the HITECH Act.\n\nBalwani was convicted of conspiracy to commit health care fraud and wire fraud, and five counts of health care fraud. The indictment detailed how the company's software failed to meet essential interoperability and data portability requirements, impacting patient care and defrauding both the government and the health care system. In addition to the prison sentence, Balwani was ordered to pay $270.2 million in restitution and forfeit $1 million. Co-conspirators and the company have previously faced convictions and penalties for their involvement in the widespread fraud.",
    "chinese_title": "医疗软件公司CEO因十亿美元欺诈案获刑",
    "chinese_summary": "摘要：\n\n一家医疗软件公司的前首席执行官桑尼·巴尔瓦尼，因其在与电子健康记录（EHR）激励计划相关的10亿美元欺诈阴谋中的作用，被判处13年监禁。巴尔瓦尼与其他人共同策划了一项欺诈美国政府和医疗服务提供者的计划。\n\n该阴谋涉及巴尔瓦尼及其同谋谎报其EHR软件的功能和合规性，以获得认证并诱使服务提供者购买。他们据称向客户支付回扣以留住他们并隐藏缺陷。这些行为使得包括医生和医院在内的客户能够虚假证明其使用了合规的EHR软件，从而根据《HITECH法案》获得了数亿美元的联邦激励付款。\n\n巴尔瓦尼被判犯有共谋实施医疗欺诈和电信欺诈罪，以及五项医疗欺诈罪。起诉书详细说明了该公司的软件如何未能满足基本的互操作性和数据可移植性要求，影响了患者护理，并欺骗了政府和医疗系统。除了监禁，巴尔瓦尼还被责令支付2.702亿美元的赔偿金并没收100万美元。其他同谋和该公司此前也因参与此广泛欺诈而面临定罪和处罚。"
  },
  {
    "id": "46394169",
    "title": "A Proclamation Regarding the Restoration of the Dash",
    "url": "https://blog.nawaz.org/posts/2025/Dec/a-proclamation-regarding-the-restoration-of-the-dash/",
    "summary": "On December 26, 2025, the author issued a proclamation lamenting the modern prejudice against the elegant em-dash (—). Traditionally used for parenthetical thoughts, sudden turns, and rhythmic pauses, the em-dash is now unfairly maligned, often viewed as a \"tell-tale sign\" of \"unthinking machines\" like Large Language Models, which the author claims have merely mimicked sophistication.\n\nThe author also criticizes the increasing misuse of the humble hyphen (-) as a \"cowardly substitute\" for the bold em-dash, arguing it flattens prose. Refusing to cede classical punctuation to algorithms or fear appearing \"artificial,\" the author decrees a \"restoration of the dash.\"\n\nWithin the confines of their blog, the author reclaims the em-dash for human writers and banishes the hyphen from all roles of punctuation and pause, replacing it with the \"glorious, unrepentant em-dash\" in every instance of stylistic flair. As a protest against misjudgment, the author, who already manually forms em-dashes, has created a plugin to convert *all* hyphens on their blog into em-dashes, even where hyphens would traditionally be appropriate, urging readers to \"join the revolution.\"",
    "chinese_title": "关于恢复达什的文告",
    "chinese_summary": "2025年12月26日，作者发布了一项声明，哀叹现代社会对优雅的破折号（—）存在的偏见。破折号传统上用于插入语、突转和节奏性停顿，但现在却受到不公正的诋毁，常被视为“不假思索的机器”，如大型语言模型（作者声称它们只是拙劣地模仿了复杂性）的“告密迹象”。\n\n作者还批评了日益增多的对“不起眼的连字符”（-）的误用，将其视为“大胆破折号”的“懦弱替代品”，认为它使散文变得平淡无奇。作者拒绝将古典标点符号拱手让给算法，也拒绝因害怕显得“人工化”而退缩，并因此颁布了“破折号复兴”的命令。\n\n在其博客范围内，作者为人类作家夺回了破折号，并将连字符从所有标点和停顿的角色中驱逐，在所有文体风格的实例中，都用“光荣的、不悔的破折号”取而代之。作为对这种误判的抗议，作者（他本人已经习惯手动输入破折号）创建了一个插件，将其博客上的*所有*连字符都转换为破折号，即使在连字符传统上是恰当的地方，并敦促读者“加入这场革命”。"
  },
  {
    "id": "46391448",
    "title": "Unix \"find\" expressions compiled to bytecode",
    "url": "https://nullprogram.com/blog/2025/12/23/",
    "summary": "The article describes a custom compiler, `findc`, that translates Unix `find` expressions into bytecode, contrasting with the tree-walk interpreters found in real-world `find` utilities. The author developed this technique for efficiency, noting `find`'s application to numerous files.\n\n`find` expressions use operators like `-a` (AND), `-o` (OR), and `!` (NOT), with implicit `-a` and a default `-print` action. Parentheses are used for precedence, and operations are short-circuiting, though the author notes `find`'s `-regex` eagerly compiles regardless.\n\nThe bytecode design is for a single-register, 1-bit machine, using five opcodes: `halt`, `not`, `braf` (branch if false), `brat` (branch if true), and `action NAME [ARGS...]`. Jumps are always forward.\n\nThe compilation process involves two main steps:\n1.  **Parsing:** `find`'s infix arguments are converted into a postfix token stream using the shunting-yard algorithm, handling operator precedence and implicit `-a` and `-print` actions.\n2.  **Compiling:** This postfix stream is then translated into bytecode. The compiler maintains a stack of bytecode *fragments*. Actions become `action` instructions. `!` appends `not`. Binary operators like `-a` and `-o` pop two fragments, inserting a `braf` or `brat` instruction to implement short-circuiting by jumping past the second fragment if the first's evaluation allows. The final result is a single program fragment, terminated by a `halt` instruction.\n\nThe author identifies opportunities for peephole optimizations to improve the generated bytecode, such as eliminating redundant `not` instructions and optimizing branch targets.",
    "chinese_title": "Unix find表达式编译为字节码",
    "chinese_summary": "本文描述了一个自定义编译器 `findc`，它将 Unix `find` 表达式翻译成字节码，与实际 `find` 工具中常见的树遍历解释器形成对比。作者开发这项技术是为了提高效率，因为 `find` 适用于处理大量文件。\n\n`find` 表达式使用 `-a` (AND)、`-o` (OR) 和 `!` (NOT) 等运算符，带有隐式的 `-a` 和默认的 `-print` 动作。括号用于表示优先级，并且操作是短路的，尽管作者指出 `find` 的 `-regex` 无论如何都会进行预编译。\n\n该字节码设计适用于单寄存器、1位机器，使用五个操作码：`halt`、`not`、`braf`（如果为假则分支）、`brat`（如果为真则分支）和 `action NAME [ARGS...]`。跳转始终是向前的。\n\n编译过程主要包括两个步骤：\n1.  **解析：** 使用调度场算法将 `find` 的中缀参数转换为后缀标记流，处理运算符优先级以及隐式的 `-a` 和 `-print` 动作。\n2.  **编译：** 然后将此后缀流翻译成字节码。编译器维护一个字节码*片段*堆栈。动作变为 `action` 指令。`!` 操作符附加 `not` 指令。像 `-a` 和 `-o` 这样的二元运算符会弹出两个片段，插入 `braf` 或 `brat` 指令以实现短路，即如果第一个片段的评估结果允许，则跳过第二个片段。最终结果是一个由 `halt` 指令终止的单一程序片段。\n\n作者指出了通过窥孔优化改进生成的字节码的机会，例如消除冗余的 `not` 指令以及优化分支目标。"
  },
  {
    "id": "46395061",
    "title": "Drawing with zero-width characters",
    "url": "https://zw.swerdlow.dev",
    "summary": "This article, titled \"Drawing with zero-width characters,\" serves as a practical demonstration rather than a traditional written explanation. The author introduces the concept by noting that a set of 18 Unicode characters, typically found in the Qur'an, profoundly altered their assumptions about how text is rendered.\n\nThe core of the content is a visually striking arrangement composed predominantly of these zero-width or combining Unicode characters. Within this intricate pattern, the phrase \"Drawing with Zero-Width Characters\" is subtly etched, effectively \"drawn\" using the very characters the article discusses. This showcases the unusual graphic potential of these specialized Unicode elements. Despite occupying no horizontal space themselves, they can combine with and modify preceding characters, creating complex visual effects and demonstrating an unconventional method of visual art within a text-based medium.",
    "chinese_title": "零宽字符绘图",
    "chinese_summary": "这篇题为《零宽字符绘图》的文章，旨在提供一个实践演示，而非传统的文字解释。作者通过指出一组通常在《古兰经》中出现的18个Unicode字符，深刻改变了他们对文本渲染方式的设想，从而引入了这个概念。\n\n文章的核心内容是一个视觉上引人注目的排布，主要由这些零宽或组合Unicode字符构成。在这个错综复杂的图案中，“零宽字符绘图”这句话被巧妙地“描绘”出来，实际上正是利用了文章所讨论的这些字符。这展示了这些特殊Unicode元素不同寻常的图形潜力。尽管它们本身不占用任何水平空间，但它们可以与前置字符组合并进行修改，从而创造出复杂的视觉效果，并在基于文本的媒介中展示了一种非传统的视觉艺术方法。"
  },
  {
    "id": "46392815",
    "title": "High school student discovers 1.5M potential new astronomical objects",
    "url": "https://www.smithsonianmag.com/smart-news/high-school-student-discovers-1-5-million-potential-new-astronomical-objects-by-developing-an-ai-algorithm-180986429/",
    "summary": "生成摘要时出错",
    "chinese_title": "High school student discovers 1.5M potential new astronomical objects",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46403291",
    "title": "Janet Jackson had the power to crash laptop computers (2022)",
    "url": "https://devblogs.microsoft.com/oldnewthing/20220816-00/?p=106994",
    "summary": "生成摘要时出错",
    "chinese_title": "Janet Jackson had the power to crash laptop computers (2022)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46398666",
    "title": "Inside the proton, the ‘most complicated thing you could possibly imagine’ (2022)",
    "url": "https://www.quantamagazine.org/inside-the-proton-the-most-complicated-thing-imaginable-20221019/",
    "summary": "生成摘要时出错",
    "chinese_title": "Inside the proton, the ‘most complicated thing you could possibly imagine’ (2022)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46395292",
    "title": "Grok and the Naked King: The Ultimate Argument Against AI Alignment",
    "url": "https://ibrahimcesar.cloud/blog/grok-and-the-naked-king/",
    "summary": "生成摘要时出错",
    "chinese_title": "Grok and the Naked King: The Ultimate Argument Against AI Alignment",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46390055",
    "title": "Building an AI agent inside a 7-year-old Rails monolith",
    "url": "https://catalinionescu.dev/ai-agent/building-ai-agent-part-1/",
    "summary": "生成摘要时出错",
    "chinese_title": "Building an AI agent inside a 7-year-old Rails monolith",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46394228",
    "title": "ICE's interest in high-tech gear raises new questions: 'What is it for?'",
    "url": "https://www.politico.com/news/2025/12/26/ice-high-tech-surveillance-lower-privacy-guardrails-00705401",
    "summary": "生成摘要时出错",
    "chinese_title": "ICE's interest in high-tech gear raises new questions: 'What is it for?'",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46388700",
    "title": "Ultimate-Linux: Userspace for Linux in Pure JavaScript",
    "url": "https://github.com/popovicu/ultimate-linux",
    "summary": "生成摘要时出错",
    "chinese_title": "Ultimate-Linux: Userspace for Linux in Pure JavaScript",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46388185",
    "title": "Governments in the West Are Turning Their Sights on VPNs",
    "url": "https://www.nakedcapitalism.com/2025/12/in-their-total-war-on-online-privacy-the-liberal-democracies-of-the-collective-west-are-now-turning-their-sights-on-vpns.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Governments in the West Are Turning Their Sights on VPNs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46398906",
    "title": "Pre-commit hooks are broken",
    "url": "https://jyn.dev/pre-commit-hooks-are-fundamentally-broken/",
    "summary": "生成摘要时出错",
    "chinese_title": "Pre-commit hooks are broken",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46391391",
    "title": "Codex vs. Claude Code (today)",
    "url": "https://build.ms/2025/12/22/codex-vs-claude-code-today/",
    "summary": "生成摘要时出错",
    "chinese_title": "Codex vs. Claude Code (today)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46403200",
    "title": "Gpg.fail",
    "url": "https://gpg.fail",
    "summary": "生成摘要时出错",
    "chinese_title": "Gpg.fail",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46394620",
    "title": "MongoBleed",
    "url": "https://github.com/joe-desimone/mongobleed/blob/main/mongobleed.py",
    "summary": "生成摘要时出错",
    "chinese_title": "MongoBleed",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46386835",
    "title": "URL Pattern API",
    "url": "https://developer.mozilla.org/en-US/docs/Web/API/URL_Pattern_API",
    "summary": "生成摘要时出错",
    "chinese_title": "URL Pattern API",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46393906",
    "title": "ZJIT is now available in Ruby 4.0",
    "url": "https://railsatscale.com/2025-12-24-launch-zjit/",
    "summary": "生成摘要时出错",
    "chinese_title": "ZJIT is now available in Ruby 4.0",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46400490",
    "title": "CloudFlare is ruining the internet (for me)",
    "url": "https://www.slashgeek.net/2016/05/17/cloudflare-is-ruining-the-internet-for-me/",
    "summary": "生成摘要时出错",
    "chinese_title": "CloudFlare is ruining the internet (for me)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46396043",
    "title": "How I think about Kubernetes",
    "url": "https://garnaudov.com/writings/how-i-think-about-kubernetes/",
    "summary": "The author proposes thinking of Kubernetes as a runtime for declarative infrastructure with a type system, rather than merely a container orchestrator.\n\nThe \"type system\" refers to Kubernetes' resource kinds (Pod, Deployment, Service) which function like types in a programming language. Each has strict definitions, semantics, and rules for composition, abstracting away processes and containers. Custom Resource Definitions (CRDs) extend this, allowing users to define new infrastructure types.\n\nThe \"runtime\" describes how Kubernetes operates. Applying a YAML manifest is submitting a typed declaration of desired state, not executing a script. The API server stores this intent as durable cluster state. Crucially, controllers continuously reconcile this desired state with the actual state of the infrastructure. If the actual state deviates, Kubernetes constantly works to revert it to the declared intent. This continuous reconciliation explains why manual edits often get reverted and why `spec` (desired) and `status` (observed) are key for debugging.\n\nThis model clarifies GitOps: Git becomes the \"true desired state,\" with a GitOps controller continuously reconciling Git (source of truth) with the cluster's API objects (runtime state). This implies `kubectl edit` is a debugging tool, as direct changes will likely be reverted by the GitOps controller.\n\nAdopting this perspective leads to practical operational principles: always change the desired state, trust reconciliation, make ownership explicit, and leverage Kubernetes' inherent type system.",
    "chinese_title": "How I think about Kubernetes",
    "chinese_summary": "The author proposes thinking of Kubernetes as a runtime for declarative infrastructure with a type system, rather than merely a container orchestrator.\n\nThe \"type system\" refers to Kubernetes' resource kinds (Pod, Deployment, Service) which function like types in a programming language. Each has strict definitions, semantics, and rules for composition, abstracting away processes and containers. Custom Resource Definitions (CRDs) extend this, allowing users to define new infrastructure types.\n\nThe \"runtime\" describes how Kubernetes operates. Applying a YAML manifest is submitting a typed declaration of desired state, not executing a script. The API server stores this intent as durable cluster state. Crucially, controllers continuously reconcile this desired state with the actual state of the infrastructure. If the actual state deviates, Kubernetes constantly works to revert it to the declared intent. This continuous reconciliation explains why manual edits often get reverted and why `spec` (desired) and `status` (observed) are key for debugging.\n\nThis model clarifies GitOps: Git becomes the \"true desired state,\" with a GitOps controller continuously reconciling Git (source of truth) with the cluster's API objects (runtime state). This implies `kubectl edit` is a debugging tool, as direct changes will likely be reverted by the GitOps controller.\n\nAdopting this perspective leads to practical operational principles: always change the desired state, trust reconciliation, make ownership explicit, and leverage Kubernetes' inherent type system."
  },
  {
    "id": "46403073",
    "title": "VSCode rebrands as \"The open source AI code editor\"",
    "url": "https://code.visualstudio.com",
    "summary": "生成摘要时出错",
    "chinese_title": "VSCode rebrands as \"The open source AI code editor\"",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46402327",
    "title": "How we automated federal retirements",
    "url": "https://ndstudio.gov/posts/automating-federal-retirements",
    "summary": "生成摘要时出错",
    "chinese_title": "How we automated federal retirements",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46399576",
    "title": "More dynamic cronjobs",
    "url": "https://george.mand.is/2025/09/more-dynamic-cronjobs/",
    "summary": "生成摘要时出错",
    "chinese_title": "More dynamic cronjobs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46392538",
    "title": "Steve wants us to make the Macintosh boot faster",
    "url": "https://www.folklore.org/Saving_Lives.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Steve wants us to make the Macintosh boot faster",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46388059",
    "title": "When a driver challenges the kernel's assumptions",
    "url": "http://miod.online.fr/software/openbsd/stories/udl.html",
    "summary": "生成摘要时出错",
    "chinese_title": "When a driver challenges the kernel's assumptions",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46398170",
    "title": "The battle to stop clever people betting",
    "url": "https://www.economist.com/christmas-specials/2025/12/18/the-battle-to-stop-clever-people-betting",
    "summary": "生成摘要时出错",
    "chinese_title": "The battle to stop clever people betting",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46387164",
    "title": "Memory Safety",
    "url": "https://www.memorysafety.org/",
    "summary": "生成摘要时出错",
    "chinese_title": "Memory Safety",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46390667",
    "title": "Geometric Algorithms for Translucency Sorting in Minecraft [pdf]",
    "url": "https://douira.dev/assets/document/douira-master-thesis.pdf",
    "summary": "生成摘要时出错",
    "chinese_title": "Geometric Algorithms for Translucency Sorting in Minecraft [pdf]",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46401499",
    "title": "OrangePi 6 Plus Review",
    "url": "https://boilingsteam.com/orange-pi-6-plus-review/",
    "summary": "生成摘要时出错",
    "chinese_title": "OrangePi 6 Plus Review",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46401190",
    "title": "Splice a Fibre",
    "url": "https://react-networks-lib.rackout.net/fibre",
    "summary": "生成摘要时出错",
    "chinese_title": "Splice a Fibre",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46395273",
    "title": "Gaussian Splatting 3 Ways",
    "url": "https://github.com/NullandKale/NullSplats",
    "summary": "生成摘要时出错",
    "chinese_title": "Gaussian Splatting 3 Ways",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46393817",
    "title": "Mostlymatter: A fork of Mattermost by Framasoft",
    "url": "https://packages.framasoft.org/projects/mostlymatter/",
    "summary": "生成摘要时出错",
    "chinese_title": "Mostlymatter: A fork of Mattermost by Framasoft",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46403276",
    "title": "USD Share as Global Reserve Currency Drops to Lowest Since 1994",
    "url": "https://wolfstreet.com/2025/12/26/status-of-the-us-dollar-as-global-reserve-currency-usd-share-drops-to-lowest-since-1994/",
    "summary": "生成摘要时出错",
    "chinese_title": "USD Share as Global Reserve Currency Drops to Lowest Since 1994",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46395491",
    "title": "What on earth is Kubernetes? (a beginners intro)",
    "url": "https://kylejeong.com/blog/what-is-kubernetes",
    "summary": "生成摘要时出错",
    "chinese_title": "What on earth is Kubernetes? (a beginners intro)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46395714",
    "title": "Karpathy on Programming",
    "url": "https://twitter.com/karpathy/status/2004607146781278521",
    "summary": "生成摘要时出错",
    "chinese_title": "Karpathy on Programming",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46391077",
    "title": "The First Web Server",
    "url": "https://dfarq.homeip.net/the-first-web-server/",
    "summary": "生成摘要时出错",
    "chinese_title": "The First Web Server",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46387838",
    "title": "No shares in company, but 550 employees received a $240M gift from their owner",
    "url": "https://economictimes.indiatimes.com/magazines/panache/no-shares-in-company-but-550-employees-received-a-240-million-gift-from-their-owner-for-staying-with-him-through-tough-times/articleshow/126175955.cms?from=mdr",
    "summary": "生成摘要时出错",
    "chinese_title": "No shares in company, but 550 employees received a $240M gift from their owner",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46393924",
    "title": "C/C++ Embedded Files (2013)",
    "url": "https://www.4rknova.com//blog/2013/01/27/cpp-embedded-files",
    "summary": "生成摘要时出错",
    "chinese_title": "C/C++ Embedded Files (2013)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46391064",
    "title": "Questions engineers should ask future employers in interviews",
    "url": "https://dollardhingra.substack.com/p/questions-software-engineers-should",
    "summary": "生成摘要时出错",
    "chinese_title": "Questions engineers should ask future employers in interviews",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46386669",
    "title": "Weight-loss pill approval set to accelerate food industry product overhauls",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/weight-loss-pill-approval-set-accelerate-food-industry-product-overhauls-2025-12-24/",
    "summary": "生成摘要时出错",
    "chinese_title": "Weight-loss pill approval set to accelerate food industry product overhauls",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46403048",
    "title": "This PNG shows a different version when loaded in Chrome than in Safari",
    "url": "https://lr0.org/blog/p/pngchanges/",
    "summary": "生成摘要时出错",
    "chinese_title": "This PNG shows a different version when loaded in Chrome than in Safari",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46402609",
    "title": "New York to require social media platforms to display mental health warnings",
    "url": "https://www.reuters.com/legal/litigation/new-york-require-social-media-platforms-display-mental-health-warnings-2025-12-26/",
    "summary": "生成摘要时出错",
    "chinese_title": "New York to require social media platforms to display mental health warnings",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46395757",
    "title": "NYC phone ban reveals some students can't read clocks",
    "url": "https://gothamist.com/news/nyc-phone-ban-reveals-some-students-cant-read-clocks",
    "summary": "生成摘要时出错",
    "chinese_title": "NYC phone ban reveals some students can't read clocks",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46393609",
    "title": "I built a quiet site for finding ambient albums while working",
    "url": "https://ambientmusic.com/",
    "summary": "生成摘要时出错",
    "chinese_title": "I built a quiet site for finding ambient albums while working",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46393262",
    "title": "Show HN: Private blogging and journaling with a simulated audience",
    "url": "https://tempblog-psi.vercel.app/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: Private blogging and journaling with a simulated audience",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46398644",
    "title": "Former ULA President and CEO Tory Bruno Joins Blue Origin",
    "url": "https://spaceflightnow.com/2025/12/26/former-ula-president-and-ceo-tory-bruno-joins-blue-origin/",
    "summary": "生成摘要时出错",
    "chinese_title": "Former ULA President and CEO Tory Bruno Joins Blue Origin",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46402611",
    "title": "A Century of Noether's Theorem",
    "url": "https://arxiv.org/abs/1902.01989",
    "summary": "生成摘要时出错",
    "chinese_title": "A Century of Noether's Theorem",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46392223",
    "title": "Cjanet",
    "url": "https://github.com/janet-lang/spork/blob/cjanet-jit/spork/cjanet.janet",
    "summary": "生成摘要时出错",
    "chinese_title": "Cjanet",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46393081",
    "title": "The AI bubble is all over now, baby blue",
    "url": "https://garymarcus.substack.com/p/the-ai-bubble-is-all-over-now-baby",
    "summary": "生成摘要时出错",
    "chinese_title": "The AI bubble is all over now, baby blue",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46391422",
    "title": "GNU Mes and the Module System",
    "url": "https://ekaitz.elenq.tech/fasterMes5.html",
    "summary": "生成摘要时出错",
    "chinese_title": "GNU Mes and the Module System",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46391808",
    "title": "Officials discover a million more documents potentially related to Epstein case",
    "url": "https://www.bbc.com/news/articles/czdgz84dn35o",
    "summary": "生成摘要时出错",
    "chinese_title": "Officials discover a million more documents potentially related to Epstein case",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46387464",
    "title": "We \"solved\" C10K years ago yet we keep reinventing it (2003)",
    "url": "https://www.kegel.com/c10k.html",
    "summary": "生成摘要时出错",
    "chinese_title": "We \"solved\" C10K years ago yet we keep reinventing it (2003)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46402202",
    "title": "Easel Turns One One year of building my own IDE in Clojure",
    "url": "https://blog.phronemophobic.com/easel-one-year.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Easel Turns One One year of building my own IDE in Clojure",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46398339",
    "title": "Retreating from EVs could be hazardous for Western carmakers",
    "url": "https://www.economist.com/business/2025/12/17/retreating-from-evs-could-be-hazardous-for-western-carmakers",
    "summary": "生成摘要时出错",
    "chinese_title": "Retreating from EVs could be hazardous for Western carmakers",
    "chinese_summary": "生成摘要时出错"
  }
]