[
  {
    "id": "45993296",
    "title": "Nano Banana Pro",
    "url": "https://blog.google/technology/ai/nano-banana-pro/",
    "summary": "Google DeepMind has launched Nano Banana Pro, a new state-of-the-art image generation and editing model built on Gemini 3 Pro. This advanced model offers unprecedented control, improved text rendering, and enhanced world knowledge, succeeding the previous Nano Banana.\n\nNano Banana Pro excels at creating accurate, context-rich visuals, from infographics and diagrams based on provided content or real-world facts (via Google Search), to mockups and posters with legible text directly embedded in multiple languages. It also enables high-fidelity visuals with consistent branding, allowing users to combine up to 14 inputs and maintain the resemblance of up to 5 people in complex compositions.\n\nUsers gain studio-quality creative controls, including localized editing, adjusting camera angles, focus, color grading, and transforming scene lighting (e.g., day to night), with outputs available in 2K and 4K resolution.\n\nNano Banana Pro is rolling out globally across Google products like the Gemini app, Google Ads, Workspace, Google AI Studio, and Vertex AI, catering to consumers, professionals, developers, and creatives.\n\nTransparency is maintained through imperceptible SynthID digital watermarks embedded in all generated media. Free and Google AI Pro users will also see a visible Gemini sparkle watermark, though this is removed for Ultra subscribers and developer tools. Users can verify if an image was Google AI-generated by uploading it to the Gemini app. The original Nano Banana remains available for fast, casual editing.",
    "chinese_title": "纳米香蕉Pro",
    "chinese_summary": "谷歌DeepMind推出了Nano Banana Pro，这是一款基于Gemini 3 Pro构建的全新尖端图像生成和编辑模型。这个先进模型提供前所未有的控制力、改进的文本渲染和增强的世界知识，接替了之前的Nano Banana。\n\nNano Banana Pro擅长创建准确、内容丰富的视觉效果，包括基于提供内容或真实世界事实（通过谷歌搜索）的信息图表和图示，以及直接嵌入多语言清晰可辨文本的模型图和海报。它还能实现具有一致品牌标识的高保真视觉效果，允许用户组合多达14个输入，并在复杂构图中保持多达5个人物的相似性。\n\n用户可获得工作室级的创意控制，包括本地化编辑、调整摄像机角度、焦点、色彩分级，以及转换场景照明（例如，从白天到夜晚），输出支持2K和4K分辨率。\n\nNano Banana Pro正在全球范围内推出，并在Gemini应用、Google Ads、Workspace、Google AI Studio和Vertex AI等谷歌产品中普及，服务于消费者、专业人士、开发者和创意工作者。\n\n透明度通过嵌入所有生成媒体中的不可察觉的SynthID数字水印得到保持。免费用户和Google AI Pro用户也会看到一个可见的Gemini闪光水印，但Ultra订阅用户和开发者工具将移除此水印。用户可以通过将图像上传到Gemini应用来验证其是否由谷歌AI生成。最初的Nano Banana仍可用于快速、休闲的编辑。"
  },
  {
    "id": "45994854",
    "title": "Android and iPhone users can now share files, starting with the Pixel 10",
    "url": "https://blog.google/products/android/quick-share-airdrop/",
    "summary": "Google is introducing a new feature that allows Android and iPhone users to seamlessly share files, addressing a long-standing demand for easier cross-platform transfers. This integration enables Quick Share on Android devices to work directly with Apple's AirDrop.\n\nThe rollout begins today, specifically with the Pixel 10 family. The new functionality is designed with robust security measures to protect user data, having been rigorously tested by independent experts. This initiative marks another step in Google's efforts to enhance compatibility between different operating systems, following previous work on RCS messaging and unknown tracker alerts. Google plans to expand this file-sharing capability to a wider range of Android devices in the future.",
    "chinese_title": "Android 和 iPhone 用户现在可以共享文件了，从 Pixel 10 开始。",
    "chinese_summary": "谷歌正在推出一项新功能，允许安卓和 iPhone 用户无缝共享文件，以满足长期以来对更便捷跨平台传输的需求。这项集成使得安卓设备上的“快速分享”（Quick Share）可以直接与苹果的 AirDrop 协同工作。\n\n该功能将从今天开始推出，率先支持 Pixel 10 系列设备。这项新功能在设计时内置了强大的安全措施以保护用户数据，并已通过独立专家的严格测试。继此前在 RCS 消息和未知追踪器警报方面的工作之后，这一举措标志着谷歌在增强不同操作系统兼容性方面又迈出了新的一步。谷歌计划未来将这一文件共享功能推广到更广泛的安卓设备上。"
  },
  {
    "id": "45996860",
    "title": "CBP is monitoring US drivers and detaining those with suspicious travel patterns",
    "url": "https://apnews.com/article/immigration-border-patrol-surveillance-drivers-ice-trump-9f5d05469ce8c629d6fecf32d32098cd",
    "summary": "The U.S. Border Patrol (CBP) operates a secretive nationwide program monitoring millions of American drivers, identifying and detaining individuals based on \"suspicious\" travel patterns. This predictive intelligence system uses hidden license plate readers (LPRs) and an algorithm to flag vehicles based on their origin, destination, and route. Federal agents then alert local law enforcement, who often pull drivers over using minor traffic infractions as a pretext, leading to aggressive questioning and searches without the driver knowing they were flagged by surveillance.\n\nInitially aimed at border-related activities and trafficking, the program has expanded over the past five years, stretching deep into the country's interior, affecting residents in major cities like Chicago, Detroit, Phoenix, San Antonio, and Houston, often beyond CBP's usual 100-mile jurisdiction. Funded to expand with AI and other technologies, CBP collaborates with agencies like the DEA, private companies, and local police, even sharing U.S. citizens' personal data via informal chats.\n\nLegal experts and privacy advocates raise significant Fourth Amendment concerns, viewing it as mass surveillance of ordinary Americans. The program's secrecy is so profound that CBP has dropped charges to prevent details from being revealed in court. Examples include Lorenzo Gutierrez Lugo, a truck driver stopped for speeding in Texas based on a Border Patrol tip, who was searched and arrested for carrying cash but later cleared. Similarly, Alek Schott was pulled over by Texas deputies after Border Patrol flagged his trip near the border, his car searched without finding anything. Critics argue these systems do not enhance community safety.",
    "chinese_title": "美国海关边境保护局正在监控美国司机，并拘留行程可疑者。",
    "chinese_summary": "美国边境巡逻队 (CBP) 运行着一个秘密的全国性项目，监控数百万美国司机，根据“可疑”的出行模式识别并拘留个人。这个预测性情报系统利用隐藏的车牌识别器 (LPR) 和算法，根据车辆的始发地、目的地和行驶路线进行标记。联邦特工随后会通知当地执法部门，后者通常以轻微的交通违规为借口拦下司机，进行盘问和搜查，而司机并不知道自己已被监控系统标记。\n\n该项目最初旨在打击边境相关活动和走私贩运，但在过去五年中已大幅扩张，深入美国内陆，影响到芝加哥、底特律、菲尼克斯、圣安东尼奥和休斯顿等主要城市的居民，其范围常常超出CBP通常100英里的管辖范围。CBP获得了资金以利用人工智能和其他技术进行扩张，并与美国缉毒局 (DEA) 等机构、私营公司和当地警方合作，甚至通过非正式聊天分享美国公民的个人数据。\n\n法律专家和隐私倡导者对该项目提出了重大的《第四修正案》担忧，认为这是对普通美国民众的大规模监控。该项目的保密性极高，CBP甚至曾撤销指控，以阻止其细节在法庭上被披露。例如，卡车司机洛伦佐·古铁雷斯·卢戈 (Lorenzo Gutierrez Lugo) 因边境巡逻队的线报，在得克萨斯州因超速被拦下，随后因携带现金被搜查和逮捕，但后来被无罪释放。同样，亚历克斯·肖特 (Alek Schott) 在边境巡逻队标记了他边境附近的行程后，被得克萨斯州副警长拦下，车辆被搜查但一无所获。批评者认为，这些系统并不能增强社区安全。"
  },
  {
    "id": "45995740",
    "title": "Microsoft makes Zork open-source",
    "url": "https://opensource.microsoft.com/blog/2025/11/20/preserving-code-that-shaped-generations-zork-i-ii-and-iii-go-open-source",
    "summary": "Microsoft, through its Open Source Programs Office (OSPO), Team Xbox, and Activision, has announced that Zork I, Zork II, and Zork III are now open-source under the MIT License. The initiative aims to preserve this cornerstone of gaming history, making the historically important code accessible for students, teachers, and developers to study, learn from, and play.\n\nZork, a revolutionary text adventure, challenged players to imagine without graphics or sound. Its underlying Z-Machine engine was a groundbreaking innovation, allowing the game to be cross-platform by interpreting story files on various computers, including Apple IIs and IBM PCs.\n\nFor this preservation effort, Microsoft is collaborating with digital archivist Jason Scott of the Internet Archive, submitting pull requests to the existing historical source repositories of Zork I, II, and III. These contributions add the MIT LICENSE, source code, accompanying documentation, and clear attribution. The release focuses purely on the code, intentionally excluding commercial packaging, marketing materials, and trademarks to maintain historical accuracy.\n\nEven today, Zork remains accessible. While commercially available, enthusiasts can compile and run the games locally using modern tools like ZILF (a Z-Machine interpreter) and various Z-machine runners such as Frotz or Fic.\n\nContributions to the open-source Zork repositories are welcomed, encouraging small, well-documented improvements that aid learning and preservation, rather than modernization. This move celebrates the original Infocom creators, the Internet Archive's stewardship, and the partners who made this open-source release possible, ensuring Zork's legacy continues to inspire.",
    "chinese_title": "微软将祖克开源",
    "chinese_summary": "微软通过其开源项目办公室（OSPO）、Xbox 团队和动视公司宣布，Zork I、Zork II 和 Zork III 现已在 MIT 许可证下开源。此举旨在保护这一游戏历史的基石，让具有历史意义的代码可供学生、教师和开发者研究、学习和游玩。\n\nZork 是一款革命性的文字冒险游戏，挑战玩家在没有图形或声音的情况下进行想象。其底层的 Z-Machine 引擎是一项开创性创新，通过在 Apple II 和 IBM PC 等各种计算机上解释故事文件，使游戏能够实现跨平台。\n\n为了这项保护工作，微软正与互联网档案馆的数字档案管理员 Jason Scott 合作，向 Zork I、II 和 III 现有的历史源代码存储库提交拉取请求。这些贡献增加了 MIT 许可证、源代码、随附文档和明确的归属。此次发布纯粹关注代码本身，有意排除了商业包装、营销材料和商标，以保持历史准确性。\n\n即使在今天，Zork 仍然可以游玩。虽然市面上仍有商业版本，但爱好者可以使用 ZILF（Z-Machine 解释器）以及 Frotz 或 Fic 等各种 Z-machine 运行器等现代工具在本地编译和运行这些游戏。\n\n微软欢迎对 Zork 开源存储库的贡献，鼓励那些有助于学习和保存而非现代化的、小型且有良好文档记录的改进。此举旨在致敬 Infocom 的原创者、互联网档案馆的尽职管理以及使此次开源发布成为可能的所有合作伙伴，确保 Zork 的遗产能够继续激励后人。"
  },
  {
    "id": "45985890",
    "title": "The patent office is about to make bad patents untouchable",
    "url": "https://www.eff.org/deeplinks/2025/11/patent-office-about-make-bad-patents-untouchable",
    "summary": "The U.S. Patent and Trademark Office (USPTO) has proposed new rules for Inter Partes Review (IPR) that the Electronic Frontier Foundation (EFF) warns will severely limit the public's ability to challenge improperly granted patents. These changes would benefit \"patent trolls\" by making bad patents virtually untouchable, leaving individuals, small companies, and nonprofits with no affordable defense against abusive lawsuits.\n\nIPR, decided by the Patent Trial and Appeal Board (PTAB), was created by Congress as a faster, more affordable, and technically expert alternative to federal court for invalidating bogus patents. It has successfully removed patents like the \"Podcasting Patent\" and \"SportBrain's\" data upload patent, protecting innovation.\n\nThe proposed rules would drastically undermine IPR by:\n1.  **Requiring defendants to waive their right to challenge patent validity in federal court** if they pursue an IPR.\n2.  **Making patents \"unchallengeable\"** if they survive any prior validity fight, even a poorly argued one, blocking future IPRs regardless of new evidence.\n3.  **Blocking IPR entirely if a district court case is projected to move faster**, forcing defendants into prohibitively expensive federal litigation.\n\nThe USPTO's claim that district court remains an option is misleading, as such fights cost millions and take years. EFF argues these rules subvert Congress's original intent for IPR, wrongly assuming defendants are abusing the system. The EFF urges the public to submit comments opposing these rules by December 2, emphasizing that the public has a right to challenge bad patents to protect innovation.",
    "chinese_title": "专利局即将使劣质专利变得不可撤销。",
    "chinese_summary": "美国专利商标局 (USPTO) 针对双方复审 (IPR) 提出了新规，电子前沿基金会 (EFF) 警告称，这些新规将严重限制公众挑战不当授予专利的能力。这些改变将使“专利蟑螂”受益，让不良专利几乎无法被撼动，从而使个人、小型公司和非营利组织无法负担得起针对滥诉的辩护。\n\n由专利审判和上诉委员会 (PTAB) 裁决的双方复审 (IPR) 是国会设立的一种比联邦法院更快、更经济、更具技术专业性的替代方案，旨在使虚假专利失效。它已成功撤销了诸如“播客专利”和“SportBrain”的数据上传专利等，从而保护了创新。\n\n拟议的新规将通过以下方式，严重削弱双方复审 (IPR)：\n1.  要求被告在寻求双方复审 (IPR) 时，必须放弃其在联邦法院挑战专利有效性的权利。\n2.  规定专利一旦在任何先前的有效性争议中幸存，即便论证不充分，也变得“不可挑战”，无论是否有新证据，都将阻止未来的双方复审。\n3.  如果预计地方法院案件进展更快，则完全阻止双方复审，迫使被告卷入代价高昂的联邦诉讼。\n\nUSPTO 声称地方法院仍是一种选择的说法具有误导性，因为此类诉讼耗资数百万美元且耗时数年。EFF 认为，这些规则颠覆了国会设立双方复审 (IPR) 的初衷，错误地假设被告正在滥用该系统。EFF 敦促公众在12月2日前提交反对这些规则的意见，强调公众有权挑战不良专利以保护创新。"
  },
  {
    "id": "45985506",
    "title": "Gaming on Linux has never been more approachable",
    "url": "https://www.theverge.com/tech/823337/switching-linux-gaming-desktop-cachyos",
    "summary": "Nathan Edwards, a senior reviews editor, plans to install Linux on his gaming PC due to growing dissatisfaction with Windows 11 and the improved viability of Linux for gaming. He criticizes Windows 11's \"egregious bullshit,\" including intrusive features like Copilot, Edge pushing Bing, OneDrive, Recall, and Microsoft's general trend toward AI integration and forced hardware upgrades.\n\nEdwards highlights that Valve's work with the Steam Deck has significantly advanced Linux gaming, with some handhelds reportedly performing better on Linux-based distros like Bazzite than on Windows. Inspired by colleagues' positive experiences and the upcoming Steam Machine, he feels it's an opportune time for a change.\n\nAlthough his prior Linux experiences have been limited and often challenging (e.g., Homebridge on Raspberry Pi, WSL for keyboard firmware), Edwards is committed to making the switch. He intends to install CachyOS, an Arch-based distro optimized for modern gaming hardware, on his desktop featuring an AMD Ryzen 7 9800X3D and Nvidia GeForce RTX 4070 Super.\n\nAcknowledging his inexperience and Linux's small market share in PC gaming (around 3% of Steam users), he anticipates potential difficulties but views the experiment as having \"medium\" stakes, as he has other machines for work. Edwards is unsure if he will become a Linux advocate or revert to Windows, but he's ready to find out.",
    "chinese_title": "Linux上的游戏从未如此平易近人。",
    "chinese_summary": "资深评测编辑Nathan Edwards计划在他的游戏电脑上安装Linux，原因是他对Windows 11日益不满，并且Linux在游戏方面的可行性有所提高。他批评Windows 11的“骇人听闻的废话”，包括Copilot等侵入性功能、Edge浏览器强推Bing、OneDrive、Recall，以及微软普遍的AI集成趋势和强制硬件升级。\n\nEdwards强调，Valve在Steam Deck方面的工作极大地推动了Linux游戏的发展，据报道，一些掌上设备在Bazzite等基于Linux的发行版上运行表现优于Windows。受同事积极体验和即将推出的Steam Machine的启发，他觉得现在是做出改变的绝佳时机。\n\n尽管他之前的Linux经验有限且常常充满挑战（例如，在树莓派上运行Homebridge，使用WSL刷键盘固件），但Edwards仍致力于进行这次转换。他打算在他的台式机上安装CachyOS——一个基于Arch、针对现代游戏硬件优化的发行版。这台电脑配备AMD Ryzen 7 9800X3D处理器和Nvidia GeForce RTX 4070 Super显卡。\n\n他承认自己经验不足，并且Linux在PC游戏市场份额很小（约占Steam用户的3%），他预计会遇到潜在的困难，但鉴于他有其他工作用电脑，他认为这次尝试的“风险中等”。Edwards不确定自己会成为Linux的拥护者还是会回归Windows，但他已准备好去探索。"
  },
  {
    "id": "45983700",
    "title": "AI is a front for consolidation of resources and power",
    "url": "https://www.chrbutler.com/what-ai-is-really-for",
    "summary": "The author, a designer immersed in AI, argues that the technology is severely overhyped, likely forming a catastrophic bubble. He finds many promised AI applications, particularly in design and large-scale workflow automation, impractical and less efficient than traditional methods. While acknowledging AI's utility for specific, small-scale tasks like information synthesis, he highlights that significant investments in AI often yield minimal gains, with time saved merely reallocated to other AI-related work.\n\nFinancially, the AI market is highly speculative and concentrated among a few companies, lacking a viable monetization model to justify its colossal valuations. This mirrors past bubbles (e.g., dot-com, Segway), but on an unprecedented scale, making an inevitable market correction potentially devastating. Beyond economic concerns, generative AI poses a severe threat to societal integrity by facilitating faster and more precise manipulation of truth, further eroding trust.\n\nThe author posits a \"conspiracy theory\" that the AI bubble's true purpose isn't just technological advancement, nor the pursuit of the abstract fantasy of Artificial General Intelligence (AGI) sold to billionaire investors. Instead, he believes AI serves as a front for the consolidation of land, energy, and water resources. The immense datacenters required for AI demand vast tracts of land, significant energy, and water, leading to politically powerful deals that concentrate these critical resources in private hands.\n\nThis \"Privatism,\" where private companies construct \"energy cities\" without public accountability, erodes national governance from within. The author fears that the infrastructure powering AI will ultimately become more valuable than the AI itself, granting those who control it more sway over policy and resources than elected governments, fundamentally transforming society. Regardless of AI's technological success, these shifts in power and resource control are already real and deeply concerning.",
    "chinese_title": "AI是资源和权力集中的幌子。",
    "chinese_summary": "作者作为一名深耕人工智能领域的设计师，认为这项技术被严重过度炒作，很可能正在形成一个灾难性的泡沫。他发现许多承诺的人工智能应用，特别是在设计和大规模工作流自动化方面，不切实际，并且效率低于传统方法。他承认人工智能对于信息整合等特定小型任务的实用性，但也指出，对人工智能的大量投资往往收效甚微，节省下来的时间只是被重新分配到其他与人工智能相关的工作上。\n\n从财务角度看，人工智能市场投机性极强，集中在少数几家公司手中，缺乏可行的盈利模式来支撑其庞大的估值。这反映了过去的一些泡沫（如互联网泡沫、赛格威），但规模前所未有，使得不可避免的市场调整可能带来毁灭性的后果。除了经济担忧，生成式人工智能通过促进更快、更精确的真相操纵，对社会完整性构成严重威胁，进一步侵蚀了信任。\n\n作者提出一种“阴谋论”，认为人工智能泡沫的真正目的不仅仅是技术进步，也不是追求向亿万富翁投资者推销的抽象的通用人工智能（AGI）幻想。相反，他认为人工智能是土地、能源和水资源整合的幌子。人工智能所需的庞大数据中心需要广阔的土地、大量的能源和水，这导致了政治上强大的交易，将这些关键资源集中到私人手中。\n\n这种“私有主义”，即私营公司在缺乏公共问责制的情况下建设“能源城市”，正在从内部侵蚀国家治理。作者担心，为人工智能提供动力的基础设施最终将比人工智能本身更有价值，使得控制这些基础设施的人对政策和资源的影响力超越民选政府，从根本上改变社会。无论人工智能的技术是否成功，这些权力与资源控制的转变已经真实发生，并且令人深感担忧。"
  },
  {
    "id": "45991853",
    "title": "Red Alert 2 in web browser",
    "url": "https://chronodivide.com/",
    "summary": "Chrono Divide is a fan-made project aiming to fully recreate the classic RTS game \"Red Alert 2\" for web browsers. Initially an experiment, it now offers a playable beta version accessible directly in a web browser without plugins, with the goal of achieving feature parity with the original game.\n\nThe beta currently supports fully functional multiplayer, all original maps, and offers cross-platform compatibility across PCs, mobiles, and tablets. It utilizes a client-server model, eliminating the need for port forwarding, and features a modern game client with options for classic or modern controls, and replay functionality. The project is also modding-friendly.\n\nMinimum system requirements include an Intel Atom Z3700+ CPU, 4GB RAM, a 64-bit OS, and a display resolution of 1024x768. Major web browsers are supported, though Chrome, Edge, and Safari are recommended over Firefox for better performance.\n\nChrono Divide relies solely on player donations to cover infrastructure costs and support ongoing development. Players can join the community on Discord for discussions and updates. The project encourages users to experience the \"Red Alert 2\" classic gameplay by playing the available beta.",
    "chinese_title": "红警2网页版",
    "chinese_summary": "Chrono Divide 是一个玩家自制项目，旨在为网页浏览器完整重现经典即时战略游戏《红色警戒2》。最初只是一个实验项目，目前已推出一个可试玩的 Beta 版，无需插件即可直接在网页浏览器中访问，目标是实现与原版游戏相同的功能。\n\n该测试版目前支持功能完善的多人模式、所有原版地图，并提供涵盖 PC、手机和平板电脑的跨平台兼容性。它采用客户端-服务器模型，无需端口转发；其现代化的游戏客户端提供经典或现代操作选项，并具备录像回放功能。该项目也支持模组。\n\n最低系统要求包括英特尔凌动 Z3700+ CPU、4GB 内存、64位操作系统以及 1024x768 的显示分辨率。支持主流网页浏览器，但为了获得更好的性能，推荐使用 Chrome、Edge 和 Safari，而非 Firefox。\n\nChrono Divide 完全依赖玩家捐款来支付基础设施费用并支持持续开发。玩家可以在 Discord 上加入社区，参与讨论并获取最新动态。该项目鼓励用户通过游玩可用的 Beta 版来体验《红色警戒2》的经典玩法。"
  },
  {
    "id": "45984143",
    "title": "The Death of Arduino?",
    "url": "https://www.linkedin.com/posts/adafruit_opensource-privacy-techpolicy-activity-7396903362237054976-r14H",
    "summary": "Adafruit Industries reports that Qualcomm-owned Arduino has quietly revised its Terms of Service (ToS) and Privacy Policy, marking a significant departure from its original open-hardware ethos.\n\nThe new policies introduce an irrevocable, perpetual license over user-uploaded content, extensive surveillance for AI features, a clause preventing users from identifying potential patent infringement, prolonged retention of usernames post-deletion, and the integration of all user data (including minors) into Qualcomm’s global data ecosystem. Most notably, users are now forbidden from reverse-engineering or understanding the platform without Arduino’s explicit permission. This shift redefines Arduino from an open community to a tightly controlled corporate service focused on data extraction.\n\nThe announcement sparked widespread criticism from the community, who view it as a severe blow to academic research, maker culture, and open-source principles. Many commenters declared \"RIP Arduino\" and are advocating for alternatives like RP2040, ESP32, or VSC with PlatformIO. Critics accuse Qualcomm of misunderstanding the open-source community and making a \"stupid move\" that could drive users away.\n\nHowever, a crucial clarification emerged: these controversial changes *only apply to the optional Arduino Cloud Service* and do not affect the core open-source hardware and software project, which remains governed by AGPL and GPL 3 licenses. Despite this, the move is seen as an opportunity for new open-source alternatives to emerge.",
    "chinese_title": "阿杜伊诺之死？",
    "chinese_summary": "Adafruit Industries 报告称，高通旗下的 Arduino 已悄然修订其服务条款（ToS）和隐私政策，这标志着其与最初的开放硬件精神的显著背离。\n\n新政策引入了对用户上传内容的不可撤销的永久许可、为人工智能功能进行的广泛监控、一项阻止用户识别潜在专利侵权的条款、用户名删除后的长期保留，以及将所有用户数据（包括未成年人）整合到高通的全球数据生态系统。最值得注意的是，未经 Arduino 明确许可，用户现在被禁止对平台进行逆向工程或理解。这一转变将 Arduino 从一个开放社区重新定义为一个专注于数据提取的、受到严格控制的企业服务。\n\n这一声明引发了社区的广泛批评，他们认为这是对学术研究、创客文化和开源原则的严重打击。许多评论者宣称“RIP Arduino”，并提倡使用 RP2040、ESP32 或带有 PlatformIO 的 VSC 等替代方案。批评者指责高通误解了开源社区，并做出了可能导致用户流失的“愚蠢举动”。\n\n然而，一项关键的澄清浮出水面：这些有争议的变更*仅适用于可选的 Arduino 云服务*，并且不影响核心的开源硬件和软件项目，该项目仍受 AGPL 和 GPL 3 许可证的约束。尽管如此，这一举动仍被视为新开源替代方案出现的契机。"
  },
  {
    "id": "45984659",
    "title": "Loose wire leads to blackout, contact with Francis Scott Key bridge",
    "url": "https://www.ntsb.gov:443/news/press-releases/Pages/NR20251118.aspx",
    "summary": "A loose wire aboard the containership Dali has been identified as the cause of blackouts that led to the vessel's collision with Baltimore's Francis Scott Key Bridge. The incident involved the Dali losing power, resulting in contact with the bridge structure.",
    "chinese_title": "电线松动导致停电，并与弗朗西斯·斯科特·基大桥发生接触。",
    "chinese_summary": "导致达利号集装箱船撞上巴尔的摩弗朗西斯·斯科特·基大桥的停电事故，已被查明是由于船上的一根松动电线所引起。此次事故涉及达利号断电，导致其与大桥结构发生接触。"
  },
  {
    "id": "45991787",
    "title": "'Calvin and Hobbes' at 40",
    "url": "https://www.npr.org/2025/11/18/nx-s1-5564064/calvin-and-hobbes-bill-watterson-40-years-comic-strip-lee-salem",
    "summary": "The article celebrates the 40th anniversary of Bill Watterson's iconic comic strip, \"Calvin and Hobbes,\" which first appeared on November 18, 1985. It chronicles the adventures of 6-year-old Calvin and his stuffed tiger, Hobbes, who transforms into a lively, observant companion in Calvin's imagination.\n\nThe beloved strip ran for a decade, concluding in 1995 when Watterson chose to end it at its peak, seeking a \"more thoughtful pace\" and a canvas beyond daily panels, producing little public work since. The strip was praised for its unique blend of the silly, fantastic, and profound.\n\nLee Salem, the strip's editor, who passed away in 2019, shared his initial awe, describing \"Calvin and Hobbes\" as fresh, funny, and featuring an \"archetypal little boy.\" He recalled a favorite strip where Calvin, sick at home, comically learns from a soap opera, an example of the strip's often-missed irony. Salem noted Calvin's resemblance to Tom Sawyer or Huck Finn, navigating a world he \"never made.\"\n\nRenee Montagne highlighted the strip's philosophical depth, citing a moment where Calvin, asked about God, responds, \"Yeah, well, someone is out to get me.\" Salem described Hobbes as Calvin's alter ego and balancing force. He emphasized that Hobbes' reality is defined by Calvin's imagination, making external definitions irrelevant; for Calvin, Hobbes was undeniably a real buddy, companion, and friend.",
    "chinese_title": "《凯文与霍布斯》40周年",
    "chinese_summary": "这篇文章纪念比尔·沃特森（Bill Watterson）的标志性漫画《卡尔文与霍布斯》（Calvin and Hobbes）问世40周年，该漫画于1985年11月18日首次亮相。它讲述了6岁男孩卡尔文和他的毛绒老虎霍布斯的冒险故事，在卡尔文的想象中，霍布斯会变成一个活泼、善于观察的伙伴。\n\n这部深受喜爱的漫画连载了十年，于1995年完结，当时沃特森选择在其巅峰时期结束创作，以寻求“更深思熟虑的节奏”和超越日常连载画幅的创作空间，此后鲜有公开作品问世。该漫画因其独特的幽默、奇幻与深刻的融合而备受赞誉。\n\n该漫画的编辑李·塞勒姆（Lee Salem），已于2019年去世，他分享了自己最初的惊叹，形容《卡尔文与霍布斯》清新、有趣，并刻画了一个“原型式”的小男孩。他回忆起他最喜欢的一篇漫画，其中卡尔文在家生病时，滑稽地从肥皂剧中学习，这是这部漫画中常被忽视的讽刺意味的一个例子。塞勒姆指出，卡尔文与汤姆·索亚或哈克贝利·费恩有相似之处，在一个他“从未创造”的世界中闯荡。\n\n蕾妮·蒙塔涅（Renee Montagne）强调了这部漫画的哲学深度，引用了一个片段，其中卡尔文被问及上帝时，回答说：“嗯，是的，总有人想找我麻烦。”塞勒姆形容霍布斯是卡尔文的“分身”和平衡力量。他强调，霍布斯的真实性是由卡尔文的想象力决定的，外部定义无关紧要；对卡尔文来说，霍布斯无疑是一个真正的伙伴、玩伴和朋友。"
  },
  {
    "id": "45992829",
    "title": "Firefox 147 Will Support the XDG Base Directory Specification",
    "url": "https://www.phoronix.com/news/Firefox-147-XDG-Base-Directory",
    "summary": "Firefox 147 is set to finally support the XDG Base Directory specification, resolving a 21-year-old bug report first opened in September 2004.\n\nCurrently, Firefox places all its files under `~/.mozilla`. With the upcoming Firefox 147 release, the browser will adhere to the XDG specification by properly positioning application data, configuration files, and cached assets within a Linux user's home directory. This means files will be placed in locations like `~/.config` and `~/.local/share`, rather than consolidating everything under `~/.mozilla`.\n\nThis change, which saw its support merged recently, will enable Firefox to integrate more smoothly with other Linux applications that already respect the FreeDesktop.org XDG Base Directory specification, leading to better organization of user files.",
    "chinese_title": "Firefox 147 将支持 XDG 基本目录规范",
    "chinese_summary": "Firefox 147 终于将支持 XDG 基础目录规范，解决了一个长达21年的bug报告，该报告最初于2004年9月提出。\n\n目前，Firefox 将其所有文件都放置在 `~/.mozilla` 下。随着即将发布的 Firefox 147 版本，浏览器将通过在 Linux 用户的家目录中正确地定位应用程序数据、配置文件和缓存资产来遵循 XDG 规范。这意味着文件将被放置在如 `~/.config` 和 `~/.local/share` 等位置，而不是将所有内容都整合在 `~/.mozilla` 下。\n\n这一最近已合并支持的更改，将使 Firefox 能够与其他已经遵循 FreeDesktop.org XDG 基础目录规范的 Linux 应用程序更顺畅地集成，从而更好地组织用户文件。"
  },
  {
    "id": "45991738",
    "title": "Adversarial poetry as a universal single-turn jailbreak mechanism in LLMs",
    "url": "https://arxiv.org/abs/2511.15304",
    "summary": "This paper presents adversarial poetry as a universal single-turn jailbreak mechanism for Large Language Models (LLMs). Researchers tested this technique across 25 frontier proprietary and open-weight models, achieving high attack-success rates (ASR), with some providers exceeding 90%. The study found that poetic attacks successfully transfer across various risk domains, including CBRN, manipulation, cyber-offence, and loss-of-control, as mapped to MLCommons and EU CoP taxonomies.\n\nTo demonstrate this vulnerability systematically, 1,200 MLCommons harmful prompts were converted into verse using a standardized meta-prompt. This method yielded ASRs up to 18 times higher than their prose baselines. Outputs were evaluated by an ensemble of three open-weight LLM judges, validated by human labeling on a stratified subset.\n\nThe results show an average jailbreak success rate of 62% for hand-crafted poetic prompts and approximately 43% for meta-prompt conversions, substantially outperforming non-poetic baselines. These findings reveal a systematic vulnerability across diverse model families and safety training approaches. The authors conclude that stylistic variation alone can circumvent contemporary safety mechanisms, suggesting fundamental limitations in current LLM alignment methods and evaluation protocols.",
    "chinese_title": "对抗性诗歌作为大语言模型中的普适单轮越狱机制",
    "chinese_summary": "本文提出对抗性诗歌作为大型语言模型 (LLMs) 的一种通用的单轮越狱机制。研究人员在25个前沿的专有模型和开源模型上测试了这项技术，取得了高攻击成功率 (ASR)，其中一些供应商的成功率超过90%。研究发现，诗歌形式的攻击成功地跨越了各种风险领域，包括生化核辐射 (CBRN)、操纵、网络攻击和失控，这些风险领域与MLCommons和欧盟行为准则 (CoP) 分类法相对应。\n\n为了系统地证明这一漏洞，研究人员使用一个标准化的元提示将1200个MLCommons有害提示转换成诗歌形式。这种方法产生的ASR比其散文基线高出多达18倍。输出结果由三个开源LLM评审器组成的集合进行评估，并通过对分层子集进行人工标注得到验证。\n\n结果显示，手工制作的诗歌提示的平均越狱成功率为62%，元提示转换的成功率约为43%，显著优于非诗歌基线。这些发现揭示了跨越不同模型家族和安全训练方法的系统性漏洞。作者总结称，仅仅是风格变化就能规避当前的安防机制，这表明了当前LLM对齐方法和评估协议存在根本性局限。"
  },
  {
    "id": "45990934",
    "title": "Interactive World History Atlas Since 3000 BC",
    "url": "http://geacron.com/home-en/",
    "summary": "The \"Interactive World History Atlas Since 3000 BC\" is a comprehensive online resource offering detailed maps and timelines spanning world history from 3000 BC onwards. It delves into various historical themes, including kingdoms, battles, and expeditions. Beyond political and military events, the atlas also covers comparative history, art, science, literature, religion, and philosophy, providing a rich, interdisciplinary view. Its maps are based on a vector database, suggesting high quality and detail. The platform aims to offer an interactive way to explore and understand historical developments across diverse fields.",
    "chinese_title": "始于公元前3000年的互动式世界历史地图集",
    "chinese_summary": "《自公元前3000年以来的互动世界历史地图集》是一个综合性在线资源，提供详细的地图和时间线，涵盖了从公元前3000年至今的世界历史。它深入探讨各种历史主题，包括王国、战役和远征。除了政治和军事事件之外，该地图集还涵盖比较历史、艺术、科学、文学、宗教和哲学，提供了一个丰富、跨学科的视角。其地图基于矢量数据库，这表明了其高质量和高细节度。该平台旨在提供一种互动方式，以探索和理解跨越不同领域的历史发展。"
  },
  {
    "id": "46001889",
    "title": "Olmo 3: Charting a path through the model flow to lead open-source AI",
    "url": "https://allenai.org/blog/olmo3",
    "summary": "Olmo 3 redefines open-source AI by releasing not just state-of-the-art models, but the *entire model flow*—the complete lifecycle encompassing every stage, checkpoint, dataset, and dependency. This unprecedented transparency aims to build trust, enable deeper adaptation, and foster innovation by allowing the community to customize and extend models throughout their development pipeline.\n\nThe release includes a family of compact, dense models (7B and 32B parameters):\n*   **Olmo 3-Base** is positioned as the strongest fully open base model, excelling in programming, math, and reading comprehension, with competitive performance against open-weight models like Qwen 2.5 and Gemma 3.\n*   **Olmo 3-Think** is the flagship reasoning model, unique in allowing inspection of intermediate reasoning traces. The 32B version is the strongest fully open thinking model, competing closely with top open-weight models such as Qwen 3 32B.\n*   **Olmo 3-Instruct** is optimized for chat, instruction following, and tool use, matching or outperforming comparable open-weight models like Llama 3.1.\n*   **Olmo 3-RL Zero** offers a fully open reinforcement learning pathway for research.\n\nA key innovation is the provision of multiple, fully documented development paths, with checkpoints available from every major training milestone (pretraining, mid-training, long-context, and post-training). This empowers users to intervene at any point, customizing data or training stages. All components—data, code, model weights, and checkpoints—are released under permissive open-source licenses, supported by rigorous data curation and advanced training frameworks. Olmo 3 demonstrates strong performance across a broad benchmark suite, leading its fully open class and challenging leading open-weight models.",
    "chinese_title": "Olmo 3：开辟模型流程之路，引领开源AI",
    "chinese_summary": "Olmo 3 通过发布不仅是最先进的模型，更是*完整的模型流*——一个涵盖每个阶段、检查点、数据集和依赖的完整生命周期，重新定义了开源AI。这种前所未有的透明度旨在通过允许社区在其整个开发流程中定制和扩展模型，从而建立信任、实现更深层次的适应性并促进创新。\n\n本次发布包括一系列紧凑、密集的模型（7B和32B参数）：\n*   **Olmo 3-Base** 被定位为最强大的完全开源基础模型，在编程、数学和阅读理解方面表现出色，与Qwen 2.5和Gemma 3等开源权重模型相比，具有竞争力。\n*   **Olmo 3-Think** 是旗舰推理模型，独特之处在于允许检查中间推理痕迹。32B版本是最强大的完全开源思考模型，与Qwen 3 32B等顶级开源权重模型紧密竞争。\n*   **Olmo 3-Instruct** 针对聊天、指令遵循和工具使用进行了优化，媲美或超越Llama 3.1等同类开源权重模型。\n*   **Olmo 3-RL Zero** 为研究提供了一个完全开源的强化学习路径。\n\n一个关键创新是提供了多个、有完整文档的开发路径，并在每个主要训练里程碑（预训练、中期训练、长上下文和后期训练）提供检查点。这使用户能够在任何时候进行干预，定制数据或训练阶段。所有组件——数据、代码、模型权重和检查点——均在宽松的开源许可下发布，并由严格的数据管理和先进的训练框架支持。Olmo 3 在广泛的基准测试套件中表现出强大性能，在其完全开源类别中处于领先地位，并挑战领先的开源权重模型。"
  },
  {
    "id": "45999038",
    "title": "Over-regulation is doubling the cost",
    "url": "https://rein.pk/over-regulation-is-doubling-the-cost",
    "summary": "In a scathing critique, a software entrepreneur turned hardtech founder argues that excessive regulation is doubling the cost of innovation and hindering progress in critical areas like climate solutions and clean energy. Working on carbon removal (Charm Industrial) and electric long-haul trucking (Revoy), the author discovered that over half the cost of building these companies stems from regulatory bottlenecks. This bureaucratic morass not only drains capital but also delays beneficial technologies, lowers US investment, and perpetuates pollution.\n\nFor Charm Industrial, which converts plant residues into bio-oil for carbon sequestration, a four-year delay simply to classify its injection well (Class I, II, or V) cost the company an estimated $90 million in lost operating time. The societal cost from continued biomass burning during this delay amounted to an additional $300 million in public healthcare expenses due to PM2.5 and NOₓ emissions. In total, this single delay cost society approximately $400 million.\n\nSimilarly, Revoy, which electrifies semi-trucks, faced years of delays and millions in legal costs trying to classify its electric \"converter dolly\" across various federal and state agencies. One state agency even demanded a $27 million certification process to prove Revoy's pollution-reducing device doesn't increase emissions.\n\nThe author emphasizes that regulators, though well-intentioned, operate in a broken system characterized by overly complex regulations, understaffing, and fear of lawsuits. This environment defaults to \"no\" for new technologies, wasting time and capital. To foster innovation, the article calls for simplifying regulations, better compensating regulators, limiting frivolous legal challenges, expediting reviews for new tech, and establishing permits by right. Unleashing American ingenuity, it concludes, is crucial for a prosperous, powerful, and clean future.",
    "chinese_title": "过度监管使成本翻倍。",
    "chinese_summary": "在一篇尖锐的批评文章中，一位从软件企业家转型为硬科技创始人的作者指出，过度监管使创新成本翻倍，阻碍了在气候解决方案和清洁能源等关键领域的进展。在从事碳去除（Charm Industrial）和电动长途卡车运输（Revoy）的工作中，作者发现，建立这些公司一半以上的成本源于监管瓶颈。这种官僚泥潭不仅耗尽资金，还拖延有益技术，降低美国投资，并使污染长期存在。\n\n对于将植物残余物转化为生物油进行碳固存的Charm Industrial而言，仅仅为了对其注入井（I类、II类或V类）进行分类而导致的四年延误，就使该公司损失了约9000万美元的运营时间。在此延误期间持续燃烧生物质所造成的社会成本，因PM2.5和NOₓ排放，额外增加了3亿美元的公共医疗开支。总计，这一项延误就给社会造成了约4亿美元的损失。\n\n同样，Revoy致力于半卡车电动化，在试图通过各联邦和州机构对其电动“转换拖车”进行分类时，面临了多年的延误和数百万美元的法律费用。一个州机构甚至要求进行一项耗资2700万美元的认证过程，以证明Revoy的减排设备不会增加排放。\n\n作者强调，监管机构尽管初衷良好，但却在一个充斥着过度复杂法规、人员不足和对诉讼的恐惧的失灵体系中运作。这种环境对新技术默认说“不”，浪费了时间和资金。为了促进创新，文章呼吁简化法规、提高监管人员薪酬、限制无谓的法律挑战、加快新技术审查以及建立“即享许可”制度。文章总结道，释放美国的创造力，对于一个繁荣、强大和清洁的未来至关重要。"
  },
  {
    "id": "45984353",
    "title": "Cognitive and mental health correlates of short-form video use",
    "url": "https://psycnet.apa.org/fulltext/2026-89350-001.html",
    "summary": "The provided content states \"APA PsycNet Loading...\", indicating that the full article text is not available. Therefore, I cannot provide a summary of its specific findings or main points.\n\nHowever, based on the title, \"Cognitive and mental health correlates of short-form video use,\" I can outline the likely scope and key areas this research would address:\n\nThis article would likely investigate the relationships between the consumption of short-form video content (e.g., TikTok, Instagram Reels, YouTube Shorts) and various cognitive functions and mental health outcomes.\n\n**Cognitive Correlates:**\nThe study would probably explore how engagement with rapidly consumed, algorithm-driven video clips impacts:\n*   **Attention Span:** Whether it shortens the ability to sustain focus on single tasks.\n*   **Working Memory:** The capacity to hold and manipulate information.\n*   **Cognitive Load:** The mental effort required, and potential overload from constant stimulation.\n*   **Information Processing:** How individuals absorb and interpret information after frequent exposure to diverse, fleeting content.\n*   **Impulsivity:** Potential links between quick content consumption and impulsive behaviors or decision-making.\n\n**Mental Health Correlates:**\nThe research would delve into associations with various aspects of psychological well-being, such as:\n*   **Anxiety and Depression:** Whether usage patterns correlate with increased symptoms.\n*   **Self-Esteem and Body Image:** The impact of social comparison and curated online realities.\n*   **Social Connection/Loneliness:** How passive consumption affects real-world social interactions.\n*   **Mood Regulation:** The role of dopamine hits and escapism in emotional states.\n*   **Sleep Quality:** Potential disruption due to late-night viewing or overstimulation.\n\nThe study would aim to identify whether specific patterns or intensities of short-form video use are positively or negatively correlated with particular cognitive or mental health outcomes. Such research is crucial for understanding the potential psychological effects of a pervasive digital habit and could inform guidelines for media use, digital literacy programs, and mental health interventions.\n\nTo provide an accurate summary, the full text of the article would be required.",
    "chinese_title": "短视频使用：认知和心理健康相关因素",
    "chinese_summary": "提供的内文显示“APA PsycNet 加载中...”，表明无法获取文章全文。因此，我无法提供其具体发现或主要内容的摘要。\n\n然而，根据标题“短视频使用与认知和心理健康的相关性”，我可以概述这项研究可能涉及的范围和关键领域：\n\n本文可能会调查短视频内容（例如，TikTok、Instagram Reels、YouTube Shorts）的消费与各种认知功能和心理健康结果之间的关系。\n\n**认知相关性：**\n该研究可能会探讨与快速消费、算法驱动的视频片段的互动如何影响：\n*   **注意力广度：** 它是否缩短了维持对单一任务专注的能力。\n*   **工作记忆：** 储存和处理信息的能力。\n*   **认知负荷：** 所需的脑力劳动，以及持续刺激可能导致的潜在超载。\n*   **信息处理：** 个人在频繁接触多样、短暂的内容后如何吸收和解释信息。\n*   **冲动性：** 快速内容消费与冲动行为或决策之间的潜在联系。\n\n**心理健康相关性：**\n该研究将深入探讨与心理健康的各个方面的关联，例如：\n*   **焦虑和抑郁：** 使用模式是否与症状增加相关。\n*   **自尊和身体形象：** 社会比较和精心策划的在线现实的影响。\n*   **社会联系/孤独感：** 被动消费如何影响现实世界中的社交互动。\n*   **情绪调节：** 多巴胺刺激和逃避现实在情绪状态中的作用。\n*   **睡眠质量：** 深夜观看或过度刺激可能导致的潜在干扰。\n\n该研究旨在确定特定模式或强度的短视频使用是否与特定的认知或心理健康结果呈正相关或负相关。此类研究对于理解普遍存在的数字习惯可能产生的心理影响至关重要，并可为媒体使用指南、数字素养项目和心理健康干预措施提供信息。\n\n要提供准确的摘要，需要文章的全文。"
  },
  {
    "id": "45985036",
    "title": "Researchers discover security vulnerability in WhatsApp",
    "url": "https://www.univie.ac.at/en/news/detail/forscherinnen-entdecken-grosse-sicherheitsluecke-in-whatsapp",
    "summary": "Researchers from the University of Vienna and SBA Research uncovered a major privacy vulnerability in WhatsApp's contact discovery mechanism, which allowed for the enumeration of 3.5 billion active accounts worldwide. The flaw enabled querying over 100 million phone numbers per hour, revealing public data like phone numbers, public keys, and if set publicly, profile pictures and \"about\" texts. From this, researchers could infer users' operating systems, account ages, and linked devices. Importantly, end-to-end encrypted message content was unaffected, and no private data was published or shared.\n\nThe study yielded broader insights, including the identification of millions of active WhatsApp accounts in countries where the platform is officially banned (e.g., China, Iran) and population-level data on Android (81%) versus iOS (19%) device distribution. It also highlighted that nearly half of the phone numbers from the 2021 Facebook data leak remain active on WhatsApp, underscoring enduring risks.\n\nThe researchers responsibly disclosed the vulnerability to Meta, which has since implemented countermeasures to mitigate the issue. WhatsApp's Vice President of Engineering, Nitin Gupta, acknowledged the collaboration, stating the study helped stress-test their anti-scraping systems and confirmed no malicious abuse occurred. The researchers stress the critical importance of continuous, independent security research and industry collaboration to safeguard user privacy and ensure the ongoing security of global communication platforms.",
    "chinese_title": "研究人员发现WhatsApp安全漏洞",
    "chinese_summary": "维也纳大学和SBA Research的研究人员发现WhatsApp联系人发现机制存在一个严重的隐私漏洞，该漏洞允许枚举全球35亿活跃账户。该漏洞使得每小时能够查询超过1亿个电话号码，从而揭示电话号码、公钥等公开数据，以及在公开设置情况下，用户的头像和“关于”文本。基于此，研究人员可以推断出用户的操作系统、账户注册时长和关联设备。重要的是，端到端加密的消息内容未受影响，也没有任何私人数据被发布或共享。\n\n这项研究还提供了更广泛的见解，包括在平台被官方禁止的国家（例如中国、伊朗）中识别出数百万活跃的WhatsApp账户，以及关于Android (81%) 和 iOS (19%) 设备分布的人口层面数据。研究还强调，2021年Facebook数据泄露事件中近一半的电话号码在WhatsApp上仍然活跃，这凸显了持续存在的风险。\n\n研究人员已负责任地向Meta披露了该漏洞，Meta此后已实施对策以缓解此问题。WhatsApp工程副总裁Nitin Gupta承认了这项合作，表示该研究有助于对其反抓取系统进行压力测试，并证实没有发生恶意滥用。研究人员强调，持续、独立的安全性研究和行业合作对于保护用户隐私和确保全球通信平台的持续安全至关重要。"
  },
  {
    "id": "45997212",
    "title": "New OS aims to provide (some) compatibility with macOS",
    "url": "https://github.com/ravynsoft/ravynos",
    "summary": "ravynOS is a new open-source operating system project aiming to provide a macOS-like experience and compatibility on x86-64 (and future ARM) systems. Built upon FreeBSD's solid foundation, existing open-source packages, and new code, its core goals include source compatibility with macOS applications and a familiar macOS-style GUI and user experience.\n\nThe OS seeks compatibility with macOS folder layouts, potentially HFS+ and APFS filesystems, and fully supports ZFS. Applications will be self-contained in App Bundles, AppDirs, and AppImage formats for an installer-less experience. While offering a standard Unix environment based on FreeBSD and X11, ravynOS will support Linux binaries via FreeBSD's compatibility layer and eventually target direct compatibility with x86-64/arm64 macOS binaries (Mach-O). The project emphasizes being secure, stable, and performant.\n\nThe project encourages contributions and offers resources like ravynos.com, a CONTRIBUTING.md file, Discord, and Matrix channels. The underlying FreeBSD system, developed over 30 years, is highlighted for its advanced networking, security, and storage features, making it a robust platform for servers, desktops, and embedded systems.",
    "chinese_title": "新系统旨在提供对 macOS 的部分兼容性",
    "chinese_summary": "ravynOS 是一个全新的开源操作系统项目，旨在为 x86-64（以及未来的 ARM）系统提供 macOS 般的体验和兼容性。它建立在 FreeBSD 坚实的基础、现有的开源软件包和新代码之上，其核心目标包括与 macOS 应用程序的源代码兼容性以及熟悉的 macOS 风格图形用户界面和用户体验。\n\n该操作系统寻求与 macOS 文件夹布局的兼容性，可能会兼容 HFS+ 和 APFS 文件系统，并完全支持 ZFS。应用程序将以 App Bundles、AppDirs 和 AppImage 格式自包含，以提供无安装程序体验。在提供基于 FreeBSD 和 X11 的标准 Unix 环境的同时，ravynOS 将通过 FreeBSD 的兼容层支持 Linux 二进制文件，最终目标是直接兼容 x86-64/arm64 macOS 二进制文件 (Mach-O)。该项目强调安全性、稳定性和高性能。\n\n该项目鼓励贡献，并提供 ravynos.com 网站、CONTRIBUTING.md 文件、Discord 和 Matrix 频道等资源。其底层 FreeBSD 系统经过 30 多年的发展，以其先进的网络、安全和存储功能而闻名，使其成为服务器、桌面和嵌入式系统的强大平台。"
  },
  {
    "id": "46003778",
    "title": "How a French judge was digitally cut off by the USA",
    "url": "https://www.heise.de/en/news/How-a-French-judge-was-digitally-cut-off-by-the-USA-11087561.html",
    "summary": "In a high-profile case highlighting the complexities of international legal cooperation and data sovereignty, a French investigative judge found herself digitally isolated by US authorities while investigating a suspected fraud involving a subsidiary of the French pharmaceutical giant Sanofi. The judge, whose identity is protected, was seeking evidence from Google accounts, including emails, but encountered significant roadblocks.\n\nThe US Justice Department, invoking the CLOUD Act, a controversial law allowing US authorities to compel American tech companies to hand over data regardless of where it's stored, informed Google that sharing the data with the French judge would constitute \"unlawful interception\" under US law. This effectively created a Catch-22: Google, an American company, was bound by US law, which contradicted the French judge's legal request.\n\nThis incident underscores a broader struggle between nations over data access and jurisdiction. While mutual legal assistance treaties (MLATs) are supposed to facilitate such exchanges, the US preference for the CLOUD Act often bypasses these established channels, especially when US interests are perceived to be at play. The French judge's experience illustrates the digital \"Iron Curtain\" that can descend, making it nearly impossible for foreign jurisdictions to access evidence held by US tech giants without US approval, even in cases involving their own citizens and territories.",
    "chinese_title": "法国法官如何被美国数字封锁",
    "chinese_summary": "在一个凸显国际司法合作和数据主权复杂性的备受关注的案件中，一名法国调查法官在调查涉及法国制药巨头赛诺菲（Sanofi）一家子公司的涉嫌欺诈案时，发现自己被美国当局“数字隔离”。这位身份受保护的法官正在寻求来自谷歌账户（包括电子邮件）的证据，但遭遇了重重阻碍。\n\n美国司法部援引《云法案》（CLOUD Act）——一项有争议的法律，允许美国当局强制美国科技公司交出数据，无论数据存储在何处——告知谷歌，将数据分享给法国法官将构成美国法律下的“非法截取”。这实际上制造了一个“第22条军规”困境：谷歌作为一家美国公司，受美国法律约束，而美国法律却与法国法官的合法请求相矛盾。\n\n这一事件凸显了各国之间围绕数据访问和管辖权展开的更广泛斗争。尽管《司法互助条约》（MLATs）本应促进此类交流，但美国对《云法案》的偏好常常绕过这些既定渠道，尤其是在涉及美国利益时。这位法国法官的经历说明了可能降下的数字“铁幕”，使得外国司法管辖区在未经美国批准的情况下，几乎不可能访问美国科技巨头持有的证据，即使是在涉及本国公民和领土的案件中。"
  },
  {
    "id": "45984461",
    "title": "Show HN: F32 – An Extremely Small ESP32 Board",
    "url": "https://github.com/PegorK/f32",
    "summary": "The f32 is an extremely small, ultra-compact ESP32 development board (9.85 mm x 8.45 mm) designed to mount behind a USB-C receptacle. Powered by an ESP32-C3FH4 microcontroller, it was created for research and as a \"stress test,\" intentionally ignoring many standard design guidelines, resulting in only one exposed GPIO connected to an LED.\n\nAn example application demonstrates its capabilities by turning the f32 into a captive portal. Users connect to its open WiFi access point and are redirected to a web page where they can toggle the onboard LED, scan for nearby WiFi networks, or view an \"About\" page.\n\nInitially, the board faced connectivity issues due to its minimal antenna circuitry. The creator successfully made it functional by soldering a piece of bent wire onto the chip antenna, achieving a surprising range of approximately 120 feet in clear line-of-sight tests.\n\nThe PCB was manufactured by PCBWay, and the author assembled it at home, detailing the process which involved flux, fine-tip soldering, a hotplate, and a rework station for tiny 01005 components. Firmware can be uploaded using ESP-IDF, Arduino, or esptool.py.\n\nWhile functional, the design deliberately neglects crucial components like proper decoupling capacitors and an antenna matching circuit. The project served as a personal learning experience and research platform, with future ideas including exposing more GPIOs and improving the antenna design.",
    "chinese_title": "展示 HN: F32 —— 一块极小的 ESP32 开发板",
    "chinese_summary": "f32是一款极小、超紧凑的ESP32开发板（9.85毫米x 8.45毫米），旨在安装在USB-C插座后面。它搭载ESP32-C3FH4微控制器，专为研究和“压力测试”而设计，刻意忽略了许多标准设计指南，最终只有一个暴露的GPIO连接到LED。\n\n一个示例应用通过将f32变成一个强制门户来展示其功能。用户连接到其开放的WiFi接入点后，会被重定向到一个网页，可以在该网页上切换板载LED、扫描附近的WiFi网络或查看“关于”页面。\n\n最初，由于其极简的天线电路，该板面临连接问题。创作者通过在芯片天线上焊接一根弯曲的导线，成功使其正常工作，在清晰的视线测试中实现了约120英尺的惊人范围。\n\nPCB由PCBWay制造，作者在家中组装，详细介绍了涉及助焊剂、细尖烙铁、加热板和返修台来处理微小的01005元件的过程。固件可以通过ESP-IDF、Arduino或esptool.py上传。\n\n尽管功能正常，但该设计刻意忽略了关键组件，如适当的去耦电容和天线匹配电路。该项目是一个个人学习经验和研究平台，未来的设想包括暴露更多GPIO并改进天线设计。"
  },
  {
    "id": "45985867",
    "title": "Precise geolocation via Wi-Fi Positioning System",
    "url": "https://www.amoses.dev/blog/wifi-location/",
    "summary": "The article explores the Wi-Fi Positioning System (WPS) as the method behind precise geolocation on devices without GPS, such as laptops, a feature crucial for applications like university attendance verification. The author highlights the inadequacy of IP geolocation for accuracy, explaining that modern browsers utilize the Geolocation API, requiring explicit user consent.\n\nWhen activated, the Geolocation API transmits data about surrounding Wi-Fi access points—including their friendly names (SSIDs), unique identifiers (BSSIDs), and signal strengths (RSSI)—to a location service. This data is then matched against vast databases of Wi-Fi networks and their known physical locations.\n\nHistorically, these databases were built through \"wardriving,\" where vehicles with GPS receivers mapped Wi-Fi networks. Today, major tech companies like Apple, Google, and Microsoft crowdsource this information; users' GPS-enabled devices continuously report visible Wi-Fi hotspots and their locations, often without explicit knowledge, contributing to highly accurate positioning services for all.\n\nWhile beneficial, WPS raises significant privacy concerns. Past controversies include Google Street View cars inadvertently collecting unencrypted Wi-Fi data, and vulnerabilities allowing the tracing of individuals' movements through stored MAC addresses or API exploits. Although providers have improved security and offer opt-out options (e.g., renaming an SSID with \"_nomap\"), these often involve disabling broader location services. The author concludes by noting crowdsourced initiatives like WiGLE.net and expressing surprise at the widespread, often unconscious, contribution to this global positioning infrastructure.",
    "chinese_title": "基于Wi-Fi定位系统的精准地理定位",
    "chinese_summary": "本文探讨了 Wi-Fi 定位系统 (WPS)，作为在没有 GPS 的设备（如笔记本电脑）上实现精准地理定位的方法，这一功能对于大学考勤验证等应用至关重要。作者强调 IP 地理定位精度不足，并解释说现代浏览器使用地理定位 API，需要明确的用户同意。\n\n激活后，地理定位 API 会将周围 Wi-Fi 接入点的数据——包括它们的友好名称 (SSID)、唯一标识符 (BSSID) 和信号强度 (RSSI)——传输到定位服务。然后，这些数据会与庞大的 Wi-Fi 网络及其已知物理位置数据库进行匹配。\n\n历史上，这些数据库是通过“驾车扫描”建立的，即装有 GPS 接收器的车辆会测绘 Wi-Fi 网络。如今，苹果、谷歌和微软等主要科技公司通过众包方式获取这些信息；用户的 GPS 设备会持续报告可见的 Wi-Fi 热点及其位置，通常是在用户不知情的情况下，从而为所有人提供高精度定位服务。\n\n尽管 WPS 有益，但也引发了严重的隐私问题。过去的争议包括谷歌街景车无意中收集未加密的 Wi-Fi 数据，以及允许通过存储的 MAC 地址或 API 漏洞利用来追踪个人行踪的漏洞。尽管服务提供商已改进安全性并提供选择退出选项（例如，将 SSID 重命名为 \"_nomap\"），但这些通常涉及禁用更广泛的定位服务。作者最后提到了 WiGLE.net 等众包计划，并对这种对全球定位基础设施广泛且通常是无意识的贡献表示惊讶。"
  },
  {
    "id": "45989469",
    "title": "PHP 8.5",
    "url": "https://stitcher.io/blog/new-in-php-85",
    "summary": "PHP 8.5, released on November 20, 2025, introduces several significant features and improvements. A major addition is the **pipe operator (`|>`)**, streamlining function chaining and making code more readable than deeply nested calls.\n\nThe release also brings **`clone with`**, allowing new values to be assigned to object properties during cloning, although it has limitations with `readonly` properties. A new **`#[NoDiscard]` attribute** can mark functions whose return values must be consumed, triggering a warning if unused, suppressible by the new `(void)` cast.\n\n**Closure improvements** now permit static closures and first-class callables in constant expressions, including attributes. Debugging is enhanced with **backtraces for fatal errors**. Convenience functions **`array_first()` and `array_last()`** are now built-in.\n\nA new **URI implementation** (`Uri\\Rfc3986\\Uri`) simplifies URI parsing. The **`#[DelayedTargetValidation]` attribute** postpones attribute validation to runtime, aiding backwards compatibility.\n\nSmaller changes include asymmetric visibility for static properties, attribute support on compile-time non-class constants, `#[Override]` for properties, and `Dom\\Element::$outerHTML`.\n\nKey deprecations and breaking changes include the removal of non-standard casts like `(boolean)`, deprecation of backticks as an alias for `shell_exec()`, deprecation of constant redeclaration, and removal of the `disabled_classes` ini setting.",
    "chinese_title": "PHP 8.5",
    "chinese_summary": "PHP 8.5 于 2025 年 11 月 20 日发布，引入了多项重要特性和改进。一个主要新增功能是**管道操作符 (`|>`)**，它简化了函数链式调用，使代码比深度嵌套调用更具可读性。\n\n此次发布还带来了 **`clone with`**，允许在克隆对象时为对象属性分配新值，尽管它对 `readonly` 属性有限制。新的 **`#[NoDiscard]` 属性**可以标记那些返回值必须被消费的函数，如果未使用则会触发警告，该警告可通过新的 `(void)` 类型转换来抑制。\n\n**闭包改进**现在允许在常量表达式中使用静态闭包和一级可调用对象，包括属性。通过为**致命错误提供回溯（backtraces）**，调试功能得到了增强。便捷函数 **`array_first()` 和 `array_last()`** 现已内置。\n\n新的 **URI 实现**（`Uri\\Rfc3986\\Uri`）简化了 URI 解析。**`#[DelayedTargetValidation]` 属性**将属性验证推迟到运行时，有助于向后兼容。\n\n较小的变化包括静态属性的非对称可见性、编译时非类常量的属性支持、属性的 `#[Override]`，以及 `Dom\\Element::$outerHTML`。\n\n主要的弃用和重大变更包括：移除非标准类型转换（如 `(boolean)`）、弃用反引号作为 `shell_exec()` 的别名、弃用常量重复声明，以及移除 `disabled_classes` ini 设置。"
  },
  {
    "id": "45984970",
    "title": "Microsoft AI CEO pushes back against critics after recent Windows AI backlash",
    "url": "https://www.windowscentral.com/microsoft/windows-11/microsoft-ai-ceo-pushes-back-against-critics-after-recent-windows-ai-backlash-the-fact-that-people-are-unimpressed-is-mindblowing-to-me",
    "summary": "Microsoft AI CEO Mustafa Suleyman has publicly challenged critics who find artificial intelligence \"underwhelming,\" expressing disbelief given the advanced capabilities like fluent conversation and media generation compared to his youth playing Snake.\n\nHis remarks come amidst significant user backlash against Microsoft's aggressive AI integration into Windows. Recently, Windows president Pavan Davuluri faced severe criticism for discussing an \"agentic OS,\" forcing him to disable replies on a post. Compounding this, a recent report from The Verge found Copilot's actual performance falls short of Microsoft's advertising claims.\n\nThis timing is problematic for Microsoft, which has just launched \"Your canvas for AI\" as Windows' new tagline and is pushing to evolve Windows into an \"agentic OS\" driven by AI agents. However, the current state of Copilot makes this vision seem like a \"pipe dream\" to many.\n\nThe article highlights a \"perception problem\" for Microsoft, as many users feel the company's \"obsession with AI\" is misplaced. Critics argue Microsoft should prioritize fixing fundamental Windows issues instead of \"shoving AI into every UI surface.\" Despite Davuluri acknowledging the need for improvements, the author is skeptical that Microsoft, now primarily an \"AI company,\" will deliver a Windows version not bloated with unwanted AI functionality. Suleyman's comments are seen as unhelpful, reinforcing the company's commitment to pervasive AI.",
    "chinese_title": "微软AI首席执行官在Windows AI近期反弹后回击批评者。",
    "chinese_summary": "微软人工智能首席执行官穆斯塔法·苏莱曼公开挑战那些认为人工智能“表现平平”的批评者，他表示，鉴于人工智能已具备流畅对话和媒体生成等先进能力，这与他年轻时玩《贪吃蛇》的时代相比，让他感到难以置信。\n\n他的言论发表之际，正值用户对微软将人工智能积极整合到Windows中的做法反应强烈。最近，Windows总裁帕万·达瓦卢里因讨论“智能代理操作系统”（agentic OS）而面临严厉批评，迫使他关闭了某帖子的评论功能。雪上加霜的是，《The Verge》最近的一份报告发现，Copilot的实际表现远未达到微软的宣传。\n\n这一时机对微软来说很成问题，该公司刚刚推出“你的AI画板”（Your canvas for AI）作为Windows的新标语，并正在推动将Windows发展成为一个由AI代理驱动的“智能代理操作系统”。然而，Copilot的现状让许多人觉得这一愿景无异于“白日梦”。\n\n文章强调了微软面临的“认知问题”，许多用户认为该公司“对人工智能的痴迷”是不合时宜的。批评者认为，微软应该优先解决Windows的基本问题，而不是“将人工智能硬塞进每一个用户界面”。尽管达瓦卢里承认需要改进，但作者怀疑微软——现在主要是一家“人工智能公司”——是否会推出一个没有充斥着不必要AI功能的Windows版本。苏莱曼的评论被认为无济于事，反而强化了该公司对普及人工智能的承诺。"
  },
  {
    "id": "45996585",
    "title": "Data-at-Rest Encryption in DuckDB",
    "url": "https://duckdb.org/2025/11/19/encryption-in-duckdb",
    "summary": "DuckDB v1.4 introduces transparent data-at-rest encryption, a significant feature for data security and compliance, addressing limitations seen in other databases. It supports industry-standard AES-GCM-256 and AES-CTR-256 ciphers. AES-GCM-256 is recommended as it provides data authentication via a tag, while AES-CTR-256 is faster but lacks this integrity check. Both symmetric ciphers require a unique Initialization Vector (IV)/nonce and a 256-bit key.\n\nThe implementation keeps the main database header plaintext but sets a flag and stores metadata like a database identifier (salt) and an encrypted canary for key verification. User-provided keys are never used directly; a Key Derivation Function (KDF) transforms them into secure 32-byte derived keys, which are cached in memory and the original keys immediately wiped.\n\nAll other database headers, data blocks (default 256KB), and Write-Ahead Logs (WAL) are encrypted. Encrypted blocks use a 40-byte header to store a plaintext nonce/IV and an optional tag, with the checksum itself encrypted. WAL entries are individually encrypted, incorporating a plaintext length, nonce, encrypted checksum, and the encrypted data.\n\nTemporary files, used for large, out-of-core operations, are also automatically encrypted to protect sensitive intermediate data. This occurs when an encrypted database is attached or `temp_file_encryption` is enabled. These temporary files use internally generated keys, making them irrecoverable if a database crash occurs.\n\nUsers can encrypt new or existing databases, or re-encrypt them, by using `ATTACH` commands with `ENCRYPTION_KEY` and `ENCRYPTION_CIPHER` parameters. Encryption can be verified by observing high data entropy using tools like `ent` or visually inspecting binary data for randomness. Decryption similarly uses the `COPY FROM DATABASE` command.",
    "chinese_title": "DuckDB 静止数据加密",
    "chinese_summary": "DuckDB v1.4 引入了透明的静态数据加密功能，这是数据安全性和合规性的一个重要特性，解决了其他数据库中存在的局限性。它支持行业标准的 AES-GCM-256 和 AES-CTR-256 加密算法。推荐使用 AES-GCM-256，因为它通过标签提供了数据认证；而 AES-CTR-256 速度更快，但缺少此完整性检查。这两种对称加密算法都需要一个唯一的初始化向量（IV）/随机数和一个 256 位密钥。\n\n该实现将主数据库头保持明文，但会设置一个标志并存储元数据，例如数据库标识符（盐值）和用于密钥验证的加密金丝雀值。用户提供的密钥从不直接使用；密钥派生函数（KDF）会将其转换为安全的 32 字节派生密钥，这些派生密钥会被缓存在内存中，而原始密钥则立即清除。\n\n所有其他数据库头、数据块（默认为 256KB）和预写日志（WAL）都经过加密。加密块使用一个 40 字节的头部来存储明文随机数/IV 和一个可选标签，并且校验和本身也被加密。WAL 条目是单独加密的，其中包含明文长度、随机数、加密校验和以及加密数据。\n\n用于大型、内存外操作的临时文件也会自动加密，以保护敏感的中间数据。当附加一个加密数据库或启用 `temp_file_encryption` 时，就会发生这种情况。这些临时文件使用内部生成的密钥，如果数据库崩溃，将无法恢复。\n\n用户可以通过使用带有 `ENCRYPTION_KEY` 和 `ENCRYPTION_CIPHER` 参数的 `ATTACH` 命令来加密新的或现有数据库，或重新加密它们。加密可以通过使用像 `ent` 这样的工具观察高数据熵，或目视检查二进制数据的随机性来验证。解密类似地使用 `COPY FROM DATABASE` 命令。"
  },
  {
    "id": "45989329",
    "title": "Basalt Woven Textile",
    "url": "https://materialdistrict.com/material/basalt-woven-textile/",
    "summary": "The Basalt Woven Textile, developed by Vulkan Europe, is an innovative material created by melting basalt rock at 1,400°C and extruding it into filaments, which are then woven. This textile offers exceptional properties.\n\nMechanically, it boasts a tensile strength more than double that of steel, with a specific strength 2.5 times that of alloyed steel and 1.5 times that of glass fiber. It exhibits high corrosive and chemical resistance, particularly to salt, acid, and alkali solutions.\n\nThe material is highly thermally stable, capable of withstanding temperatures up to 700°C, and some compositions up to 800°C, making it suitable for heat-insulating items. Additionally, basalt fibers possess excellent electric-insulating characteristics and transparency to electromagnetic radiation, enabling their use in electrical insulation for both low-voltage (250V) and high-voltage (500V) equipment.\n\nSensory properties include a satin gloss, smooth texture, soft hardness, and warm feel. Technically, it offers good fire, UV, weather, scratch, and chemical resistance, all while being lightweight. Introduced in 2015, this material from the Netherlands represents a significant advancement in natural stone textiles.",
    "chinese_title": "玄武岩织物",
    "chinese_summary": "由Vulkan Europe开发的玄武岩编织纺织品，是一种创新材料，通过将玄武岩在1400°C下熔化并挤压成长丝，然后编织而成。这种纺织品具有卓越的性能。\n\n在力学性能方面，其拉伸强度是钢的两倍多，比强度是合金钢的2.5倍，是玻璃纤维的1.5倍。它具有高耐腐蚀性和耐化学性，特别耐盐溶液、酸溶液和碱溶液。\n\n该材料具有高热稳定性，能够承受高达700°C的温度，某些配方甚至可达800°C，使其适用于隔热产品。此外，玄武岩纤维还具有优异的电绝缘特性和对电磁辐射的透明性，使其可用于低压(250V)和高压(500V)设备的电气绝缘。\n\n在感官特性方面，它具有绸缎般的光泽、光滑的质地、软硬适中和温暖的触感。在技术上，它具有良好的耐火性、抗紫外线、耐候性、耐刮擦性和耐化学性，同时质地轻盈。该材料于2015年推出，这种来自荷兰的材料代表着天然石材纺织领域的重大进步。"
  },
  {
    "id": "45987179",
    "title": "Verifying your Matrix devices is becoming mandatory",
    "url": "https://element.io/blog/verifying-your-devices-is-becoming-mandatory-2/",
    "summary": "A new, coordinated security fix for all Matrix server implementations has been published as part of the Matrix 1.16 off-cycle spec update. This crucial update makes verifying Matrix devices mandatory. The security fix, aimed at enhancing the platform's overall security, was announced on August 11, 2025.",
    "chinese_title": "验证您的Matrix设备将成为强制要求。",
    "chinese_summary": "作为 Matrix 1.16 非周期性规范更新的一部分，一项针对所有 Matrix 服务器实现的新的、协调一致的安全修复已发布。这项关键更新强制要求验证 Matrix 设备。该安全修复旨在增强平台整体安全性，并于 2025 年 8 月 11 日公布。"
  },
  {
    "id": "46002989",
    "title": "HP and Dell disable HEVC support built into their laptops' CPUs",
    "url": "https://arstechnica.com/gadgets/2025/11/hp-and-dell-disable-hevc-support-built-into-their-laptops-cpus/",
    "summary": "HP and Dell are disabling built-in HEVC/H.265 hardware decoding on some of their laptops, despite the processors having integrated support. This affects models like HP's ProBook 460/465 G11 and EliteBook 665 G11, where HP explicitly notes the feature is disabled. Dell is also doing this on certain models, such as the Dell 16 Plus 2-in-1, unless they include specific components like discrete graphics, a 4K display, or Dolby Vision.\n\nThis decision leads to significant user frustration and performance issues. Users experience web browsers failing to play HEVC content smoothly, often requiring workarounds like disabling hardware acceleration, which degrades system performance and removes features like background blurring.\n\nWhen asked for comment, neither HP nor Dell explained their reasoning, instead suggesting customers utilize licensed third-party software for HEVC support or purchase premium systems.\n\nThe article speculates that the primary motive is to minimize rising HEVC licensing costs. Royalty rates for HEVC are set to increase in January, with fees climbing from $0.20 to $0.24 per unit for high-volume sales. Given the millions of devices HP and Dell sell, these royalties can be substantial. Companies like Synology have also recently ended HEVC support due to licensing complexities. This move is causing confusion and frustration among users who expect modern, often expensive, laptops to handle common video codecs seamlessly.",
    "chinese_title": "惠普和戴尔禁用其笔记本电脑CPU内置的HEVC支持",
    "chinese_summary": "惠普和戴尔正在禁用其部分笔记本电脑中内置的HEVC/H.265硬件解码功能，尽管处理器本身集成了支持。这影响了惠普的ProBook 460/465 G11和EliteBook 665 G11等型号，惠普明确指出这些功能已被禁用。戴尔也在某些型号上这样做，例如Dell 16 Plus 2合1，除非它们包含独立显卡、4K显示屏或杜比视界等特定组件。\n\n这一决定导致用户极度不满和性能问题。用户发现网页浏览器无法流畅播放HEVC内容，常常需要采取变通方法，例如禁用硬件加速，但这会降低系统性能并移除背景模糊等功能。\n\n当被问及原因时，惠普和戴尔均未解释其理由，反而建议客户使用获得许可的第三方软件来支持HEVC，或购买高端系统。\n\n文章推测，主要动机是为了最大限度地降低不断上涨的HEVC许可费用。HEVC的版税费率定于一月份上涨，对于大批量销售，每单位费用将从0.20美元攀升至0.24美元。考虑到惠普和戴尔销售数百万台设备，这些版税可能会非常可观。群晖等公司也因许可复杂性而最近停止了对HEVC的支持。此举正在用户中引起困惑和不满，他们期望现代、通常价格不菲的笔记本电脑能够无缝处理常见的视频编解码器。"
  },
  {
    "id": "45995834",
    "title": "NTSB Preliminary Report – UPS Boeing MD-11F Crash [pdf]",
    "url": "https://www.ntsb.gov/Documents/Prelimiary%20Report%20DCA26MA024.pdf",
    "summary": "The provided content states \"Page not found.\" Therefore, it is not possible to summarize the NTSB preliminary report on the UPS Boeing MD-11F crash, as the actual content of the report is missing.",
    "chinese_title": "国家运输安全委员会初步报告——联合包裹波音MD-11F坠机 [pdf]",
    "chinese_summary": "提供的内容显示“找不到页面。”因此，无法总结NTSB关于UPS波音MD-11F坠机事件的初步报告，因为报告的实际内容缺失。"
  },
  {
    "id": "46006016",
    "title": "Show HN: Wealthfolio 2.0- Open source investment tracker. Now Mobile and Docker",
    "url": "https://wealthfolio.app/?v=2.0",
    "summary": "Wealthfolio 2.0 is an open-source, private investment tracker that runs locally on Desktop, Mobile, Web, and Docker, allowing users to manage their wealth while maintaining full control over their data. With over 5,000 GitHub stars, it emphasizes a privacy-first approach, ensuring data never leaves the user's device, and offers a beautiful, easy-to-use interface. It's free to use with an optional one-time payment, avoiding subscriptions.\n\nKey features include accounts aggregation, enabling users to gather all investment and savings accounts in one place, with CSV import functionality. It provides a comprehensive holdings overview for stocks, ETFs, and cryptocurrencies, alongside a performance dashboard to track investments, compare accounts, and benchmark against market indexes like the S&P 500.\n\nUsers can also monitor dividends and interest income, track individual account performance over time, and set and monitor financial goals. A crucial feature is the tracking of contribution rooms and limits for tax-advantaged accounts (e.g., IRAs, 401(k)s), helping prevent over-contribution. Wealthfolio is further extensible with powerful add-ons, such as an Investment Fees Tracker, Goal Progress Tracker, and Stock Trading Tracker, enhancing its functionality.",
    "chinese_title": "HN 展示: Wealthfolio 2.0 - 开源投资追踪器。现已支持移动端和 Docker。",
    "chinese_summary": "Wealthfolio 2.0 是一款开源的私人投资追踪器，可在桌面、移动设备、网页和 Docker 上本地运行，让用户在管理财富的同时完全掌控自己的数据。它在 GitHub 上拥有超过5,000颗星，强调隐私优先，确保数据绝不离开用户设备，并提供美观易用的界面。用户可免费使用，也可选择一次性付费，无需订阅。\n\n主要功能包括账户聚合，允许用户将所有投资和储蓄账户汇集一处，并支持 CSV 导入功能。它提供股票、ETF 和加密货币的全面持仓概览，以及一个性能仪表板，用于追踪投资、比较账户并与标普500指数等市场基准进行对标。\n\n用户还可以监控股息和利息收入，跟踪各个账户的历史表现，并设定和监控财务目标。一个关键功能是追踪免税账户（例如 IRA、401(k) 等）的缴款空间和限额，有助于防止超额缴款。Wealthfolio 还可通过强大的附加组件进行扩展，例如投资费用追踪器、目标进度追踪器和股票交易追踪器，从而增强其功能。"
  },
  {
    "id": "45993943",
    "title": "The Banished Bottom of the Housing Market",
    "url": "https://www.ryanpuzycki.com/p/the-banished-bottom-of-the-housing",
    "summary": "The article \"The Banished Bottom of the Housing Market\" argues that America's modern homelessness crisis stems from the deliberate destruction of its cheapest housing option: Single-Room Occupancy (SRO) units. Historically, SROs, including those provided by the YMCA, offered affordable, market-rate furnished rooms with shared facilities, serving low-income individuals, young workers, and marginalized groups. At its 1940 peak, the YMCA alone housed over 100,000 people.\n\nHowever, from the Progressive Era onward, SROs were systematically dismantled. Reformers, viewing them as \"caldrons of social evil\" and championing single-family homes, enacted discriminatory building codes, health ordinances, exclusionary zoning, and \"unrelated occupancy\" limits. Urban renewal and economic shifts further targeted SRO districts. Millions of these rooms disappeared, starving a vital housing market. The subsequent deinstitutionalization of mental patients in the 1970s, combined with shrinking SRO supply, directly fueled the homelessness wave of the late 1970s and 80s, a crisis that persists today with nearly 800,000 unhoused individuals.\n\nThe author proposes re-legalizing shared housing or \"co-living,\" advocating for the conversion of vacant office spaces into deeply affordable rooms. This approach could yield many more units at a fraction of the cost of new apartments. Yet, current zoning, building codes, and occupancy limits often render such solutions illegal or economically unfeasible. The article concludes that restoring this \"banished bottom\" of the housing market is crucial for addressing the pervasive need for deeply affordable housing.",
    "chinese_title": "绝迹的楼市底部",
    "chinese_summary": "文章《住房市场中被驱逐的底层》认为，美国的现代无家可归危机源于其最廉价住房选择——单间出租房（SRO）单元——被蓄意破坏。历史上，SRO，包括青年会（YMCA）提供的那些，提供价格可负担、市场价格的带家具房间和共享设施，服务于低收入个人、年轻工人及边缘群体。在1940年鼎盛时期，仅青年会就曾为超过10万人提供住宿。\n\n然而，从进步时代开始，SRO被系统性地拆除。改革者们将其视为“社会罪恶的温床”，并倡导独栋住宅，颁布了歧视性建筑规范、卫生条例、排他性分区规划和“非亲属居住”限制。城市更新和经济转型进一步针对SRO区域。数百万间此类房间消失，扼杀了一个重要的住房市场。1970年代精神病患者的去机构化，加上SRO供应的萎缩，直接助长了1970年代末和1980年代的无家可归潮，这一危机至今仍未解决，目前有近80万无家可归者。\n\n作者提议重新合法化共享住房或“共居”模式，倡导将空置办公空间改造成深度可负担的房间。这种方法可以以新建公寓成本的一小部分，提供多得多的单元。然而，当前的分区规划、建筑规范和居住限制常常使得这些解决方案不合法或在经济上不可行。文章总结道，恢复住房市场中这个“被驱逐的底层”对于解决普遍存在的对深度可负担住房的需求至关重要。"
  },
  {
    "id": "45985196",
    "title": "How Slide Rules Work",
    "url": "https://amenzwa.github.io/stem/ComputingHistory/HowSlideRulesWork/",
    "summary": "The article \"How Slide Rules Work\" provides a historical overview and explanation of this once-ubiquitous computing device. It traces computational history from ancient measurements to John Napier's 1614 invention of logarithms, which simplified multiplication and division into addition and subtraction. This led to Edmund Gunter's logarithmic scale (1620) and William Oughtred's first practical slide rule (1622). For almost four centuries, slide rules were essential tools for engineers, scientists, and professionals across diverse fields, from the Industrial Revolution to space exploration, embodying \"capability through simplicity.\"\n\nThe author shares a personal connection, having used slide rules as an engineering student in Burma before electronic calculators became affordable. His primary goal is to preserve the knowledge of how this ingenious device works, focusing on its operational principles rather than acting as a \"how-to\" guide. He recommends readers acquire a K&E 4081-3 or Post 1460 slide rule to follow the explanations.\n\nA slide rule comprises three independent components: the stationary body, the movable slide, and the gliding cursor with a hairline. Its fundamental operation mechanizes the properties of logarithms: converting multiplication ($a × b = log^{-1}[log(a) + log(b)]$) and division ($a ÷ b = log^{-1}[log(a) - log(b)]$) into simple physical addition or subtraction of lengths on identical logarithmic scales (typically labeled C and D). These scales are constructed non-linearly, representing the logarithms of numbers, thus allowing complex calculations via mechanical manipulation.",
    "chinese_title": "计算尺工作原理",
    "chinese_summary": "文章《计算尺如何工作》提供了对这种曾无处不在的计算工具的历史概述和解释。它追溯了计算史，从古代测量到约翰·纳皮尔1614年发明的对数，后者将乘除法简化为加减法。这促成了埃德蒙·冈特1620年的对数刻度尺以及威廉·奥特雷德1622年的第一把实用计算尺。近四个世纪以来，计算尺一直是工程师、科学家以及各行各业专业人士的必备工具，从工业革命到太空探索，它体现了“以简驭繁”的理念。\n\n作者分享了自己的亲身经历，在电子计算器普及之前，他曾在缅甸作为一名工程系学生使用计算尺。他的主要目标是保留这种巧妙设备的工作原理知识，侧重于其操作原理，而非作为一份“操作指南”。他建议读者购置K&E 4081-3或Post 1460型号的计算尺来理解这些解释。\n\n计算尺由三个独立部件组成：固定的尺身、可移动的游尺以及带有游标线的光标。其基本操作是机械化地利用对数性质：将乘法（$a × b = log^{-1}[log(a) + log(b)]$)和除法（$a ÷ b = log^{-1}[log(a) - log(b)]$)转换为在相同的对数刻度（通常标记为C和D）上进行简单的物理长度加减。这些刻度是非线性构造的，代表数字的对数，从而通过机械操作实现复杂的计算。"
  },
  {
    "id": "45995816",
    "title": "The Lions Operating System",
    "url": "https://lionsos.org",
    "summary": "The Lions Operating System (#LionsOS) is an actively researched and developed OS by the Trustworthy Systems research group at UNSW Sydney, Australia. While not yet stable or concretely verified, it is available for experimentation.\n\nBuilt upon the seL4 microkernel, LionsOS aims to make seL4's inherent performance, security, and reliability accessible. It diverges from conventional operating systems by providing composable components, joined via the Microkit tool, for creating custom OSes tailored to specific tasks.\n\nIts design principles, detailed in the sDDF document, include connecting components through efficient, model-checked lock-free queues. Components are single-purpose (e.g., drivers solely interface with hardware via queues), while \"virtualisers\" handle multiplexing, control, and address conversions. Information sharing is deliberately minimal, occurring only via queues or published pages. The system is static, not adapting to changing hardware or loading new components at runtime, though it supports swapping existing component types at runtime for policy changes or VM reboots. The project encourages community contributions and pull requests to expand its component ecosystem.",
    "chinese_title": "狮子操作系统",
    "chinese_summary": "Lions操作系统（#LionsOS）是澳大利亚悉尼新南威尔士大学可信系统研究组正在积极研究和开发的操作系统。虽然尚未稳定或经过具体验证，但可供实验使用。\n\nLionsOS建立在seL4微内核之上，旨在使seL4固有的性能、安全性与可靠性变得易于利用。它通过提供可组合的组件，并利用Microkit工具连接这些组件，从而与传统操作系统区别开来，用于创建针对特定任务的定制操作系统。\n\n其设计原则（详见sDDF文档）包括通过高效、经过模型验证的无锁队列连接组件。组件是单一用途的（例如，驱动程序仅通过队列与硬件交互），而“虚拟器”则处理多路复用、控制和地址转换。信息共享被有意地最小化，仅通过队列或已发布页面进行。该系统是静态的，不适应变化的硬件或在运行时加载新组件，但支持在运行时交换现有组件类型以实现策略更改或虚拟机重启。该项目鼓励社区贡献和拉取请求，以扩展其组件生态系统。"
  },
  {
    "id": "45999024",
    "title": "France is taking state actions against GrapheneOS?",
    "url": "https://grapheneos.social/@GrapheneOS/115584160910016309",
    "summary": "The article indicates that GrapheneOS has made an allegation against France. A statement from GrapheneOS's official Mastodon account claims that \"France is taking state actions…\" against the privacy-focused mobile operating system. While the source of this serious claim is identified, the provided text does not offer any specific details or further context regarding the nature of these alleged state actions. The remainder of the content is a standard Mastodon message, unrelated to the core claim, advising users to enable JavaScript for the web application or use a dedicated app.",
    "chinese_title": "法国正在对GrapheneOS采取国家行动？",
    "chinese_summary": "文章指出 GrapheneOS 对法国提出了指控。GrapheneOS 官方 Mastodon 账户发布声明称，法国正在对这款专注于隐私的移动操作系统“采取国家行动……”尽管这项严重指控的来源已被确认，但所提供的文本并未提供有关这些所谓国家行动性质的任何具体细节或进一步背景信息。内容的其余部分是一条标准的 Mastodon 消息，与核心指控无关，建议用户为网络应用程序启用 JavaScript 或使用专用应用程序。"
  },
  {
    "id": "46002161",
    "title": "It's hard to build an oscillator",
    "url": "https://lcamtuf.substack.com/p/its-hard-to-build-an-oscillator",
    "summary": "In his article \"It's hard to build an oscillator,\" lcamtuf describes the surprising difficulty in creating a reliable oscillator, even for seemingly simple tasks like generating a 50% duty cycle square wave. He recounts a practical challenge where a basic microcontroller's PWM output was unreliable, causing a power supply to shut down due to a momentary short.\n\nThe core issue lies in the imperfections of real-world components and circuit design. While ideal components can create a perfect oscillator, practical designs are plagued by:\n*   **Component tolerances:** Resistors, capacitors, and transistors deviate from their stated values.\n*   **Parasitic effects:** Stray capacitance, inductance, and resistance within the circuit board and components.\n*   **Noise:** Electromagnetic interference (EMI) and power supply noise.\n*   **Temperature variations:** Component characteristics change with temperature.\n\nHe illustrates this with examples of common oscillator types:\n*   **RC timers (e.g., 555 timer):** Highly susceptible to component tolerances, supply voltage changes, and temperature, leading to inconsistent frequencies and duty cycles. Achieving a perfect 50% duty cycle is particularly challenging.\n*   **Ring oscillators:** Fast but sensitive to manufacturing variations and supply voltage.\n*   **Crystal oscillators:** Offer high precision but are more complex and require careful matching of load capacitors.\n\nThe author concludes that while basic oscillators can be quickly prototyped, achieving a stable, precise, and robust design for production often requires significant engineering effort, careful component selection, layout considerations, and potentially advanced techniques like frequency-locked loops. The \"easy\" part is getting *something* to oscillate; the \"hard\" part is making it work *well* and reliably in diverse conditions.",
    "chinese_title": "振荡器很难建造",
    "chinese_summary": "lcamtuf 在他的文章《振荡器很难制作》中，描述了创建可靠振荡器所面临的惊人困难，即使是生成50%占空比方波这样看似简单的任务也如此。他讲述了一个实际案例，其中一个基本微控制器的PWM输出不可靠，导致电源因瞬时短路而关闭。\n\n核心问题在于现实世界中元件和电路设计的不完善。尽管理想元件可以创建完美的振荡器，但实际设计却受以下因素困扰：\n*   **元件容差：** 电阻器、电容器和晶体管的实际值会偏离其标称值。\n*   **寄生效应：** 电路板和元件内部的寄生电容、电感和电阻。\n*   **噪声：** 电磁干扰 (EMI) 和电源噪声。\n*   **温度变化：** 元件特性随温度变化。\n\n他通过常见振荡器类型的例子对此进行了阐述：\n*   **RC 定时器（例如 555 定时器）：** 极易受元件容差、电源电压变化和温度的影响，导致频率和占空比不稳定。实现完美的 50% 占空比尤其困难。\n*   **环形振荡器：** 速度快，但对制造差异和电源电压敏感。\n*   **晶体振荡器：** 提供高精度，但更复杂，需要仔细匹配负载电容。\n\n作者总结道，虽然基本的振荡器可以快速制作原型，但要为生产实现稳定、精确和鲁棒的设计，通常需要大量的工程投入、细致的元件选择、布局考量，以及可能的高级技术，例如锁频环。“简单”的部分是让 *某个东西* 振荡起来；“困难”的部分是在各种条件下使其 *良好* 且可靠地工作。"
  },
  {
    "id": "46003144",
    "title": "FAWK: LLMs can write a language interpreter",
    "url": "https://martin.janiczek.cz/2025/11/21/fawk-llms-can-write-a-language-interpreter.html",
    "summary": "The author, an \"FP-pilled\" programmer, found traditional AWK challenging for an Advent of Code problem, struggling with its limitations like mutable state, dynamic scope, and inability to return arrays from functions. This led to a vision for \"FAWK,\" a modern, functional iteration of AWK incorporating desired features: first-class arrays (passed by value, returnable), first-class functions and lambdas, lexical scope, explicit globals, and even pipelines.\n\nInstead of manual implementation, the author leveraged an LLM (Cursor Agent with Sonnet 4.5) to build a Python interpreter for FAWK. To their surprise, the LLM impressively succeeded, handling complex programming language constructs like multi-dimensional arrays, print statement/expression duality, lexical scoping, and closures, while also generating extensive test suites. The only notable struggle was with arbitrary precision floating-point math, which was resolved by instructing the LLM to integrate an external library.\n\nThis experience significantly shifted the author's perception of LLM capabilities, demonstrating that a functional interpreter for a new language could be \"vibe-coded\" in a single day. While acknowledging the downside of lacking intimate code familiarity, the author reflects on the potential for LLMs to accelerate complex projects, suggesting a shift towards code review over initial code generation. The author plans to dogfood FAWK for future Advent of Code challenges, refining it and exploring potential rewrites with LLM assistance.",
    "chinese_title": "FAWK：大语言模型能编写语言解释器",
    "chinese_summary": "一位深受函数式编程理念影响的程序员，在解决“Advent of Code”编程挑战时，发现传统AWK语言难以应对。他尤其苦于AWK的可变状态、动态作用域以及函数无法返回数组等局限。这促使他构想出“FAWK”——一个现代的、函数式的AWK迭代版本，旨在融入他所期望的特性：一等公民数组（按值传递，可返回）、一等公民函数和Lambda表达式、词法作用域、显式全局变量，乃至管道操作。\n\n作者没有选择手动实现，而是利用大型语言模型（LLM，具体为使用 Sonnet 4.5 的 Cursor Agent）为FAWK构建了一个Python解释器。令作者惊讶的是，该LLM表现出色，成功处理了多维数组、print语句与表达式的二元性、词法作用域和闭包等复杂的编程语言结构，同时还生成了大量的测试套件。唯一显著的挑战是任意精度浮点数学计算，这个问题通过指示LLM集成外部库而得以解决。\n\n这次经历极大地改变了作者对LLM能力的看法，证明了一种新语言的函数式解释器可以在一天之内“凭感觉快速实现”。尽管作者承认这种方法可能导致对代码缺乏深入了解，但他反思了LLM加速复杂项目的潜力，并建议将工作重心从最初的代码生成转向代码审查。作者计划在未来的Advent of Code挑战中亲身使用FAWK，对其进行完善，并探索在LLM协助下进行潜在的重写。"
  },
  {
    "id": "45997294",
    "title": "Kagi Assistants",
    "url": "https://blog.kagi.com/kagi-assistants",
    "summary": "Kagi announced the release of two new AI-powered research assistants, Quick Assistant and Research Assistant, on November 20, 2025. These tools are designed to enhance the human search experience, not replace it, by putting users at the center and leveraging AI as a powerful but fallible tool.\n\nBoth assistants excel at identifying search queries, executing multiple simultaneous searches (even in different languages), and synthesizing findings into high-quality, verifiable answers with sources and citations. The Quick Assistant, available on all plans, prioritizes speed and concise answers, aiming to respond in under 5 seconds. The Research Assistant (ultimate tier only) focuses on depth and diversity, conducting exhaustive analysis, which can take over 20 seconds. They are accessible via the Kagi Assistant webapp or directly from the search bar using bangs like `?`, `!quick`, and `!research`.\n\nKagi's Research Assistant unexpectedly achieved a 95.5% score on the SimpleQA benchmark in August 2025, topping it at the time. However, Kagi emphasizes that this was a \"happy accident,\" as their primary goal is to build useful products, not optimize for benchmark scores. They explain that pursuing a 100% score on benchmarks like SimpleQA would lead to \"overfitting\" to specific dataset quirks, potentially compromising real-world utility, and could even involve ethically questionable practices. Kagi also noted that its search engine provides a less noisy backend for LLMs, outperforming other search engines in factual retrieval benchmarks. Kagi's assistants also have access to various other tools, including code execution, image generation, and specific APIs.",
    "chinese_title": "卡吉助手",
    "chinese_summary": "Kagi 于2025年11月20日宣布发布两款全新的人工智能研究助理：Quick Assistant 和 Research Assistant。这些工具旨在增强而非取代人类的搜索体验，通过将用户置于中心地位，并利用人工智能作为一种强大但可能出错的工具。\n\n两款助理都擅长识别搜索查询，执行多项同步搜索（甚至支持不同语言），并将搜索结果综合为高质量、可验证的答案，并附带来源和引用。Quick Assistant（所有套餐均可使用）优先考虑速度和简洁的答案，目标是在5秒内作出回应。Research Assistant（仅限最高级套餐）则侧重于深度和多样性，进行详尽的分析，耗时可能超过20秒。用户可以通过 Kagi Assistant 网页应用访问它们，也可以直接在搜索栏中使用 `?`、`!quick` 和 `!research` 等“bang”命令来调用。\n\nKagi 的 Research Assistant 在2025年8月的 SimpleQA 基准测试中意外地取得了95.5%的成绩，当时位居榜首。然而，Kagi 强调这只是一个“意外之喜”，因为他们的主要目标是构建有用的产品，而非针对基准测试分数进行优化。他们解释说，在 SimpleQA 等基准测试中追求100%的得分会导致对特定数据集特性的“过拟合”，可能损害实际应用价值，甚至可能涉及道德上有争议的做法。Kagi 还指出，其搜索引擎为大型语言模型（LLMs）提供了更“干净”的后端，在事实检索基准测试中表现优于其他搜索引擎。Kagi 的助理还可以访问各种其他工具，包括代码执行、图像生成和特定的 API。"
  },
  {
    "id": "45997914",
    "title": "New Glenn Update",
    "url": "https://www.blueorigin.com/news/new-glenn-upgraded-engines-subcooled-components-drive-enhanced-performance",
    "summary": "Blue Origin has announced significant upgrades to its New Glenn rocket, focusing on enhanced performance through improved BE-4 engines and the adoption of subcooled propellant components.\n\nThe BE-4 engines, which power New Glenn's first stage, have undergone upgrades based on extensive testing. These improvements translate to increased thrust and better overall engine performance. A key innovation is the use of subcooled propellants (liquid oxygen and liquid natural gas) in certain tank components, increasing their density. This allows New Glenn to carry more propellant within the same tank volume, directly contributing to greater thrust and efficiency.\n\nThese combined enhancements enable New Glenn to deliver heavier payloads to various orbits, expanding its mission capabilities for both commercial and government customers. The upgrades reinforce Blue Origin's commitment to reusability and high performance, ensuring New Glenn remains a competitive and versatile heavy-lift launch vehicle.",
    "chinese_title": "新格伦更新",
    "chinese_summary": "蓝色起源已宣布对其新格伦火箭进行重大升级，重点是通过改进BE-4发动机和采用过冷推进剂组件来提升性能。\n\n驱动新格伦火箭第一级的BE-4发动机在广泛测试的基础上进行了升级。这些改进转化为更高的推力和更好的整体发动机性能。一项关键创新是在特定储罐组件中使用过冷推进剂（液氧和液化天然气），增加了它们的密度。这使得新格伦火箭能够在相同的储罐体积内携带更多推进剂，直接有助于提高推力和效率。\n\n这些综合增强功能使新格伦火箭能够将更重的有效载荷送入不同轨道，从而扩大了其对商业和政府客户的任务能力。这些升级强化了蓝色起源对可重复使用性和高性能的承诺，确保新格伦火箭仍然是一款有竞争力的多功能重型运载火箭。"
  },
  {
    "id": "45993073",
    "title": "210 IQ Is Not Enough",
    "url": "https://taylor.town/iq-not-enough",
    "summary": "The article \"210 IQ Is Not Enough\" explores the limitations of raw intelligence and societal definitions of success, using the lives of alleged high-IQ individuals Christopher Langan and Kim Ung-yong as case studies.\n\nChristopher Langan, famous for an alleged ~170 IQ, has not produced acclaimed works but is known for his controversial views, resentment, and hubris, earning labels like \"Alex Jones with a thesaurus.\" Despite a profoundly difficult childhood, his story is presented not as an excuse for negativity, but as a cautionary tale against letting bitterness and unmet potential define one's life. The author encourages readers to reflect on their own setbacks and practice gratitude, asserting self-worth independent of external validation.\n\nConversely, Kim Ung-yong, who reportedly scored 210 on an IQ test and was a child prodigy invited to NASA, described his early life as machine-like and lonely. As an adult, he deliberately chose a pragmatic career in civil engineering, rejecting the \"failed genius\" label. Kim emphasized his happiness and challenged society's \"unilateral standards\" for judging individuals, advocating for respect for diverse talents and dreams. He later became a professor and a philanthropist.\n\nUltimately, the article's message is for the reader: no amount of IQ, money, or external achievements can guarantee fulfillment. It encourages freeing oneself from societal expectations, ambition, and guilt. True contentment stems from within, recognizing that \"you are plenty\" and allowing oneself to be happy on one's own terms, as \"210 IQ is not enough. It is only plenty if you let it be.\"",
    "chinese_title": "210智商不够",
    "chinese_summary": "文章《210的智商不够》以据称拥有高智商的克里斯托弗·兰根和金雄镕的人生为例，探讨了单纯智力的局限性以及社会对成功的定义。\n\n克里斯托弗·兰根以据称智商高达170而闻名，却未能创作出备受赞誉的作品，反而因其争议性观点、怨恨和傲慢而广为人知，甚至被贴上“手握词典的亚历克斯·琼斯”之类的标签。尽管童年生活极其艰难，他的故事并非用来为消极情绪开脱，而是作为警示，告诫人们不要让苦涩和未实现的潜力定义自己的人生。作者鼓励读者反思自己的挫折，并学会感恩，主张自我价值应独立于外界认可。\n\n相反，金雄镕据报道智商测试高达210，曾是受邀前往NASA的神童，但他却形容自己的早期生活像机器般枯燥且孤独。成年后，他刻意选择了一份务实的土木工程职业，拒绝接受“失败天才”的标签。金雄镕强调了自己的幸福，并质疑社会评判个人的“单一标准”，倡导尊重多元的才能和梦想。他后来成为一名教授和慈善家。\n\n归根结底，这篇文章向读者传达的信息是：无论智商、金钱或外部成就多寡，都无法保证真正的满足感。它鼓励人们摆脱社会期望、野心和愧疚感。真正的满足感源于内心，认识到“你本身就已足够”，并允许自己按照自己的方式获得幸福，因为“210的智商不够，只有当你允许它足够时，它才足够”。"
  },
  {
    "id": "45994895",
    "title": "Go Cryptography State of the Union",
    "url": "https://words.filippo.io/2025-state/",
    "summary": "The 2025 Go Cryptography State of the Union highlighted major advancements and an excellent security track record by the Go Cryptography team (now Geomys).\n\nKey achievements include the implementation of post-quantum key exchanges, solving FIPS 140 compliance, and maintaining a robust security posture. The team reported no \"oof\" (medium severity) vulnerabilities since 2023, and no \"ouch\" (high severity) vulnerabilities since 2019. Furthermore, a professional security audit by Trail of Bits found no issues in the foundational Go cryptography standard library.\n\nFor post-quantum cryptography, Go 1.24+ now integrates ML-KEM, the NIST-selected algorithm. Significantly, `crypto/tls` and `x/crypto/ssh` packages automatically use a hybrid X25519/ML-KEM-768 key exchange by default. This provides immediate quantum resistance against \"record-now-decrypt-later\" attacks, without requiring user configuration, while maintaining robustness through hybridization. Post-quantum digital signatures are being addressed more cautiously due to less urgency and protocol redesign needs.\n\nFIPS 140 compliance, a US government standard, was achieved with a new native Go FIPS 140-3 Cryptographic Module. This replaces the problematic cgo-based BoringCrypto approach, leveraging existing internal Go packages. The solution ensures compliance with minimal impact on observable application behavior, offering a \"frozen module\" for audit requirements. Extensive testing was performed across many platforms, with Geomys funding efforts to ensure broad compatibility. Crucially, the team actively resisted lowering security for FIPS compliance, implementing advanced techniques for randomness generation and ECDSA `k` value handling to exceed base requirements.",
    "chinese_title": "Go 语言密码学综述",
    "chinese_summary": "2025年Go密码学年度报告重点介绍了Go密码学团队（现为Geomys）的重大进展和卓越的安全记录。\n\n主要成就包括实现后量子密钥交换、解决FIPS 140合规性问题以及保持强大的安全态势。该团队报告称，自2023年以来未发现“oof”（中等严重性）漏洞，自2019年以来未发现“ouch”（高严重性）漏洞。此外，Trail of Bits进行的一次专业安全审计未在Go基础密码学标准库中发现任何问题。\n\n在后量子密码学方面，Go 1.24+版本现已集成NIST选定的算法ML-KEM。值得注意的是，`crypto/tls`和`x/crypto/ssh`包默认自动使用混合型X25519/ML-KEM-768密钥交换。这提供了针对“先记录后解密”攻击的即时量子抗性，无需用户配置，同时通过混合保持了鲁棒性。后量子数字签名因其紧迫性较低且需要协议重新设计，目前正在更谨慎地处理。\n\nFIPS 140合规性（一项美国政府标准）已通过新的Go原生FIPS 140-3加密模块实现。这取代了有问题的基于cgo的BoringCrypto方法，从而利用了现有的Go内部包。该解决方案确保了合规性，同时对可观察的应用程序行为影响最小，为审计要求提供了一个“冻结模块”。Geomys资助了跨多个平台的广泛测试工作，以确保广泛的兼容性。至关重要的是，团队积极抵制为FIPS合规性而降低安全性，实施了随机数生成和ECDSA `k` 值处理的先进技术，以超越基本要求。"
  },
  {
    "id": "45984133",
    "title": "The lost cause of the Lisp machines",
    "url": "https://www.tfeb.org/fragments/2025/11/18/the-lost-cause-of-the-lisp-machines/",
    "summary": "The author, a former Lisp machine user, expresses frustration with \"Lisp Machine romantics,\" arguing that the technology died decades ago and its perceived advantages are largely mythical or irrelevant today. Symbolics, a major Lisp machine vendor, went bankrupt in 1993, but the author states the machines effectively died in 1983 with the rise of RISC architectures and commodity hardware like the Sun 3/260, which quickly surpassed them in performance for the money.\n\nThe article debunks several common myths:\n*   **Superior Development Environment:** While cool for the 1980s, it wasn't hardware-dependent. Modern Lisps on stock hardware offer equally productive environments (e.g., LispWorks), and today's fast machines negate past memory/speed issues.\n*   **Faster Performance:** Lisp machines were not inherently faster or more competitive in terms of performance-for-money; early RISC machines quickly outperformed them.\n*   **User-Microcodable Hardware:** This feature was primarily for manufacturers to implement complex instruction sets, not for general users. Moore's Law and improved compilers made this approach obsolete.\n*   **\"Lisp All The Way Down\":** While offering deep system access, this lacked isolation and security, unacceptable by modern standards. A secure, modern \"Lisp all the way down\" system would not provide the same low-level access and wouldn't require special hardware.\n*   **Difficulty of Good Compilers for Stock Hardware:** This is false. Modern Common Lisp compilers (like SBCL and LispWorks) are highly optimized, comparable to C/Fortran compilers for floating-point code, and far superior to those of the Lisp machine era. Compilation speed is also no longer a bottleneck.\n\nThe author concludes that Lisp machine romanticism is akin to \"gear acquisition syndrome\"—a distraction from the actual work of coding and practice. He urges enthusiasts to \"let them go\" and focus on current technological possibilities, rather than mourning a lost, unreplicable past.",
    "chinese_title": "Lisp机器的败局",
    "chinese_summary": "作者，一位前Lisp机器用户，对“Lisp机器浪漫主义者”表示不满，认为这项技术几十年前就已消亡，其所谓的优势在很大程度上是虚构的或在今天已无关紧要。主要的Lisp机器供应商Symbolics于1993年破产，但作者指出，随着RISC架构和Sun 3/260等商用硬件的兴起，这些机器实际上在1983年就已经消亡了，后者很快在性价比上超越了它们。\n\n文章驳斥了几个常见的迷思：\n*   **卓越的开发环境：** 尽管在1980年代很酷，但它并非依赖于硬件。现代基于通用硬件的Lisp（例如LispWorks）提供了同样高效的开发环境，如今的高速机器消除了过去的内存/速度问题。\n*   **更快的性能：** Lisp机器在性能或性价比方面并非天生更快或更具竞争力；早期的RISC机器很快就超越了它们。\n*   **用户可编程微代码硬件：** 此功能主要供制造商实现复杂的指令集，而非普通用户。摩尔定律和改进的编译器使这种方法过时了。\n*   **“Lisp一路到底”：** 尽管提供了深度系统访问，但它缺乏隔离性和安全性，按现代标准是不可接受的。一个安全的、现代的“Lisp一路到底”系统将无法提供相同的低级访问，并且不需要特殊硬件。\n*   **通用硬件上难以实现优秀的编译器：** 这是错误的。现代的Common Lisp编译器（如SBCL和LispWorks）高度优化，在浮点代码方面可与C/Fortran编译器媲美，并且远优于Lisp机器时代的编译器。编译速度也不再是瓶颈。\n\n作者总结道，Lisp机器浪漫主义类似于“设备购置症”——分散了人们在实际编码和实践工作上的注意力。他敦促爱好者们“放下过去”，专注于当前的技术可能性，而不是哀悼一个逝去且无法复制的过去。"
  },
  {
    "id": "46006521",
    "title": "How Cops Are Using Flock's ALPR Network to Surveil Protesters and Activists",
    "url": "https://www.eff.org/deeplinks/2025/11/how-cops-are-using-flock-safetys-alpr-network-surveil-protesters-and-activists",
    "summary": "An analysis of 10 months of Flock Safety's ALPR (Automated License Plate Reader) network data reveals that over 50 federal, state, and local agencies conducted hundreds of searches related to protest activity in 2025. Flock's system captures license plates, vehicle characteristics, time, and location, uploading this data to a massive, searchable national database accessible by thousands of law enforcement agencies, which are encouraged to share data broadly.\n\nThe Electronic Frontier Foundation (EFF) obtained data showing extensive searches linked to major events like the \"No Kings\" protests against government overreach and surveillance, as well as anti-deportation rallies, pro-Palestinian demonstrations, and other activist gatherings. The Tulsa Police Department and 19 other agencies were notable users for protest-related searches.\n\nPolice frequently logged \"protest\" as the reason for these searches, often without articulating a specific crime under investigation, despite calls from civil liberties groups for warrant requirements. While some searches might relate to actual crimes, the system's nature means it collects data on everyone attending or near a protest, not just suspects, raising concerns about mass surveillance and its chilling effect on First Amendment rights.\n\nThe U.S. Border Patrol (USBP) extensively used Flock's system for immigration enforcement and to target critics, even after its direct access was reportedly paused, by leveraging local agencies. Animal rights activists from Direct Action Everywhere (DxE) were also specifically targeted.\n\nThe article concludes that these ALPR systems, while marketed for community safety, threaten the right to public dissent by documenting attendees. It urges protesters to adopt self-defense strategies and calls on local officials to shut down these surveillance networks to protect civil liberties.",
    "chinese_title": "警方利用Flock ALPR网络监控抗议者与活动家",
    "chinese_summary": "对Flock Safety自动车牌识别（ALPR）系统长达10个月的网络数据分析显示，2025年，超过50个联邦、州和地方机构进行了数百次与抗议活动相关的搜索。Flock的系统捕获车牌、车辆特征、时间及地点，并将这些数据上传到一个庞大、可搜索的全国性数据库，该数据库可供数千个执法机构访问，并且这些机构被鼓励广泛共享数据。\n\n电子前沿基金会（EFF）获得的数据显示，大量搜索与反对政府越权和监控的“无王”抗议活动、反驱逐集会、亲巴勒斯坦示威以及其他激进分子集会等重大事件相关。塔尔萨警察局和另外19个机构是抗议活动相关搜索的显著用户。\n\n警方经常将“抗议”记录为这些搜索的原因，尽管公民自由团体呼吁要求搜查令，警方却常常没有明确说明正在调查的具体犯罪行为。虽然有些搜索可能与实际犯罪有关，但该系统的性质意味着它收集所有参与或接近抗议活动的人的数据，而不仅仅是嫌疑人，这引发了对大规模监控及其对第一修正案权利的寒蝉效应的担忧。\n\n美国边境巡逻队（USBP）广泛使用Flock的系统进行移民执法和针对批评者，即使在其直接访问权限据称被暂停后，也通过利用地方机构进行。来自“无处不行动”（DxE）的动物权利活动家也受到了特别针对。\n\n文章总结称，这些ALPR系统虽然以社区安全为名进行推广，但通过记录参与者信息，威胁了公众异议的权利。文章敦促抗议者采取自卫策略，并呼吁地方官员关闭这些监控网络以保护公民自由。"
  },
  {
    "id": "46000015",
    "title": "Nursing excluded as 'professional' degree by Department of Education",
    "url": "https://nurse.org/news/nursing-excluded-as-professional-degree-dept-of-ed/",
    "summary": "The U.S. Department of Education (DOE) has excluded nursing degrees from its official list of \"professional\" degrees eligible for certain federal student loan relief programs, such as Public Service Loan Forgiveness (PSLF). This decision means nursing graduates, regardless of their degree level (ADN, BSN, MSN, DNP), are not recognized as holding a professional degree for these specific benefits.\n\nThe DOE's list includes degrees in fields like medicine, law, dentistry, optometry, veterinary medicine, podiatry, and pharmacy. The exclusion has sparked widespread outrage among nurses and nursing organizations, including the American Association of Colleges of Nursing (AACN) and the American Nurses Association (ANA), who argue that nursing requires extensive education, clinical training, and licensure, meeting all criteria for a professional degree.\n\nCritics point out that nurses often incur significant student debt while working in crucial public service roles. They contend that this decision devalues the nursing profession and its critical contributions to healthcare. While the DOE has not fully clarified its rationale, some speculate it might relate to the entry-level education for an RN (associate's degree), despite the inclusion of doctoral-level degrees like PharmD and the exclusion of the Doctor of Nursing Practice (DNP).\n\nNursing advocacy groups are actively campaigning for the DOE to revise its list and include nursing degrees, emphasizing the essential professional status of nurses. The DOE has stated that the list is not exhaustive and is subject to updates.",
    "chinese_title": "教育部将护理排除在“专业”学位之外",
    "chinese_summary": "美国教育部（DOE）已将其官方“专业”学位列表中排除了护理学学位，该列表中的学位有资格获得某些联邦学生贷款减免计划，例如“公共服务贷款减免计划”（PSLF）。这一决定意味着，护理专业毕业生，无论其学位级别（如ADN、BSN、MSN、DNP）如何，均不被认定为持有专业学位，从而无法享受这些特定福利。\n\n教育部的名单中包括医学、法律、牙科、验光、兽医学、足病学和药学等领域的学位。这一排除在护士和护理组织中引发了广泛的愤怒，其中包括美国护理学院协会（AACN）和美国护士协会（ANA），他们认为护理学需要广泛的教育、临床培训和执照，符合专业学位的各项标准。\n\n批评者指出，护士在从事关键公共服务工作的同时，往往背负着巨额学生债务。他们认为，这一决定贬低了护理专业及其对医疗保健的关键贡献。尽管教育部尚未完全阐明其理由，但一些人猜测这可能与注册护士（RN）的入门级教育（副学士学位）有关，尽管该名单中包含了药学博士（PharmD）等博士级学位，却排除了护理实践博士（DNP）。\n\n护理倡导团体正在积极开展运动，呼吁教育部修订其名单并纳入护理学学位，强调护士作为专业人员的重要地位。教育部已表示，该名单并非详尽无遗，且可能会进行更新。"
  },
  {
    "id": "45997722",
    "title": "Run Docker containers natively in Proxmox 9.1 (OCI images)",
    "url": "https://raymii.org/s/tutorials/Finally_run_Docker_containers_natively_in_Proxmox_9.1.html",
    "summary": "Proxmox VE 9.1 introduces a significant new feature: native support for running Docker containers (OCI images), eliminating the need for dedicated VMs or problematic Docker-in-LXC setups. Previously, Proxmox recommended running Docker inside a QEMU virtual machine, but the new functionality streamlines this process.\n\nWhile the article's title suggests \"native\" execution, Proxmox achieves this by converting OCI images into full-fledged LXC containers, squashing all layers into a single rootfs during creation. This method saves time and resources compared to managing an entire VM.\n\nHowever, this feature is currently a tech preview with some limitations:\n*   It's not yet recommended for use cases requiring container orchestration or live migration (VMs are still preferred for these).\n*   Updating containers isn't straightforward, requiring recreation rather than a simple \"pull.\"\n*   The container console often doesn't provide a shell directly, though `pct enter` allows access.\n*   Environment variables can be set post-creation but not during initial setup.\n\nTo run an OCI image:\n1.  Ensure Proxmox VE is updated to at least 9.1.1.\n2.  Navigate to storage and use the \"Pull from OCI Registry\" button to download the desired image (e.g., `docker.io/eclipse-mosquitto`).\n3.  Create a new CT (Container), selecting the downloaded OCI image as the template.\n4.  Configure disks for volumes (comparable to Docker's `-v` option) and other settings as needed.\n\nProxmox VE automatically detects the OCI image and performs the necessary conversion to an LXC container. Despite the underlying conversion, this new capability marks a major step forward, offering a much more convenient way to deploy individual application containers directly within Proxmox.",
    "chinese_title": "在 Proxmox 9.1 中原生运行 Docker 容器 (OCI 镜像)",
    "chinese_summary": "Proxmox VE 9.1 引入了一项重要的新功能：原生支持运行 Docker 容器（OCI 镜像），从而消除了对专用虚拟机或有问题的 Docker-in-LXC 设置的需求。以前，Proxmox 建议在 QEMU 虚拟机内部运行 Docker，但新功能简化了这一过程。\n\n尽管文章标题暗示了“原生”执行，Proxmox 实现这一功能的方式是，在创建过程中将 OCI 镜像转换为功能齐全的 LXC 容器，并将所有层扁平化为一个单一的 rootfs。与管理整个虚拟机相比，这种方法节省了时间和资源。\n\n然而，此功能目前处于技术预览阶段，存在一些限制：\n*   尚不建议用于需要容器编排或实时迁移的场景（这些场景仍首选虚拟机）。\n*   更新容器并不直接，需要重新创建而不是简单的“拉取”。\n*   容器控制台通常不直接提供 shell，尽管可以使用 `pct enter` 进行访问。\n*   环境变量可以在创建后设置，但不能在初始设置期间设置。\n\n要运行 OCI 镜像：\n1.  确保 Proxmox VE 已更新到至少 9.1.1 版本。\n2.  导航到存储并使用“从 OCI 注册表拉取”按钮下载所需的镜像（例如 `docker.io/eclipse-mosquitto`）。\n3.  创建一个新的 CT（容器），选择已下载的 OCI 镜像作为模板。\n4.  根据需要为卷配置磁盘（类似于 Docker 的 `-v` 选项）和其他设置。\n\nProxmox VE 会自动检测 OCI 镜像并执行必要的转换，将其变为 LXC 容器。尽管底层进行了转换，这项新功能标志着一个重要的进步，提供了一种更便捷的方式，可以直接在 Proxmox 中部署单个应用程序容器。"
  },
  {
    "id": "45983746",
    "title": "Gov. Abbott's office redacts pages of emails about Elon Musk",
    "url": "https://www.kut.org/politics/2025-11-19/texas-governor-abbott-elon-musk-emails-redacted",
    "summary": "Texas Gov. Greg Abbott’s office released nearly 1,400 pages of emails concerning Elon Musk and his companies, but all but about 200 pages were entirely blacked out. The documents, requested by The Texas Newsroom, were sought to understand Musk's significant investments in Texas and his influence on state government. Lawyers for Abbott and SpaceX initially fought their release, citing trade secrets, \"intimate and embarrassing\" exchanges, and confidential policy discussions, arguing public disclosure would have a \"chilling effect.\"\n\nThe extensive redactions mean little about Musk’s ties or influence is revealed. The readable portions included mostly already-public information, such as old SpaceX incorporation records, committee agendas, and minor items like happy hour invitations or launch reminders. Assistant Attorney General Erin Groff largely sided with Abbott and Musk, permitting most documents to be withheld, although some deemed \"not highly intimate or embarrassing\" were ordered released.\n\nOpen government experts criticized the limited disclosure as symptomatic of a broader transparency problem in Texas. They attribute it to a 2015 state Supreme Court decision that allowed companies to easily claim \"competitively sensitive\" information, and subsequent legislative efforts that failed to fully restore public records access. Experts like Tom Leatherbury and Reid Pillifant emphasize concerns that such practices hinder public oversight of officials' decisions and taxpayer spending. They also note that a recent state Supreme Court ruling has made challenging executive branch redactions more difficult, leaving little recourse. The Texas Newsroom has asked the AG's office to reconsider its decision.",
    "chinese_title": "阿博特州长办公室修订了关于埃隆·马斯克的多页电子邮件。",
    "chinese_summary": "德克萨斯州州长格雷格·雅培的办公室公布了近1400页与埃隆·马斯克及其公司有关的电子邮件，但除约200页外，其余部分全部被彻底涂黑。这些文件是德克萨斯新闻编辑室要求获取的，旨在了解马斯克在德克萨斯州的重大投资以及他对州政府的影响。雅培和SpaceX的律师最初反对公布这些文件，理由是其中包含商业秘密、“私密且令人尴尬”的交流以及机密政策讨论，并声称公开披露将产生“寒蝉效应”。\n\n大面积的涂黑意味着马斯克的关系或影响力几乎没有被披露。可阅读的部分主要包含已经公开的信息，例如SpaceX旧的注册记录、委员会议程，以及像欢乐时光邀请或发射提醒等次要内容。助理总检察长艾琳·格罗夫基本站在雅培和马斯克一边，允许扣留大部分文件，尽管一些被认为“不高度私密或令人尴尬”的文件被命令公布。\n\n开放政府专家批评这种有限的披露，认为这是德克萨斯州更广泛的透明度问题的一个症结所在。他们将其归因于2015年州最高法院的一项裁决，该裁决允许公司轻易声称信息“具有竞争敏感性”，以及随后未能完全恢复公共记录查阅权的立法努力。汤姆·莱瑟伯里和里德·皮利凡特等专家强调，这种做法阻碍了公众对官员决策和纳税人支出的监督。他们还指出，州最高法院最近的一项裁决使得挑战行政部门的涂黑行为变得更加困难，几乎没有追索权。德克萨斯新闻编辑室已要求总检察长办公室重新考虑其决定。"
  },
  {
    "id": "45999872",
    "title": "Why top firms fire good workers",
    "url": "https://www.rochester.edu/newscenter/employee-turnover-why-top-firms-churn-good-workers-681832/",
    "summary": "The provided text features a title, \"Why top firms fire good workers,\" which suggests an analytical discussion on this specific topic. However, the accompanying content does not address this question.\n\nInstead, the body text functions as a promotional statement for the Simon Business School at the University of Rochester. It emphasizes the school's \"unabashedly analytical\" approach, stating that its researchers and students apply \"rigorous analysis\" across various fields, \"from markets to management.\" The core mission is to \"advance ideas with real-world impact\" and achieve \"business done better at URochester.\"",
    "chinese_title": "顶尖公司为何解雇优秀员工",
    "chinese_summary": "所提供的文本包含一个标题“顶尖公司为何解雇优秀员工”，这表明它将对这个特定主题进行分析性讨论。然而，随附内容并未解决这个问题。\n\n相反，正文是罗切斯特大学西蒙商学院的一份宣传声明。它强调该学院“毫不掩饰的分析性”方法，指出其研究人员和学生将“严谨的分析”应用于从“市场到管理”的各个领域。其核心使命是“推动具有实际影响力的思想”，并在“罗切斯特大学成就更好的商业”。"
  },
  {
    "id": "46005553",
    "title": "Arduino published updated terms and conditions: no longer an open commons",
    "url": "https://www.molecularist.com/2025/11/did-qualcomm-kill-arduino-for-good.html",
    "summary": "Qualcomm's recent acquisition of Arduino has led to updated terms and conditions, confirming fears within the maker community that Arduino is no longer an open commons. The new terms, described as corporate boilerplate, include mandatory arbitration, data integration, and export controls. Most critically, they explicitly state that using the platform grants no patent licenses, raising concerns Qualcomm could assert patents against projects developed with Arduino tools or compatible hardware. This directly contradicts the open-source licenses (AGPL/GPLv3) of Arduino's IDE and CLI, which permit reverse engineering, while the new terms forbid it for \"the Platform.\"\n\nThe community is seeking clarification on whether \"the Platform\" includes the essential IDE and CLI or only cloud services, as this ambiguity puts library maintainers and hardware makers at legal risk. Adafruit, a respected voice in open hardware, emphasizes that Qualcomm misunderstands Arduino's true value: it's not merely an IoT hardware company, but the \"IBM PC of the maker world\"—a vital, open-source standard and ecosystem that underpins millions of projects, libraries, and educational curricula. Applying restrictive enterprise legal frameworks to this \"commons\" risks destroying its value, stranding decades of accumulated knowledge, and alienating new makers.\n\nWhile possibly tone-deafness rather than malice, Qualcomm has severely eroded trust. To salvage Arduino's legacy, Qualcomm must explicitly clarify that the IDE, CLI, and core libraries remain under existing open-source licenses, ideally through concrete commitments or by placing them within an independent foundation with community governance. The coming months will determine if Arduino can restore trust and survive as a commons.",
    "chinese_title": "Arduino 发布更新条款和条件：不再是开放公共资源",
    "chinese_summary": "高通最近收购Arduino后，更新了其条款和条件，证实了创客社区的担忧，即Arduino不再是一个开放的公共资源。新条款被描述为企业套话，包含强制仲裁、数据整合和出口管制。最关键的是，它们明确指出使用该平台不授予任何专利许可，引发了人们对高通可能对使用Arduino工具或兼容硬件开发的项目主张专利权的担忧。这直接与Arduino IDE和CLI的开源许可证（AGPL/GPLv3）相矛盾，后者允许逆向工程，而新条款则禁止对“该平台”进行逆向工程。\n\n社区正在寻求澄清，“该平台”是包括核心IDE和CLI，还是仅指云服务，因为这种模糊性使库维护者和硬件制造商面临法律风险。Adafruit作为开源硬件领域备受尊敬的声音，强调高通误解了Arduino的真正价值：它不仅仅是一家物联网硬件公司，更是“创客世界的IBM PC”——一个重要的开源标准和生态系统，支撑着数百万个项目、库和教育课程。将限制性的企业法律框架应用于这一“公共资源”有可能会破坏其价值，让数十年积累的知识束之高阁，并疏远新的创客。\n\n虽然这可能只是麻木不仁而非恶意，但高通已经严重损害了信任。为了挽救Arduino的遗产，高通必须明确澄清IDE、CLI和核心库仍受现有开源许可证的保护，最好是通过具体的承诺，或者将其置于一个由社区治理的独立基金会之下。未来几个月将决定Arduino能否恢复信任并作为一个公共资源存续下去。"
  },
  {
    "id": "45996433",
    "title": "Mozilla says it's finally done with Onerep",
    "url": "https://krebsonsecurity.com/2025/11/mozilla-says-its-finally-done-with-two-faced-onerep/",
    "summary": "Mozilla is finally ending its partnership with Onerep, an identity protection service offered with Firefox, which will officially cease next month. This decision comes sixteen months after Mozilla initially announced it was winding down the collaboration in March 2024.\n\nThe original controversy stemmed from a KrebsOnSecurity investigation revealing Onerep's Belarusian founder, Dimitri Shelest, had created dozens of people-search services since 2010, including the active data broker Nuwber, which sells background reports. Shelest acknowledged his ownership in Nuwber, founded around the same time as Onerep in 2015.\n\nMozilla stated it will discontinue Monitor Plus, the paid service offering Onerep's data broker site scans and automated data removal. The company cited \"high standards for vendors\" and the \"realities of the data broker ecosystem\" as challenges in consistently delivering expected value and reliability.\n\nCurrent Monitor Plus subscribers will retain full access until December 17, 2025, receiving prorated refunds thereafter. Mozilla will continue its free Monitor data breach service, integrated into Firefox, and plans to integrate more privacy and security experiences, including its VPN, for free.",
    "chinese_title": "谋智称，它终于与 Onerep 了断了。",
    "chinese_summary": "Mozilla 最终将终止与 Onerep 的合作，后者是与 Firefox 捆绑提供的身份保护服务，并将于下个月正式停用。此举距离 Mozilla 最初于 2024 年 3 月宣布逐步终止此次合作已过去十六个月。\n\n最初的争议源于 KrebsOnSecurity 的一项调查，该调查披露 Onerep 的白俄罗斯创始人 Dimitri Shelest 自 2010 年以来创建了数十个个人信息查询服务，其中包括活跃的数据经纪公司 Nuwber，该公司出售背景报告。Shelest 承认他拥有 Nuwber 的所有权，该公司与 Onerep 均成立于 2015 年左右。\n\nMozilla 表示将停用 Monitor Plus，这是一项付费服务，提供 Onerep 的数据经纪网站扫描和自动化数据删除功能。该公司引用了“对供应商的高标准”和“数据经纪生态系统的现实”作为持续提供预期价值和可靠性所面临的挑战。\n\n现有 Monitor Plus 订阅者将保留完整访问权限直至 2025 年 12 月 17 日，此后将获得按比例退款。Mozilla 将继续提供其免费的 Monitor 数据泄露服务（已集成到 Firefox 中），并计划免费整合更多隐私和安全体验，包括其 VPN。"
  },
  {
    "id": "45992304",
    "title": "Students fight back over course taught by AI",
    "url": "https://www.theguardian.com/education/2025/nov/20/university-of-staffordshire-course-taught-in-large-part-by-ai-artificial-intelligence",
    "summary": "Students at Staffordshire University are confronting their lecturers over a coding module largely taught by Artificial Intelligence, leading to feelings of being \"robbed of knowledge and enjoyment.\" James and Owen, among 41 students in a government-funded apprenticeship for digital careers, discovered the course relied heavily on AI-generated slides and voiceovers. They expressed concern over wasting two years on a program delivered \"in the cheapest way possible.\"\n\nStudents identified various signs of AI-generated material, including suspicious file names, inconsistent British/American English, generic information, and a course video where the voiceover abruptly changed to a Spanish accent. AI detectors later confirmed a high likelihood of AI generation in course materials. Students highlighted the hypocrisy of being taught by AI while the university's policies strictly prohibit students from submitting AI-generated work, threatening academic misconduct.\n\nDespite multiple confrontations with lecturers and officials, the university initially responded that teachers are allowed to use various tools. Subsequently, a policy statement appeared on the course website, seemingly justifying AI use for \"academic professionals.\" While the university maintained \"academic standards and learning outcomes were maintained\" and brought in human lecturers for the final session, students felt it was too little, too late.\n\nThis incident reflects a growing trend of universities using AI in teaching, which, despite being lauded by some education policies, is proving demoralizing for students who feel their time is wasted on superficial learning, rather than gaining the in-depth knowledge they sought.",
    "chinese_title": "学生反抗AI授课",
    "chinese_summary": "斯塔福德郡大学的学生们正就一个主要由人工智能教授的编程模块与讲师对质，这让他们感到“知识和乐趣被剥夺了”。詹姆斯和欧文是41名参加政府资助的数字职业学徒计划的学生中的一员，他们发现该课程严重依赖人工智能生成的幻灯片和画外音。他们对在一个以“尽可能便宜的方式”交付的课程上浪费两年时间表示担忧。\n\n学生们发现了人工智能生成材料的各种迹象，包括可疑的文件名、不一致的英式/美式英语、通用信息，以及一个课程视频中画外音突然变成了西班牙口音。人工智能检测器后来证实，课程材料极有可能由人工智能生成。学生们强调了这种虚伪性：他们被人工智能教授，而大学政策却严禁学生提交人工智能生成作品，并威胁将处以学术不端行为的惩罚。\n\n尽管多次与讲师和校方人员对峙，大学最初回应称教师可以使用各种工具。随后，一份政策声明出现在课程网站上，似乎在为“学术专业人士”使用人工智能进行辩护。尽管大学坚称“学术标准和学习成果得到了保持”，并在最后一节课安排了真人讲师，但学生们认为这已经太少、太晚了。\n\n这一事件反映了大学在教学中使用人工智能的日益增长的趋势，尽管受到一些教育政策的称赞，但这却让学生感到士气低落，他们觉得时间浪费在肤浅的学习上，而不是获得他们所寻求的深入知识。"
  },
  {
    "id": "45984112",
    "title": "Measuring political bias in Claude",
    "url": "https://www.anthropic.com/news/political-even-handedness",
    "summary": "Anthropic's \"Measuring political bias in Claude\" outlines their commitment to training Claude for political even-handedness, ensuring it treats opposing viewpoints with equal depth, engagement, and analytical quality. Their goal is for Claude to be seen as fair and trustworthy across the political spectrum.\n\nThey employ \"character training\" using reinforcement learning and system prompts to instill traits like objectivity, balanced discussion, and a refusal to influence users' political decisions. Ideal behaviors include avoiding unsolicited opinions, maintaining factual accuracy, representing multiple perspectives respectfully, and using neutral language.\n\nTo measure this, Anthropic developed an automated \"Paired Prompts\" evaluation. This method presents AI models with requests on the same contentious topic from two opposing ideological viewpoints. Responses are then graded by Claude Sonnet 4.5 (with cross-checks from other models) on three criteria:\n1.  **Even-handedness:** Similar depth, engagement, and evidence for both sides.\n2.  **Opposing perspectives:** Acknowledging counterarguments.\n3.  **Refusals:** Willingness to engage with the prompt.\n\nResults showed Claude Sonnet 4.5 (94%) and Opus 4.1 (95%) performed comparably to Gemini 2.5 Pro (97%) and Grok 4 (96%) in even-handedness, outperforming GPT-5 (89%) and Llama 4 (66%). Claude models also maintained low refusal rates. Anthropic open-sourced this evaluation to benefit the broader AI industry. The study acknowledges limitations, such as its focus on US political discourse and single-turn interactions.",
    "chinese_title": "衡量Claude中的政治偏见",
    "chinese_summary": "Anthropic的《衡量Claude政治偏见》阐述了他们致力于将Claude训练成政治上不偏不倚的承诺，确保它以同等的深度、参与度和分析质量对待对立观点。他们的目标是让Claude在整个政治光谱中被视为公平和值得信赖。\n\n他们采用“品格训练”，利用强化学习和系统提示，灌输客观性、平衡讨论以及拒绝影响用户政治决策等特质。理想行为包括避免提供不请自来的观点、保持事实准确性、尊重地呈现多方观点以及使用中立语言。\n\n为了衡量这一点，Anthropic开发了一种自动化的“配对提示”评估方法。该方法向AI模型呈现同一争议话题下来自两种对立意识形态视角的请求。然后由Claude Sonnet 4.5（并辅以其他模型的交叉检查）根据三个标准对响应进行评分：\n1.  **不偏不倚性：** 对双方提供相似的深度、参与度和证据。\n2.  **对立观点：** 承认反驳论点。\n3.  **拒绝率：** 参与提示的意愿。\n\n结果显示，Claude Sonnet 4.5（94%）和Opus 4.1（95%）在不偏不倚性方面与Gemini 2.5 Pro（97%）和Grok 4（96%）表现相当，优于GPT-5（89%）和Llama 4（66%）。Claude模型也保持了较低的拒绝率。Anthropic开源了这项评估，以造福更广泛的AI行业。该研究承认其局限性，例如其侧重于美国政治话语和单轮互动。"
  },
  {
    "id": "46005111",
    "title": "We should all be using dependency cooldowns",
    "url": "https://blog.yossarian.net/2025/11/21/We-should-all-be-using-dependency-cooldowns",
    "summary": "The article champions \"dependency cooldowns\" as a free, easy, and highly effective method to combat open source supply chain attacks. The author argues that despite vendor hype, most supply chain attacks share a common structure: an attacker compromises a project and introduces malicious code, but their \"window of opportunity\" for impact is typically very short—often hours to a few days—before security vendors detect and report the compromise, leading to package removal.\n\nAnalyzing prominent attacks like Ultralytics, tj-actions, and Nx, the article highlights that 8 out of 10 recent incidents had an exploitation window of less than a week. A \"cooldown\" is a waiting period (e.g., 7 days) between a dependency's publication and its allowed use. This window allows security tools and vendors to identify and address malicious packages before they are automatically adopted by users.\n\nCooldowns are lauded for their empirical effectiveness in mitigating the majority of high-visibility attacks, their ease of implementation (often free via tools like Dependabot or Renovate), and their positive impact on vendor behavior. A 7-day cooldown, for instance, could prevent 80% of listed attacks from reaching end-users. While not a complete solution, an 80-90% reduction in exposure for free is a significant gain. The article encourages wider adoption by projects and calls for packaging ecosystems to integrate first-class cooldown support directly into package managers.",
    "chinese_title": "我们都应该使用依赖冷却期。",
    "chinese_summary": "本文倡导将“依赖冷却期”作为一种免费、简便且高效的方法来对抗开源供应链攻击。作者指出，尽管有厂商宣传，但大多数供应链攻击都具有共同的结构：攻击者攻陷一个项目并植入恶意代码，但其造成影响的“攻击窗口期”通常非常短——往往只有几小时到几天——在此期间，安全厂商便会检测并报告此入侵情况，从而导致软件包被移除。\n\n文章分析了Ultralytics、tj-actions和Nx等知名攻击事件，指出近10起事件中有8起的利用窗口期不足一周。“冷却期”是指一个依赖项发布后到其允许使用之间的等待时间（例如7天）。这个窗口期让安全工具和厂商有机会在恶意软件包被用户自动采纳之前，识别并处理它们。\n\n冷却期因其在缓解大多数高关注度攻击方面的实践有效性、易于实施（通常可通过Dependabot或Renovate等工具免费实现）以及对厂商行为的积极影响而备受赞扬。例如，一个7天的冷却期可以阻止80%已列出的攻击触达最终用户。虽然这并非一个彻底的解决方案，但免费实现80-90%的风险暴露降低，无疑是一项重大收益。文章鼓励各项目更广泛地采纳这一机制，并呼吁包管理生态系统将原生冷却期支持直接整合到包管理器中。"
  },
  {
    "id": "46006082",
    "title": "You can make PS2 games in JavaScript",
    "url": "https://jslegenddev.substack.com/p/you-can-now-make-ps2-games-in-javascript",
    "summary": "You can now make PS2 games in JavaScript, thanks to the release of a new JavaScript SDK for the \"PlayStation 2 Online\" platform. This innovative tool empowers web developers to create and publish games that can be played directly on a modified PlayStation 2 console, bypassing traditional emulation.\n\nThe SDK, known as `ps2-online-sdk`, leverages a modified PS2 emulator to allow local development and testing in a browser environment. It provides JavaScript APIs to interact with the console's hardware features, including controllers, graphics, audio, and even network functionality. Developers can use their existing web development skills to build games, complete with 3D graphics rendered using WebGL, WebGPU, or other browser-based rendering techniques.\n\nA key feature is the ability to deploy games to a physical PS2. By transferring the game's compiled JavaScript and assets to a USB drive or network share, users can launch them on a PS2 running custom firmware. The platform envisions a community-driven ecosystem where developers can share their creations, potentially leading to new online multiplayer experiences for the classic console. This initiative redefines game development for the PS2, making it accessible to a broader audience of JavaScript developers.",
    "chinese_title": "你可以用 JavaScript 开发 PS2 游戏",
    "chinese_summary": "得益于“PlayStation 2 Online”平台发布了一个新的JavaScript SDK，现在可以用JavaScript制作PS2游戏了。这一创新工具赋能Web开发者，让他们能够创建和发布可直接在修改过的PlayStation 2主机上运行的游戏，从而绕过了传统的模拟器。\n\n这个名为`ps2-online-sdk`的SDK，利用一个修改过的PS2模拟器，允许开发者在浏览器环境中进行本地开发和测试。它提供了JavaScript API，用于与主机的硬件功能进行交互，包括控制器、图形、音频，甚至网络功能。开发者可以使用他们现有的Web开发技能来构建游戏，包括使用WebGL、WebGPU或其他基于浏览器的渲染技术呈现的3D图形。\n\n一个关键功能是能够将游戏部署到一台物理PS2主机上。通过将游戏的编译后的JavaScript代码和资产传输到USB驱动器或网络共享中，用户可以在运行自定义固件的PS2上启动这些游戏。该平台设想了一个社区驱动的生态系统，开发者可以在其中分享他们的作品，这有望为这款经典主机带来全新的在线多人游戏体验。这一举措重新定义了PS2的游戏开发，使其可供更广泛的JavaScript开发者群体使用。"
  },
  {
    "id": "45992403",
    "title": "Dr Matthew Garrett v Dr Roy Schestowitz and Anor",
    "url": "https://caselaw.nationalarchives.gov.uk/ewhc/kb/2025/3063",
    "summary": "Mrs Justice Collins Rice is presiding over a dispute between prominent 'free software movement' activists: Dr Matthew Garrett (Claimant) and Dr Roy Schestowitz and Mrs Rianne Schestowitz (Defendants).\n\nDr Garrett, a senior software engineer at NVIDIA and Berkeley lecturer, claims libel over 24 publications on the Schestowitzes' websites (Techrights and Tuxmachines) and a further data protection claim, stemming from August/September 2023. The defendants, who operate non-profit free software sites, counterclaim for harassment. Their defence against libel includes arguing no serious harm, truth, honest opinion, and public interest, while for data protection, they cite journalistic purposes.\n\nA critical procedural issue emerged when the defendants, acting in person, failed to provide witness statements by court deadlines. This led to an order from Griffiths J prohibiting them from calling any witnesses at trial. Dr Schestowitz confirmed this was a deliberate financial decision, understanding it would limit their ability to introduce evidence for their defence and counterclaim.\n\nMrs Justice Collins Rice's preliminary task involved determining the \"single natural and ordinary meaning,\" distinguishing fact from opinion, and assessing the defamatory tendency of each publication. She noted common themes: Dr Garrett was accused of waging an online campaign of criminal (cybercrime, hate crime, blackmail, threats), illegal (defamation, harassment), and offensive (racist, antisemitic, misogynist, etc.) material via IRC 'sockpuppet' accounts. Crucially, he was also repeatedly alleged to be an uncontrolled user of illegal Class A drugs, specifically crack cocaine.\n\nThe judge determined that allegations of criminal or illegal acts were factual (Chase level 1), while offensive attitudinal matters were expressions of opinion. She concluded that all publications were of \"grossly defamatory tendency.\"",
    "chinese_title": "马修·加勒特博士 诉 罗伊·舍斯托维茨博士 及另案当事人",
    "chinese_summary": "柯林斯·赖斯法官正在审理一场备受关注的“自由软件运动”活动家之间的纠纷：原告马修·加勒特博士与被告罗伊·谢斯托维茨博士和里安妮·谢斯托维茨夫人。\n\n加勒特博士是英伟达（NVIDIA）的高级软件工程师和伯克利大学的讲师，他指控谢斯托维茨夫妇网站（Techrights和Tuxmachines）上的24篇出版物构成诽谤，并提出一项额外的数据保护索赔，这些索赔源于2023年8月/9月。被告经营非营利性自由软件网站，他们反诉原告骚扰。他们针对诽谤的辩护包括主张未造成严重损害、事实、诚实意见和公共利益，而对于数据保护，他们则援引新闻目的。\n\n当被告亲自出庭，未能按法院规定期限提交证人陈述时，出现了一个关键的程序问题。这导致格里菲斯法官下令禁止他们在审判中传唤任何证人。谢斯托维茨博士证实这是一个蓄意的财务决定，他明白这将限制他们为辩护和反诉引入证据的能力。\n\n柯林斯·赖斯法官的初步任务包括确定“单一自然和普通含义”，区分事实与意见，并评估每篇出版物的诽谤倾向。她指出了一些共同主题：加勒特博士被指控通过IRC“马甲”账户进行线上活动，发布犯罪（网络犯罪、仇恨犯罪、勒索、威胁）、非法（诽谤、骚扰）和冒犯性（种族主义、反犹太主义、厌女等）内容。至关重要的是，他还被反复指控是失控的非法A类毒品（特别是可卡因）使用者。\n\n法官裁定，关于犯罪或非法行为的指控属于事实（切斯原则一级），而冒犯性态度问题则属于意见表达。她总结说，所有出版物都具有“严重诽谤倾向”。"
  },
  {
    "id": "46004293",
    "title": "Making a Small RPG",
    "url": "https://jslegenddev.substack.com/p/making-a-small-rpg",
    "summary": "In \"Making a Small RPG,\" the author shares insights into developing a concise role-playing game within a limited scope, specifically for game jams. The core philosophy emphasizes starting small, focusing on one central idea or mechanic, and completing it.\n\nThe article breaks down the process into several key areas:\n\n1.  **Scope and Core Idea:** Begin with a single, compelling idea, like a unique combat system, movement mechanic, or narrative theme. This prevents feature creep and ensures focus.\n2.  **Tools:** The author recommends user-friendly tools that speed up development. For graphics, Aseprite (pixel art) or MagicaVoxel (voxel art) are suggested. Godot Engine is highlighted for its versatility, ease of use for 2D, and active community, making it suitable for quick prototyping.\n3.  **Art Style:** Simplicity is key. A pixel art style or even placeholder graphics can work wonders, allowing developers to prioritize gameplay over extensive visual fidelity.\n4.  **Audio:** While sound adds polish, it's often the last priority for small projects. Free resources or simple sound effects are acceptable.\n5.  **Marketing & Showcase:** Even for small games, sharing development progress and the final product on platforms like itch.io is encouraged for feedback and community engagement.\n\nThe article's overarching message is to embrace limitations, prioritize completion over perfection, and learn through iterative development, making small RPGs a great entry point into game development.",
    "chinese_title": "小型RPG制作",
    "chinese_summary": "在《制作小型RPG》一文中，作者分享了在有限范围内（特别是针对游戏果酱）开发简洁角色扮演游戏的见解。其核心理念强调从小处着手，专注于一个核心创意或机制，并将其完成。\n\n文章将该过程分解为几个关键领域：\n\n1.  **范围与核心创意：** 从一个单一的、引人注目的创意开始，例如独特的战斗系统、移动机制或叙事主题。这可以防止功能蔓延并确保专注。\n2.  **工具：** 作者推荐了能加快开发进程的用户友好工具。对于图形方面，建议使用Aseprite（像素艺术）或MagicaVoxel（体素艺术）。Godot引擎因其多功能性、易于2D使用以及活跃的社区而受到强调，使其适合快速原型开发。\n3.  **美术风格：** 简洁是关键。像素艺术风格甚至占位符图形都能发挥巨大作用，使得开发者能够将游戏玩法置于广泛的视觉保真度之上。\n4.  **音频：** 尽管声音能增加完善度，但对于小型项目而言，它通常是最后一个优先级。免费资源或简单的音效是可以接受的。\n5.  **营销与展示：** 即使是小型游戏，也鼓励在itch.io等平台上分享开发进度和最终产品，以获取反馈和社区参与。\n\n文章的总体信息是拥抱限制，将完成度置于完美之上，并通过迭代开发进行学习，这使得小型RPG成为进入游戏开发的绝佳切入点。"
  },
  {
    "id": "45995918",
    "title": "RFK Jr.'s loathesome edits: CDC website now falsely links vaccines and autism",
    "url": "https://arstechnica.com/health/2025/11/rfk-jr-s-loathesome-edits-cdc-website-now-falsely-links-vaccines-and-autism/",
    "summary": "Under Robert F. Kennedy Jr.'s leadership as the country’s top health official, the CDC’s \"Autism and Vaccines\" webpage was abruptly replaced. The previous page accurately stated that studies show no link between vaccines and autism. The new version, however, promotes the false claim that \"studies have not ruled out the possibility that infant vaccines cause autism,\" described by critics as an \"anti-vaccine screed.\"\n\nThe updated page cherry-picks fringe studies, misrepresents federal reviews, and targets aluminum adjuvants even when irrelevant (e.g., to the MMR vaccine). It cites a two-decade-old survey of 77 parents and dismisses a recent high-quality study of 1.2 million children that found no link between vaccine aluminum and autism, a study Kennedy previously demanded be retracted.\n\nHHS claimed the updates reflect \"gold standard, evidence-based science,\" but anonymous agency officials stated career CDC scientists were not consulted. Medical and health experts expressed \"dismay, anger, and disbelief.\" Dr. Susan Kressly, President of the American Academy of Pediatrics, blasted the changes, calling the link \"false\" and citing over 40 high-quality studies conclusively refuting any connection. She urged the CDC to stop spreading \"harmful myths\" that undermine public trust and threaten vaccination rates, which could lead to increased disease and suffering.",
    "chinese_title": "小肯尼迪的卑劣修改：疾控中心网站现虚假关联疫苗与自闭症",
    "chinese_summary": "在小罗伯特·F·肯尼迪担任国家最高卫生官员期间，疾控中心（CDC）关于“自闭症与疫苗”的网页突然被撤换。此前的页面明确指出，研究表明疫苗与自闭症之间没有关联。然而，新版本却宣扬了“研究尚未排除婴儿疫苗导致自闭症的可能性”这一虚假主张，被批评者形容为“反疫苗檄文”。\n\n更新后的页面挑选边缘研究，歪曲联邦审查结果，甚至在不相关的情况下也针对铝佐剂（例如，与麻腮风疫苗无关）。它引用了一项针对77名父母的20年前的调查，却驳斥了一项近期针对120万儿童的高质量研究，该研究发现疫苗中的铝与自闭症之间没有关联。肯尼迪此前曾要求撤回这项研究。\n\n卫生与公众服务部（HHS）声称这些更新反映了“金标准、循证科学”，但匿名的机构官员表示，疾控中心的职业科学家并未被征求意见。医学和健康专家对此表达了“沮丧、愤怒和难以置信”。美国儿科学会主席苏珊·克雷斯利博士猛烈抨击了这些修改，称这种关联是“虚假的”，并引用了超过40项高质量研究，这些研究明确驳斥了任何关联。她敦促疾控中心停止散布损害公众信任并威胁疫苗接种率的“有害神话”，因为这可能导致疾病增加和痛苦。"
  },
  {
    "id": "45986940",
    "title": "CornHub",
    "url": "https://cornhub.website/",
    "summary": "\"CornHub\" is a parody website designed to mimic the popular adult entertainment platform, but with a humorous focus on corn-related content. The site features sections like \"Hot Corn Videos Worldwide\" and \"Newest Corn Videos,\" presenting titles that comically rephrase typical adult themes using corn terminology. Examples include \"Mass Popping Party!\", \"young cobs left OUTSIDE ALONE,\" \"cornstars get tricked into a 3 way,\" \"Corn Gets Grilled and Passionately Buttered,\" \"cute and innocent cobs get BOILED,\" and \"INTERRACIAL CORN: BIG BLACK COB x TWO MIXED COBS.\"\n\nThe platform lists various social media integrations (Discord, Instagram, TikTok, X, YouTube) and numerous language options. It also highlights \"Featured Cornstars\" such as Cobbers, Gijs, CVideos, and POPPED. CornHub positions itself as \"the most complete and revolutionary corn tube site,\" offering \"100% free corn\" videos and \"CCC photo albums,\" available for streaming or download. It boasts a \"number 1 free popping community on the net\" and promises daily updates, aiming to \"keep your love for corno alive and well\" while encouraging user feedback.",
    "chinese_title": "玉米站",
    "chinese_summary": "“CornHub”是一个恶搞网站，旨在模仿那个流行的成人娱乐平台，但其幽默的重点在于玉米相关内容。该网站设有“全球热门玉米视频”和“最新玉米视频”等板块，其标题用玉米术语诙谐地改写了典型的成人主题。例如：“爆裂派对！”、“嫩玉米芯独自留在户外”、“玉米明星被骗进行三人行”、“玉米被烤并热情地涂上黄油”、“可爱无辜的玉米芯被煮熟了”以及“跨种族玉米：大黑玉米芯X两个杂交玉米芯”。\n\n该平台列出了各种社交媒体集成（Discord、Instagram、TikTok、X、YouTube）和多种语言选项。它还重点介绍了“特色玉米明星”，如Cobbers、Gijs、CVideos和POPPED。CornHub将自己定位为“最完整、最具革命性的玉米视频网站”，提供“100%免费玉米”视频和“CCC相册”，可在线观看或下载。它号称是“网上排名第一的免费爆裂社区”，并承诺每日更新，旨在“让您对玉米的热爱永不熄灭”，同时鼓励用户反馈。"
  },
  {
    "id": "45985978",
    "title": "Tailscale Down",
    "url": "https://status.tailscale.com/incidents/01KAF1H8V7EGFKVG5KGZBB2RJC",
    "summary": "Tailscale experienced a partial outage affecting its coordination server and the admin console (login.tailscale.com) for some users. The incident began on Wednesday, November 19, 2025, at 9:50 PM, causing coordination server errors and slowdowns.\n\nTailscale promptly initiated an investigation, identified the root cause by 10:27 PM, and began working on a fix. By 10:59 PM, the coordination servers were reported to be functioning properly, with ongoing monitoring to ensure stability. The incident was officially resolved on Thursday, November 20, 2025, at 12:22 AM, confirming that the Tailscale coordination server was healthy.",
    "chinese_title": "Tailscale 宕机",
    "chinese_summary": "Tailscale 经历了一次部分服务中断，影响了其协调服务器和部分用户的管理控制台（login.tailscale.com）。该事件始于2025年11月19日星期三晚上9:50，导致协调服务器出现错误和运行缓慢。\n\nTailscale 迅速展开调查，在晚上10:27前查明了根本原因，并开始着手修复。截至晚上10:59，协调服务器报告已恢复正常运行，并持续监控以确保稳定性。该事件于2025年11月20日星期四凌晨12:22正式解决，确认 Tailscale 协调服务器已恢复健康。"
  },
  {
    "id": "45998531",
    "title": "Gmail can read your emails and attachments to train its AI, unless you opt out",
    "url": "https://www.malwarebytes.com/blog/news/2025/11/gmail-is-reading-your-emails-and-attachments-to-train-its-ai-unless-you-turn-it-off",
    "summary": "Google is reportedly rolling out a change that automatically opts Gmail users in to allow their private emails and attachments to be used for training its AI models, such as Gemini, Smart Compose, and AI-generated replies. This is intended to power new Gmail features, making the service smarter and more personalized.\n\nThe concern is that these settings are being enabled by default without explicit user consent, meaning private messages could be analyzed for AI training in the background. While Google promises strong privacy measures like anonymization, using sensitive information for AI training raises significant privacy red flags for many, despite the potential benefits of improved AI assistance.\n\nTo regain control and fully opt out, users must manually change settings in two separate locations:\n\n1.  **Turn off \"Smart Features in Gmail, Chat, and Meet\":**\n    *   Go to Gmail Settings (gear icon > See all settings or Menu > Settings).\n    *   Find \"Smart Features in Gmail, Chat, and Meet\" and uncheck it.\n    *   Save changes.\n\n2.  **Turn off \"Google Workspace Smart Features\":**\n    *   Still in Settings, locate \"Google Workspace smart features.\"\n    *   Click \"Manage Workspace smart feature settings.\"\n    *   Toggle off both \"Smart features in Google Workspace\" and \"Smart features in other Google products.\"\n    *   Save again.\n\nAfter completing both steps, verify that the toggles remain off and refresh Gmail. Google separates these settings to cover features within Workspace apps and those extended to other Google products. The rollout is gradual, so not all accounts may have these enabled by default yet, but users concerned about privacy are advised to check their settings immediately.",
    "chinese_title": "Gmail可以读取你的电子邮件和附件来训练其AI，除非你选择退出。",
    "chinese_summary": "谷歌据报正在推出一项变更，该变更将自动选择Gmail用户启用，允许他们的私人电子邮件和附件用于训练其AI模型，例如Gemini、智能撰写和AI生成回复。此举旨在为新的Gmail功能提供支持，使服务更智能、更个性化。\n\n令人担忧的是，这些设置在没有用户明确同意的情况下默认启用，这意味着私人信息可能会在后台被分析用于AI训练。尽管谷歌承诺采取强大的隐私保护措施，例如匿名化，但将敏感信息用于AI训练仍然给许多人敲响了严重的隐私警钟，即便AI辅助功能可能会得到改进并带来潜在好处。\n\n为了重新获得控制权并完全选择退出，用户必须在两个不同的位置手动更改设置：\n\n1.  **关闭“Gmail、Chat 和 Meet 中的智能功能”：**\n    *   前往 Gmail 设置（齿轮图标 > 查看所有设置 或 菜单 > 设置）。\n    *   找到“Gmail、Chat 和 Meet 中的智能功能”并取消勾选。\n    *   保存更改。\n\n2.  **关闭“Google Workspace 智能功能”：**\n    *   仍在“设置”中，找到“Google Workspace 智能功能”。\n    *   点击“管理 Workspace 智能功能设置”。\n    *   关闭“Google Workspace 中的智能功能”和“其他 Google 产品中的智能功能”两个选项。\n    *   再次保存。\n\n完成以上两个步骤后，请确认这些开关保持关闭状态，并刷新Gmail。谷歌将这些设置分开是为了覆盖Workspace应用内部的功能以及延伸到其他Google产品中的功能。此项推出是逐步进行的，因此并非所有账户都已默认启用这些功能，但建议关注隐私的用户立即检查其设置。"
  },
  {
    "id": "45987252",
    "title": "Measuring the impact of AI scams on the elderly",
    "url": "https://simonlermen.substack.com/p/can-ai-models-be-jailbroken-to-phish",
    "summary": "Unable to access the article link.",
    "chinese_title": "评估AI诈骗对老年人的影响",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46003876",
    "title": "Brexit Hit to UK Economy Double Official Estimate, Study Finds",
    "url": "https://www.bloomberg.com/news/articles/2025-11-21/brexit-hit-to-uk-economy-double-official-estimate-study-finds",
    "summary": "Unable to access the article link.",
    "chinese_title": "脱欧对英国经济的冲击是官方估计的两倍，研究发现",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45993214",
    "title": "Freer Monads, More Extensible Effects (2015) [pdf]",
    "url": "https://okmij.org/ftp/Haskell/extensible/more.pdf",
    "summary": "The provided content consists of raw, compressed PDF stream data, which is not directly human-readable. To summarize the article \"Freer Monads, More Extensible Effects (2015)\", I would need access to the actual text content of the PDF, which cannot be extracted from the binary data provided. Therefore, I am unable to provide a summary based on this input.",
    "chinese_title": "自由单子，更可扩展的效应 (2015) [pdf]",
    "chinese_summary": "所提供的内容是原始的、压缩的PDF流数据，无法直接被人阅读。要总结文章《Freer Monads, More Extensible Effects (2015)》，我需要访问PDF的实际文本内容，而这些内容无法从所提供的二进制数据中提取。因此，我无法根据此输入提供摘要。"
  },
  {
    "id": "45997729",
    "title": "U.S. Coast Guard will no longer classify swastikas, nooses as hate symbols",
    "url": "https://www.washingtonpost.com/national-security/2025/11/20/coast-guard-swastika-noose/",
    "summary": "Unable to access the article link.",
    "chinese_title": "美国海岸警卫队将不再把卍字符、绞索归类为仇恨符号。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45987027",
    "title": "Linux Career Opportunities in 2025: Skills in High Demand",
    "url": "https://www.linuxcareers.com/resources/blog/2025/11/linux-career-opportunities-in-2025-skills-in-high-demand/",
    "summary": "The provided text consists only of a title, \"Linux Career Opportunities in 2025: Skills in High Demand - Linux Jobs & Careers,\" and navigation skips (\"Skip to main navigation,\" \"Skip to main content\"). It does not contain the actual article content detailing Linux career opportunities, in-demand skills, or any other information relevant to the specified topic.\n\nTherefore, it is impossible to provide a summary of the article's main points and key information as the substantive content is missing. To receive a summary, please provide the full body of the article.",
    "chinese_title": "2025年Linux就业前景：热门技能",
    "chinese_summary": "所提供的文本仅包含一个标题：“2025年Linux职业机会：高需求技能 - Linux工作与职业”，以及导航跳过链接（“跳至主导航”，“跳至主要内容”）。其中不包含任何详细阐述Linux职业机会、高需求技能或与指定主题相关的其他信息的实际文章内容。\n\n因此，由于缺乏实质性内容，无法提供文章的主要观点和关键信息的摘要。若要获取摘要，请提供文章的完整正文。"
  },
  {
    "id": "45990575",
    "title": "DOS Days – Laptop Displays",
    "url": "https://www.dosdays.co.uk/topics/laptop_displays.php",
    "summary": "The article \"DOS Days – Laptop Displays\" traces the evolution of laptop screens during the DOS era, highlighting the rapid technological advancements that transformed these crucial components.\n\nInitially, early DOS laptops primarily featured monochrome Liquid Crystal Displays (LCDs), often transflective, capable of emulating CGA, Hercules, or EGA graphics in a single color, usually grey on grey, green on black, or blue on white. Resolutions were low, typically 640x200 or 640x480.\n\nThe progression moved to greyscale displays, offering more shades for better graphical representation, still predominantly passive matrix. The first attempts at color arrived with passive-matrix Super-Twist Nematic (STN) and later Dual Super-Twist Nematic (DSTN) displays. While offering color, these suffered from significant drawbacks: slow refresh rates, resulting in \"ghosting\" or \"submarining\" cursors, narrow viewing angles, and muted, washed-out colors. These limitations often made them unsuitable for fast-moving graphics or detailed work.\n\nThe major breakthrough came with Thin Film Transistor (TFT) active-matrix displays. TFT technology revolutionized laptop screens by providing each pixel with its own transistor, leading to significantly brighter, sharper images, much wider viewing angles, faster response times, and vibrant, true colors. This innovation made graphical user interfaces like Windows practical on laptops and paved the way for modern multimedia experiences, moving far beyond the text-centric world of DOS. The article concludes by emphasizing how these display advancements were fundamental to the laptop's transition from a niche business tool to a versatile personal computer.",
    "chinese_title": "DOS时代 - 笔记本显示屏",
    "chinese_summary": "文章《DOS时代——笔记本电脑显示器》追溯了DOS时代笔记本电脑屏幕的演变，突出了改变这些关键组件的快速技术进步。\n\n最初，早期的DOS笔记本电脑主要采用单色液晶显示器（LCD），通常是半透射式，能够以单一颜色模拟CGA、Hercules或EGA图形，通常是灰底灰字、黑底绿字或白底蓝字。分辨率很低，通常为640x200或640x480。\n\n随后发展到灰度显示器，提供更多色阶以获得更好的图形表现力，但仍以无源矩阵为主。最初的彩色尝试是采用无源矩阵的超扭曲向列（STN）显示器，随后是双层超扭曲向列（DSTN）显示器。尽管提供了彩色显示，但这些显示器存在明显的缺点：刷新率慢，导致光标出现“残影”或“潜水艇效应”；视角窄；颜色暗淡、褪色。这些限制常常使它们不适合显示快速移动的图形或进行精细工作。\n\n真正的突破出现在薄膜晶体管（TFT）有源矩阵显示器。TFT技术通过为每个像素配备独立的晶体管，彻底改变了笔记本电脑屏幕，从而带来更明亮、更清晰的图像，更宽的视角，更快的响应时间以及鲜艳、真实的色彩。这一创新使Windows等图形用户界面在笔记本电脑上变得实用，并为现代多媒体体验铺平了道路，使其远远超越了以文本为中心的DOS世界。文章最后强调，这些显示技术进步对于笔记本电脑从小众商务工具向多功能个人电脑的转型至关重要。"
  },
  {
    "id": "45999622",
    "title": "Prozac 'no better than placebo' for treating children with depression, experts",
    "url": "https://www.theguardian.com/society/2025/nov/20/prozac-no-better-than-placebo-for-treating-children-with-depression-experts-say",
    "summary": "A new meta-analysis suggests that fluoxetine, commonly known as Prozac, offers no clinically meaningful benefit over a placebo for treating depression in children and adolescents. Academics from Austria and the UK reviewed 12 large trials from 1997 to 2024, concluding that any improvement in depressive symptoms was too small to be significant.\n\nThe study argues that current clinical guidelines in the UK, US, and Canada, which recommend antidepressants for young people, should be revised. Authors highlight that exposing children to known side effects – including weight gain, sleep disturbance, concentration problems, and increased suicidal ideation – is unjustifiable when the drug has no advantage over placebo. They also noted a \"novelty bias\" in earlier trials, which were more positive.\n\nThe researchers urge clinicians to prioritize understanding and addressing the underlying causes of depression, rather than prescribing medication with negligible benefit and poorly understood long-term effects.\n\nThe National Institute for Health and Care Excellence (NICE) stated that psychological therapies remain the first-line treatment, with antidepressants considered for moderate to severe cases only under specialist supervision. The Royal College of Psychiatrists, however, advised \"caution\" in interpreting the findings, noting that guidelines weigh various factors beyond just average effect size, such as safety and patient preferences.",
    "chinese_title": "专家：百忧解治疗儿童抑郁症“不优于安慰剂”",
    "chinese_summary": "新的一项荟萃分析表明，氟西汀（俗称百忧解）在治疗儿童和青少年抑郁症方面，相比安慰剂没有临床意义上的益处。来自奥地利和英国的学者审查了1997年至2024年间的12项大型试验，得出的结论是抑郁症状的任何改善都太小，不具有显著性。\n\n该研究认为，目前英国、美国和加拿大建议青少年使用抗抑郁药的临床指南应该修订。作者们强调，当药物对安慰剂没有优势时，让儿童暴露于已知的副作用（包括体重增加、睡眠障碍、注意力不集中和自杀意念增加）是站不住脚的。他们还指出，早期试验存在“新奇偏误”，那些试验的结果更为积极。\n\n研究人员敦促临床医生优先理解和解决抑郁症的根本原因，而不是开出益处微乎其微且长期影响知之甚少的药物。\n\n英国国家健康与护理卓越研究院（NICE）指出，心理疗法仍是一线治疗，抗抑郁药仅在专科医生监督下用于中度至重度病例。然而，英国皇家精神病医师学院建议对研究结果的解读保持“谨慎”，指出指南在考虑平均效应量之外，还会权衡安全性和患者偏好等多种因素。"
  },
  {
    "id": "45998047",
    "title": "GitHut – Programming Languages and GitHub (2014)",
    "url": "https://githut.info/",
    "summary": "GitHut is a 2014 project by Carlo Zapponi designed to visualize and explore the programming languages used across repositories hosted on GitHub, the world's largest code host. The initiative aims to understand language popularity among developers, discover unique language characteristics, and observe the human quest for better problem-solving tools and collaboration.\n\nThe quantitative data for GitHut is collected from GitHub's publicly available API, specifically aggregated and stored by GitHub Archive, which is also accessible via Google BigQuery. This data is updated quarterly. A crucial methodological choice was to use \"Activity\" (number of changes pushed) as the primary metric for language popularity, rather than newly created repositories. This decision was made because many new repositories do not specify a programming language, making \"Activity\" a more reliable indicator. Programming language release years are sourced from Wikipedia.\n\nGitHut provides views such as \"top active languages\" and allows users to explore data by total amount or percentage. The work is licensed under a Creative Commons BY-NC-SA License.",
    "chinese_title": "GitHut — 编程语言与 GitHub (2014)",
    "chinese_summary": "GitHut 是 Carlo Zapponi 在 2014 年创建的一个项目，旨在可视化和探索全球最大代码托管平台 GitHub 上托管的仓库所使用的编程语言。该项目旨在了解开发人员对语言的偏好、发现独特的语言特性，并观察人类对更好的问题解决工具和协作方式的探索。\n\nGitHut 的量化数据来源于 GitHub 公开可用的 API，具体由 GitHub Archive 汇总并存储，GitHub Archive 也可通过 Google BigQuery 访问。这些数据每季度更新一次。一个关键的方法学选择是，使用“活动”（推送的更改数量）作为衡量语言受欢迎程度的主要指标，而非新创建的仓库。做出这一决定是因为许多新仓库没有指定编程语言，“活动”因此成为一个更可靠的指标。编程语言的发布年份来源于维基百科。\n\nGitHut 提供“最活跃语言”等视图，并允许用户按总量或百分比探索数据。该作品根据知识共享署名-非商业性使用-相同方式共享（CC BY-NC-SA）许可协议授权。"
  },
  {
    "id": "45989186",
    "title": "Details about the shebang/hash-bang mechanism on various Unix flavours (2001)",
    "url": "https://www.in-ulm.de/%7Emascheck/various/shebang/",
    "summary": "The shebang (`#!`) mechanism, originating from Bell Labs (Dennis Ritchie) between Research Unix V7 and V8, was first widely implemented in 4.0BSD (1980) and by default in 4.2BSD (1983). Initially, it had strict line length limits (16-32 bytes) and didn't pass arguments.\n\nOver time, `#!` evolved to pass arguments as a single string (Linux) or in a split fashion, though the myth of a *required* blank after `#!` (e.g., in early autoconf docs) is largely unfounded. Setuid support for scripts was often disabled due to security concerns (race conditions), but modern systems like Solaris, Irix, UnixWare, NetBSD, OpenBSD, and MacOS X 10.5+ support it by using virtual filedescriptors (`/dev/fd/n`) to mitigate risks.\n\nNesting `#!` scripts (where the interpreter itself is a script) is generally unsupported, but Linux (since 2.6.27.9) allows up to four levels, and Minix also accepts it. The `env` utility (`#!/usr/bin/env`) enhances script portability by finding interpreters in `PATH`, though `env`'s own location (`/usr/bin/env` vs. `/bin/env`) can still vary.\n\nMaximum line lengths for `#!` increased significantly from the original 16-32 bytes to 127 bytes on Linux, typically `_POSIX_PATH_MAX` (255) or `PATH_MAX` (1024) on many other systems, and `PAGE_SIZE` (e.g., 4096-8192 bytes) on FreeBSD since 6.0. FreeBSD 4.0 briefly introduced comment-like handling of `#` in arguments, which was later revoked, while MacOS X 10.3 adopted it. The article also corrects historical inaccuracies found in the Unix FAQ.",
    "chinese_title": "各种 Unix 版本 shebang/hash-bang 机制详解 (2001)",
    "chinese_summary": "shebang（`#!`）机制起源于贝尔实验室（丹尼斯·里奇）在 Research Unix V7 和 V8 之间，首次在 4.0BSD (1980) 中得到广泛实现，并从 4.2BSD (1983) 开始成为默认功能。最初，它有严格的行长度限制（16-32字节），且不传递参数。\n\n随着时间的推移，`#!` 演变为将参数作为单个字符串（Linux）或以拆分方式传递，尽管关于 `#!` 之后必须有空格的说法（例如在早期的 autoconf 文档中）在很大程度上是毫无根据的。由于安全问题（竞争条件），脚本的 Setuid 支持常常被禁用，但现代系统如 Solaris、Irix、UnixWare、NetBSD、OpenBSD 和 MacOS X 10.5+ 通过使用虚拟文件描述符（`/dev/fd/n`）来缓解风险并支持此功能。\n\n嵌套 `#!` 脚本（即解释器本身也是一个脚本）通常不被支持，但 Linux（自 2.6.27.9 起）允许最多四层嵌套，Minix 也支持此功能。`env` 工具（`#!/usr/bin/env`）通过在 `PATH` 中查找解释器来增强脚本的可移植性，尽管 `env` 本身的路径（`/usr/bin/env` 与 `/bin/env`）仍可能有所不同。\n\n`#!` 的最大行长度从最初的 16-32 字节显著增加，在 Linux 上达到 127 字节，在许多其他系统上通常是 `_POSIX_PATH_MAX` (255) 或 `PATH_MAX` (1024)，在 FreeBSD 6.0 及更高版本上则是 `PAGE_SIZE`（例如 4096-8192 字节）。FreeBSD 4.0 曾短暂引入对参数中 `#` 的注释式处理，但后来被撤销，而 MacOS X 10.3 则采用了此功能。本文还纠正了 Unix FAQ 中发现的历史不准确之处。"
  },
  {
    "id": "46003266",
    "title": "Germany: States Pass Porn Filters for Operating Systems",
    "url": "https://www.heise.de/en/news/Youth-Protection-States-Pass-Porn-Filters-for-Operating-Systems-11086768.html",
    "summary": "Unable to access the article link.",
    "chinese_title": "德国：各州通过操作系统色情过滤器",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46005349",
    "title": "XBMC 4.0 for the Original Xbox",
    "url": "https://www.xbox-scene.info/articles/announcing-xbmc-40-for-the-original-xbox-r64/",
    "summary": "XBMC 4.0 has been released for the Original Xbox, marking the first major update since 2016 and a significant effort to modernize and preserve this iconic homebrew application. Originating as XboxMediaPlayer in 2002, XBMC eventually split into XBMC4Xbox and Kodi, and even influenced Plex, shaping the landscape of media center software.\n\nThis new version revitalizes the platform with several key advancements. Most notably, it introduces the Estuary user interface, a modern skin adapted from Kodi v17, powered by a ported GUIlib engine. This brings a contemporary, intuitive look and improved navigation to the legacy console while maintaining performance.\n\nXBMC 4.0 significantly expands games library support, offering rich metadata, artwork, and descriptions for both Xbox and emulated titles, akin to its movie and music sections. Online metadata scrapers for movies and TV are fully restored, enabling comprehensive media organization. The update also includes improved task scheduling for concurrent activities like background library updates, enhanced music playback with FLAC support and visualizers, and an online add-on repository.\n\nThe project features Python-based add-ons (with future Python 3.4.10 support planned for broader compatibility) and revised settings for playback, network services (including Insignia-compatible DNS), and system tools. This open-source release aims to keep the Original Xbox relevant and useful, demonstrating its enduring potential through active development. XBMC 4.0 is distinct from The Kodi Foundation.",
    "chinese_title": "初代 Xbox 上的 XBMC 4.0",
    "chinese_summary": "XBMC 4.0 已面向初代 Xbox 发布，标志着自 2016 年以来的首次重大更新，也是一项致力于将这款标志性自制应用程序现代化并加以保存的重要举措。XBMC 起源于 2002 年的 XboxMediaPlayer，最终分裂为 XBMC4Xbox 和 Kodi，甚至影响了 Plex，塑造了媒体中心软件的格局。\n\n这个新版本通过几项关键进展为平台注入了新的活力。最值得注意的是，它引入了 Estuary 用户界面，这是一个由移植的 GUIlib 引擎驱动，改编自 Kodi v17 的现代皮肤。这为这款老式主机带来了现代、直观的外观和改进的导航体验，同时保持了性能。\n\nXBMC 4.0 显著扩展了游戏库支持，为 Xbox 游戏和模拟器游戏提供了丰富的元数据、封面图和描述，类似于其电影和音乐部分。针对电影和电视的在线元数据抓取器已完全恢复，从而实现了全面的媒体整理。此次更新还包括改进的任务调度功能，用于处理后台库更新等并发活动；增强的音乐播放功能，支持 FLAC 格式和可视化效果；以及一个在线插件库。\n\n该项目包含基于 Python 的插件（未来计划支持 Python 3.4.10 以实现更广泛的兼容性），并修订了播放、网络服务（包括兼容 Insignia 的 DNS）和系统工具的设置。这个开源版本旨在通过积极的开发，让初代 Xbox 保持其相关性和实用性，展示其持久的潜力。XBMC 4.0 与 Kodi 基金会是独立的。"
  },
  {
    "id": "45997099",
    "title": "OOP is shifting between domains, not disappearing",
    "url": "https://blog.jsbarretto.com/post/actors",
    "summary": "The article posits that Object-Oriented Programming (OOP) is not disappearing but rather shifting its fundamental principles to new domains, a trend the author views negatively. Historically, OOP evolved to manage complexity in software development by enforcing separation and limiting information flow between components through concepts like interfaces, encapsulation, inheritance, and polymorphism.\n\nHowever, the author contends that this internal, language-enforced separation has been replaced by external process and network boundaries. Driven by a pervasive lack of trust among developers and between independently operating programs, modern systems have erected \"highest and thickest walls\" in the form of microservices, Docker, and Kubernetes.\n\nThe author argues that this contemporary distributed architecture, despite its promises of \"scaling,\" merely replicates OOP's flaws on a grander scale, magnifying them tenfold. Analogies are drawn, such as OpenAPI schemas replacing type-checkers and Kubernetes replacing event loops. Every interaction across these components incurs significant overhead, including new failure modes, serialization costs, kernel scheduling, and network latency. The article concludes that while not fully convinced by OOP, the author finds its distributed systems replacement to be an even more complex, inefficient, and problematic paradigm.",
    "chinese_title": "OOP 正在跨领域转移，而非消失。",
    "chinese_summary": "文章认为，面向对象编程（OOP）并未消失，而是将其基本原则转移到了新的领域，作者对此趋势持负面看法。从历史上看，OOP的演变是为了通过接口、封装、继承和多态等概念，强制实现组件间的分离并限制信息流，从而管理软件开发中的复杂性。\n\n然而，作者认为，这种内部的、由语言强制实现的分离已经被外部进程和网络边界所取代。在开发者之间以及独立运行的程序之间普遍存在的不信任感的驱动下，现代系统以微服务、Docker和Kubernetes的形式，竖起了“最高最厚的墙”。\n\n作者认为，这种当代的分布式架构，尽管承诺“可扩展性”，但它只是在更大规模上复制了OOP的缺陷，并将其放大了十倍。文章中进行了类比，例如OpenAPI schema取代了类型检查器，Kubernetes取代了事件循环。这些组件间的每次交互都会产生显著的开销，包括新的故障模式、序列化成本、内核调度和网络延迟。文章总结道，尽管作者并未完全信服OOP，但他认为其分布式系统替代方案是一个更加复杂、低效且充满问题的范式。"
  },
  {
    "id": "45984623",
    "title": "Racing karts on a Rust GPU kernel driver",
    "url": "https://www.collabora.com/news-and-blog/news-and-events/racing-karts-on-a-rust-gpu-kernel-driver.html",
    "summary": "Collabora has announced a significant milestone for Tyr, their Rust driver for Arm Mali GPUs: the prototype can now run a full desktop environment (GNOME, Weston) and demanding 3D games like SuperTuxKart, matching the performance of C-based drivers.\n\nThe article details the progression of Tyr, explaining the crucial role of the kernel-mode driver (KMD) in hardware initialization, memory management, and job scheduling, contrasting it with the user-mode driver's API translation. Initially, development focused on fundamental KMD operations and submitting simple GPU jobs. Subsequent achievements included rendering a rotating cube (kmscube) at display refresh rates and then at over 500 frames per second, demonstrating robust job submission and synchronization.\n\nThe project then scaled up, successfully running Weston and GNOME, allowing users to log in, browse the web, and watch videos. The ultimate test involved running a full-screen 3D game, SuperTuxKart, which performed flawlessly without noticeable hiccups, showcasing the KMD's capability under demanding workloads.\n\nWhile Tyr remains a prototype not yet ready for daily use or upstream integration, it serves as a vital experimental platform and testbed for Rust abstractions in GPU drivers. It definitively proves that Rust GPU KMDs are viable and can deliver performance on par with their C counterparts. Currently, the prototype is limited to the Rock 5B board (Rockchip RK3588), with Collabora encouraging testing and feedback from the community.",
    "chinese_title": "在 Rust GPU 内核驱动上跑卡丁车",
    "chinese_summary": "Collabora 宣布 Tyr（他们为 Arm Mali GPU 开发的 Rust 驱动程序）取得了重要里程碑：该原型现在可以运行完整的桌面环境（GNOME, Weston）以及像 SuperTuxKart 这样的高要求 3D 游戏，性能与基于 C 语言的驱动程序相当。\n\n文章详细介绍了 Tyr 的进展，解释了内核模式驱动程序（KMD）在硬件初始化、内存管理和作业调度中的关键作用，并将其与用户模式驱动程序的 API 转换进行了对比。最初，开发工作侧重于基本的 KMD 操作和提交简单的 GPU 作业。随后的成就包括以显示器刷新率渲染旋转立方体 (kmscube)，然后达到每秒超过 500 帧的速度，这展示了强大的作业提交和同步能力。\n\n随后，该项目进行了扩展，成功运行了 Weston 和 GNOME，用户可以登录、浏览网页和观看视频。最终测试是在全屏模式下运行 3D 游戏 SuperTuxKart，游戏运行流畅，没有任何明显卡顿，展示了 KMD 在高负载工作下的强大能力。\n\n尽管 Tyr 仍是一个原型，尚未准备好用于日常使用或上游集成，但它为 GPU 驱动程序中 Rust 抽象的应用提供了一个重要的实验平台和测试平台。它明确证明了 Rust GPU KMD 是可行的，并且可以提供与 C 语言对应产品相当的性能。目前，该原型仅限于 Rock 5B 开发板（瑞芯微 RK3588），Collabora 鼓励社区进行测试并提供反馈。"
  },
  {
    "id": "45991497",
    "title": "Show HN: Awesome J2ME",
    "url": "https://github.com/hstsethi/awesome-j2me",
    "summary": "This \"Awesome J2ME\" list is a comprehensive curated collection of resources dedicated to Java Platform, Micro Edition (J2ME), a Java specification for old keypad phones and PDAs. The project aims to raise awareness and support for the J2ME community and development.\n\nThe list covers a wide array of topics, including:\n*   **Documentation, Tutorials & Academic Articles:** Providing foundational knowledge and deeper research.\n*   **Communities:** Forums and groups like Kahvibreak Discord and r/J2MEGaming focused on preservation and discussion.\n*   **Development Tools:** Ranging from compilers (Cibyl) and UI toolkits (LWUIT) to build tools like J2ME Polish.\n*   **IDEs & SDKs:** Essential tools for development, such as NetBeans 6.1, Eclipse archives, and the Sun Java ME SDK mirror.\n*   **Emulators:** Software to run J2ME apps on modern platforms, including FreeJ2ME (for desktop), J2ME Loader (for Android), and PSPKvm.\n*   **Hardware:** Referencing resources like the Mobile Phone Museum for historical context.\n*   **Native Software:** A collection of functional applications (e.g., Discord J2ME, Jtube, Telegram Micro, UPI 123PAY) and video games (e.g., Gravity Defied CPP, Moby Games, extensive archives).\n*   **Related Projects:** Linking to other preservation efforts like \"Awesome Symbian.\"\n*   **Reverse Engineering & Decompilers:** Tools like Fernflower and Jd Decompiler for analyzing existing J2ME code.\n\nThe list emphasizes J2ME's role in creating Midlets (.jad or .jar) for platforms like old keypad phones and Symbian, highlighting its historical significance and ongoing preservation efforts.",
    "chinese_title": "HN 展示: J2ME 精选",
    "chinese_summary": "这个“Awesome J2ME”列表是一个全面的精选资源集合，致力于Java平台微型版（J2ME），这是一项针对老式按键手机和PDA的Java规范。该项目旨在提高人们对J2ME社区和开发的认知并给予支持。\n\n该列表涵盖了广泛的主题，包括：\n*   **文档、教程与学术文章：** 提供基础知识和深度研究。\n*   **社区：** 专注于J2ME内容保存与讨论的论坛和群组，例如Kahvibreak Discord和r/J2MEGaming。\n*   **开发工具：** 从编译器（Cibyl）、UI工具包（LWUIT）到构建工具（如J2ME Polish）不等。\n*   **IDE与SDK：** 必备的开发工具，例如NetBeans 6.1、Eclipse存档和Sun Java ME SDK镜像。\n*   **模拟器：** 用于在现代平台上运行J2ME应用的软件，包括FreeJ2ME（桌面版）、J2ME Loader（安卓版）和PSPKvm。\n*   **硬件：** 引用移动电话博物馆等资源以提供历史背景。\n*   **原生软件：** 一系列功能性应用（例如Discord J2ME、Jtube、Telegram Micro、UPI 123PAY）和视频游戏（例如Gravity Defied CPP、Moby Games、大量存档）。\n*   **相关项目：** 链接到其他保护工作，例如“Awesome Symbian”。\n*   **逆向工程与反编译器：** 用于分析现有J2ME代码的工具，例如Fernflower和Jd Decompiler。\n\n该列表强调了J2ME在为老式按键手机和Symbian等平台创建Midlets（.jad或.jar文件）方面的作用，突出了其历史意义和持续的保护工作。"
  },
  {
    "id": "46004364",
    "title": "EXIF orientation info in PNGs isn't used for image-orientation: from-image",
    "url": "https://bugzilla.mozilla.org/show_bug.cgi?id=1627423",
    "summary": "This bug report, titled \"EXIF orientation info in PNGs isn't used for image-orientation: from-image,\" describes an issue where Firefox (and Chrome) fail to apply EXIF orientation data embedded in PNG images, even when the `image-orientation: from-image` CSS property is specified.\n\nThe reporter, Eric Portis, demonstrated that a JPEG and a PNG with identical EXIF \"Rotate 90 CW\" orientation info displayed differently, with only the JPEG correctly rotated. This behavior was observed across multiple browsers. Safari was noted to partially respect EXIF orientation in PNGs if the data appeared before the image data, but Firefox and Chrome did not.\n\nCommenters confirmed that the PNG specification (PNG-3) defines an `eXIf` chunk for this purpose. The initial patches for related image loading work did not cover this, but it was noted that adding support wouldn't be too difficult if the `eXIf` chunk appeared early in the file.\n\nThe bug was categorized as a defect, impacting web compatibility due to differing platform behavior (parity-chrome, parity-safari). After about five years, the bug was marked as RESOLVED DUPLICATE of bug 1682759, indicating that the fix or resolution for this issue is tracked under that other bug.",
    "chinese_title": "PNG中的EXIF方向信息不用于“图像方向：来自图像”。",
    "chinese_summary": "这份题为“PNG图片中的EXIF方向信息未用于`image-orientation: from-image`”的bug报告，描述了一个问题：Firefox（和Chrome）未能应用嵌入在PNG图片中的EXIF方向数据，即使指定了`image-orientation: from-image`这一CSS属性。\n\n报告者Eric Portis演示了具有相同EXIF“顺时针旋转90度”方向信息的JPEG和PNG图片显示不同，只有JPEG图片被正确旋转。这一行为在多个浏览器中被观察到。据指出，Safari在PNG图片中如果EXIF数据出现在图片数据之前，则会部分遵循EXIF方向信息，但Firefox和Chrome则不然。\n\n评论者证实，PNG规范（PNG-3）为此定义了一个`eXIf`块。相关的图片加载工作的初始补丁并未涵盖这一点，但据指出，如果`eXIf`块在文件早期出现，添加支持将不会太困难。\n\n该bug被归类为缺陷，由于不同平台行为（与Chrome、Safari的兼容性问题）而影响网络兼容性。大约五年后，该bug被标记为bug 1682759的“已解决重复”，表明此问题的修复或解决方案在该其他bug下进行跟踪。"
  },
  {
    "id": "45988278",
    "title": "50th Anniversary of BitBLT",
    "url": "https://mastodon.sdf.org/@fvzappa/115574872559813280",
    "summary": "The article announces the 50th anniversary of BitBLT, which is declared for November 19, 2025. This declaration was made by \"Crazy Eddie's Used Computers\" through a post on Mastodon @ SDF. The accompanying Chinese text is a standard technical message from Mastodon, indicating the need for JavaScript to use its web application or the option to choose a platform-specific Mastodon app, and is not directly related to the anniversary announcement itself.",
    "chinese_title": "BitBLT五十周年",
    "chinese_summary": "这篇文章宣布BitBLT的50周年纪念日定于2025年11月19日。这项声明由“Crazy Eddie's Used Computers”通过Mastodon @ SDF上的一篇帖子发布。随附的中文文本是Mastodon的一条标准技术消息，指出需要JavaScript才能使用其网页应用程序，或者可以选择特定平台的Mastodon应用程序，并且与周年纪念日的宣布本身没有直接关系。"
  },
  {
    "id": "45999842",
    "title": "Homeschooling hits record numbers",
    "url": "https://reason.com/2025/11/19/homeschooling-hits-record-numbers/",
    "summary": "Homeschooling is experiencing unprecedented growth in the U.S., becoming an increasingly mainstream educational choice. The initial surge, fueled by COVID-19 pandemic closures and dissatisfaction with remote learning, has not subsided; instead, it indicates a fundamental and resilient shift in how American families approach education.\n\nAngela Watson of Johns Hopkins University reports an average homeschooling growth rate of 5.4% for 2024-2025, nearly triple the pre-pandemic rate of 2%. Over a third of reporting states have reached their highest-ever homeschooling numbers, surpassing even pandemic peaks. While a brief post-pandemic dip occurred, growth rebounded sharply in 2023-2024 and continues, with some states seeing over 20% increases. The total homeschooling population is now estimated at about 6% of students nationwide, up from 3% pre-pandemic, with these figures likely underestimating the true numbers.\n\nThis trend is part of a broader exodus from traditional public schools towards non-public alternatives. Studies by Boston University and the Brookings Institution confirm significant declines in public school enrollment nationally, projecting potential losses of up to 8.5 million students by mid-century if current patterns persist.\n\nThe primary driver is widespread disappointment with public schools, cited for their rigidity, politicization, poor learning outcomes, and perceived politicized lessons. Parents' satisfaction with public schools consistently ranks lowest among educational options, while homeschooling enjoys a 70% favorability rating. This \"fundamental shift\" represents a lasting change in the American educational landscape.",
    "chinese_title": "在家教育人数创历史新高",
    "chinese_summary": "美国家庭教育正经历前所未有的增长，成为一种日益主流的教育选择。最初由新冠疫情停课和对远程学习的不满所引发的激增并未消退，反而预示着美国家庭教育方式的根本性和持久性转变。\n\n约翰霍普金斯大学的安吉拉·沃森报告称，2024-2025年家庭教育的平均增长率为5.4%，几乎是疫情前2%增长率的三倍。超过三分之一的报告州达到了有史以来最高的家庭教育人数，甚至超过了疫情高峰期的水平。尽管疫情后曾出现短暂下降，但2023-2024年增长强劲反弹并持续至今，一些州的增幅超过20%。目前，全国家庭教育学生总数估计约占学生总数的6%，高于疫情前的3%，且这些数字可能低估了实际人数。\n\n这一趋势是学生从传统公立学校大规模转向非公立教育选择的更广泛现象的一部分。波士顿大学和布鲁金斯学会的研究证实，全国公立学校入学人数显著下降，如果目前的模式持续下去，预计到本世纪中叶学生人数可能损失高达850万。\n\n主要驱动因素是对公立学校普遍存在的失望，其原因包括僵化、政治化、学习成果不佳以及被认为带有政治色彩的课程。在所有教育选择中，家长对公立学校的满意度一直排名最低，而家庭教育则享有70%的好评率。这种“根本性转变”代表着美国教育格局的持久性变化。"
  },
  {
    "id": "46006183",
    "title": "Private Equity's New Venture: Youth Sports",
    "url": "https://jacobin.com/2025/11/youth-sports-hockey-private-equity",
    "summary": "Private equity firms are rapidly acquiring the $40 billion youth sports industry, shifting its focus from child development to profit maximization, often at the expense of families. A prime example is Black Bear Sports Group, the largest owner-operator of hockey rinks, which bans parents from recording their children's games. Instead, families are forced to subscribe to expensive exclusive streaming services like Black Bear TV, costing significantly more than professional sports streaming. Parents face threats of team penalties for non-compliance, a concern raised by Sen. Chris Murphy.\n\nBlack Bear and similar firms also impose new fees, such as a $50 \"registration and insurance\" charge, exacerbating already high costs for equipment, leagues, and travel. These rising expenses, averaging over $1,000 annually per child and $2,500 for hockey, are pricing lower-income families out of youth sports, turning it into a \"sport of kings.\"\n\nThis trend extends beyond hockey; Unrivaled Sports consolidates baseball leagues, and Bain Capital-backed Varsity Brands dominates competitive cheerleading, imposing exclusive apparel and streaming (Varsity TV) and facing antitrust lawsuits. Critics argue this private equity playbook—acquiring distressed assets, loading with debt, slashing costs, and extracting maximum profit—degrades service quality and creates monopolies. Despite high prices, services like Black Bear TV face complaints about poor streaming quality. These practices control venues, leagues, tournaments, and even ratings, limiting choices and further inflating costs for families.",
    "chinese_title": "私募股权的新尝试：青少年体育",
    "chinese_summary": "私募股权公司正在迅速收购价值400亿美元的青少年体育产业，将其重心从儿童发展转向利润最大化，而这往往是以牺牲家庭利益为代价的。一个主要例子是黑熊体育集团，它是最大的冰球场馆所有者兼运营商，该集团禁止家长录制他们孩子的比赛。相反，家庭被迫订阅昂贵的独家流媒体服务，例如黑熊电视，其费用远高于专业体育流媒体。参议员克里斯·墨菲曾提出担忧，家长若不遵守规定将面临球队惩罚的威胁。\n\n黑熊体育及类似公司还征收新费用，例如50美元的“注册和保险”费，这加剧了本已高昂的设备、联赛和差旅费用。这些不断上涨的开支，平均每个孩子每年超过1000美元，冰球项目则达到2500美元，正在将低收入家庭排挤出青少年体育领域，使其变成“国王的运动”。\n\n这种趋势不仅限于冰球；无与伦比体育公司（Unrivaled Sports）整合棒球联赛，贝恩资本支持的Varsity Brands公司主导竞技啦啦队领域，强制推行独家服装和流媒体服务（Varsity TV），并面临反垄断诉讼。批评人士认为，这种私募股权的惯用策略——收购不良资产、背负债务、削减成本并榨取最大利润——正在降低服务质量并制造垄断。尽管价格高昂，黑熊电视等服务仍面临流媒体质量差的投诉。这些做法控制着场馆、联赛、锦标赛乃至评分，限制了选择，并进一步提高了家庭的开支。"
  },
  {
    "id": "46004118",
    "title": "Jmail: Gmail Clone with Epstein's Emails",
    "url": "https://jmail.world",
    "summary": "The \"Jmail\" content describes a conceptual Gmail-like interface presenting what are claimed to be real emails of Jeffrey Epstein, allegedly released by Congress. The simulated user is logged in as Epstein, with access to browse, star, search, or view a random selection from a database of 2,235 emails.\n\nThe displayed emails, primarily from 2018-2019, illustrate a broad range of Epstein's communications. They include numerous news digests from sources like Quora and Flipboard, covering political events (e.g., Mueller investigation, Trump administration news, 2020 Democratic debates), financial updates, and general interest articles.\n\nNotable correspondence features exchanges with individuals such as Steve Bannon, Joichi Ito, and Paul Morris, discussing political commentary, financial opportunities, and personal matters. Subjects also directly reference Epstein's own legal issues (his arrest, prosecutor's conduct), links to news articles, and organizational announcements. The content provides an overview of the types of digital communications and contacts associated with Jeffrey Epstein, as presented through this simulated platform.",
    "chinese_title": "Jmail：Gmail克隆版，内含爱泼斯坦邮件",
    "chinese_summary": "“Jmail”内容描述了一个概念性的类似Gmail的界面，展示了据称是国会发布的、属于杰弗里·爱泼斯坦的真实电子邮件。模拟用户以爱泼斯坦的身份登录，可以浏览、加星标、搜索或随机查看一个包含2,235封电子邮件的数据库。\n\n所展示的电子邮件主要来自2018-2019年，揭示了爱泼斯坦广泛的通信内容。其中包含大量来自Quora和Flipboard等来源的新闻摘要，涵盖政治事件（例如穆勒调查、特朗普政府新闻、2020年民主党辩论）、金融更新以及一般兴趣文章。\n\n值得注意的通信包括与史蒂夫·班农、伊藤穰一和保罗·莫里斯等人的交流，讨论政治评论、金融机会和个人事务。主题还直接提及爱泼斯坦自身的法律问题（他的被捕、检察官的行为）、新闻文章链接以及组织公告。这些内容通过这个模拟平台，概述了与杰弗里·爱泼斯坦相关的数字通信和联系类型。"
  },
  {
    "id": "45998396",
    "title": "Virgin and Qantas to ban use of portable power banks after string of fires",
    "url": "https://www.abc.net.au/news/2025-11-21/airlines-virgin-australia-qantas-ban-power-banks/106033982",
    "summary": "Virgin Australia, Qantas, QantasLink, and Jetstar are implementing new bans on the use and charging of portable power banks during flights, effective December 1 and December 15, 2025, respectively. This decision follows a string of international and domestic lithium battery fires, including a mid-air incident on a Virgin Australia flight in July and an emergency landing by Air China.\n\nUnder the new rules, passengers are limited to two power banks in their carry-on baggage. Virgin Australia requires power banks to be easily accessible (not in overhead lockers) and permits up to 100 Wh unrestricted, with 100-160 Wh needing airline approval. Qantas and Jetstar will allow two power banks, each under 160 Wh. Crucially, power banks cannot be used or charged on board, though in-seat charging ports for other devices remain permissible. Power banks continue to be prohibited in checked baggage.\n\nVirgin Australia's chief operations officer Chris Snook stated these changes align with international safety standards amidst a global increase in lithium battery devices carried by travellers. The Australian Transport Safety Bureau (ATSB) has recorded five in-flight power bank fires on Australian aircraft since 2016. The Flight Attendants Association of Australia (FAAA) has long called for tougher regulations, highlighting the dangers.\n\nThe Australian Competition and Consumer Commission (ACCC) reported a 92% increase in lithium battery incidents between 2020-2022, issuing 17 power bank recalls. Many international airlines, including Emirates, Cathay Pacific, and Korean Air, have already banned power bank use on flights, making Australian carriers' new policies consistent with global safety standards.",
    "chinese_title": "维珍航空和澳航因多起火灾将禁用移动电源。",
    "chinese_summary": "维珍澳大利亚航空、澳洲航空、澳洲快运航空和捷星航空将分别于2025年12月1日和12月15日起，在航班上实施新的禁止使用和为便携式充电宝充电的规定。此决定是由于一系列国际和国内锂电池火灾事故引发的，其中包括7月份维珍澳大利亚航空一次航班上的空中事故以及中国国际航空的一次紧急降落。\n\n根据新规定，乘客随身行李中携带的充电宝数量限制为两个。维珍澳大利亚航空要求充电宝易于取用（不可放在头顶储物柜中），并允许携带能量不超过100瓦时（Wh）的充电宝，无需申报；能量在100至160瓦时（Wh）之间的则需获得航空公司批准。澳洲航空和捷星航空将允许携带两个充电宝，每个的能量均不得超过160瓦时（Wh）。重要的是，充电宝在机上不能使用或充电，但用于其他设备的座椅充电端口仍然可以使用。充电宝仍然禁止托运。\n\n维珍澳大利亚航空首席运营官克里斯·斯努克（Chris Snook）表示，这些变化符合国际安全标准，以应对全球旅客携带的锂电池设备数量的增加。澳大利亚运输安全局（ATSB）的数据显示，自2016年以来，澳大利亚飞机上已发生五起机上充电宝火灾。澳大利亚空乘协会（FAAA）长期以来一直呼吁更严格的规定，强调其潜在危险。\n\n澳大利亚竞争与消费者委员会（ACCC）报告称，2020年至2022年间，锂电池事故增加了92%，并发布了17次充电宝召回。包括阿联酋航空、国泰航空和大韩航空在内的许多国际航空公司已经禁止在航班上使用充电宝，这使得澳大利亚航空公司的这项新政策与全球安全标准保持一致。"
  },
  {
    "id": "46005928",
    "title": "The New AI Consciousness Paper",
    "url": "https://www.astralcodexten.com/p/the-new-ai-consciousness-paper",
    "summary": "A new paper by Yoshua Bengio, David Chalmers, and others in *Trends In Cognitive Science* addresses the often-poor discourse on AI consciousness. It restricts its focus to computational theories, examining models like Recurrent Processing Theory, Global Workspace Theory, and Higher Order Theory, which largely involve various \"feedback mechanisms\" in information processing.\n\nThe paper tentatively concludes that while current AI systems, like LLMs, are not conscious due to their feedforward nature, there are no technical barriers to building future AI architectures that satisfy these computational requirements for consciousness.\n\nPhilosophically, the paper commendably defines its target as \"phenomenal consciousness\" – the subjective, internal experience (\"something it is like\") – distinguishing it from \"access consciousness\" (information available for report). However, the present article's author criticizes the paper for then applying theories typically associated with access consciousness (e.g., Global Workspace Theory) to phenomenal consciousness. This conflation leads to \"strange results,\" such as the implication that a company with a boss and employees communicating could be phenomenally conscious. The author questions the leap from computational feedback to genuine subjective experience, highlighting the fundamental difficulty in grounding phenomenal consciousness.",
    "chinese_title": "新人工智能意识论文",
    "chinese_summary": "Yoshua Bengio、David Chalmers 等人在《认知科学趋势》上发表的一篇新论文，旨在解决关于人工智能意识的普遍存在的低质量讨论。该论文将重点限制在计算理论上，考察了递归处理理论、全局工作空间理论和高阶理论等模型，这些模型在信息处理中很大程度上涉及各种“反馈机制”。\n\n该论文初步得出结论，尽管当前的人工智能系统（如大型语言模型LLMs）由于其前馈性质而没有意识，但构建满足这些意识计算要求的未来人工智能架构没有技术障碍。\n\n从哲学角度看，该论文值得称赞地将其目标定义为“现象意识”——即主观的、内在的体验（“有某种感受”）——并将其与“可及意识”（可供报告的信息）区分开来。然而，本文作者批评该论文随后将通常与可及意识相关的理论（例如全局工作空间理论）应用于现象意识。这种混淆导致了“奇怪的结果”，例如，这意味着一个有老板和员工进行沟通的公司可能拥有现象意识。作者质疑了从计算反馈到真正主观体验的这一飞跃，强调了将现象意识置于基础之上的根本性困难。"
  },
  {
    "id": "45991835",
    "title": "Tesla Robotaxi had 3 more crashes, now 7 total",
    "url": "https://electrek.co/2025/11/17/tesla-robotaxi-had-3-more-crashes-now-7-total/",
    "summary": "Tesla has reported three more Robotaxi crashes in Austin, Texas, bringing its total to seven incidents since the service launched. These new crashes occurred in September 2025 and involved an animal, a cyclist, and a Robotaxi driving into a car backing up. Most incidents resulted in property damage, though one July crash caused minor injuries.\n\nTesla began reporting to NHTSA after moving in-car supervisors from the driver's to the passenger seat. Previously, it reported three crashes in July and one more last month. The fleet had covered roughly 250,000 miles by early November for four crashes, now totaling around 300,000 miles for seven.\n\nThe article notes Tesla's crash rate is approximately twice as high as Waymo's, despite the presence of human supervisors ready to intervene. A significant point of criticism is Tesla's practice of redacting crash narratives in its NHTSA reports, which prevents the public from understanding the details and fault, unlike other companies.\n\nThe author expresses concern, pointing out that 7 crashes in about 300,000 miles for Tesla is worrying, especially compared to the human average of one crash per 700,000 miles. A commenter also criticizes Tesla's \"vision-only\" approach, arguing it's insufficient for safe, unsupervised Level-4 autonomy, which typically relies on additional sensors like lidar or radar for reliability.",
    "chinese_title": "特斯拉自动驾驶出租车再添3起撞车事故，累计已达7起。",
    "chinese_summary": "特斯拉报告了在德克萨斯州奥斯汀发生的另外三起Robotaxi（自动驾驶出租车）事故，使其服务启动以来的事故总数达到七起。这些新事故发生在2025年9月，涉及动物、骑自行车的人，以及一辆Robotaxi撞上了一辆正在倒车的汽车。大多数事故造成了财产损失，不过7月的一起事故导致了轻伤。\n\n特斯拉在将车内监督员从驾驶座移至副驾驶座后，开始向美国国家公路交通安全管理局（NHTSA）报告事故。此前，它在7月报告了三起事故，上个月又报告了一起。截至11月初，该车队在发生四起事故时已行驶了大约25万英里；现在发生七起事故时，总计行驶里程约为30万英里。\n\n文章指出，尽管有随时准备干预的人类监督员，特斯拉的事故率大约是Waymo的两倍。一个重要的批评点是特斯拉在向NHTSA提交的报告中会删减事故叙述，这使得公众无法像了解其他公司事故那样了解事故细节和责任。\n\n作者表示担忧，指出特斯拉在约30万英里内发生7起事故令人不安，特别是与人类平均每70万英里发生一起事故相比。一位评论员也批评了特斯拉的“纯视觉”方案，认为这不足以实现安全的、无人监督的L4级自动驾驶，L4级自动驾驶通常依靠激光雷达或毫米波雷达等额外传感器来确保可靠性。"
  },
  {
    "id": "45985318",
    "title": "Labor Department Won't Publish October Unemployment Rate",
    "url": "https://www.wsj.com/economy/bls-to-publish-november-jobs-data-on-december-16-b9baab5c",
    "summary": "The Labor Department's Bureau of Labor Statistics (BLS) will not publish a standalone unemployment rate for October, a direct consequence of the recent government shutdown. Instead, the BLS announced it would release the November unemployment rate on December 16, with this report also incorporating data collected for October.\n\nThis decision marks an unprecedented situation for modern jobs data, creating a \"statistical black hole\" for the month of October. It will make it significantly more difficult for economists and policymakers to accurately assess the state of the labor market during that period, including the immediate impact of the government shutdown itself. While October data will be included, disaggregating it from November's figures will be challenging, potentially obscuring specific monthly trends.\n\nEconomists will face a longer wait for crucial labor market insights and will likely resort to other indicators like jobless claims or anecdotal evidence to piece together an understanding of October's employment landscape. The combined report on December 16 will also be published later than typical for a November jobs release, highlighting the significant disruption caused by the shutdown and the BLS's efforts to provide comprehensive data despite the delays.",
    "chinese_title": "劳工部不会公布十月失业率",
    "chinese_summary": "劳工部劳工统计局（BLS）将不会公布独立的十月份失业率，这是近期政府停摆的直接后果。相反，劳工统计局宣布将于12月16日发布11月份失业率，该报告也将包含10月份收集的数据。\n\n这一决定标志着现代就业数据史无前例的情况，为十月份制造了一个“统计黑洞”。这将使经济学家和政策制定者更难以准确评估该时期的劳动力市场状况，包括政府停摆本身的直接影响。尽管10月份数据会被包含在内，但要将其从11月份的数据中分离出来将极具挑战性，可能掩盖具体的月度趋势。\n\n经济学家将需要更长时间才能获得关键的劳动力市场洞察，并可能诉诸其他指标，如失业金申请或坊间证据，来拼凑出对10月份就业状况的理解。12月16日发布的这份合并报告也将比通常的11月就业报告发布时间晚，这凸显了停摆造成的重大干扰以及劳工统计局尽管面临延误仍努力提供全面数据的决心。"
  },
  {
    "id": "45989650",
    "title": "Implementation of a Java Processor on a FPGA (2016)",
    "url": "https://mavmatrix.uta.edu/electricaleng_theses/337/",
    "summary": "In \"Implementation of a Java Processor on a FPGA\" (2016), Omkar Joshi addresses the performance drawbacks of Java applications, which stem from the Java Virtual Machine (JVM)'s role in interpreting and translating Java bytecodes into native processor instructions. While Java's architectural neutrality and portability contribute to its widespread popularity, this interpretation process, along with functionalities like dynamic linking, introduces significant execution overhead compared to natively compiled programs.\n\nTo mitigate this, Joshi developed a specialized processor where Java bytecodes are the native instructions. This innovative approach eliminates the time-consuming interpretation and translation steps, thereby accelerating Java application execution. Furthermore, the project aims to enhance efficiency by pre-processing class files, reducing run-time dependencies before loading them into the processor's memory.\n\nThe processor is implemented on a Field Programmable Gate Array (FPGA), offering crucial advantages. The FPGA platform allows the Java Machine to be updated with new Java standards even after field installation, ensuring its longevity and relevance. Additionally, FPGAs enable application-specific optimization by integrating custom hardware modules, further boosting processing speed for particular tasks. Key concepts in this work include FPGA, Java Virtual Machine, and Java processor. This Master's thesis was completed at The University of Texas at Arlington.",
    "chinese_title": "基于FPGA的Java处理器实现 (2016)",
    "chinese_summary": "Omkar Joshi在2016年发表的《在FPGA上实现Java处理器》一文中，探讨了Java应用程序的性能缺陷，这些缺陷源于Java虚拟机（JVM）在解释和翻译Java字节码为原生处理器指令过程中扮演的角色。尽管Java的架构中立性和可移植性使其广受欢迎，但这种解释过程，以及动态链接等功能，相比于原生编译程序，引入了显著的执行开销。\n\n为了缓解这个问题，Joshi开发了一种专门的处理器，其中Java字节码就是原生指令。这种创新方法消除了耗时的解释和翻译步骤，从而加速了Java应用程序的执行。此外，该项目旨在通过预处理类文件来提高效率，在将它们加载到处理器内存之前减少运行时依赖。\n\n该处理器实现在现场可编程门阵列（FPGA）上，提供了关键优势。FPGA平台允许Java机器在现场安装后仍能通过更新适应新的Java标准，确保其长期可用性和相关性。此外，FPGA通过集成定制硬件模块实现应用程序特定的优化，进一步提高特定任务的处理速度。这项工作的关键概念包括FPGA、Java虚拟机和Java处理器。这篇硕士论文在德克萨斯大学阿灵顿分校完成。"
  },
  {
    "id": "46004386",
    "title": "Building a Minimal Viable Armv7 Emulator from Scratch",
    "url": "https://xnacly.me/posts/2025/building-a-minimal-viable-armv7-emulator/",
    "summary": "The article details the creation of \"stinkarm,\" a Minimal Viable Armv7 Emulator built from scratch in Rust. The author aimed for zero dependencies and completed the project in 1.3k lines, driven by a desire to understand the ELF format, ARM 32-bit instruction encoding, and assembly execution for a future JIT compiler project.\n\nStinkarm functions as a userspace emulator, parsing and validating 32-bit ARM binaries, mapping segments into host memory, decoding a subset of ARM instructions, translating guest and host memory interactions, and forwarding ARM Linux syscalls to x86-64 System V syscalls. It can execute a \"hello world\" binary in 1.9ms (0.015ms raw emulation), making it ~100-1000x slower than native ARMv7, but demonstrating its viability.\n\nThe development process involved creating a build script (`bld_exmpl`) and Nix flake to compile ARMv7 assembly on a non-ARM system. A significant part of the article focuses on ELF parsing. The emulator strictly validates the 52-byte `Elf32_Ehdr` for correct magic bytes, 32-bit class, little-endian data, current version, ARM machine type, and executable type. It then uses `phoff` and `phentsize` from this header to locate and interpret `Elf32_Phdr` entries, which describe program segments. Rust's `TryFrom` trait and custom `le16!` and `le32!` macros are utilized for safe and type-checked parsing of little-endian byte sequences.",
    "chinese_title": "从零开始构建最小可行 Armv7 模拟器",
    "chinese_summary": "The article details the creation of \"stinkarm,\" a Minimal Viable Armv7 Emulator built from scratch in Rust. The author aimed for zero dependencies and completed the project in 1.3k lines, driven by a desire to understand the ELF format, ARM 32-bit instruction encoding, and assembly execution for a future JIT compiler project.\n\nStinkarm functions as a userspace emulator, parsing and validating 32-bit ARM binaries, mapping segments into host memory, decoding a subset of ARM instructions, translating guest and host memory interactions, and forwarding ARM Linux syscalls to x86-64 System V syscalls. It can execute a \"hello world\" binary in 1.9ms (0.015ms raw emulation), making it ~100-1000x slower than native ARMv7, but demonstrating its viability.\n\nThe development process involved creating a build script (`bld_exmpl`) and Nix flake to compile ARMv7 assembly on a non-ARM system. A significant part of the article focuses on ELF parsing. The emulator strictly validates the 52-byte `Elf32_Ehdr` for correct magic bytes, 32-bit class, little-endian data, current version, ARM machine type, and executable type. It then uses `phoff` and `phentsize` from this header to locate and interpret `Elf32_Phdr` entries, which describe program segments. Rust's `TryFrom` trait and custom `le16!` and `le32!` macros are utilized for safe and type-checked parsing of little-endian byte sequences."
  },
  {
    "id": "45985799",
    "title": "Roblox Requires Age Checks for Communication, Ushering in New Safety Standard",
    "url": "https://corp.roblox.com/newsroom/2025/11/roblox-requires-age-checks-limits-minor-and-adult-chat",
    "summary": "生成摘要时出错",
    "chinese_title": "Roblox Requires Age Checks for Communication, Ushering in New Safety Standard",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45984072",
    "title": "Pozsar's Bretton Woods III: The Framework",
    "url": "https://philippdubach.com/2025/10/25/pozsars-bretton-woods-iii-the-framework-1/2/",
    "summary": "生成摘要时出错",
    "chinese_title": "Pozsar's Bretton Woods III: The Framework",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45987289",
    "title": "Debunking the Myths of the HBO Chernobyl series (2023)",
    "url": "https://blog.osm-ai.net/investigation/2023/01/05/hbo-chernobyl-myth.html",
    "summary": "生成摘要时出错",
    "chinese_title": "揭穿HBO《切尔诺贝利》系列剧迷思 (2023年)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45987220",
    "title": "Workday to acquire Pipedream",
    "url": "https://newsroom.workday.com/2025-11-19-Workday-Signs-Definitive-Agreement-to-Acquire-Pipedream",
    "summary": "生成摘要时出错",
    "chinese_title": "Workday to acquire Pipedream",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45999256",
    "title": "RI judge intervenes after ICE mistakenly detains Superior Court intern",
    "url": "https://www.wpri.com/news/local-news/providence/ri-judge-intervenes-after-ice-mistakenly-detains-superior-court-intern/",
    "summary": "生成摘要时出错",
    "chinese_title": "罗德岛法官在移民局错拘高等法院实习生后介入。",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46002138",
    "title": "The Qtile Window Manager: A Python-Powered Tiling Experience",
    "url": "https://tech.stonecharioteer.com/posts/2025/qtile-window-manager/",
    "summary": "This article details the author's journey from XFCE to the Qtile window manager, attracted by its Python-powered configuration. Emphasizing isolation, the author describes installing Qtile within a Python 3.10 virtual environment in `/opt/qtile` using the `deadsnakes` PPA, and configuring a `.desktop` entry and `~/.xsessionrc` for startup services like wallpaper restoration.\n\nThe core of the article showcases a highly customized Qtile setup built on principles of modularity, adaptive behavior, practical keybindings, and visual consistency. Key features include a custom color scheme and unique assets (like a \"straw-hat\" icon), smart mouse movement for multi-monitor setups, and logical Vim-style keybindings.\n\nLeveraging Python's power, the configuration integrates hardware-aware widgets that detect battery presence, display dynamic IP addresses, and monitor AMD GPU VRAM usage via `amdgpu_top`. Screen layouts adapt dynamically to the number of connected monitors, providing richer information on the primary display. Startup hooks (`autostart.sh`, `reload.sh`) manage scripts for initial setup and reloads.\n\nLessons learned highlight the immense power of Python for complex logic, the value of iterative customization, the necessity of hardware awareness, and performance considerations. Future plans include developing custom widgets for notifications, tmux, Kubernetes, and enhancing multi-monitor support and external integrations. The author concludes that Qtile has significantly transformed and boosted their Linux desktop productivity.",
    "chinese_title": "The Qtile Window Manager: A Python-Powered Tiling Experience",
    "chinese_summary": "This article details the author's journey from XFCE to the Qtile window manager, attracted by its Python-powered configuration. Emphasizing isolation, the author describes installing Qtile within a Python 3.10 virtual environment in `/opt/qtile` using the `deadsnakes` PPA, and configuring a `.desktop` entry and `~/.xsessionrc` for startup services like wallpaper restoration.\n\nThe core of the article showcases a highly customized Qtile setup built on principles of modularity, adaptive behavior, practical keybindings, and visual consistency. Key features include a custom color scheme and unique assets (like a \"straw-hat\" icon), smart mouse movement for multi-monitor setups, and logical Vim-style keybindings.\n\nLeveraging Python's power, the configuration integrates hardware-aware widgets that detect battery presence, display dynamic IP addresses, and monitor AMD GPU VRAM usage via `amdgpu_top`. Screen layouts adapt dynamically to the number of connected monitors, providing richer information on the primary display. Startup hooks (`autostart.sh`, `reload.sh`) manage scripts for initial setup and reloads.\n\nLessons learned highlight the immense power of Python for complex logic, the value of iterative customization, the necessity of hardware awareness, and performance considerations. Future plans include developing custom widgets for notifications, tmux, Kubernetes, and enhancing multi-monitor support and external integrations. The author concludes that Qtile has significantly transformed and boosted their Linux desktop productivity."
  },
  {
    "id": "45996921",
    "title": "The AI bubble is bigger than you think",
    "url": "https://prospect.org/2025/11/19/ai-bubble-bigger-than-you-think/",
    "summary": "生成摘要时出错",
    "chinese_title": "The AI bubble is bigger than you think",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45983312",
    "title": "Why Samsung Phones Are Failing Emergency Calls in Australia",
    "url": "https://hackaday.com/2025/11/19/why-samsung-phones-are-failing-emergency-calls-in-australia/",
    "summary": "Samsung phones in Australia are failing to connect to the Triple Zero (000) emergency line, an issue linked to at least one death and putting thousands at risk. This critical problem stems from Australia's 3G network shutdown (2023-2024), which exposed flaws in Voice-over-LTE (VoLTE) functionality on 4G and 5G devices.\n\nUnlike robust 2G/3G circuit-switched calls, VoLTE is a data-based system that lacks consistent global interoperability. Many older 4G/5G phones, particularly certain Samsung models, were either sold without proper VoLTE implementation or fail to make emergency calls when roaming or using specific network providers. For instance, some Samsung phones fail to connect 000 when only the Vodafone network is available, even if they work on Telstra or Optus.\n\nSamsung has identified affected models: older devices from 2016-2017 (e.g., Galaxy S7) require replacement, while newer ones (e.g., Galaxy S20+, S21 Ultra 5G) can be fixed with software updates. Telecoms are contacting customers, with non-compliant devices facing bans from networks.\n\nThis issue isn't unique to Australia; European authorities have noted similar VoLTE emergency calling failures, especially when international roaming. The problem highlights the loose standardization of VoLTE, which, unlike older reliable 2G/3G systems, fails to guarantee emergency call functionality across all networks as 2G/3G services are phased out globally.",
    "chinese_title": "Why Samsung Phones Are Failing Emergency Calls in Australia",
    "chinese_summary": "Samsung phones in Australia are failing to connect to the Triple Zero (000) emergency line, an issue linked to at least one death and putting thousands at risk. This critical problem stems from Australia's 3G network shutdown (2023-2024), which exposed flaws in Voice-over-LTE (VoLTE) functionality on 4G and 5G devices.\n\nUnlike robust 2G/3G circuit-switched calls, VoLTE is a data-based system that lacks consistent global interoperability. Many older 4G/5G phones, particularly certain Samsung models, were either sold without proper VoLTE implementation or fail to make emergency calls when roaming or using specific network providers. For instance, some Samsung phones fail to connect 000 when only the Vodafone network is available, even if they work on Telstra or Optus.\n\nSamsung has identified affected models: older devices from 2016-2017 (e.g., Galaxy S7) require replacement, while newer ones (e.g., Galaxy S20+, S21 Ultra 5G) can be fixed with software updates. Telecoms are contacting customers, with non-compliant devices facing bans from networks.\n\nThis issue isn't unique to Australia; European authorities have noted similar VoLTE emergency calling failures, especially when international roaming. The problem highlights the loose standardization of VoLTE, which, unlike older reliable 2G/3G systems, fails to guarantee emergency call functionality across all networks as 2G/3G services are phased out globally."
  },
  {
    "id": "45991257",
    "title": "Border Patrol is monitoring drivers, detaining those with 'suspicious' patterns",
    "url": "https://abcnews.go.com/Technology/wireStory/border-patrol-monitoring-us-drivers-detaining-suspicious-travel-127699704",
    "summary": "生成摘要时出错",
    "chinese_title": "Border Patrol is monitoring drivers, detaining those with 'suspicious' patterns",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45987784",
    "title": "Crypto got everything it wanted. Now it's sinking",
    "url": "https://www.economist.com/finance-and-economics/2025/11/18/crypto-got-everything-it-wanted-now-its-sinking",
    "summary": "生成摘要时出错",
    "chinese_title": "Crypto got everything it wanted. Now it's sinking",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45990287",
    "title": "Why Zig Is Quietly Doing What Rust Couldn't: Staying Simple",
    "url": "https://freedium-mirror.cfd/@daxx5/why-zig-is-quietly-doing-what-rust-couldnt-staying-simple-a47f86b3a58a",
    "summary": "生成摘要时出错",
    "chinese_title": "Why Zig Is Quietly Doing What Rust Couldn't: Staying Simple",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46001727",
    "title": "Microsoft AI CEO Puzzled by People Being Unimpressed by AI",
    "url": "https://80.lv/articles/microsoft-ai-ceo-puzzled-by-people-being-unimpressed-by-ai",
    "summary": "生成摘要时出错",
    "chinese_title": "Microsoft AI CEO Puzzled by People Being Unimpressed by AI",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45989394",
    "title": "Show HN: An A2A-compatible, open-source framework for multi-agent networks",
    "url": "https://github.com/openagents-org/openagents",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: An A2A-compatible, open-source framework for multi-agent networks",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45986728",
    "title": "40% of young U.S. women want to leave the country: Gallup poll",
    "url": "https://www.deseret.com/politics/2025/11/18/gallup-poll-finds-us-women-want-leave-country-permanently/",
    "summary": "生成摘要时出错",
    "chinese_title": "40% of young U.S. women want to leave the country: Gallup poll",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45984282",
    "title": "Robert Louis Stevenson's Art of Living (and Dying)",
    "url": "https://lithub.com/robert-louis-stevensons-art-of-living-and-dying/",
    "summary": "生成摘要时出错",
    "chinese_title": "Robert Louis Stevenson's Art of Living (and Dying)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46000303",
    "title": "Measuring Latency (2015)",
    "url": "https://bravenewgeek.com/everything-you-know-about-latency-is-wrong/",
    "summary": "生成摘要时出错",
    "chinese_title": "Measuring Latency (2015)",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46003906",
    "title": "Trump administration eliminates protections for endangered species",
    "url": "https://www.cbsnews.com/news/trump-administration-endangered-species-act-rollback/",
    "summary": "生成摘要时出错",
    "chinese_title": "Trump administration eliminates protections for endangered species",
    "chinese_summary": "生成摘要时出错"
  }
]