[
  {
    "id": "46138238",
    "title": "Ghostty is now non-profit",
    "url": "https://mitchellh.com/writing/ghostty-non-profit",
    "summary": "Ghostty, the terminal project, has officially become a non-profit entity, fiscally sponsored by Hack Club, a registered 501(c)(3) non-profit, as of December 3, 2025. This arrangement allows Ghostty to operate as a charitable initiative, leveraging Hack Club's tax-exempt status for compliance, donations, accounting, and governance.\n\nFounder Mitchell Hashimoto stated this move reinforces Ghostty's commitment to being free and open source for everyone. It aims to establish a sustainable development model beyond his personal involvement, offers legal protections to the community, and safeguards against potential \"rug pulls\" by ensuring the mission cannot be altered or funds diverted for private gain. Hashimoto believes foundational infrastructure like terminals should be stewarded by mission-driven, non-commercial entities.\n\nTechnically, nothing changes for Ghostty; its goals, MIT license, and development plans remain consistent. Financially, Ghostty can now accept tax-deductible donations in the United States, enabling compensation for contributors, support for upstream dependencies, community events, and operational costs. All financial transactions will be transparent via Hack Club Bank. Intellectual property associated with Ghostty has been transferred to Hack Club, though individual contributor copyrights are maintained. Mitchell Hashimoto remains the project lead, and critically, no project funds will personally benefit him.\n\nHack Club, as the fiscal sponsor, receives 7% of all donations to cover administrative costs and support its mission of empowering young people in technology. Hashimoto's family is also making a separate $150,000 donation directly to Hack Club. The article encourages donations, assuring contributors that funds will be used for public-benefit goals.",
    "chinese_title": "Ghostty 现已成为非营利组织",
    "chinese_summary": "Ghostty 终端项目已于 2025 年 12 月 3 日正式成为一个非营利实体，由注册的 501(c)(3) 非营利组织 Hack Club 提供财政赞助。这项安排使 Ghostty 能够作为一项慈善倡议运作，利用 Hack Club 的免税地位来处理合规、捐赠、会计和治理事宜。\n\n创始人 Mitchell Hashimoto 表示，此举巩固了 Ghostty 对所有人免费和开源的承诺。它旨在建立一个超越他个人参与的可持续发展模式，为社区提供法律保护，并通过确保其使命不被改变或资金不被挪作私用，防范潜在的“卷款跑路”。Hashimoto 认为，终端等基础架构应由使命驱动的非商业实体来管理。\n\n从技术上讲，Ghostty 没有变化；其目标、MIT 许可和开发计划保持不变。在财务上，Ghostty 现在可以在美国接受可抵税的捐赠，从而能够补偿贡献者、支持上游依赖项、社区活动和运营成本。所有财务交易都将通过 Hack Club Bank 透明化。与 Ghostty 相关的知识产权已转让给 Hack Club，但个人贡献者的版权仍受保留。Mitchell Hashimoto 仍担任项目负责人，至关重要的是，任何项目资金都不会使他个人受益。\n\nHack Club 作为财政赞助商，将获得所有捐赠的 7%，以支付行政费用并支持其赋能年轻人在科技领域的使命。Hashimoto 的家人还将单独向 Hack Club 捐赠 15 万美元。文章鼓励捐赠，并向贡献者保证资金将用于公共利益目标。"
  },
  {
    "id": "46160315",
    "title": "Netflix to Acquire Warner Bros",
    "url": "https://about.netflix.com/en/news/netflix-to-acquire-warner-bros",
    "summary": "Unable to access the article link.",
    "chinese_title": "奈飞收购华纳兄弟",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46138952",
    "title": "Everyone in Seattle hates AI",
    "url": "https://jonready.com/blog/posts/everyone-in-seattle-hates-ai.html",
    "summary": "The author, building an AI-powered map, observes a striking hostility towards \"AI\" among Seattle engineers, contrasting sharply with curiosity in other tech hubs. A former Microsoft coworker's intense negativity stemmed not from the author's product, but from pervasive, mandatory, and ineffective AI tools like Copilot 365 forced upon her at work. She revealed a PM was even laid off for \"not effectively using Copilot 365,\" highlighting a punitive culture.\n\nThe article details a cultural collapse in Seattle's big tech, especially Microsoft. Post-layoff directives prioritized \"AI\" classified projects, making others seem irrelevant. Engineers were compelled to use inferior Microsoft AI tools they couldn't fix, fostering widespread frustration. AI teams became a \"protected class,\" while others faced stagnant compensation and poor reviews if they didn't \"embrace AI.\"\n\nThis environment has cultivated a harmful belief system in Seattle: AI is useless, and local engineers are unqualified for it. This stifles innovation, leaving engineers in resentment and self-doubt, stalling their careers. Consequently, companies lose innovation, and new AI ventures in Seattle face immediate hostility. The author concludes that despite Seattle's talent, its tech culture now stifles the belief in changing the world, unlike more optimistic tech ecosystems.",
    "chinese_title": "西雅图人人都讨厌AI",
    "chinese_summary": "作者在构建一个由AI驱动的地图时，观察到西雅图工程师对“AI”表现出惊人的敌意，这与其他科技中心的强烈好奇心形成鲜明对比。一位前微软同事的强烈负面情绪并非源于作者的产品，而是因为工作中被强制使用的、无处不在的、且无效的AI工具，如Copilot 365。她透露，甚至有一位产品经理因“未能有效使用Copilot 365”而被解雇，这凸显了一种惩罚性的文化。\n\n文章详细描述了西雅图大型科技公司，尤其是微软，出现的文化崩溃。裁员后的指令优先考虑被归类为“AI”的项目，使得其他项目显得无关紧要。工程师被迫使用他们无法修复的劣质微软AI工具，这培养了普遍的挫败感。AI团队成为“受保护的阶层”，而其他员工如果“不拥抱AI”，则面临薪酬停滞和糟糕的绩效评估。\n\n这种环境在西雅图催生了一种有害的信念体系：AI毫无用处，而本地工程师也无法胜任。这扼杀了创新，让工程师们心怀不满和自我怀疑，阻碍了他们的职业发展。结果，公司失去了创新能力，西雅图的新AI企业也面临着即时的敌意。作者总结道，尽管西雅图人才济济，但其科技文化现在却扼杀了改变世界的信念，这与更乐观的科技生态系统截然不同。"
  },
  {
    "id": "46158191",
    "title": "Cloudflare was down",
    "url": "https://www.cloudflare.com/",
    "summary": "Cloudflare's \"connectivity cloud\" is a unified global platform offering over 60 services to connect, protect, and build. It enables organizations to securely connect users, applications, and AI agents, modernize networks with SASE and Zero Trust, and defend against cyber threats like web browsing attacks and phishing.\n\nFor websites, apps, and APIs, Cloudflare provides industry-leading WAF, DDoS, and bot protection, while accelerating performance with its ultra-fast CDN. Developers can leverage its platform to build and scale applications, including serverless code, AI agents, databases, and storage, without operational overhead.\n\nPowered by a unique global network spanning 330+ cities, Cloudflare blocks 234 billion cyber threats daily and protects 20% of all websites. Leading companies like Discord, Zendesk, and Investec rely on its capabilities. Specific benefits include accelerating website performance, blocking bot traffic, optimizing video experiences, deploying serverless and AI applications at the edge, and eliminating egress fees for object storage.\n\nCloudflare is frequently recognized as a Leader, Challenger, or Visionary in various Gartner and Forrester reports across categories such as WAF, SASE, SSE, and serverless development. Users can get started for free, explore demos, or contact sales for expert assistance.",
    "chinese_title": "Cloudflare 宕机了",
    "chinese_summary": "Cloudflare的“互联互通云”是一个统一的全球平台，提供超过60项服务，用于连接、保护和构建。它使组织能够安全地连接用户、应用程序和AI代理，通过SASE和零信任现代化网络，并防御网络浏览攻击和网络钓鱼等网络威胁。\n\n对于网站、应用程序和API，Cloudflare提供行业领先的WAF、DDoS和僵尸网络防护，同时通过其超快的CDN加速性能。开发人员可以利用其平台构建和扩展应用程序，包括无服务器代码、AI代理、数据库和存储，无需运营开销。\n\n在遍布330多个城市的独特全球网络支持下，Cloudflare每天拦截2340亿次网络威胁，并保护全球20%的网站。Discord、Zendesk和Investec等领先公司都信赖其能力。具体优势包括加速网站性能、阻止僵尸流量、优化视频体验、在边缘部署无服务器和AI应用程序，以及消除对象存储的出口流量费用。\n\nCloudflare在Gartner和Forrester关于WAF、SASE、SSE和无服务器开发等类别的各种报告中，经常被评为“领导者”、“挑战者”或“远见者”。用户可以免费开始使用、探索演示或联系销售寻求专家帮助。"
  },
  {
    "id": "46150715",
    "title": "Why are 38 percent of Stanford students saying they're disabled?",
    "url": "https://reason.com/2025/12/04/why-are-38-percent-of-stanford-students-saying-theyre-disabled/",
    "summary": "The article examines the surprisingly high percentage of students at elite universities claiming disabilities, citing Stanford at 38%, Amherst at 34%, and Brown/Harvard at 20%. The majority of these claims are for mental health conditions like anxiety, depression, and ADHD. The author expresses skepticism, arguing it's \"bogus\" that such selective institutions would have so many genuinely learning-disabled students, especially when community colleges have far lower rates. Professors often perceive these accommodations as \"rich kids getting extra time on tests.\"\n\nSeveral factors are suggested for this trend. The Americans with Disabilities Act allows expansive accommodations with little more than a doctor's note. There's a rising tendency to view mental health and neurodevelopmental conditions as identity markers. Online platforms, particularly TikTok, broadly describe these conditions, leading young people to interpret normal struggles (e.g., poor time management, difficulty focusing) as signs of a diagnosable disorder, creating a \"deeply distorted view of 'normal'.\" This is compounded by the DSM's lowered diagnostic bar for ADHD in 2013. Finally, immense risk-aversion and fear of failure among elite students drive them to seek diagnoses and accommodations to avoid bad grades and self-doubt, mistaking typical academic challenges for disabilities. The author concludes that these unnecessary accommodations hinder genuine intellectual growth and the development of crucial coping skills needed for adult life, essentially constituting a form of cheating both against peers and oneself.",
    "chinese_title": "为什么38%的斯坦福学生自称残疾？",
    "chinese_summary": "文章探讨了精英大学学生声称有残疾的比例惊人地高，引用了斯坦福大学38%、阿默斯特学院34%以及布朗大学/哈佛大学20%的数据。这些申报中的大多数是针对焦虑症、抑郁症和注意力缺陷多动障碍（ADHD）等心理健康问题。作者对此表示质疑，认为如此严格录取的学府会有这么多真正有学习障碍的学生是“荒谬的”，尤其是社区大学的比例要低得多。教授们普遍认为，这些特殊照顾不过是“富家子弟在考试中获得额外时间”的手段。\n\n导致这一趋势的因素有以下几点。《美国残疾人法案》规定，仅凭医生证明即可获得广泛的特殊照顾。将心理健康和神经发育状况视为身份标志的趋势日益盛行。在线平台，尤其是TikTok，广泛描述这些状况，导致年轻人将正常的困境（例如时间管理不善、注意力难以集中）解读为可诊断疾病的迹象，从而形成对“正常”的“严重扭曲的看法”。2013年，《精神疾病诊断与统计手册》（DSM）降低了ADHD的诊断门槛，这进一步加剧了上述现象。最后，精英学生中普遍存在的极度规避风险和害怕失败的心态，促使他们寻求诊断和特殊照顾，以避免差成绩和自我怀疑，将常见的学业挑战误认为是残疾。作者总结道，这些不必要的特殊照顾阻碍了真正的智力成长和成年生活所需的关键应对技能的发展，本质上构成了对同龄人和对自己的一种欺骗。"
  },
  {
    "id": "46145365",
    "title": "It’s time to free JavaScript (2024)",
    "url": "https://javascript.tm/letter",
    "summary": "This article argues that Oracle should release its trademark on \"JavaScript,\" asserting it has been legally abandoned due to both non-use and genericism, causing widespread confusion. The trademark, a relic from Oracle's 2009 acquisition of Sun Microsystems (which initially partnered with Netscape to create JavaScript), is still held by Oracle despite JavaScript becoming the world's most popular programming language, used independently by millions.\n\nThe authors contend Oracle has not genuinely used \"JavaScript\" as a trademark for a core product. References to Node.js (not an Oracle product) and Oracle JET (a set of JavaScript libraries) in a 2019 USPTO filing, along with GraalVM's hidden support for the language, are dismissed as insufficient to demonstrate bona fide use.\n\nMoreover, \"JavaScript\" has become a generic term. Sun's refusal to release the name for standardization led to the creation of \"ECMAScript.\" Oracle's consistent inaction in enforcing its trademark rights has allowed the term to be used universally, forcing community organizations (like \"JSConf\") to painstakingly avoid the full name.\n\nThe letter urges Oracle, which is believed to have no real business interest in the mark, to voluntarily release it into the public domain. If this request, previously met with silence, is again ignored, the authors, including JavaScript creator Brendan Eich, plan to file a petition for trademark cancellation with the USPTO, seeking community support and pro bono legal assistance.",
    "chinese_title": "是时候解放 JavaScript 了 (2024)",
    "chinese_summary": "本文认为，甲骨文应该放弃其“JavaScript”商标，声称该商标因不使用和通用化而已被合法放弃，造成了广泛的混淆。该商标是甲骨文在2009年收购Sun Microsystems（后者最初与网景公司合作创建了JavaScript）后遗留的产物，尽管JavaScript已成为全球最流行的编程语言并被数百万人独立使用，但甲骨文仍持有该商标。\n\n作者们认为，甲骨文并未真正将“JavaScript”作为其核心产品的商标使用。在2019年美国专利商标局（USPTO）的一份文件中提及Node.js（非甲骨文产品）和Oracle JET（一套JavaScript库），以及GraalVM对该语言的隐藏支持，都被认为是不足以证明其善意使用的。\n\n此外，“JavaScript”已成为一个通用术语。Sun公司拒绝为标准化释放该名称，导致了“ECMAScript”的创建。甲骨文在执行其商标权方面的一贯不作为，使得该术语被普遍使用，迫使社区组织（如“JSConf”）煞费苦心地避免使用完整名称。\n\n信中敦促甲骨文（据信其对该商标没有实际商业利益）自愿将其释放到公共领域。如果这一此前曾被置之不理的请求再次被忽视，包括JavaScript创始人Brendan Eich在内的作者们计划向美国专利商标局提交一份商标撤销申请，并寻求社区支持和无偿法律援助。"
  },
  {
    "id": "46145180",
    "title": "How elites could shape mass preferences as AI reduces persuasion costs",
    "url": "https://arxiv.org/abs/2512.04047",
    "summary": "Nadav Kunievsky's paper, \"Polarization by Design: How Elites Could Shape Mass Preferences as AI Reduces Persuasion Costs,\" investigates how declining costs and increased precision of AI-driven persuasion technologies could allow political elites to strategically design public opinion. Historically, elites used limited instruments like mass media to influence preferences; AI now makes the distribution of preferences an object of deliberate design.\n\nThe author develops a dynamic model where elites choose to reshape policy preferences, balancing persuasion costs with the need to secure majority support. The model reveals that with a *single elite*, optimal interventions tend to pull society towards more polarized opinion profiles – a \"polarization pull\" – which is accelerated by improved persuasion technology.\n\nHowever, when *two opposed elites* alternate in power, the same technology incentivizes them to create \"semi-lock\" regions where opinions become more cohesive and resistant to rival influence. Consequently, advancements in persuasion technology could either heighten or, surprisingly, dampen polarization depending on the specific political environment.\n\nThe research concludes that cheaper persuasion technologies transform polarization from an emergent social byproduct into a strategic instrument of governance. This has significant implications for democratic stability as AI capabilities continue to advance, fundamentally altering how political power might be exercised and sustained.",
    "chinese_title": "随着人工智能降低说服成本，精英将如何塑造大众偏好",
    "chinese_summary": "纳达夫·库涅夫斯基的论文《设计极化：随着人工智能降低说服成本，精英如何塑造大众偏好》探讨了人工智能驱动的说服技术如何通过降低成本和提高精准度，使政治精英能够策略性地设计公共舆论。历史上，精英们利用大众媒体等有限工具影响偏好；而现在，人工智能使得偏好的分布成为蓄意设计的目标。\n\n作者开发了一个动态模型，其中精英选择重塑政策偏好，权衡说服成本与争取多数支持的需求。该模型揭示，在存在**单一精英**的情况下，最优干预措施倾向于将社会推向更极化的意见分布——一种“极化拉力”——而改进的说服技术会加速这一过程。\n\n然而，当**两个对立精英**轮流执政时，同样的技术会促使他们创建“半锁定”区域，使民众意见更加凝聚，并抵制对手的影响。因此，说服技术的进步可能加剧，或者出人意料地，抑制极化，这取决于具体的政治环境。\n\n该研究总结，更廉价的说服技术将极化从一种新兴的社会副产品转变为一种战略性的治理工具。随着人工智能能力的不断进步，这对于民主稳定具有深远影响，从根本上改变了政治权力可能被行使和维持的方式。"
  },
  {
    "id": "46146133",
    "title": "PGlite – Embeddable Postgres",
    "url": "https://pglite.dev/",
    "summary": "PGlite is an embeddable Postgres solution, distinguished by its lightweight nature. It offers a complete WebAssembly (WASM) build of Postgres, which is remarkably small, weighing in at under 3MB when gzipped.",
    "chinese_title": "PGlite – 可嵌入的 Postgres",
    "chinese_summary": "PGlite 是一个可嵌入的 Postgres 解决方案，以其轻量级特性而著称。它提供一个完整的 Postgres WebAssembly (WASM) 构建，该构建在经过 gzip 压缩后，体积惊人地小于 3MB。"
  },
  {
    "id": "46146451",
    "title": "I ignore the spotlight as a staff engineer",
    "url": "https://lalitm.com/software-engineering-outside-the-spotlight/",
    "summary": "A Senior Staff Engineer at Google, the author challenges Sean Goedecke's \"spotlight\" model for Staff+ engineers, proposing an alternative path optimizing for systems and stewardship over fungibility. Unlike product teams driven by quarterly shifts and external customers, the author works in developer tools and infrastructure, serving internal engineers. Here, success is \"bottom-up,\" built on deep context and long-term ownership, rather than executive whims.\n\nStewardship offers compounding returns: efficiency through pattern matching and systemic innovation. The author's Bigtrace project, a distributed query engine processing billions of traces monthly, emerged from years of observing problems, a feat impossible with frequent team rotations. This long-term trust also grants the political capital to say \"No\" to volatile, high-visibility projects (like rushed AI integration into Perfetto) that threaten product quality and user trust.\n\nCareer progression isn't reliant on executive visibility. Instead, an \"alternate currency of impact\" emerges: a \"shadow hierarchy\" where advocacy from critical customer teams (e.g., Pixel engineers needing Perfetto) fuels promotions, and a \"utility ledger\" tracks engineering health metrics like bugs fixed, criticality, ubiquity, and scale. These provide a robust, technically-driven promotion case.\n\nThis approach aligns with Will Larson's Architect or Tech Lead archetypes. While acknowledging initial luck in finding such a team, the author stresses that staying is a choice, and these less-visible, stable infrastructure teams are more common than perceived, offering deep technical ownership for those willing to forgo external validation. The path emphasizes depth, patience, and building lasting foundations over chasing the spotlight.",
    "chinese_title": "作为资深工程师，我不爱出风头。",
    "chinese_summary": "谷歌的一位高级资深工程师，作者挑战了Sean Goedecke关于Staff+工程师的“聚光灯”模型，提出了一个替代路径，该路径侧重于系统和管理职责，而非可替代性。与受季度变化和外部客户驱动的产品团队不同，作者在开发者工具和基础设施领域工作，服务于内部工程师。在这里，成功是“自下而上”的，建立在深厚的背景知识和长期所有权之上，而非高层领导的突发奇想。\n\n尽责管理带来复利效应：通过模式匹配和系统性创新提升效率。作者的Bigtrace项目是一个每月处理数十亿条追踪的分布式查询引擎，是多年观察问题后诞生的，如果团队频繁轮岗，这将是不可能完成的壮举。这种长期信任也赋予了政治资本，使其能够对那些不稳定、高知名度的项目（例如将AI仓促整合到Perfetto中）说“不”，这些项目会威胁产品质量和用户信任。\n\n职业发展不依赖于高层的可见性。取而代之的是一种“影响力替代货币”的出现：一个“影子层级”，其中关键客户团队（例如需要Perfetto的Pixel工程师）的拥护推动着晋升，以及一个“效用分类账”，它跟踪工程健康指标，如修复的bug数量、关键性、普适性和规模。这些共同提供了一个强大且技术驱动的晋升依据。\n\n这种方法与Will Larson的架构师或技术主管原型相符。作者承认最初找到这样的团队有运气成分，但他强调留下是一种选择，而且这些不那么显眼但稳定的基础设施团队比人们想象的更常见，为那些愿意放弃外部认可的人提供了深厚的技术所有权。这条路径强调深度、耐心，以及构建持久基础，而非追逐聚光灯。"
  },
  {
    "id": "46142100",
    "title": "Average DRAM price in USD over last 18 months",
    "url": "https://pcpartpicker.com/trends/price/memory/",
    "summary": "Unable to access the article link.",
    "chinese_title": "近18个月DRAM美元均价",
    "chinese_summary": "无法访问文章链接"
  },
  {
    "id": "46147540",
    "title": "Transparent leadership beats servant leadership",
    "url": "https://entropicthoughts.com/transparent-leadership-beats-servant-leadership",
    "summary": "The author, drawing from personal management experience, critiques \"servant leadership,\" likening it to \"curling parenting.\" While initially comfortable for direct reports, this approach can make the leader an overworked, single point of failure. Ultimately, it leaves teams ill-equipped to handle future obstacles, isolated, and lacking purpose once the leader departs.\n\nAs an alternative, the author proposes \"transparent leadership,\" a model focused on empowering teams and making the leader redundant. A transparent leader achieves this by:\n*   Coaching and connecting team members.\n*   Teaching methodical problem-solving.\n*   Explaining organizational values and principles to enable independent, aligned decision-making.\n*   Creating direct links between supply and demand, rather than acting as a middleman.\n*   Fostering career growth by gradually transferring leadership responsibilities.\n*   Continuously training their own replacement.\n\nOnce a leader successfully makes themselves redundant, the article suggests that instead of inventing new work, demanding status reports, or creating bureaucracy, the optimal response is to return to technical problems. This keeps the manager's skills fresh, garners respect from their team, and allows them to function as a \"high-powered spare worker\" rather than a paper-shuffler. This approach prioritizes long-term team autonomy and resilience.",
    "chinese_title": "透明领导力胜过仆人式领导力",
    "chinese_summary": "作者结合个人管理经验，批判了“仆人式领导”，将其比作“直升机式育儿”。这种方式虽然起初让下属感到舒适，但可能导致领导者工作过量，成为单一故障点。最终，一旦领导者离职，团队将缺乏应对未来障碍的能力，变得孤立无援，并失去目标。\n\n作为替代方案，作者提出了“透明领导”——一种旨在赋能团队并让领导者变得可有可无的模型。透明领导者通过以下方式实现这一目标：\n*   辅导并连接团队成员。\n*   传授系统的问题解决方。\n*   解释组织价值观和原则，使团队能够独立地做出符合方向的决策。\n*   在供给和需求之间建立直接联系，而非充当中间人。\n*   通过逐步移交领导职责来促进职业成长。\n*   持续培养自己的接班人。\n\n文章建议，一旦领导者成功地使自己变得可有可无，最佳的回应是回归技术问题，而非创造新工作、要求提交状态报告或制造官僚主义。这能保持管理者的技能与时俱进，赢得团队的尊重，并使他们能够充当“高效的备用人员”，而非仅仅处理文书工作。这种方法优先考虑团队的长期自主性和韧性。"
  },
  {
    "id": "46155135",
    "title": "Netflix’s AV1 Journey: From Android to TVs and Beyond",
    "url": "https://netflixtechblog.com/av1-now-powering-30-of-netflix-streaming-02f592242d80",
    "summary": "Netflix's AV1 video codec now powers 30% of its total streaming, a substantial increase from its initial 10% adoption on Android in 2020. This expansion highlights AV1's superior compression efficiency, which delivers better visual quality at lower bitrates compared to older codecs like AVC and HEVC. This translates to data savings for users and reduced bandwidth costs for Netflix.\n\nThe initial rollout focused on Android devices to improve streaming in bandwidth-constrained mobile environments. However, the recent growth to Smart TVs, streaming sticks, and game consoles has been enabled by the increasing availability of dedicated hardware AV1 decoders. AV1 is computationally intensive, making hardware acceleration critical for efficient playback, especially on power-sensitive devices. Netflix actively collaborated with SoC vendors and device manufacturers to ensure widespread AV1 hardware support across various platforms.\n\nThis strategic move allows more users to benefit from AV1's quality advantages, particularly in areas with fluctuating network conditions. Netflix continues to optimize its AV1 encoding pipelines and plans to extend its deployment to even more content and devices as hardware support becomes ubiquitous, further enhancing the quality of experience and achieving greater operational efficiencies.",
    "chinese_title": "网飞的AV1之旅：从安卓到电视，乃至更广",
    "chinese_summary": "Netflix的AV1视频编解码器目前已驱动其30%的总流媒体播放量，这比2020年最初在Android设备上10%的采用率有了显著增长。此次扩张凸显了AV1卓越的压缩效率，与AVC和HEVC等旧编解码器相比，它能在更低的比特率下提供更好的视觉质量。这意味着用户可以节省数据流量，Netflix也能降低带宽成本。\n\n最初的推广主要集中在Android设备上，以改善带宽受限的移动环境下的流媒体播放体验。然而，近期扩展到智能电视、流媒体棒和游戏主机，得益于专用硬件AV1解码器日益普及。AV1计算量大，因此硬件加速对于高效播放至关重要，尤其是在对功耗敏感的设备上。Netflix积极与SoC供应商和设备制造商合作，以确保AV1硬件在各种平台上的广泛支持。\n\n这一战略举措让更多用户受益于AV1的质量优势，尤其是在网络条件不稳定的地区。随着硬件支持的普及，Netflix将继续优化其AV1编码流程，并计划将其部署扩展到更多内容和设备，从而进一步提升用户体验质量并实现更高的运营效率。"
  },
  {
    "id": "46145834",
    "title": "Unreal Tournament 2004 is back",
    "url": "https://old.reddit.com/r/unrealtournament/comments/1pdbe69/breaking_unreal_tournament_2004_is_back/",
    "summary": "**Unable to access the article link.**\n\nThe provided URL appears to be for an old Reddit post, and I am unable to access its content to summarize the article.",
    "chinese_title": "虚幻竞技场2004回来了",
    "chinese_summary": "**无法访问文章链接。**\n\n所提供的网址似乎是一个旧的Reddit帖子，我无法访问其内容来总结文章。"
  },
  {
    "id": "46148748",
    "title": "Microsoft drops AI sales targets in half after salespeople miss their quotas",
    "url": "https://arstechnica.com/ai/2025/12/microsoft-slashes-ai-sales-growth-targets-as-customers-resist-unproven-agents/",
    "summary": "Microsoft has significantly lowered sales growth targets for its AI agent products after numerous salespeople missed their quotas in the last fiscal year. This unusual adjustment comes after the company failed to meet ambitious sales goals for its \"agentic\" AI offerings, designed for autonomous, multi-step tasks like generating dashboards or writing reports, and featured heavily in products like Microsoft 365 Copilot and Azure AI Foundry.\n\nSales figures reveal the struggle: an Azure sales unit's 50% growth quota for its Foundry product was met by less than a fifth of its salespeople, leading to a target reduction to 25%. Another unit saw targets cut from doubling sales to 50%. These indicate enterprises are reluctant to pay premium prices for these tools. Furthermore, Microsoft's Copilot faces brand preference issues, with many employees, such as those at drugmaker Amgen, reportedly favoring OpenAI's ChatGPT for general tasks and using Copilot mainly for Microsoft-specific applications.\n\nThe article suggests a fundamental problem: current AI agent technology may not be ready for the high-stakes autonomous business work Microsoft promises. AI models are prone to \"confabulation\" (confidently generating false outputs) and exhibit \"brittleness,\" struggling with novel problems outside their training data, making them unreliable for critical tasks. This explains the appeal of Artificial General Intelligence (AGI), a more capable, but currently elusive, system.\n\nDespite these sales challenges, Microsoft continues record capital expenditures on AI infrastructure. Much of its AI revenue, however, currently stems from other AI companies renting cloud services rather than widespread adoption by traditional enterprises. Microsoft appears to be building for an AI revolution that many businesses have yet to fully embrace.",
    "chinese_title": "因销售人员未能完成配额，微软将AI销售目标下调一半。",
    "chinese_summary": "微软在上一财年有大量销售人员未达标后，已大幅下调其AI代理产品（AI agent products）的销售增长目标。这一不同寻常的调整，是因为该公司未能达到其“代理式”（agentic）AI产品雄心勃勃的销售目标。这些产品专为自主、多步骤任务设计，例如生成仪表板或撰写报告，并大量应用于Microsoft 365 Copilot和Azure AI Foundry等产品中。\n\n销售数据揭示了这一困境：一个Azure销售部门的Foundry产品50%的增长配额，仅有不到五分之一的销售人员达标，导致目标被下调至25%。另一个部门的目标则从销售额翻倍下调至50%。这些都表明企业不愿为这些工具支付高昂溢价。此外，微软的Copilot还面临品牌偏好问题，据报道，许多员工（例如制药商安进（Amgen）的员工）倾向于使用OpenAI的ChatGPT完成一般任务，而主要将Copilot用于微软特定的应用程序。\n\n文章指出一个根本性问题：当前的AI代理技术可能尚未准备好承担微软所承诺的、高风险的自主商业工作。AI模型容易出现“虚构”（confabulation，即自信地生成虚假输出）以及“脆弱性”（brittleness），难以处理训练数据之外的新颖问题，这使得它们在关键任务中不可靠。这解释了通用人工智能（AGI）的吸引力，它是一个能力更强但目前仍难以实现的系统。\n\n尽管面临这些销售挑战，微软仍在AI基础设施上持续进行创纪录的资本支出。然而，目前微软的大部分AI收入并非来自传统企业的广泛采用，而是源于其他AI公司租用其云服务。微软似乎正在为一场AI革命进行建设，而许多企业尚未完全接受这场革命。"
  },
  {
    "id": "46159193",
    "title": "The US polluters that are rewriting the EU's human rights and climate law",
    "url": "https://www.somo.nl/the-secretive-cabal-of-us-polluters-that-is-rewriting-the-eus-human-rights-and-climate-law/",
    "summary": "The article exposes a powerful, often secretive, lobbying campaign by major US corporations and their European affiliates to significantly weaken the European Union's Corporate Sustainability Due Diligence Directive (CSDDD). Led by groups like BusinessEurope and AmCham EU, and including giants such as ExxonMobil, Chevron, Microsoft, Apple, and BlackRock, these entities have exerted immense pressure on EU institutions.\n\nTheir primary goal is to dilute provisions that would hold companies accountable for human rights abuses and environmental damage across their global supply chains. Through extensive lobbying, private meetings, and threats of reduced investment, they have successfully pushed for the exclusion of the financial sector from the directive's scope, weakened civil liability provisions, reduced the number of companies covered, and watered down climate plan requirements.\n\nThe article argues that this \"secretive cabal\" has already substantially undermined the CSDDD's original ambition to ensure corporate responsibility, allowing companies to avoid accountability for issues like child labor, deforestation, and pollution. The author warns that if further weakened, the directive will fail to protect vulnerable communities and the environment, enabling powerful corporations to continue operating with impunity.",
    "chinese_title": "美国污染者正在改写欧盟的人权和气候法",
    "chinese_summary": "本文揭露了一场由美国主要企业及其欧洲分支机构发起的、强大且常秘密进行的游说活动，旨在大幅削弱欧盟《企业可持续发展尽职调查指令》(CSDDD)。这场活动由欧洲商业联合会 (BusinessEurope) 和欧盟美国商会 (AmCham EU) 等团体牵头，并包括埃克森美孚、雪佛龙、微软、苹果和贝莱德等巨头，这些实体已对欧盟机构施加了巨大压力。\n\n他们的主要目标是淡化那些旨在让企业对其全球供应链中的人权侵犯和环境破坏负责的条款。通过广泛的游说、私人会议和减少投资的威胁，他们已成功推动将金融业排除在该指令的范围之外，削弱了民事责任条款，减少了受覆盖企业数量，并淡化了气候计划要求。\n\n文章指出，这个“秘密集团”已严重破坏了CSDDD确保企业责任的初衷，使得企业得以逃避对童工、森林砍伐和污染等问题的责任。作者警告称，如果该指令被进一步削弱，它将无法保护弱势社区和环境，从而使强大的企业能够继续逍遥法外地运作。"
  },
  {
    "id": "46153466",
    "title": "Thoughts on Go vs. Rust vs. Zig",
    "url": "https://sinclairtarget.com/blog/2025/08/thoughts-on-go-vs.-rust-vs.-zig/",
    "summary": "The author explores Go, Rust, and Zig by examining the values and trade-offs embedded in their design, rather than just feature lists. This perspective aims to clarify their distinct purposes despite functional overlaps.\n\n**Go** is highlighted for its minimalism, akin to a \"modern C.\" Its limited feature set (e.g., late generics, no tagged unions) prioritizes code stability, readability, and ease of understanding, especially for concurrent programming. Go simplifies memory management through garbage collection and flexible slice types, making it ideal for corporate collaboration and broad applicability.\n\n**Rust** is described as maximalist, striving for \"zero-cost abstractions\" to deliver both memory safety and performance. Its complexity arises from numerous concepts and a demanding type system that requires developers to explicitly express runtime behavior for compile-time safety checks. This rigor prevents undefined behavior (UB), providing strong code guarantees, though it steepens the learning curve.\n\n**Zig**, the newest, offers ultimate programmer control, contrasting Go's abstractions and Rust's strictness. It features explicit manual memory management with customizable allocators and actively eschews object-oriented programming (OOP) features like private fields and dynamic dispatch in favor of data-oriented design. Zig detects \"illegal behavior\" at runtime, with configurable checks. Its design encourages managing memory in large chunks rather than tying allocations to small objects, presenting a \"subversive\" approach that challenges traditional OOP paradigms.",
    "chinese_title": "关于 Go、Rust 和 Zig 的思考",
    "chinese_summary": "作者通过审视Go、Rust和Zig设计中蕴含的价值观和权衡取舍，而非仅仅罗列功能特性，来探讨这三种语言。这种视角旨在阐明它们在功能上虽有重叠，却各自拥有独特的目标。\n\n**Go**语言以其极简主义而著称，类似于“现代C语言”。其有限的功能集（例如，较晚引入泛型、没有带标签的联合体）优先考虑代码的稳定性、可读性和易懂性，尤其是在并发编程方面。Go通过垃圾回收和灵活的切片类型简化内存管理，使其非常适合企业协作和广泛应用。\n\n**Rust**被描述为“极致主义者”，致力于实现“零成本抽象”，以兼顾内存安全和性能。它的复杂性源于其众多的概念和一个要求严苛的类型系统，该系统要求开发者明确表达运行时行为，以进行编译时安全检查。这种严谨性阻止了未定义行为（UB），提供了强大的代码保证，尽管这增加了学习曲线的难度。\n\n最新的**Zig**语言提供了极致的程序员控制权，与Go的抽象和Rust的严格性形成对比。它具有显式的手动内存管理和可定制的内存分配器，并积极摒弃面向对象编程（OOP）特性，如私有字段和动态分派，转而青睐数据导向设计。Zig在运行时检测“非法行为”，并提供可配置的检查。其设计鼓励以大块方式管理内存，而不是将内存分配与小对象绑定，呈现出一种“颠覆性”方法，挑战了传统的OOP范式。"
  },
  {
    "id": "46147353",
    "title": "RAM is so expensive, Samsung won't even sell it to Samsung",
    "url": "https://www.pcworld.com/article/2998935/ram-is-so-expensive-samsung-wont-even-sell-it-to-samsung.html",
    "summary": "RAM prices are skyrocketing due to an \"AI\" bubble, causing a supply crunch and making memory chips extremely expensive. This has led to a remarkable situation where Samsung Semiconductor Global, a major memory manufacturer, reportedly rejected a long-term order for smartphone DRAM chips from its own corporate sibling, Samsung Electronics' Mobile Experience division.\n\nSamsung Electronics, which makes Galaxy phones, sought supply for its 2026 flagship designs but was forced to renegotiate quarterly at higher prices. Samsung Semiconductor is prioritizing lucrative \"AI\" data center clients, who are willing to pay premium prices, over its internal partner.\n\nThis \"chipflation\" is expected to result in higher prices for Samsung phones and other mobile devices for consumers. The issue extends beyond Samsung, with Raspberry Pi raising prices due to memory costs and Lenovo stockpiling supplies. Component prices have recently tripled, causing finished memory modules to double in price in a single month. Experts anticipate continued price increases into next year, with supply constraints potentially lasting until 2027 or later.",
    "chinese_title": "内存太贵了，三星甚至都不会卖给三星。",
    "chinese_summary": "RAM价格因“AI”泡沫飙升，导致供应短缺，内存芯片变得极其昂贵。这导致了一个值得关注的局面：作为主要内存制造商的三星半导体全球，据报道拒绝了其同集团姊妹公司三星电子移动体验部门的一份智能手机DRAM芯片长期订单。\n\n生产Galaxy手机的三星电子曾为其2026年旗舰机型寻求供应，但被迫每季度以更高价格重新谈判。三星半导体正在优先考虑那些愿意支付更高溢价的利润丰厚的“AI”数据中心客户，而非其内部合作伙伴。\n\n这种“芯片通胀”（chipflation）预计将导致消费者购买三星手机及其他移动设备的价格上涨。这个问题已不限于三星，树莓派（Raspberry Pi）因内存成本上涨而提价，联想（Lenovo）也在囤积备货。零部件价格最近翻了三倍，导致成品内存模块在一个月内价格翻番。专家预计价格将持续上涨至明年，供应紧张状况可能持续到2027年甚至更晚。"
  },
  {
    "id": "46155619",
    "title": "BMW PHEV: Safety fuse replacement is extremely expensive",
    "url": "https://evclinic.eu/2025/12/04/2021-phev-bmw-ibmucp-21f37e-post-crash-recovery-when-eu-engineering-becomes-a-synonym-for-unrepairable-generating-waste/",
    "summary": "The article \"BMW PHEV: Safety fuse replacement is extremely expensive\" critically examines BMW's design for a high-voltage safety fuse in their 2021 330e G20 plug-in hybrid electric vehicle (PHEV). After a minor frontal collision (around 20km/h), the vehicle's high-voltage system tripped its internal safety fuse, the IBMU CP 21F37E, rendering the car inoperable.\n\nBMW's official position states that this particular fuse is not a replaceable component. Instead, its failure requires replacing the *entire high-voltage battery pack*. The cost for this replacement battery alone is a staggering €26,000, excluding labor, shipping, and taxes. Given the car's market value of €35,000-€40,000, this repair cost is deemed economically unfeasible, effectively making even minor collision damage a write-off.\n\nThe author strongly criticizes this engineering choice as \"unrepairable\" and wasteful, contrasting it sharply with other manufacturers like Tesla, where similar battery fuses can be replaced individually for a few hundred euros. The article argues that BMW's design promotes planned obsolescence, generates unnecessary electronic waste, and goes against principles of sustainability and EU repairability regulations, calling it a significant design flaw.",
    "chinese_title": "宝马PHEV：安全保险丝更换极其昂贵",
    "chinese_summary": "题为《宝马PHEV：安全熔断器更换费用高昂》的文章，尖锐地审视了宝马2021款330e G20插电式混合动力汽车（PHEV）高压安全熔断器的设计。在一次轻微的正面碰撞（时速约20公里）后，该车的高压系统触发了其内部安全熔断器IBMUC P 21F37E，导致车辆无法运行。\n\n宝马官方立场称，该熔断器并非可更换部件。相反，一旦损坏，则需要更换*整个高压电池组*。仅更换电池本身的成本就高达26,000欧元，不含人工费、运费和税费。考虑到该车35,000至40,000欧元的市场价值，这一维修成本被认为经济上不可行，使得即使是轻微的碰撞损坏也形同报废。\n\n作者强烈批评这种工程选择是“无法修复”且浪费的，并将其与特斯拉等其他制造商形成了鲜明对比，在特斯拉，类似的电池熔断器可以单独更换，只需几百欧元。文章指出，宝马的设计助长了计划报废，产生了不必要的电子垃圾，并违背了可持续发展原则和欧盟的可修复性法规，称其为一项重大的设计缺陷。"
  },
  {
    "id": "46144275",
    "title": "Uncloud - Tool for deploying containerised apps across servers without k8s",
    "url": "https://uncloud.run/",
    "summary": "\"Uncloud\" is introduced as a tool for deploying containerized applications across multiple servers, specifically positioned as an alternative to Kubernetes (k8s). It emphasizes providing users with complete control over their infrastructure, including servers and data. Key advantages include predictable costs through the avoidance of per-request pricing, and the elimination of vendor lock-in or platform dependencies. Uncloud also ensures that users can directly access their machines via SSH and debug using standard tools.",
    "chinese_title": "Uncloud - 无需K8s即可跨服务器部署容器化应用的工具",
    "chinese_summary": "Uncloud 被介绍为一种在多台服务器上部署容器化应用的工具，尤其被定位为 Kubernetes (k8s) 的替代方案。它强调为用户提供对其基础设施（包括服务器和数据）的完全控制。主要优势包括通过避免按请求计费来实现可预测的成本，以及消除厂商锁定或平台依赖。Uncloud 还确保用户可以通过 SSH 直接访问其机器并使用标准工具进行调试。"
  },
  {
    "id": "46139761",
    "title": "Show HN: I built a dashboard to compare mortgage rates across 120 credit unions",
    "url": "https://finfam.app/blog/credit-union-mortgages",
    "summary": "FinFam has launched a dashboard to help consumers compare mortgage rates from over 120 credit unions across the United States. This tool addresses the challenge of finding competitive rates from member-owned, non-profit credit unions, which often offer better deals than big banks whose higher rates frequently subsidize marketing.\n\nThe dashboard provides daily-updated rates for 30-Year and 15-Year Fixed mortgages, displaying best, good, and median Annual Percentage Rates (APRs), along with comparisons to national averages. For instance, as of December 4, 2025, the best 30-Year Fixed APR was 5.49% (-70 bps vs. National Avg) and the best 15-Year Fixed APR was 4.98% (-46 bps vs. National Avg).\n\nThe developer's motivation stemmed from personal experience, saving 1.5% APR by opting for a credit union over a big bank. The tool aims to highlight that standardized mortgage products shouldn't have vast price differences due to marketing budgets. Rates are collected from credit union websites, and national benchmarks are sourced from the St. Louis Federal Reserve.\n\nUsers are encouraged to utilize the dashboard to identify potential lenders, obtain personalized quotes (factoring in credit score, down payment, and points), and protect their privacy with services like optoutprescreen.com before credit checks. FinFam asserts its independence, does not receive referral fees, and provides rates for informational purposes only, stressing that actual rates will vary. The goal is to help people discover options and save significant money.",
    "chinese_title": "展示 HN: 我开发了一个仪表盘，能比较120家信用合作社的房贷利率",
    "chinese_summary": "FinFam推出了一个仪表盘，旨在帮助消费者比较来自美国各地120多家信用合作社的抵押贷款利率。该工具解决了难以从会员所有、非营利性信用合作社找到有竞争力利率的挑战，这些信用合作社通常比那些以较高利率补贴营销的大型银行提供更优惠的交易。\n\n该仪表盘提供每日更新的30年期和15年期固定抵押贷款利率，显示最佳、良好和中位数年利率（APR），并与全国平均水平进行比较。例如，截至2025年12月4日，最佳30年期固定APR为5.49%（比全国平均水平低70个基点），最佳15年期固定APR为4.98%（比全国平均水平低46个基点）。\n\n开发者的动机源于个人经历，他通过选择信用合作社而非大型银行，节省了1.5%的年利率。该工具旨在强调，标准化的抵押贷款产品不应因营销预算而存在巨大的价格差异。利率数据收集自信用合作社网站，全国基准数据来源于圣路易斯联邦储备银行。\n\n我们鼓励用户利用该仪表盘识别潜在贷款机构，获取个性化报价（需考虑信用评分、首付和点数），并在信用检查前使用optoutprescreen.com等服务保护其隐私。FinFam声明其独立性，不收取推荐费，且仅提供利率信息供参考，强调实际利率会有所不同。其目标是帮助人们发现更多选择并节省大量资金。"
  },
  {
    "id": "46151578",
    "title": "The RAM shortage comes for us all",
    "url": "https://www.jeffgeerling.com/blog/2025/ram-shortage-comes-us-all",
    "summary": "The article highlights a severe and rapidly escalating RAM shortage, driving unprecedented price inflation across the industry. The author notes a personal experience of a 64GB DDR5 kit tripling in price from $209 to $650 in months.\n\nThis shortage is impacting everyone: Raspberry Pi has increased prices and introduced a lower-spec model, Micron is discontinuing the Crucial brand, Samsung struggles to source RAM for its own phones, and small vendors face price hikes of 200-300% even for older memory tech. PC builders are already seeing DDR4 prices jump from $30 to $120 and DDR5 from $150 to $500 for 64GB. Libre Computer reports a single 4GB LPDDR4 module costing $35, exceeding all other components in some of their SBCs.\n\nThe primary cause is the massive buildout of AI datacenters. Major memory manufacturers are prioritizing high-margin AI-specific RAM (like HBM), neglecting and even shutting down consumer memory lines. Even GPU board manufacturers are reportedly being told by Nvidia to source their own VRAM.\n\nThe hopeful \"AI bubble burst\" scenario, where cheap hardware floods the market, is unlikely to benefit consumers. The RAM and associated hardware are specialized (integrated into unique GPUs or HBM modules), not compatible with standard PCs, and require immense infrastructure (power/cooling) beyond typical homelabs.\n\nThis situation threatens to gut the PC building hobby, make SBCs prohibitively expensive, and leave many in a lurch. Companies like Lenovo are already stockpiling RAM, exacerbating shortages that echo the 2020 toilet paper crisis and 2021-2022 chip shortages. The author concludes that this \"AI bubble\" is imposing a hidden \"AI tax\" on nearly all electronics, with no clear end in sight.",
    "chinese_title": "内存短缺无人幸免",
    "chinese_summary": "本文强调了严峻且迅速升级的RAM短缺，正在推动整个行业前所未有的价格上涨。作者指出，他个人经历了一套64GB DDR5套件在数月内从209美元飙升至650美元，价格翻了三倍。\n\n此次短缺正在影响所有人：树莓派（Raspberry Pi）已提高价格并推出了低规格型号；美光（Micron）正在停产其Crucial品牌；三星（Samsung）难以为其自有手机采购RAM；甚至小型供应商也面临着旧内存技术200-300%的价格上涨。PC组装商已经看到64GB的DDR4价格从30美元飙升至120美元，DDR5则从150美元飙升至500美元。Libre Computer报告称，一个4GB LPDDR4模块的成本高达35美元，超过了其某些单板计算机（SBC）中所有其他组件的总和。\n\n主要原因是人工智能数据中心的大规模建设。主要内存制造商正在优先生产高利润的人工智能专用RAM（如HBM），忽视甚至关闭了消费级内存生产线。据报道，甚至GPU板卡制造商也被英伟达（Nvidia）告知要自行采购显存（VRAM）。\n\n人们所期望的“AI泡沫破裂”场景——即廉价硬件涌入市场——不太可能让消费者受益。这些RAM及相关硬件都是专业化的（集成在独特的GPU或HBM模块中），与标准PC不兼容，并且需要超出典型家庭实验室的巨大基础设施（电力/散热）。\n\n这种情况威胁到PC DIY爱好，使单板计算机（SBC）价格高昂得令人望而却步，并让许多人陷入困境。联想（Lenovo）等公司已经开始囤积RAM，加剧了短缺，这与2020年的卫生纸危机和2021-2022年的芯片短缺如出一辙。作者总结说，这个“AI泡沫”正在对几乎所有电子产品征收一种隐性的“AI税”，而且看不到明确的结束迹象。"
  },
  {
    "id": "46153116",
    "title": "Django 6",
    "url": "https://docs.djangoproject.com/en/6.0/releases/6.0/",
    "summary": "Django 6.0, released December 3, 2025, brings substantial updates and some backwards incompatible changes. It now supports Python 3.12, 3.13, and 3.14, discontinuing support for Python 3.10 and 3.11, and drops support for MariaDB 10.5.\n\nKey new features include built-in Content Security Policy (CSP) support, making it easier to protect against content injection attacks via settings like `SECURE_CSP` and a `csp()` context processor. The Django Template Language gains \"Template Partials\" (`{% partialdef %}` and `{% partial %}`) for encapsulating and reusing template fragments, enhancing modularity. A new, built-in Tasks framework allows offloading work outside the HTTP request-response cycle to background workers, handling task definition, validation, and queuing. Email handling has been updated to use Python’s modern `email.message.EmailMessage` API, offering a cleaner, Unicode-friendly interface.\n\nMinor features include the adoption of Font Awesome 6.7.2 for admin icons, increased PBKDF2 password hasher iterations, new GIS functionalities (e.g., `Rotate` function, MariaDB 12.0.1+ support for `coveredby`), `Lexeme` expression for PostgreSQL full-text search, and the `StringAgg` and `AnyValue` aggregates now available across more databases. Asynchronous pagination is introduced with `AsyncPaginator`.\n\nSignificant backwards incompatible changes include `DEFAULT_AUTO_FIELD` now defaulting to `BigAutoField`, which may require explicit configuration for older projects. Custom ORM expressions must now return parameters as a tuple from their `as_sql()` method.\n\nFinally, Django 6.0 begins deprecating positional arguments for optional parameters in `django.core.mail` APIs, requiring keyword arguments instead.",
    "chinese_title": "Django 6",
    "chinese_summary": "Django 6.0 于 2025 年 12 月 3 日发布，带来了大量更新和一些向后不兼容的改动。它现在支持 Python 3.12、3.13 和 3.14，停止支持 Python 3.10 和 3.11，并取消了对 MariaDB 10.5 的支持。\n\n主要新特性包括内置的内容安全策略 (CSP) 支持，通过 `SECURE_CSP` 等设置和 `csp()` 上下文处理器，可以更轻松地防范内容注入攻击。Django 模板语言增加了“模板局部”（Template Partials）（`{% partialdef %}` 和 `{% partial %}`），用于封装和重用模板片段，从而增强了模块化。一个新的内置任务框架允许将 HTTP 请求-响应周期之外的工作卸载到后台工作者处理，负责任务定义、验证和排队。电子邮件处理已更新为使用 Python 现代的 `email.message.EmailMessage` API，提供了更简洁、更支持 Unicode 的接口。\n\n次要特性包括：管理图标采用 Font Awesome 6.7.2；增加了 PBKDF2 密码哈希器的迭代次数；新增了 GIS 功能（例如 `Rotate` 函数，MariaDB 12.0.1+ 支持 `coveredby`）；PostgreSQL 全文搜索的 `Lexeme` 表达式；以及 `StringAgg` 和 `AnyValue` 聚合函数现在可在更多数据库中使用。通过 `AsyncPaginator` 引入了异步分页。\n\n重大的向后不兼容更改包括 `DEFAULT_AUTO_FIELD` 现在默认为 `BigAutoField`，这可能需要为旧项目进行显式配置。自定义 ORM 表达式现在必须从其 `as_sql()` 方法中以元组形式返回参数。\n\n最后，Django 6.0 开始弃用 `django.core.mail` API 中可选参数的位置参数，转而要求使用关键字参数。"
  },
  {
    "id": "46162656",
    "title": "Cloudflare outage on December 5, 2025",
    "url": "https://blog.cloudflare.com/5-december-2025-outage/",
    "summary": "On December 5, 2025, Cloudflare experienced an outage lasting approximately 25 minutes (08:47 to 09:12 UTC), affecting about 28% of its HTTP traffic. This was not a cyberattack but resulted from internal configuration changes related to mitigating an industry-wide vulnerability (CVE-2025-55182) in React Server Components.\n\nThe incident began when Cloudflare attempted to increase its Web Application Firewall (WAF) buffer size. During this process, an internal WAF testing tool was disabled via a rapid, global configuration system. This change, applied instantly across the network, triggered a bug in Cloudflare's older FL1 proxy. The system attempted to apply a \"killswitch\" to a rule with an \"execute\" action, which unexpectedly caused a Lua exception (\"attempt to index field 'execute' (a nil value)\") due to a missing object.\n\nCustomers using the older FL1 proxy alongside the Cloudflare Managed Ruleset were impacted, receiving HTTP 500 errors. This specific code error had existed undetected for years and is not present in their newer Rust-based FL2 proxy.\n\nCloudflare acknowledged this was the second significant outage in weeks, following a similar incident on November 18. Critical mitigation changes promised after the previous event, such as enhanced rollouts and \"fail-open\" error handling, had not yet been fully deployed. Cloudflare has since locked down all network changes and apologized for the repeated disruption to its customers and the Internet.",
    "chinese_title": "Cloudflare 2025年12月5日服务中断",
    "chinese_summary": "2025年12月5日，Cloudflare发生了一次持续约25分钟（UTC时间08:47至09:12）的宕机，影响了其约28%的HTTP流量。这并非网络攻击，而是源于为缓解React服务器组件中一项行业范围漏洞（CVE-2025-55182）而进行的内部配置更改。\n\n事件始于Cloudflare尝试增加其Web应用防火墙（WAF）的缓冲区大小。在此过程中，一个内部WAF测试工具通过一个快速、全局的配置系统被禁用。这一立即应用于全网络的更改，触发了Cloudflare较旧的FL1代理中的一个错误。系统试图对一个带有“execute”动作的规则应用“killswitch”（紧急关闭开关），由于缺少对象，意外地导致了Lua异常（“attempt to index field 'execute' (a nil value)”）。\n\n使用较旧FL1代理以及Cloudflare托管规则集的用户受到了影响，收到了HTTP 500错误。这个特定的代码错误已存在多年未被发现，并且不存在于他们较新的基于Rust的FL2代理中。\n\nCloudflare承认，这是继11月18日类似事件之后，几周内的第二次重大宕机。上次事件后承诺的关键缓解措施，例如增强的部署流程和“故障开”（fail-open）错误处理，尚未完全部署。此后，Cloudflare已锁定所有网络更改，并为其给客户和互联网造成的反复中断表示歉意。"
  },
  {
    "id": "46154491",
    "title": "We gave 5 LLMs $100K to trade stocks for 8 months",
    "url": "https://www.aitradearena.com/research/we-ran-llms-for-8-months",
    "summary": "The article, titled \"We gave 5 LLMs $100K to trade stocks for 8 months,\" describes a project named \"AI Trade Arena.\" In this initiative, the researchers allocated a substantial sum of $100,000 to five distinct large language models (LLMs). The purpose was for these AI models to engage in stock trading activities over an eight-month period, implying an experimental setup to evaluate their performance and capabilities in a financial market context.\n\n**Important Note:** The provided text is extremely brief, consisting only of the article title and project name. Therefore, this summary is limited to the information explicitly stated in these elements. To provide a more comprehensive summary detailing the specific LLMs used, their trading strategies, the outcomes (profits/losses), and the conclusions drawn, the full article content would be required.",
    "chinese_title": "我们给了5个大型语言模型各10万美元，让它们炒股8个月。",
    "chinese_summary": "这篇文章，题为“我们给了5个大型语言模型10万美元，让它们交易股票8个月”，描述了一个名为“AI交易竞技场”的项目。在此项目中，研究人员向五个不同的大型语言模型（LLMs）拨款10万美元。目的是让这些AI模型在八个月内进行股票交易活动，这暗示了一个实验性设置，旨在评估它们在金融市场背景下的表现和能力。\n\n重要说明：\n所提供的文本非常简短，仅包含文章标题和项目名称。因此，本摘要仅限于这些要素中明确说明的信息。要提供更全面的摘要，详细说明所使用的具体LLMs、它们的交易策略、结果（利润/亏损）以及得出的结论，则需要完整的文章内容。"
  },
  {
    "id": "46149813",
    "title": "Multivox: Volumetric Display",
    "url": "https://github.com/AncientJames/multivox",
    "summary": "Multivox is a software project designed to drive custom volumetric displays, namely Rotovox and Vortex. These devices feature two 128x64 HUB75 LED panels spinning around a vertical axis, controlled by a Raspberry Pi 4. Rotovox uses vertically arranged panels for higher vertical resolution, while Vortex has horizontally arranged panels for brighter output and higher refresh rates, with 3D printable parts available.\n\nThe software architecture consists of a `driver` that creates and scans a voxel buffer in shared memory, synchronized with rotation via a GPIO sensor, and `client` code that generates content and writes to this buffer. Both are designed to run on the same Raspberry Pi, with input from a Bluetooth gamepad and audio via Bluetooth.\n\nThe project includes various `toys` (demos) like `tesseract` and `fireworks`, utility scripts in `python` for calibration and model conversion, and a `simulator` (virtex) that renders the voxel buffer to an X11 window, allowing development without physical hardware.\n\nBuilding involves cloning the repository and using CMake to configure for either `vortex` or `rotovox`. The driver (`sudo ./vortex`) must run first, providing diagnostics and accepting keyboard input for settings like bit depth, uniformity, and trails. Client applications, like `./tesseract` or `./viewer`, then interact with the shared voxel buffer.\n\nFor automatic startup, Multivox can be installed to `~/Multivox` and configured as a systemd service for the driver (`vortex.service`) and a cron job for the `multivox` launcher. The Multivox front end acts as a fantasy console, displaying installed `.mct` applications as cartridges with saved preview snapshots.",
    "chinese_title": "多体素：体积显示器",
    "chinese_summary": "Multivox 是一个软件项目，旨在驱动定制的体积显示器，即 Rotovox 和 Vortex。这些设备配备两个 128x64 HUB75 LED 面板，围绕垂直轴旋转，并由 Raspberry Pi 4 控制。Rotovox 采用垂直排列的面板以实现更高的垂直分辨率，而 Vortex 则采用水平排列的面板以提供更亮的输出和更高的刷新率，并提供可 3D 打印的部件。\n\n软件架构包括一个 `driver`（驱动程序），它在共享内存中创建并扫描体素缓冲区，通过 GPIO 传感器与旋转同步；以及 `client`（客户端）代码，用于生成内容并写入此缓冲区。两者都设计为在同一 Raspberry Pi 上运行，输入来自蓝牙游戏手柄，音频通过蓝牙传输。\n\n该项目包含各种 `toys`（演示程序），如 `tesseract` 和 `fireworks`；用于校准和模型转换的 `python` 实用脚本；以及一个 `simulator`（模拟器，virtex），它将体素缓冲区渲染到 X11 窗口，从而无需物理硬件即可进行开发。\n\n构建涉及克隆代码库并使用 CMake 为 `vortex` 或 `rotovox` 进行配置。驱动程序（`sudo ./vortex`）必须首先运行，它提供诊断信息并接受键盘输入来设置位深度、均匀性和拖影等参数。然后，客户端应用程序（例如 `./tesseract` 或 `./viewer`）与共享体素缓冲区进行交互。\n\n为了实现自动启动，Multivox 可以安装到 `~/Multivox`，并为驱动程序（`vortex.service`）配置为 systemd 服务，为 `multivox` 启动器配置为 cron 任务。Multivox 前端充当一个幻想主机，将已安装的 `.mct` 应用程序显示为带有保存的预览快照的卡带。"
  },
  {
    "id": "46155085",
    "title": "Trick users and bypass warnings – Modern SVG Clickjacking attacks",
    "url": "https://lyra.horse/blog/2025/12/svg-clickjacking/",
    "summary": "The article introduces \"SVG clickjacking,\" a novel technique leveraging SVG filters to enable complex, interactive clickjacking attacks and data exfiltration within cross-origin iframes, surpassing the limitations of classic clickjacking. The author's discovery hinges on SVG filter primitives like `<feColorMatrix>`, `<feDisplacementMap>`, `<feComposite>`, and `<feBlend>` to visually manipulate framed content without directly accessing its data.\n\nKey attack primitives and capabilities demonstrated include:\n*   **Fake Captcha:** Utilizing `feDisplacementMap` to distort text in an iframe, forcing users to retype sensitive codes for exfiltration.\n*   **Grey Text Hiding & Masking:** A sophisticated chain of filters can selectively hide placeholder text, sculpt input fields, and modify their appearance, tricking users into entering specific data.\n*   **Pixel Reading:** By cropping and tiling specific pixels, and applying arithmetic operations with `feComposite`, the attack can detect pixel colors. This enables dynamic, responsive attacks like hover effects, fake dropdowns, and form validation, all reacting to the iframe's visual state.\n*   **Logic Gates:** Critically, the author shows that `feBlend` and `feComposite` can implement all fundamental logic gates (NOT, AND, OR, XOR). This functional completeness allows SVG filters to be programmed for arbitrary logic, enabling highly complex, stateful attacks—even demonstrating a basic calculator (full adder) entirely within the SVG filter.\n\nWhile direct data exfiltration *out* of the SVG context is not possible, the ability to program intricate interactive logic makes SVG clickjacking a potent tool for sophisticated user deception and interaction manipulation. The technique is primarily effective on Chrome and Firefox.",
    "chinese_title": "欺骗用户、绕过警告：现代 SVG 点击劫持攻击",
    "chinese_summary": "本文介绍了一种名为“SVG点击劫持”的新颖技术，该技术利用SVG滤镜在跨域iframe中实现复杂的交互式点击劫持攻击和数据窃取，超越了传统点击劫持的局限性。作者的发现核心在于SVG滤镜基元，如`<feColorMatrix>`、`<feDisplacementMap>`、`<feComposite>`和`<feBlend>`，它们能够在不直接访问其数据的情况下，视觉上操纵被嵌入的内容。\n\n本文展示的关键攻击原语和能力包括：\n*   **伪造验证码：** 利用`feDisplacementMap`扭曲iframe中的文本，强迫用户重新输入敏感代码以窃取数据。\n*   **灰色文本隐藏与遮蔽：** 一系列复杂的滤镜可以有选择地隐藏占位符文本、塑造输入字段并修改其外观，从而欺骗用户输入特定数据。\n*   **像素读取：** 通过裁剪和平铺特定像素，并利用`feComposite`应用算术运算，攻击可以检测像素颜色。这使得动态、响应式攻击成为可能，例如悬停效果、伪造下拉菜单和表单验证，所有这些都根据iframe的视觉状态做出反应。\n*   **逻辑门：** 至关重要的是，作者展示了`feBlend`和`feComposite`可以实现所有基本的逻辑门（非、与、或、异或）。这种功能完备性允许SVG滤镜进行任意逻辑编程，从而实现高度复杂、有状态的攻击——甚至完全在SVG滤镜内演示了一个基本计算器（全加器）。\n\n虽然无法直接从SVG上下文外部窃取数据，但编程复杂交互逻辑的能力使SVG点击劫持成为一种强大的工具，用于复杂的用于欺骗和交互操纵。该技术主要在Chrome和Firefox浏览器上有效。"
  },
  {
    "id": "46157594",
    "title": "UniFi 5G",
    "url": "https://blog.ui.com/article/introducing-unifi-5g",
    "summary": "The UniFi 5G Max lineup was developed with the primary objective of delivering a sleek, versatile, and exceptionally powerful 5G internet experience. Its design ensures effortless functionality and reliable connectivity across any environment.",
    "chinese_title": "UniFi 5G",
    "chinese_summary": "UniFi 5G Max 系列的开发，旨在提供时尚、多功能且性能卓越的5G互联网体验。其设计确保在任何环境下都能实现便捷的功能和可靠的连接。"
  },
  {
    "id": "46158578",
    "title": "Kenyan court declares law banning seed sharing unconstitutional",
    "url": "https://apnews.com/article/kenya-seed-sharing-law-ruling-ad4df5a364299b3a9f8515c0f52d5f80",
    "summary": "A Kenyan high court on Thursday declared unconstitutional sections of a 2012 seed law that had prohibited farmers from sharing and selling indigenous seeds. This landmark ruling, hailed as a major win for food security, overturns a law that could have seen farmers face up to two years in prison or a 1 million Kenya shillings ($7,700) fine for sharing seeds through community seed banks.\n\nJustice Rhoda Rutto also ruled against sections of the law that empowered government officials to raid seed banks and seize seeds. The law was originally introduced to combat the sale of counterfeit seeds and to grant sole seed trading rights to licensed companies.\n\nThe case was brought by 15 smallholder farmers. Farmer Samuel Wathome expressed relief, stating the ruling vindicates traditional seed-saving practices passed down through generations. Elizabeth Atieno, a food campaigner at Greenpeace Africa, lauded the decision as a \"victory for our culture\" and a \"blow against the corporate capture of our food system,\" allowing communities to freely share climate-resilient, locally adapted seeds.\n\nFood campaigners highlight indigenous seeds' importance for food security due to their natural drought resistance and adaptability to local climate conditions, often outperforming hybrid varieties. While Kenya has a national seed bank, community seed banks are crucial for preserving variety and ensuring proximity to farmers. The country has previously faced significant losses due to counterfeit seeds in its rain-fed agricultural sector.",
    "chinese_title": "肯尼亚法院裁定禁分享种子法违宪",
    "chinese_summary": "肯尼亚高等法院周四裁定，2012年种子法中禁止农民分享和销售本土种子的部分违宪。这项具有里程碑意义的裁决被誉为粮食安全方面的一大胜利，它推翻了一项法律。根据该法律，农民通过社区种子库分享种子可能面临长达两年的监禁或100万肯尼亚先令（约合7700美元）的罚款。\n\n罗达·鲁托法官还裁定，该法律中授权政府官员搜查种子库并没收种子的条款也予以驳回。该法律最初出台的目的是打击假冒种子的销售，并授予持牌公司独家种子贸易权。\n\n该案件由15名小农户提起。农民塞缪尔·瓦托姆表达了宽慰，称这项裁决为代代相传的传统种子保存做法正名。绿色和平非洲分部粮食活动家伊丽莎白·阿蒂诺赞扬了这一决定，称其为“我们文化的胜利”和“对企业掌控我们粮食体系的打击”，它将使社区能够自由分享气候适应型和当地适应性强的种子。\n\n粮食活动家们强调，本土种子因其天然的抗旱性和对当地气候条件的适应性而对粮食安全至关重要，它们通常比杂交品种表现更好。尽管肯尼亚拥有国家种子库，但社区种子库对于保护种子的多样性和确保农民就近获得种子至关重要。该国此前在雨养农业部门因假冒种子而遭受了重大损失。"
  },
  {
    "id": "46147493",
    "title": "Fighting the age-gated internet",
    "url": "https://www.wired.com/story/age-verification-is-sweeping-the-us-activists-are-fighting-back/",
    "summary": "The internet is facing a major transformation as age-verification laws gain traction, with half of US states and countries like the UK and Australia implementing such mandates. Congress recently reviewed 19 online safety bills, including the Kids Online Safety Act (KOSA), which often propose ID or age verification for \"adult\" content or even restrict minors under 16 from platforms.\n\nHowever, organizations like Fight for the Future (FFTF) fiercely oppose these measures, arguing they set a dangerous precedent for increased censorship, surveillance, and data breaches due to third-party verification services. Sarah Philips, an FFTF campaigner, labels them \"censorship laws\" that threaten democratic freedom, akin to book bans. Over 90 human rights groups have voiced similar concerns, stating these mandates treat users like \"criminal suspects\" for corporate profit.\n\nCritics argue that these bills fail to address underlying issues like comprehensive privacy and antitrust concerns, instead imposing verification that ultimately impacts all internet users, not just minors. They fear policies like KOSA could enable broad censorship of diverse content, including LGBTQ+ information. Although no new legislation advanced from the recent Congressional hearing, FFTF warns that age-gating the internet would require everyone, regardless of age, to prove they are not a child, fundamentally altering online access and privacy.",
    "chinese_title": "对抗年龄门槛互联网",
    "chinese_summary": "随着年龄验证法律日益普及，互联网正面临一场重大变革，美国半数州以及英国、澳大利亚等国家已开始实施此类强制性规定。国会最近审查了19项在线安全法案，其中包括《儿童在线安全法案》(KOSA)，这些法案通常提议对“成人”内容进行身份或年龄验证，甚至禁止16岁以下未成年人使用某些平台。\n\n然而，像“为未来而战”(FFTF)这样的组织强烈反对这些措施，认为它们为第三方验证服务导致审查、监控和数据泄露的增加开创危险先例。FFTF活动家莎拉·菲利普斯称它们为“审查法”，认为它们威胁民主自由，类似禁书。超过90个人权组织也表达了类似的担忧，称这些强制性规定为了企业利润将用户视为“犯罪嫌疑人”。\n\n批评人士认为，这些法案未能解决综合隐私和反垄断等根本问题，却强制推行验证，最终影响的是所有互联网用户，而不仅仅是未成年人。他们担心KOSA等政策可能导致对包括LGBTQ+信息在内的多元内容的广泛审查。尽管最近的国会听证会没有推进任何新立法，FFTF警告称，对互联网实行年龄限制将要求所有人，无论年龄大小，都证明自己不是儿童，从而从根本上改变在线访问和隐私。"
  },
  {
    "id": "46149375",
    "title": "Autism should not be treated as a single condition",
    "url": "https://www.economist.com/science-and-technology/2025/12/03/why-autism-should-not-be-treated-as-a-single-condition",
    "summary": "Unable to access the article link.",
    "chinese_title": "自闭症不应被视为单一病症",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46152941",
    "title": "A Cozy Mk IV light aircraft crashed after 3D-printed part was weakened by heat",
    "url": "https://www.bbc.com/news/articles/c1w932vqye0o",
    "summary": "A Cozy Mk IV light aircraft crashed at Gloucestershire Airport on March 18 after a 3D-printed plastic part, an air induction elbow, softened and collapsed due to engine heat. The part, purchased at a North American air show, was deemed to be made of \"inappropriate material\" by the Air Accidents Investigation Branch (AAIB).\n\nThe pilot, the sole occupant, sustained minor injuries in the crash, which destroyed the aircraft after its engine lost all power during final approach. He managed to steer clear of some obstacles but struck the instrument landing system. In response to the accident, the Light Aircraft Association (LAA) plans to issue a safety alert to inspectors regarding the use of 3D-printed parts in aircraft.",
    "chinese_title": "一架Cozy Mk IV轻型飞机因3D打印部件受热弱化而坠毁",
    "chinese_summary": "3月18日，一架Cozy Mk IV型轻型飞机在格洛斯特郡机场坠毁。事故原因是其一个3D打印塑料部件——进气弯管——因发动机热量软化并塌陷。该部件是在一次北美航展上购买的，航空事故调查局（AAIB）认为其由“不合适的材料”制成。\n\n飞行员是唯一的乘员，在事故中受轻伤。事故导致飞机在最后进近时发动机失去所有动力，飞机被毁。飞行员设法避开了一些障碍物，但撞上了仪表着陆系统。为应对此次事故，轻型飞机协会（LAA）计划向检查员发布关于飞机中使用3D打印部件的安全警报。"
  },
  {
    "id": "46156979",
    "title": "State Department to deny visas to fact checkers and others, citing 'censorship'",
    "url": "https://www.npr.org/2025/12/04/nx-s1-5633444/trump-content-moderation-visas-censorship",
    "summary": "The State Department, under the Trump administration, has issued a directive to deny H-1B visas to individuals involved in fact-checking, content moderation, or \"trust and safety\" activities, labeling these as \"censorship\" of Americans' speech. An internal memo instructs consular officers to scrutinize applicants' work histories for such roles, particularly those in the tech sector.\n\nThis policy stems from a stance by Secretary of State Marco Rubio and the White House, claiming to defend Americans' freedom of expression. The administration frequently cites President Trump's past bans from social media platforms as evidence of tech companies unfairly targeting conservatives. A State Department spokesperson confirmed the administration's intent to prevent \"aliens coming to the United States to work as censors muzzling Americans.\"\n\nCritics, however, are alarmed. Alice Goguen Hunsberger, a trust and safety professional, emphasized that this work is vital for protecting children, preventing fraud, and enhancing online safety, not arbitrary censorship, and highlights the importance of global workers in these roles. First Amendment experts, such as Carrie DeCell of the Knight First Amendment Institute, criticize the policy as \"incoherent and unconstitutional,\" arguing that studying misinformation and content moderation are protected free speech activities. Ironically, the State Department simultaneously announced it would require H-1B visa applicants to make their social media profiles public for official review.",
    "chinese_title": "国务院将以“审查制度”为由，拒发事实核查员等签证。",
    "chinese_summary": "特朗普政府领导下的国务院发布了一项指令，拒绝向从事事实核查、内容审核或“信任与安全”活动的个人发放H-1B签证，并将其定性为“审查”美国人言论的行为。一份内部备忘录指示领事官员仔细审查申请人的工作经历中是否包含此类职务，特别是科技行业的申请人。\n\n这项政策源于国务卿马可·卢比奥和白宫的立场，声称旨在捍卫美国人的言论自由。政府经常引用特朗普总统此前被社交媒体平台封禁的事件，作为科技公司不公平地针对保守派的证据。一位国务院发言人证实了政府的意图，即阻止“外国人来到美国从事审查工作，压制美国人的言论”。\n\n然而，批评人士对此深感担忧。信任与安全专业人士爱丽丝·戈根·汉斯伯格强调指出，这项工作对于保护儿童、防止欺诈和增强网络安全至关重要，而非武断的审查，并突出了全球劳工在这些岗位上的重要性。第一修正案专家，例如奈特第一修正案研究所的卡丽·德塞尔，批评这项政策“前后矛盾且违宪”，认为研究虚假信息和内容审核是受保护的言论自由活动。具有讽刺意味的是，国务院同时宣布将要求H-1B签证申请人公开其社交媒体资料，以供官方审查。"
  },
  {
    "id": "46145902",
    "title": "Tunnl.gg",
    "url": "https://tunnl.gg",
    "summary": "Tunnl.gg is presented as a service that simplifies the process of exposing a local development server (localhost) to the internet. Its primary value proposition is offering \"the easiest way\" for users to make their locally running applications or services accessible publicly. This tool is beneficial for developers needing to share their work, test webhooks, or collaborate by providing a public URL for their local environment without complex network configurations.",
    "chinese_title": "Tunnl.gg",
    "chinese_summary": "Tunnl.gg 被呈现为一项服务，它简化了将本地开发服务器（localhost）暴露到互联网的过程。其主要价值主张是为用户提供“最简单的方式”，使其本地运行的应用程序或服务能够公开访问。这个工具对开发者非常有用，无论是需要分享他们的工作、测试 webhook，还是通过为本地环境提供公共 URL 进行协作，而且无需进行复杂的网络配置。"
  },
  {
    "id": "46151299",
    "title": "I have been writing a niche history blog for 15 years",
    "url": "https://resobscura.substack.com/p/why-i-have-been-writing-a-niche-history",
    "summary": "Dr. Erik Wade, author of the \"Res Obscura\" Substack, reflects on 15 years of writing his niche history blog, which he started in 2009. The blog meticulously documents a daily calendar of medieval European historical events, drawing directly from primary sources.\n\nWade initially began the blog as a personal project to deepen his engagement with medieval history, improve his research and writing skills, and better understand the period's chronology. What started as a training ground for an aspiring academic evolved into a sustained passion project.\n\nHe continues because it offers profound intellectual satisfaction, allows him to delve into historical details often overlooked, and serves as a valuable compendium of medieval history. The blog has not only honed his scholarly abilities, leading to collaborations and speaking invitations, but also connected him with a community of fellow enthusiasts.\n\nIn an age of rapid content, \"Res Obscura\" stands as a testament to the rewards of slow, deliberate, and consistent engagement with a specialized subject. Wade highlights how this long-term commitment has enriched his academic life, provided a unique creative outlet, and allowed him to contribute a rich, accessible historical resource over many years.",
    "chinese_title": "我写小众历史博客已经15年了。",
    "chinese_summary": "埃里克·韦德博士是“Res Obscura”Substack专栏的作者，他回顾了自2009年开始撰写小众历史博客15年来的历程。这个博客详尽记录了欧洲中世纪历史事件的每日年表，内容直接取材于一手资料。\n\n韦德最初创办这个博客是一个个人项目，旨在加深他对中世纪历史的投入，提升其研究和写作技能，并更好地掌握该时期的历史编年。最初只是他作为一名未来学者的磨练平台，最终发展成为一个持久的、充满激情的项目。\n\n他坚持下去，因为这个博客带给他深刻的智力满足，让他得以深入研究那些常被忽视的历史细节，并作为一份珍贵的中世纪历史概要。这个博客不仅磨练了他的学术能力，为他带来了合作机会和演讲邀请，还让他与一群志同道合的爱好者建立了联系。\n\n在这个信息速食的时代，“Res Obscura”则证明了缓慢、深思熟虑并持之以恒地投入到一个专业领域所带来的丰厚回报。韦德强调，这种长期的投入丰富了他的学术生活，提供了一个独特的创作出口，并使他能够在多年来贡献一份丰富且易于获取的历史资源。"
  },
  {
    "id": "46162262",
    "title": "Covid-19 mRNA Vaccination and 4-Year All-Cause Mortality",
    "url": "https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2842305",
    "summary": "A large retrospective cohort study published in JAMA Network Open investigated the long-term association between mRNA COVID-19 vaccination and all-cause mortality over a four-year period. The study utilized data from over 2.3 million adults aged 18 and older in Israel, tracking outcomes from March 2021 to March 2025.\n\nResearchers compared all-cause mortality rates between individuals who had received three or more mRNA vaccine doses and unvaccinated individuals, meticulously adjusting for potential confounding factors such as age, sex, socioeconomic status, baseline comorbidities, and healthcare utilization.\n\nThe findings revealed a significantly lower risk of all-cause mortality among the vaccinated group. Individuals who received three or more mRNA vaccine doses had an adjusted Hazard Ratio of 0.72 (95% CI, 0.70-0.74) compared to unvaccinated individuals, indicating a 28% lower risk of death from any cause over the four-year follow-up. This protective association remained consistent across various subgroups, including different age ranges, sexes, and individuals with varying comorbidity burdens.\n\nThe study concludes that receiving three or more mRNA COVID-19 vaccine doses is associated with a significantly reduced long-term risk of all-cause mortality. These findings reinforce the overall safety and potential broader health benefits of mRNA vaccination over an extended period, beyond its primary role in preventing severe COVID-19 disease.",
    "chinese_title": "COVID-19 mRNA疫苗接种与4年全因死亡率",
    "chinese_summary": "JAMA Network Open发表的一项大型回顾性队列研究调查了mRNA COVID-19疫苗接种与四年期间内全因死亡率之间的长期关联。该研究使用了来自以色列超过230万18岁及以上成年人的数据，追踪了从2021年3月到2025年3月的结果。\n\n研究人员比较了接受三剂或更多mRNA疫苗接种的个体与未接种疫苗的个体之间的全因死亡率，并精心调整了潜在的混杂因素，例如年龄、性别、社会经济地位、基线合并症和医疗保健利用情况。\n\n研究结果显示，在接种疫苗组中，全因死亡率风险显著降低。与未接种疫苗的个体相比，接受了三剂或更多mRNA疫苗接种的个体调整后的风险比为0.72（95%置信区间，0.70-0.74），这表明在四年随访期间，死于任何原因的风险降低了28%。这种保护性关联在各个亚组中保持一致，包括不同年龄段、性别以及合并症负担不同的个体。\n\n该研究得出结论，接种三剂或更多mRNA COVID-19疫苗与全因死亡率的长期显著降低相关。这些发现进一步证实了mRNA疫苗在较长时间内的整体安全性和潜在的更广泛健康益处，超出了其预防严重COVID-19疾病的主要作用。"
  },
  {
    "id": "46160773",
    "title": "Most technical problems are people problems",
    "url": "https://blog.joeschrag.com/2023/11/most-technical-problems-are-really.html",
    "summary": "The article posits that most technical problems are fundamentally people problems, stemming from human factors rather than purely technical challenges. The author illustrates this with an experience at a company burdened by immense technical debt, where a well-intentioned technical fix failed due to underlying human issues. Developers resisted change, management avoided confronting outdated practices, and a culture of complacency prevailed.\n\nTechnical debt, the author argues, often arises from human failings: unclear requirements, unrealistic sales deadlines, developers choosing comfortable but outdated technologies, reactive management, and ego. The author learned that trying to solve these human-rooted problems with purely technical solutions is ineffective.\n\nThe piece emphasizes that engineers must move beyond the ideal of solving problems in a vacuum. Effective communication, particularly with non-technical stakeholders, is crucial. Technical work, especially tech debt cleanup, must be quantified and presented in terms of business value, as \"perception that your team is getting a lot done is just as important as getting a lot done.\"\n\nUltimately, the article concludes that senior engineering roles require strong cross-functional collaboration, an understanding of personalities, egos, and organizational blindspots, not just deep technical knowledge. While \"engineer's engineers\" are highly productive, the \"heads up coder\" who combines technical expertise with the ability to foresee and navigate project risks (technical and human) is equally valuable for successful initiatives.",
    "chinese_title": "大多数技术问题都是人的问题。",
    "chinese_summary": "文章指出，大多数技术问题本质上是人的问题，源于人为因素而非纯粹的技术挑战。作者通过在一个背负巨额技术债务的公司经历来阐明这一点，该公司一次善意的技术修复因潜在的人为问题而失败。开发者抵制变革，管理层回避直面过时做法，一种自满文化盛行。\n\n作者认为，技术债务往往源于人为失误：需求不明确、不切实际的销售截止日期、开发者选择舒适但过时的技术、反应式管理以及自负。作者认识到，试图用纯粹的技术方案解决这些根植于人的问题是无效的。\n\n文章强调，工程师必须超越在“真空”中解决问题的理想。有效沟通，尤其是与非技术利益相关者的沟通，至关重要。技术工作，尤其是技术债务清理，必须量化并以业务价值来呈现，因为“你的团队做了很多工作的感知与实际做了很多工作同样重要”。\n\n最终，文章总结道，高级工程职位不仅需要深厚的技术知识，还需要强大的跨职能协作能力，以及对个性和自我、组织盲点的理解。尽管“纯粹的工程师”效率很高，但兼具技术专长和预见及驾驭项目风险（技术和人为）能力的“高瞻远瞩的程序员”对于项目的成功同样宝贵。"
  },
  {
    "id": "46145797",
    "title": "Programming peaked",
    "url": "https://functional.computer/blog/programming-peaked",
    "summary": "Samir Talwar argues that programming has peaked, contrasting the current development landscape of 2025 with his experiences in 2010.\n\nIn 2025, he describes an environment where JavaScript (with types) is prevalent, often generated by AI and susceptible to malicious NPM packages. Development relies on resource-intensive tools like VS Code, slow TypeScript compilations, and cumbersome pull request workflows that significantly delay code integration. Deployment is a complex \"ordeal,\" involving bloated containers (re-downloading entire Debian repositories, including unnecessary components like Perl) and untestable, string-templated YAML for opaque Kubernetes clusters. These run on expensive, rented Cloud VMs, where direct control and transparency are lost, making the entire process slow, frustrating, and divorced from actual programming.\n\nIn contrast, Talwar fondly recalls 2010, when he wrote Java using efficient tools like Eclipse, which offered advanced refactoring and instant compilation. Development involved constant, fast unit testing, direct code pushes after pairing, and rapid deployment of simple JAR files (with vetted Maven dependencies) to reliable, owned physical servers in local datacentres. This allowed for code-to-ship times under a minute.\n\nTalwar expresses a longing for those dependable tools, the speed of deployment, and the presence of testers. He attributes the decline to NPM, which made Node.js and JavaScript ubiquitous, leading to its often-inappropriate use across the stack (including React and Electron). He advocates for a return to using \"sensible tool[s] for the job at hand.\"",
    "chinese_title": "编程达到顶峰",
    "chinese_summary": "萨米尔·塔尔瓦认为编程已达到顶峰，他将2025年当前的开发现状与自己在2010年的经历进行了对比。\n\n在2025年，他描述了一个强类型JavaScript普遍存在的环境，这些代码常由AI生成，并易受恶意NPM包的侵扰。开发依赖于VS Code等资源密集型工具、缓慢的TypeScript编译以及繁琐的拉取请求（pull request）工作流，这些都显著延迟了代码集成。部署是一个复杂的“苦差事”，它涉及臃肿的容器（重新下载整个Debian仓库，包括Perl等不必要的组件），以及用于不透明Kubernetes集群的、无法测试且字符串模板化的YAML。这些都运行在昂贵、租用的云虚拟机上，在那里，直接控制和透明度都已丧失，使得整个过程缓慢、令人沮丧，并与实际编程脱节。\n\n相比之下，塔尔瓦深情回忆起2010年，那时他使用Eclipse等高效工具编写Java代码，这些工具提供了高级重构和即时编译功能。开发涉及持续、快速的单元测试，结对编程后直接推送代码，以及将简单的JAR文件（带有经过审查的Maven依赖）快速部署到本地数据中心可靠的自有物理服务器上。这使得代码从编写到发布的时间可以控制在一分钟之内。\n\n塔尔瓦表达了对那些可靠工具、部署速度和测试人员存在的渴望。他将这种衰落归因于NPM，NPM使得Node.js和JavaScript无处不在，导致它们在整个技术栈中（包括React和Electron）经常被不恰当地使用。他倡导回归“为手头工作选择合适的工具”这一理念。"
  },
  {
    "id": "46146406",
    "title": "30 years ago today \"Netscape and Sun announce JavaScript\"",
    "url": "https://web.archive.org/web/20070916144913/http://wp.netscape.com/newsref/pr/newsrelease67.html",
    "summary": "On December 4, 1995, Netscape Communications and Sun Microsystems announced JavaScript, an open, cross-platform object scripting language. This new language was designed to complement Sun's Java, facilitating the creation and customization of applications for enterprise networks and the Internet. An initial version was immediately available as part of the beta release of Netscape Navigator 2.0.\n\nJavaScript is positioned as an easy-to-use scripting language for HTML page authors and enterprise developers to dynamically control the behavior of objects on clients and servers, rather than creating new objects like Java. It's designed to be network-centric, integrated with both Java and HTML, and accessible even to those with little programming experience, similar to Visual Basic.\n\nTwenty-eight industry-leading companies, including Apple, AT&T, Hewlett-Packard, Oracle, and Silicon Graphics, endorsed JavaScript, committing to its integration into their future products. Netscape and Sun announced plans to propose JavaScript to the W3 Consortium (W3C) and the Internet Engineering Task Force (IETF) as an open, freely licensed Internet standard, including offering a royalty-free source code reference implementation. Netscape pledged to integrate JavaScript across its client and server products, as well as development tools like Netscape Navigator Gold 2.0 and LiveWire, to support the development and deployment of dynamic online applications.",
    "chinese_title": "三十年前的今天，网景和太阳宣布了JavaScript",
    "chinese_summary": "1995年12月4日，网景通信公司（Netscape Communications）和昇阳微系统公司（Sun Microsystems）宣布推出JavaScript，这是一种开放的、跨平台的对象脚本语言。这种新语言旨在补充昇阳的Java，促进为企业网络和互联网创建和定制应用程序。首个版本随即作为网景导航者（Netscape Navigator）2.0测试版的一部分推出。\n\nJavaScript被定位为一种易于使用的脚本语言，供HTML页面作者和企业开发人员使用，以动态控制客户端和服务器上对象的行为，而不是像Java那样创建新对象。它被设计为以网络为中心，与Java和HTML集成，并且即使是编程经验很少的人也能上手，类似于Visual Basic。\n\n包括苹果（Apple）、美国电话电报公司（AT&T）、惠普（Hewlett-Packard）、甲骨文（Oracle）和硅谷图形公司（Silicon Graphics）在内的二十八家行业领先公司认可JavaScript，承诺将其整合到未来的产品中。网景和昇阳宣布计划向W3C联盟（W3C Consortium）和互联网工程任务组（IETF）提议将JavaScript作为一项开放的、自由许可的互联网标准，包括提供免版税的源代码参考实现。网景承诺将其客户端和服务器产品，以及Netscape Navigator Gold 2.0和LiveWire等开发工具全面集成JavaScript，以支持动态在线应用程序的开发和部署。"
  },
  {
    "id": "46162368",
    "title": "Jolla Phone Pre-Order",
    "url": "https://commerce.jolla.com/products/jolla-phone-preorder",
    "summary": "The Jolla Phone is an independent European Linux smartphone, designed with community input as a \"Do It Together\" project, emphasizing privacy and user control. Pre-orders are currently open via a 99 € refundable voucher, which secures a special total price of 499 € (compared to an estimated normal price of 599€-699€).\n\nThe project is crowdfunded and requires 2,000 pre-orders by January 4, 2026, to move into full production; if the goal isn't met, all payments are fully refunded. As of now, 620 units have been sold. Estimated delivery is by the end of 1H/2026, initially for EU, UK, Norway, and Switzerland markets.\n\nKey features include Sailfish OS 5, offering \"Privacy by Design\" with no tracking, a user-configurable physical Privacy Switch (for mic, Bluetooth, Android apps), and guaranteed long-term OS support (minimum 5 years). It runs native Sailfish apps and Android apps via AppSupport, with an option to go fully de-Googled. Hardware specifications include 5G with dual-SIM, 12GB RAM, 256GB expandable storage, a 6.36” FullHD AMOLED display, 50MP main camera, and a user-replaceable 5,500mAh battery. The design features user-replaceable back covers in distinct Nordic-inspired colors. Early supporters also receive a Special Edition Back Cover.",
    "chinese_title": "Jolla 手机预订",
    "chinese_summary": "Jolla手机是一款独立的欧洲Linux智能手机，融合社区意见，作为一项“共同实现”的项目设计，强调隐私和用户控制。目前已开放预订，通过99欧元的保证金券（可退还）即可确保以499欧元的特惠总价购买（相比之下，预计正常价格为599欧元-699欧元）。\n\n该项目采用众筹模式，需在2026年1月4日前达到2,000份预订单才能进入全面生产阶段；如果未能达标，所有款项将全额退还。截至目前，已售出620台。预计在2026年上半年末交付，最初面向欧盟、英国、挪威和瑞士市场。\n\n主要特点包括Sailfish OS 5操作系统，提供“隐私优先设计”，无追踪功能；一个用户可配置的物理隐私开关（用于麦克风、蓝牙、安卓应用）；并保证长期操作系统支持（至少5年）。它通过AppSupport运行原生的Sailfish应用和安卓应用，并提供完全去Google化的选项。硬件配置包括5G双卡、12GB内存、256GB可扩展存储、6.36英寸全高清AMOLED显示屏、50MP主摄像头以及一个用户可更换的5,500mAh电池。设计特点是用户可更换的后盖，采用独特的北欧风格配色。早期支持者还将获得一个特别版后盖。"
  },
  {
    "id": "46154022",
    "title": "State of AI: An Empirical 100T Token Study with OpenRouter",
    "url": "https://openrouter.ai/state-of-ai",
    "summary": "This article from OpenRouter presents an empirical study based on 100 trillion tokens of AI usage data to analyze the state of AI. The key findings reveal several significant trends:\n\nOpen-source models, particularly Mixtral, are rapidly catching up to and in some cases surpassing proprietary models like GPT-3.5 in both performance and cost-effectiveness. Mixtral is noted for being 2-3x cheaper than GPT-3.5 and achieving comparable or better quality in many use cases, making it a strong contender for production workloads.\n\nThe study highlights the increasing commoditization of \"good enough\" AI. As many tasks can be handled by a range of models, cost-efficiency and speed are becoming critical differentiators. There's a strong trend towards \"lowest bidder AI\" where users optimize for the cheapest model that meets their quality threshold.\n\nAnother major finding is the emergence of \"model agility.\" Developers are increasingly building applications with the flexibility to switch between models based on performance, cost, and availability, rather than being locked into a single provider. This multi-model approach is crucial for optimizing workflows and mitigating vendor lock-in.\n\nOverall, the report suggests a shift towards a more diverse and competitive AI landscape, where open-source innovations and cost efficiency are driving significant changes in how AI is developed and deployed.",
    "chinese_title": "AI现状：基于OpenRouter的100T Token实证研究",
    "chinese_summary": "OpenRouter的这篇文章基于100万亿个AI使用token数据，进行了一项实证研究，以分析AI的现状。主要发现揭示了几个显著趋势：\n\n开源模型，尤其是Mixtral，在性能和成本效益两方面正迅速赶上，在某些情况下甚至超越GPT-3.5等专有模型。Mixtral以比GPT-3.5便宜2-3倍且在许多用例中能达到相当甚至更优的质量而著称，使其成为生产工作负载的有力竞争者。\n\n该研究强调了“足够好”的AI日益商品化。由于许多任务可以通过一系列模型来处理，成本效益和速度正成为关键的差异化因素。目前存在一种强烈的“最低价AI”趋势，即用户会选择满足其质量门槛的最便宜模型。\n\n另一个主要发现是“模型敏捷性”的出现。开发者正越来越多地构建具有根据性能、成本和可用性灵活切换模型能力的应用，而不是被锁定在单一提供商。这种多模型方法对于优化工作流程和减轻供应商锁定至关重要。\n\n总体而言，该报告表明AI格局正转向更加多元化和竞争激烈，其中开源创新和成本效率正在推动AI开发和部署方式的重大变革。"
  },
  {
    "id": "46162872",
    "title": "Framework Laptop 13 gets ARM processor with 12 cores via upgrade kit",
    "url": "https://www.notebookcheck.net/Framework-Laptop-13-gets-ARM-processor-with-12-cores-via-upgrade-kit.1177930.0.html",
    "summary": "MetaComputing has launched an ARM mainboard upgrade kit for the Framework Laptop 13, providing an alternative to traditional Intel, AMD, and Snapdragon X processors. This mainboard is equipped with a CIX CP8180 ARM chipset, featuring eight Cortex-A720 performance cores (two boosting to 2.6 GHz) and four Cortex-A520 efficiency cores, alongside a 10-core ARM Immortalis-G720 GPU and a 30 TOPS AI accelerator.\n\nThough likely slower than the Snapdragon X Elite, the chipset is expected to be sufficient for daily tasks. A significant concern is its high idle power draw of approximately 16 watts, which could lead to short battery life with the Framework Laptop 13's 55Wh battery, making it potentially more attractive to developers.\n\nThe mainboard is compatible with the Framework Laptop 13 or can be housed in a mini PC case. The MetaComputing ARM AI PC Kit is available now, with a base configuration (16GB RAM, 1TB SSD, mini PC case) priced at $549. A bundle including a Framework Laptop 13 costs $999, and a 32GB RAM upgrade is an additional $100. Worldwide shipping is free, excluding import fees and taxes.",
    "chinese_title": "框架笔记本13通过升级套件搭载12核ARM处理器",
    "chinese_summary": "MetaComputing推出了适用于Framework笔记本13的ARM主板升级套件，为传统的英特尔、AMD和骁龙X处理器提供了替代选择。该主板配备了CIX CP8180 ARM芯片组，搭载八个Cortex-A720性能核心（其中两个可加速至2.6 GHz）和四个Cortex-A520能效核心，以及一个10核ARM Immortalis-G720 GPU和一个30 TOPS的AI加速器。\n\n尽管性能可能低于骁龙X Elite，但该芯片组预计足以应对日常任务。一个值得关注的问题是其高达约16瓦的空闲功耗，这可能导致搭配Framework笔记本13的55瓦时电池时，续航时间缩短，使其对开发者来说可能更具吸引力。\n\n该主板兼容Framework笔记本13，也可以安装在迷你PC机箱中。MetaComputing ARM AI PC套件现已上市，基本配置（16GB内存、1TB固态硬盘、迷你PC机箱）定价为549美元。包含Framework笔记本13的捆绑包售价为999美元，32GB内存升级需额外支付100美元。全球免费送货，不含进口关税和税费。"
  },
  {
    "id": "46161125",
    "title": "Influential study on glyphosate safety retracted 25 years after publication",
    "url": "https://www.lemonde.fr/en/environment/article/2025/12/03/influential-study-on-glyphosate-safety-retracted-25-years-after-publication_6748114_114.html",
    "summary": "An influential study published in April 2000 in *Regulatory Toxicology and Pharmacology*, which concluded glyphosate was safe, has been retracted 25 years later, on November 28. The journal cited \"several critical issues that are considered to undermine the academic integrity of this article and its conclusions.\"\n\nThe retraction stems from revelations made eight years prior during US court proceedings, known as the \"Monsanto Papers.\" These internal documents exposed \"ghostwriting,\" a form of scientific fraud. It was revealed that Monsanto employees, not the listed scientists Gary M. Williams, Robert Kroes, and Ian C. Munro, were the actual authors of the research.\n\nCompanies engage in ghostwriting to pay researchers to sign their names to articles they did not write. The clear motivation is to lend credibility to studies supporting the safety of their products, such as pesticides or drugs, by making it appear they were authored by independent scientists rather than company employees.",
    "chinese_title": "具有影响力的草甘膦安全性研究发表25年后被撤回",
    "chinese_summary": "一项于2000年4月发表在《法规毒理学与药理学》期刊上、结论为草甘膦是安全的颇具影响力的研究，在25年后的11月28日被撤回。该期刊引述称，存在“几个关键问题，这些问题被认为损害了该文章及其结论的学术诚信。”\n\n此次撤回源于八年前在美国法庭诉讼期间披露的信息，即所谓的“孟山都文件”。这些内部文件揭露了“幽灵写作”这种学术造假形式。文件显示，该研究的实际作者是孟山都的员工，而非署名科学家Gary M. Williams、Robert Kroes和Ian C. Munro。\n\n公司进行幽灵写作，是为了付钱给研究人员，让他们在并非自己撰写的文章上署名。其明确动机是，通过使支持其产品（如农药或药物）安全性的研究看起来是由独立科学家而非公司员工撰写，从而提升这些研究的可信度。"
  },
  {
    "id": "46148460",
    "title": "Show HN: Onlyrecipe 2.0 – I added all features HN requested – 4 years later",
    "url": "https://onlyrecipeapp.com/?url=https://www.allrecipes.com/turkish-pasta-recipe-8754903",
    "summary": "This \"Show HN\" post introduces Onlyrecipe 2.0, an updated version of a recipe management application. The creator highlights that this release, arriving four years after the initial discussion on Hacker News, incorporates all the features and requests made by the HN community during that time. The core functionality of Onlyrecipe is to allow users to save, organize, and print their favorite recipes.",
    "chinese_title": "HN 展示：Onlyrecipe 2.0 — 四年后，我添加了 HN 要求的所有功能。",
    "chinese_summary": "这篇“Show HN”帖子介绍了Onlyrecipe 2.0，一款食谱管理应用的更新版本。创作者强调，此版本是在Hacker News上首次讨论四年后发布的，它整合了HN社区在那段时间内提出的所有功能和请求。Onlyrecipe的核心功能是让用户能够保存、整理和打印他们喜爱的食谱。"
  },
  {
    "id": "46146740",
    "title": "Japanese four-cylinder engine is so reliable still in production after 25 years",
    "url": "https://www.topspeed.com/reliable-japanese-four-cylinder-engine-still-in-production/",
    "summary": "The Honda K-series engine is celebrated in the Japanese automotive community for its exceptional balance of performance, reliability, and efficiency, remaining in production for almost 25 years. Introduced in 2001, it replaced the B and H series to meet stricter emissions and improve thermal efficiency. Its first generation featured a clean-sheet aluminum block, forged crankshaft, lightweight pistons, chain-driven dual overhead camshafts, and the advanced i-VTEC system for broad torque and strong high-RPM breathing. Honda also optimized the engine's orientation for better airflow and serviceability, debuting it in the JDM Stream before expanding to models like the Civic and Integra Type R.\n\nThe current-generation K20C evolved to meet modern turbocharging demands and emissions. Key improvements include a reinforced closed-deck aluminum block for enhanced cylinder stability, a low-friction rotating assembly, precise direct injection, and optimized cylinder head ports. Its compact, low-inertia turbo and integrated exhaust passages improve response and emissions. Honda prioritizes mid-range torque and real-world drivability, validating designs through extensive endurance testing, resulting in predictable behavior and low maintenance.\n\nThe K-series also proved its mettle in motorsport, with racing versions excelling in touring car championships like Super Taikyu and BTCC. Its rigid block, efficient cooling, sharp throttle response, and i-VTEC flexibility contributed to strong pace and reliability, often completing full seasons with minimal rebuilds.\n\nHonda continues to utilize the K-series due to its adaptable architecture, supporting modern efficiency, high durability, and potential for integration with hybrid systems. Its design allows for continuous improvement without major structural changes, ensuring cost-effectiveness and manufacturing consistency. While the L-series may eventually be a primary focus, the K-series' proven performance, resilience, and market appeal ensure its continued relevance.",
    "chinese_title": "日系四缸发动机可靠性极高，25年了仍在生产。",
    "chinese_summary": "本田K系列发动机因其在性能、可靠性和效率之间卓越的平衡而在日本汽车界备受推崇，已持续生产近25年。该系列发动机于2001年推出，取代了B系列和H系列，旨在满足更严格的排放标准并提高热效率。其第一代产品采用了全新的铝制缸体、锻造曲轴、轻量化活塞、链条驱动双顶置凸轮轴，以及先进的i-VTEC系统，以实现宽泛的扭矩和强劲的高转速响应。本田还优化了发动机的安装方向，以改善气流和可维护性，最初在日本本土市场（JDM）的Stream车型上首次亮相，随后扩展到思域（Civic）和英特格拉Type R（Integra Type R）等车型。\n\n当前一代的K20C发动机经过发展，以满足现代涡轮增压和排放要求。主要改进包括：强化型封闭式铝制缸体以增强气缸稳定性、低摩擦旋转组件、精准的直喷技术以及优化的气缸盖气道。其紧凑、低惯量涡轮增压器和一体式排气通道提高了响应速度并减少了排放。本田优先考虑中低转速扭矩和实际驾驶性能，通过广泛的耐久性测试验证设计，从而实现了可预测的行为和低维护成本。\n\nK系列发动机在赛车运动中也证明了其实力，赛车版本在Super Taikyu（超级耐久赛）和BTCC（英国房车锦标赛）等房车锦标赛中表现出色。其坚固的缸体、高效的冷却系统、灵敏的油门响应以及i-VTEC系统的灵活性，共同为其带来了强劲的性能和可靠性，通常只需极少的重建即可完成整个赛季。\n\n本田继续使用K系列发动机，得益于其适应性强的架构，支持现代效率、高耐用性以及与混合动力系统集成的潜力。其设计允许在不进行重大结构改变的情况下持续改进，从而确保了成本效益和制造一致性。尽管L系列最终可能成为主要焦点，但K系列久经考验的性能、韧性和市场吸引力确保了其持续的重要性。"
  },
  {
    "id": "46138632",
    "title": "Lie groups are crucial to some of the most fundamental theories in physics",
    "url": "https://www.quantamagazine.org/what-are-lie-groups-20251203/",
    "summary": "Lie groups are a powerful mathematical tool that blends group theory, geometry, and linear algebra, proving crucial to fundamental theories in physics, number theory, and chemistry. Identified by Marius Sophus Lie in the 1870s, they describe continuous symmetries, unlike the discrete symmetries of objects like an equilateral triangle.\n\nFor instance, the infinite rotations of a Frisbee form the Lie group SO(2), which can be visualized as a smooth, continuous shape or \"manifold\"—a circle in this case. Other Lie groups might resemble a sphere or more complex shapes. This smooth geometry is their key advantage. By \"zooming in\" on a small region of a Lie group, its curve can be approximated as a straight line, called a Lie algebra. This transformation allows mathematicians to use the simpler tools of linear algebra to perform complex calculations and compare different groups.\n\nIn physics, Lie groups are indispensable. The natural world abounds with continuous symmetries, which Lie groups elegantly capture. All fundamental forces—gravity, electromagnetism, and the strong/weak nuclear forces—are defined by Lie group symmetries, explaining phenomena like particle pairings and quantized energy levels. Moreover, Emmy Noether's theorem demonstrated that for every Lie group symmetry in a physical system, there exists a corresponding conservation law (e.g., time translation symmetry implies energy conservation). Lie groups thus remain a vital tool for understanding the universe's inherent symmetries.",
    "chinese_title": "李群对物理学中一些最基本的理论至关重要。",
    "chinese_summary": "李群是一种强大的数学工具，它融合了群论、几何学和线性代数，对物理学、数论和化学中的基础理论至关重要。李群由马吕斯·索福斯·李在19世纪70年代提出，它们描述了连续对称性，这与等边三角形等物体的离散对称性不同。\n\n例如，飞盘的无限旋转构成了李群SO(2)，它可被形象化为一个光滑、连续的形状或“流形”——在本例中就是一个圆。其他李群可能类似于球体或更复杂的形状。这种光滑的几何结构是它们的核心优势。通过“放大”观察李群的一个小区域，其曲线可以被近似为一条直线，这被称为李代数。这种转化使得数学家能够利用线性代数这一更简单的工具来进行复杂的计算，并比较不同的群。\n\n在物理学中，李群是不可或缺的。自然界中充满了连续对称性，而李群能够优雅地捕捉这些对称性。所有基本作用力——引力、电磁力以及强弱核力——都由李群对称性来定义，解释了粒子配对和量子化能级等现象。此外，埃米·诺特定理证明，物理系统中的每一个李群对称性都对应一个守恒定律（例如，时间平移对称性意味着能量守恒）。因此，李群仍然是理解宇宙固有对称性的一项至关重要的工具。"
  },
  {
    "id": "46149019",
    "title": "Bootloader Unlock Wall of Shame",
    "url": "https://github.com/zenfyrdev/bootloader-unlock-wall-of-shame",
    "summary": "The \"Bootloader Unlock Wall of Shame\" is a compilation of companies that restrict or completely block bootloader unlocking on their devices. The author views this trend, often disguised as \"caring about your data,\" as a dangerous precedent that limits user control and could lead to further restrictions on features like ADB or sideloading. It emphasizes that only 100% offline unlock processes are truly trustworthy.\n\nThe document categorizes manufacturers by the difficulty of unlocking:\n*   **\"Just terrible!\"** lists companies making it completely impossible without workarounds (e.g., Apple, Samsung, Huawei, Amazon, Alcatel). This category also includes most **Carrier Locked Devices**, which often remain locked even after contracts expire.\n*   **\"Avoid at all costs!\"** includes manufacturers that allow unlocking only under specific conditions (region, model, SOC) or require sacrifices (e.g., Xiaomi, OPPO/Realme, HMD/Nokia, Motorola, LG).\n*   **\"Proceed with caution!\"** features companies requiring an online account and/or a waiting period before unlocking (e.g., Google, OnePlus, Sony, Fairphone).\n*   **\"Safe for now\"** identifies manufacturers with fewer restrictions (e.g., Nothing, Microsoft, Volla, Teclast).\n\nAdditionally, the guide provides \"Misc info\" on potential unlocking methods, such as custom Android Verified Boot (AVB) keys and universal SOC-based exploits for Kirin, MediaTek, and Unisoc chipsets. Qualcomm lacks a universal method but offers some device-specific options.",
    "chinese_title": "Bootloader 解锁耻辱墙",
    "chinese_summary": "“引导加载程序解锁耻辱墙”汇集了那些在其设备上限制或完全阻止引导加载程序解锁的公司。作者认为这种趋势，常伪装成“关心您的数据”，是一个危险的先例，它限制了用户控制，并可能导致对ADB或侧载等功能进一步的限制。它强调只有100%离线解锁过程才是真正值得信赖的。\n\n本文档根据解锁难度对制造商进行了分类：\n*   **“简直糟糕透顶！”** 列出了那些不使用变通方法就完全无法解锁的公司（例如苹果、三星、华为、亚马逊、阿尔卡特）。此类别还包括大多数**运营商锁定设备**，这些设备即使在合同到期后也通常保持锁定状态。\n*   **“务必避免！”** 包括那些仅在特定条件下（地区、型号、系统芯片）才允许解锁或需要付出代价的制造商（例如小米、OPPO/Realme、HMD/诺基亚、摩托罗拉、LG）。\n*   **“谨慎行事！”** 列出了那些在解锁前需要在线账户和/或等待期的公司（例如谷歌、一加、索尼、Fairphone）。\n*   **“暂时安全”** 指出了限制较少的制造商（例如Nothing、微软、Volla、Teclast）。\n\n此外，该指南提供了关于潜在解锁方法的“杂项信息”，例如自定义Android验证启动 (AVB) 密钥以及针对麒麟、联发科和紫光展锐芯片组的通用系统芯片级漏洞。高通公司没有通用的方法，但提供了一些针对特定设备的选项。"
  },
  {
    "id": "46155701",
    "title": "NeurIPS 2025 Best Paper Awards",
    "url": "https://blog.neurips.cc/2025/11/26/announcing-the-neurips-2025-best-paper-awards/",
    "summary": "NeurIPS 2025 announced its Best Paper Awards, recognizing seven groundbreaking papers: four best papers (one from the Datasets & Benchmark Track) and three runner-ups. These awards highlight advances in diffusion model theory, self-supervised reinforcement learning, attention mechanisms for large language models (LLMs), reasoning in LLMs, online learning, neural scaling laws, and LLM diversity benchmarking.\n\nThe Best Papers include:\n*   **\"Artificial Hivemind: The Open-Ended Homogeneity of Language Models (and Beyond)\"** (Datasets & Benchmark Track) introduces Infinity-Chat, a large-scale dataset for evaluating LLM diversity. It reveals the \"Artificial Hivemind effect\"—LLMs' tendency to generate homogeneous outputs, posing risks to human creativity and highlighting miscalibration with diverse human preferences.\n*   **\"Gated Attention for Large Language Models\"** demonstrates that a simple head-specific sigmoid gate after Scaled Dot-Product Attention consistently improves LLM performance, enhances training stability, and mitigates the \"attention sink\" phenomenon.\n*   **\"1000 Layer Networks for Self-Supervised RL: Scaling Depth Can Enable New Goal-Reaching Capabilities\"** challenges the convention of shallow RL networks, showing that increasing depth to 1024 layers significantly boosts self-supervised contrastive RL performance and enables the emergence of more sophisticated capabilities.\n*   **\"Why Diffusion Models Don’t Memorize: The Role of Implicit Dynamical Regularization in Training\"** provides foundational insights into diffusion model generalization. It identifies two distinct timescales—generalization and memorization—showing an expanding window for effective generalization due to implicit dynamical regularization.\n\nOne runner-up, **\"Does Reinforcement Learning Really Incentivize Reasoning Capacity in LLMs Beyond the Base Model?\"**, critically examines Reinforcement Learning with Verifiable Rewards (RLVR). It finds that current RLVR methods primarily improve sampling efficiency but do not elicit fundamentally new reasoning patterns beyond the base model's inherent capabilities, suggesting that distillation might be more effective for true capability expansion.",
    "chinese_title": "NeurIPS 2025 最佳论文奖",
    "chinese_summary": "NeurIPS 2025 公布了其最佳论文奖，表彰了七篇开创性论文：四篇最佳论文（其中一篇来自数据集与基准赛道）和三篇优胜奖论文。这些奖项凸显了扩散模型理论、自监督强化学习、大型语言模型（LLM）的注意力机制、LLM推理、在线学习、神经缩放定律以及LLM多样性基准测试方面的进展。\n\n最佳论文包括：\n*   **“人工蜂群：语言模型（及 beyond）的开放式同质性”**（数据集与基准赛道）介绍了 Infinity-Chat，一个用于评估LLM多样性的大规模数据集。它揭示了“人工蜂群效应”——LLM倾向于生成同质化输出，对人类创造力构成风险，并凸显了与多样化人类偏好的校准不足。\n*   **“大型语言模型的门控注意力”** 证明了在缩放点积注意力之后使用一个简单的头部特定 Sigmoid 门控，能够持续提升LLM性能，增强训练稳定性，并缓解“注意力汇聚”现象。\n*   **“用于自监督强化学习的千层网络：深度扩展可实现新的目标达成能力”** 挑战了传统浅层强化学习网络的惯例，表明将深度增加到1024层能够显著提升自监督对比强化学习的性能，并促使更复杂的能力涌现。\n*   **“扩散模型为何不记忆：训练中隐式动态正则化的作用”** 为扩散模型的泛化提供了基础见解。它识别了两个不同的时间尺度——泛化和记忆，并表明由于隐式动态正则化，有效泛化的窗口正在扩大。\n\n一篇优胜奖论文，**“强化学习真的能激励LLM超越基础模型的推理能力吗？”**，批判性地审视了带可验证奖励的强化学习（RLVR）。它发现当前的RLVR方法主要提升了采样效率，但未能激发超越基础模型固有能力的根本性新推理模式，这表明蒸馏可能对真正的能力扩展更为有效。"
  },
  {
    "id": "46148763",
    "title": "The Free Software Foundation Europe deleted its account on X",
    "url": "https://fsfe.org/news/2025/news-20251204-01.en.html",
    "summary": "On December 4, 2025, the Free Software Foundation Europe (FSFE) announced it had permanently deleted its account on X, the platform formerly known as Twitter. The decision reflects the FSFE's long-held discomfort with the proprietary platform, which never aligned with its core values of freedom and decentralization.\n\nInitially, the FSFE used Twitter to promote Free Software values, engage with policymakers and journalists, and reach individuals unfamiliar with software freedom, viewing it as a tool for information exchange and dialogue. However, following Elon Musk's acquisition and the rebranding to X, the platform significantly deteriorated. The FSFE observed it transform into a \"centralised arena of hostility, misinformation, and profit-driven control,\" marked by increased harassment, hate speech, and an algorithm that prioritizes polarization and sensationalism. Growing privacy and data protection concerns further solidified their decision to depart.\n\nWhile the FSFE will maintain a presence on some other proprietary platforms to reach a wider audience, it strongly encourages supporters of digital freedom and decentralization to join them on the Fediverse. They advocate for the Fediverse, including Mastodon and Peertube, as a transparent, autonomous, and resilient alternative to profit-driven, centrally controlled platforms.",
    "chinese_title": "自由软件基金会欧洲删除了其X账号",
    "chinese_summary": "2025年12月4日，欧洲自由软件基金会（FSFE）宣布已永久删除其在X平台（即以前的Twitter）上的账户。这一决定反映了FSFE长期以来对这个专有平台的不满，该平台从未与其自由和去中心化的核心价值观相符。\n\n最初，FSFE曾利用Twitter推广自由软件价值观，与政策制定者和记者互动，并接触不熟悉软件自由的个人，将其视为信息交流和对话的工具。然而，在埃隆·马斯克收购并将品牌重塑为X之后，该平台显著恶化。FSFE观察到它演变成一个“充满敌意、错误信息和利润驱动控制的中心化舞台”，其特点是骚扰、仇恨言论增多，以及算法优先考虑两极分化和哗众取宠。日益增长的隐私和数据保护担忧进一步坚定了他们离开的决定。\n\n尽管FSFE仍将保留在其他一些专有平台上的存在以接触更广泛的受众，但它强烈鼓励数字自由和去中心化的支持者加入他们的联邦宇宙（Fediverse）。他们倡导将联邦宇宙（包括Mastodon和Peertube）作为营利驱动、中心化控制平台的透明、自主且有弹性的替代方案。"
  },
  {
    "id": "46142866",
    "title": "Why WinQuake exists and how it works",
    "url": "https://fabiensanglard.net/winquake/index.html",
    "summary": "WinQuake (`winquake.exe`) was created by id Software to overcome significant limitations of the original `quake.exe` on Windows 95 and NT. `quake.exe` ran approximately 25% slower on Windows 95 due to virtualization overhead, relied on convoluted methods for TCP/IP networking, and critically, was incompatible with Windows NT's Virtual DOS Machine (NTVDM).\n\nWinQuake addressed these issues by implementing multiple backends for input, audio, and video, configurable through various modes (e.g., `fastvid`, `safe`). For audio, it offered DirectSound for low latency (higher CPU impact) or WinMM for better framerates. Input used either DirectInput for smoother responsiveness or the legacy Winuser.h API.\n\nThe most complex component was the video backend. WinQuake could render using the safe but slow GDI-based Device-Independent Bitmaps (DIB) for windowed mode. For fullscreen, it relied on SciTech's Multi-platform Graphics Library (MGL). MGL dynamically selected the best available driver, including DirectDraw (Microsoft's 2D gaming API), but its secret weapon was \"WinDirect.\" WinDirect was SciTech's proprietary technology that allowed WinQuake to bypass Windows' GDI/DirectDraw restrictions, directly accessing display hardware (VGA, VESA) and taking full control of the screen, much like a DOS application.\n\nThis sophisticated architecture allowed WinQuake to achieve framerates comparable to the DOS version, provide direct Winsock access, and run on Windows NT, ultimately delivering a superior user experience that justified its existence. It impressively retains backward compatibility even with modern Windows 11.",
    "chinese_title": "WinQuake为何存在以及其工作原理",
    "chinese_summary": "WinQuake (`winquake.exe`) 由 id Software 创建，旨在克服原始 `quake.exe` 在 Windows 95 和 NT 上的重大限制。`quake.exe` 在 Windows 95 上由于虚拟化开销运行速度慢约 25%，TCP/IP 网络依赖复杂方法，最重要的是，它与 Windows NT 的虚拟 DOS 机器 (NTVDM) 不兼容。\n\nWinQuake 通过为输入、音频和视频实现多个后端来解决这些问题，这些后端可通过各种模式（例如 `fastvid`、`safe`）进行配置。对于音频，它提供 DirectSound 以实现低延迟（CPU 影响更大）或 WinMM 以获得更好的帧率。输入则使用 DirectInput 实现更流畅的响应，或使用传统的 Winuser.h API。\n\n最复杂的组件是视频后端。WinQuake 在窗口模式下可以使用安全但缓慢的基于 GDI 的设备无关位图 (DIB) 进行渲染。对于全屏模式，它依赖于 SciTech 的多平台图形库 (MGL)。MGL 动态选择最佳可用驱动程序，包括 DirectDraw（微软的 2D 游戏 API），但其秘密武器是“WinDirect”。WinDirect 是 SciTech 的专有技术，它允许 WinQuake 绕过 Windows 的 GDI/DirectDraw 限制，直接访问显示硬件（VGA、VESA）并完全控制屏幕，就像一个 DOS 应用程序一样。\n\n这种复杂的架构使 WinQuake 能够实现与 DOS 版本相当的帧率，提供直接的 Winsock 访问，并在 Windows NT 上运行，最终提供了卓越的用户体验，证明了其存在的合理性。令人印象深刻的是，它甚至在现代 Windows 11 上仍能保持向后兼容性。"
  },
  {
    "id": "46140244",
    "title": "8086 Microcode Browser",
    "url": "https://nand2mario.github.io/posts/2025/8086_microcode_browser/",
    "summary": "The author, known for \"486Tang,\" has launched an online 8086 microcode browser, developed during an effort to faithfully recreate the original 8086 chip. This project involved extensive study of Andrew Jenner's 2020 extraction and disassembly of the 8086 microcode.\n\nThe interactive browser decodes each 21-bit micro-instruction into readable fields, offering explanatory tooltips on hover and clickable jump targets, including indirect jumps and calls. A \"Browse by Instruction\" feature allows users to select any of approximately 300 8086 instructions, instantly navigating to its corresponding microcode entry point among the roughly 60 unique routines.\n\nThe article reveals several fascinating aspects of the 8086's internal workings:\n*   Register IDs change meaning based on context (e.g., '10100' is SIGMA as a source but tmpaL as a destination).\n*   Internal naming is inconsistent; N and R are the same physical register, and SI is called IJ.\n*   The Instruction Pointer (IP) points to the *next prefetch address*, with a CORR micro-operation used to rewind it to the true instruction boundary during branches or interrupts.\n*   Most arithmetic instructions elegantly reuse the same four micro-instructions (008–00B), with the XI micro-operation performing varied behaviors based on opcode or ModRM bits.",
    "chinese_title": "8086 微代码浏览器",
    "chinese_summary": "以“486Tang”闻名的作者发布了一个在线8086微码浏览器，该浏览器是在努力忠实复现原始8086芯片的过程中开发的。该项目涉及对Andrew Jenner于2020年对8086微码的提取和反汇编的深入研究。\n\n这个交互式浏览器将每条21位微指令解码成可读字段，鼠标悬停时提供解释性工具提示，并提供可点击的跳转目标，包括间接跳转和调用。一个“按指令浏览”功能允许用户选择大约300条8086指令中的任意一条，立即导航到其在约60个独立例程中对应的微码入口点。\n\n文章揭示了8086内部工作原理的几个引人入胜的方面：\n*   寄存器ID会根据上下文改变含义（例如，'10100'在作为源时是SIGMA，但作为目标时是tmpaL）。\n*   内部命名不一致；N和R是同一个物理寄存器，而SI被称为IJ。\n*   指令指针（IP）指向*下一个预取地址*，并使用CORR微操作在分支或中断期间将其回溯到真正的指令边界。\n*   大多数算术指令优雅地重用了相同的四条微指令（008–00B），其中XI微操作根据操作码或ModRM位执行不同的行为。"
  },
  {
    "id": "46141745",
    "title": "Acme, a brief history of one of the protocols which has changed the Internet",
    "url": "https://blog.brocas.org/2025/12/01/ACME-a-brief-history-of-one-of-the-protocols-which-has-changed-the-Internet-Security/",
    "summary": "The article chronicles the ACME (Automated Certificate Management Environment) protocol, a pivotal development in Internet security. Prior to 2015, encryption was scarce (around 40% of websites), largely due to the complexity and cost of obtaining and managing TLS certificates. Edward Snowden's 2013 revelations highlighted the urgent need for secure communications.\n\nIn response, Let's Encrypt, a free and automated Certificate Authority (CA), was launched in 2015 by the Internet Security Research Group (ISRG) with backing from partners like Mozilla and EFF. Its core mission was to eliminate the barriers to encryption through automation, a critical factor for its small team to operate at global scale. Let's Encrypt has since dramatically increased global HTTPS adoption to over 83%.\n\nACME is the open protocol underpinning Let's Encrypt's automation. It enables client software to prove control over a domain to a CA (via HTTP, DNS, or TLS challenges) for automatic certificate issuance, removing human intervention. Conceived in late 2014, ACME's development merged efforts from various research groups, becoming central to Let's Encrypt's design. Initially focused on securing the Web, its DNS challenge also allowed securing other protocols like SMTP.\n\nACME's open development and subsequent standardization by the IETF (RFC 8555, 2019) were instrumental. This process fostered a diverse ecosystem of ACME clients and led to significant protocol improvements, including design changes (e.g., certificate-request-first flow, authenticated GET requests) and enhanced security (e.g., deprecation of tls-sni-01). The protocol's openness and IETF collaboration encouraged adoption by other CAs, confirming ACME's transformative impact on the certificate ecosystem.",
    "chinese_title": "艾克米：改变互联网的协议之一的简史",
    "chinese_summary": "本文记述了ACME（自动化证书管理环境）协议，这是互联网安全领域的一项关键发展。在2015年之前，加密技术应用稀少（约占网站总数的40%），这主要是由于获取和管理TLS证书的复杂性和高成本。爱德华·斯诺登在2013年的爆料凸显了安全通信的迫切需求。\n\n为此，互联网安全研究小组（ISRG）于2015年推出了Let's Encrypt，这是一个免费且自动化的证书颁发机构（CA），并获得了Mozilla和EFF等合作伙伴的支持。其核心使命是通过自动化消除加密障碍，这对于其小团队在全球范围内运作至关重要。此后，Let's Encrypt已将全球HTTPS的普及率大幅提升至83%以上。\n\nACME是支撑Let's Encrypt自动化运作的开放协议。它允许客户端软件（通过HTTP、DNS或TLS质询）向CA证明其对域名的控制权，从而实现证书的自动颁发，无需人工干预。ACME协议构想于2014年末，其开发整合了多个研究小组的努力，并成为Let's Encrypt设计的核心。最初，ACME主要专注于保护网络安全，但其DNS质询机制也使得保护SMTP等其他协议成为可能。\n\nACME的开放式开发以及随后由IETF（RFC 8555，2019年）进行的标准化工作至关重要。这一过程促进了ACME客户端的多元生态系统发展，并带来了协议的显著改进，包括设计变更（例如，证书请求优先流程、带认证的GET请求）和安全增强（例如，废弃tls-sni-01）。协议的开放性以及与IETF的合作鼓励了其他CA采用ACME，证实了ACME对证书生态系统的变革性影响。"
  },
  {
    "id": "46148744",
    "title": "Proxmox Datacenter Manager 1.0 available",
    "url": "https://www.proxmox.com/en/about/company-details/press-releases/proxmox-datacenter-manager-1-0",
    "summary": "Proxmox Server Solutions GmbH announced the immediate availability of Proxmox Datacenter Manager (PDM) 1.0 on December 4, 2025. This new enterprise software product is designed to address the increasing complexity of operating large-scale and distributed Proxmox-based environments.\n\nProxmox Datacenter Manager offers a \"single pane of glass\" view for the holistic administration, monitoring, and scaling of both Proxmox VE and Proxmox Backup Server. Its primary goal is to provide administrators with comprehensive and seamless control over their entire infrastructure.\n\nThe product was developed as a strategic answer to challenges faced by enterprises managing growing data centers, including a lack of global oversight, fragmented metrics, and the need for complex manual operations across multiple locations or clusters. PDM bridges the gap between individual Proxmox nodes and clusters, offering a unified view that simplifies routine tasks and enables advanced functionalities previously difficult to achieve in distributed setups.",
    "chinese_title": "Proxmox 数据中心管理器 1.0 发布",
    "chinese_summary": "Proxmox服务器解决方案有限公司于2025年12月4日宣布立即推出Proxmox数据中心管理器（PDM）1.0。这款全新的企业级软件产品旨在解决管理日益复杂的大规模和分布式Proxmox环境所带来的挑战。\n\nProxmox数据中心管理器提供“单一管理视图”，用于对Proxmox VE和Proxmox Backup Server进行整体管理、监控和扩展。其主要目标是为管理员提供对其整个基础设施的全面、无缝控制。\n\n该产品的开发旨在战略性地解决企业在管理不断增长的数据中心时所面临的挑战，其中包括缺乏全局监管、指标碎片化以及在多个地点或集群中进行复杂手动操作的需求。PDM弥合了单个Proxmox节点和集群之间的鸿沟，提供了一个统一视图，从而简化了日常任务，并实现了在分布式部署中此前难以实现的高级功能。"
  },
  {
    "id": "46160698",
    "title": "Making RSS More Fun",
    "url": "https://matduggan.com/making-rss-more-fun/",
    "summary": "The author expresses a strong dislike for traditional RSS readers, finding them a \"chore\" due to overwhelming backlogs and a lack of chronological relevance. They desire a \"TikTok-like\" content discovery experience for the \"small web,\" where users can passively consume random content from small creators, upvote what they like, and have a simple algorithm serve popular content more often, all without ads or extensive data collection.\n\nTo achieve this, the author created \"TimeWasterPro,\" a Firefox extension available at `https://timewasterpro.xyz/`. Users click a button to get a random website, then upvote, downvote, or report it. Upvotes help prioritize \"high quality\" content for others, and users can submit links to climb a leaderboard.\n\nThe backend, built with FastAPI, SQLAlchemy, and SQLite, slowly crawls RSS feeds from Kagi's small web list, currently indexing over 600,000 pages. The design intentionally uses an old-school Apple System OS aesthetic (System.css) to signal it's a light-hearted, non-commercial hobby project. User authentication requires an email, though the author regrets this choice and aims for minimal data collection.\n\nWhile generally pleased with the project, challenges include platform-specific keyboard shortcuts and future plans involve categorizing content (perhaps with ML), improving new user onboarding to feature \"best stuff\" early, and managing low-quality submissions. The source code will be released when stable.",
    "chinese_title": "玩转 RSS",
    "chinese_summary": "作者对传统的RSS阅读器表达了强烈的厌恶，认为它们因积压内容过多且缺乏时间相关性而成为一种“苦差事”。他们渴望为“小网站”提供一种“TikTok式”的内容发现体验，在这种体验中，用户可以被动地消费来自小型创作者的随机内容，对喜欢的内容点赞，并由一个简单的算法更频繁地推送热门内容，所有这一切都没有广告，也没有大量数据收集。\n\n为实现这一目标，作者创建了“TimeWasterPro”，这是一个Firefox扩展，可在`https://timewasterpro.xyz/`获取。用户点击一个按钮即可获得一个随机网站，然后可以点赞、点踩或举报。点赞有助于为其他人优先展示“高质量”内容，用户还可以提交链接以登上排行榜。\n\n后端使用FastAPI、SQLAlchemy和SQLite构建，缓慢爬取Kagi小网站列表中的RSS订阅源，目前已索引超过60万个页面。其设计有意采用了老式的Apple System OS美学风格（System.css），以表明这是一个轻松的、非商业的个人爱好项目。用户认证需要电子邮件，尽管作者对此选择感到遗憾，并致力于最小化数据收集。\n\n尽管作者对项目总体满意，但挑战包括平台特定的键盘快捷键；未来的计划包括内容分类（可能借助机器学习）、改进新用户引导以尽早展示“最佳内容”，以及管理低质量的提交。源代码将在稳定后发布。"
  },
  {
    "id": "46164646",
    "title": "Shingles vaccination prevented or delayed dementia",
    "url": "https://www.cell.com/cell/fulltext/S0092-8674(25)01256-5",
    "summary": "Unable to access the article link.",
    "chinese_title": "带状疱疹疫苗接种预防或延迟痴呆症",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46147341",
    "title": "Functional Quadtrees",
    "url": "https://lbjgruppen.com/en/posts/functional-quadtree-clojure",
    "summary": "This article introduces \"Functional Quadtrees,\" a tree data structure designed to provide adaptive levels of detail, focusing resources where needed (e.g., high resolution near a camera position on a map, lower resolution further away). Challenged by existing imperative tutorials, the author presents a declarative, functional implementation in Clojure that runs in the browser.\n\nThe core data model for a quadtree node includes its bounds, center, and width. The decision to subdivide a node (`split?`) is made recursively based on the camera's proximity to the node's center and the node's current width, stopping at a predefined minimum size. Clojure's `prewalk` function is leveraged for this efficient, recursive tree generation, enabling the entire tree to be rebuilt in sub-milliseconds without imperative state management.\n\nFor visualization, the article uses the HTML canvas API. A key aspect of the real-time demo is ensuring consistent node coloring: each node's center coordinates are hashed to generate a stable, unique hexadecimal color, preventing visual flickering as the camera moves.\n\nThe author concludes by emphasizing the benefits of Quadtrees for resource optimization in various applications (like VR) and praises Clojure/Clojurescript for enabling a succinct, functional, and easily maintainable core implementation (around 25 lines of code). Shadow-cljs is also highlighted for its efficient compilation and developer-friendly features.",
    "chinese_title": "函数式的四叉树",
    "chinese_summary": "本文介绍了“函数式四叉树”——一种树状数据结构，旨在提供自适应细节层次，将资源集中在需要的地方（例如，在地图上摄像机位置附近呈现高分辨率，距离较远的地方则呈现低分辨率）。面对现有命令式教程的挑战，作者在Clojure中呈现了一个声明式、函数式的实现，该实现可在浏览器中运行。\n\n四叉树节点的核心数据模型包括其边界、中心和宽度。是否细分节点（`split?`）的决定是根据摄像机与节点中心的接近程度以及节点的当前宽度递归做出的，并在达到预设的最小尺寸时停止。利用Clojure的`prewalk`函数进行高效的递归树生成，使得整个树可以在亚毫秒内重建，无需命令式状态管理。\n\n为了可视化，文章使用了HTML canvas API。实时演示的一个关键点是确保节点颜色的一致性：每个节点的中心坐标都被哈希以生成稳定、唯一的十六进制颜色，防止摄像机移动时出现视觉闪烁。\n\n作者最后强调了四叉树在各种应用（如VR）中进行资源优化方面的优势，并赞扬Clojure/Clojurescript能够实现一个简洁、函数式且易于维护的核心实现（大约25行代码）。Shadow-cljs也因其高效的编译和开发者友好的特性而受到强调。"
  },
  {
    "id": "46147371",
    "title": "Human hair grows through 'pulling' not pushing, study shows",
    "url": "https://phys.org/news/2025-12-human-hair.html",
    "summary": "Unable to access the article link.",
    "chinese_title": "头发通过“拉”而非“推”生长，研究显示",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46142000",
    "title": "Kea DHCP: Modern, open source DHCPv4 and DHCPv6 server",
    "url": "https://www.isc.org/kea/",
    "summary": "ISC has announced the release of Kea 3.0.0, a significant update for its modern, open-source DHCPv4 and DHCPv6 server. This major release is particularly notable as it marks the first Long-Term Support (LTS) version of Kea.",
    "chinese_title": "Kea DHCP: 现代、开源的 DHCPv4 和 DHCPv6 服务器",
    "chinese_summary": "ISC 宣布发布 Kea 3.0.0，这是对其现代开源 DHCPv4 和 DHCPv6 服务器的一次重要更新。这一主要版本尤为引人注目，因为它标志着 Kea 的首个长期支持 (LTS) 版本。"
  },
  {
    "id": "46153058",
    "title": "CUDA-l2: Surpassing cuBLAS performance for matrix multiplication through RL",
    "url": "https://github.com/deepreinforce-ai/CUDA-L2",
    "summary": "CUDA-L2 is an innovative system that combines large language models (LLMs) and reinforcement learning (RL) to automatically optimize Half-precision General Matrix Multiply (HGEMM) CUDA kernels. It systematically outperforms major matrix multiplication baselines, including torch.matmul and NVIDIA's cuBLAS and cuBLASLt libraries, demonstrating significant speedups across 1,000 (M,N,K) configurations on NVIDIA A100 GPUs.\n\nThe project recently released A100-optimized HGEMM kernels. Future development includes support for 32-bit accumulators, more diverse matrix configurations, expansion to new GPU architectures like Hopper and Blackwell, and easier deployment for open-source LLMs.\n\nFor installation, users need Python, PyTorch 2.6.0+, and a specific version of NVIDIA CUTLASS (v4.2.1). Crucially, environment variables `CUTLASS_DIR` and `TORCH_CUDA_ARCH_LIST` must be correctly configured to prevent issues.\n\nUsage involves running the `eval_one_file.sh` script, which supports both offline and server execution modes. Key arguments include matrix dimensions (`--mnk`), warmup and benchmark durations, GPU ID, and optionally, target Queries Per Second (`--target_qps`) for server mode.\n\nA100 kernels are optimized for A100 and may not guarantee speedups on other GPUs. For unsupported matrix dimensions, users can pad with zeros or request new kernels. Support is available via GitHub issues or email.",
    "chinese_title": "CUDA-l2：通过RL实现矩阵乘法性能超越cuBLAS",
    "chinese_summary": "CUDA-L2 是一个创新系统，它结合了大型语言模型（LLMs）和强化学习（RL），以自动优化半精度通用矩阵乘法（HGEMM）CUDA 内核。该系统在 NVIDIA A100 GPU 上针对 1,000 种 (M,N,K) 配置进行了测试，系统性地超越了包括 torch.matmul 和 NVIDIA 的 cuBLAS 和 cuBLASLt 库在内的主要矩阵乘法基准，展示了显著的速度提升。\n\n该项目最近发布了针对 A100 优化的 HGEMM 内核。未来的开发包括支持 32 位累加器、更多样化的矩阵配置、扩展到 Hopper 和 Blackwell 等新的 GPU 架构，以及更便捷的开源 LLMs 部署。\n\n安装时，用户需要 Python、PyTorch 2.6.0+ 和特定版本的 NVIDIA CUTLASS (v4.2.1)。关键在于，必须正确配置环境变量 `CUTLASS_DIR` 和 `TORCH_CUDA_ARCH_LIST` 以防止出现问题。\n\n使用方法涉及运行 `eval_one_file.sh` 脚本，该脚本支持离线和服务器两种执行模式。关键参数包括矩阵维度 (`--mnk`)、预热和基准测试持续时间、GPU ID，以及服务器模式下可选的目标每秒查询次数 (`--target_qps`)。\n\nA100 内核已针对 A100 优化，可能无法保证在其他 GPU 上实现加速。对于不支持的矩阵维度，用户可以用零填充或请求新的内核。支持可通过 GitHub issues 或电子邮件获得。"
  },
  {
    "id": "46160239",
    "title": "Sugars, Gum, Stardust Found in NASA's Asteroid Bennu Samples",
    "url": "https://www.nasa.gov/missions/osiris-rex/sugars-gum-stardust-found-in-nasas-asteroid-bennu-samples/",
    "summary": "NASA's OSIRIS-REx mission samples from asteroid Bennu continue to reveal significant insights into the early solar system and the origins of life. Recent studies published in Nature Geosciences and Nature Astronomy highlight three remarkable discoveries:\n\n1.  **Essential Sugars:** Scientists found five-carbon ribose and, for the first time in an extraterrestrial sample, six-carbon glucose. Ribose is crucial for RNA, and its presence, alongside previously found nucleobases, amino acids, and phosphates, means all components for RNA are present in Bennu. This supports the \"RNA world\" hypothesis, suggesting ribose may have been more common than deoxyribose in the early solar system, and that RNA could have been the primary molecule for early life. Glucose indicates an important energy source for life was also widespread.\n\n2.  **Mysterious \"Space Gum\":** A novel gum-like substance, rich in nitrogen and oxygen, was discovered. This polymer-like material, never before seen in space rocks, likely formed early in the solar system as Bennu's parent asteroid warmed. Flexible when formed and now hardened, it's likened to a \"space plastic\" and could have provided chemical precursors that helped trigger life on Earth.\n\n3.  **Abundant Supernova Dust:** Samples contained an unexpectedly high abundance of presolar grains—dust from supernova explosions—six times more than any other studied astromaterial. This suggests Bennu's parent body formed in a region of the protoplanetary disk enriched with dying star dust. Pockets of less-altered material preserved these grains, offering insights into the asteroid's origins despite extensive fluid alteration.\n\nThese discoveries collectively provide crucial clues about the molecular ingredients available in the early solar system and their potential role in the origins of life.",
    "chinese_title": "NASA贝努小行星样本发现糖类、胶、星尘",
    "chinese_summary": "美国宇航局OSIRIS-REx任务从小行星“贝努”带回的样本持续揭示了关于早期太阳系和生命起源的重要见解。近期发表在《自然·地球科学》和《自然·天文学》上的研究重点介绍了三项引人注目的发现：\n\n1.  **必需糖类：** 科学家发现了五碳糖核糖，并在地外样本中首次发现了六碳糖葡萄糖。核糖对RNA至关重要，它的存在，加上此前已发现的核碱基、氨基酸和磷酸盐，意味着RNA的所有组成部分都存在于贝努小行星中。这支持了“RNA世界”假说，认为在早期太阳系中，核糖可能比脱氧核糖更常见，并且RNA可能是早期生命的主要分子。葡萄糖的存在表明，重要的生命能源也曾广泛存在。\n\n2.  **神秘的“太空胶”：** 科学家发现了一种富含氮和氧的新型类胶状物质。这种聚合物状物质此前从未在太空岩石中见过，可能是贝努小行星的母体在早期太阳系中受热时形成的。它在形成时是柔韧的，现在已硬化，被比作一种“太空塑料”，并且可能提供了有助于引发地球生命的化学前体。\n\n3.  **丰富的超新星尘埃：** 样本中含有异常高丰度的太阳前颗粒（即超新星爆发产生的尘埃），其含量是其他任何已研究过的宇宙物质的六倍。这表明贝努小行星的母体是在原行星盘中一个富含垂死恒星尘埃的区域形成的。那些受变质作用较小的物质囊泡保留了这些颗粒，尽管经历了广泛的流体蚀变，但仍为小行星的起源提供了线索。\n\n这些发现共同为早期太阳系中可用的分子成分及其在生命起源中可能扮演的角色提供了关键线索。"
  },
  {
    "id": "46152098",
    "title": "CJEU has made it effectively impossible to run a user-generated platform legally",
    "url": "https://www.techdirt.com/2025/12/04/eus-top-court-just-made-it-literally-impossible-to-run-a-user-generated-content-platform-legally/",
    "summary": "A recent ruling by the Court of Justice of the European Union (CJEU) has, according to the article, made it \"effectively impossible\" for user-generated content (UGC) platforms to operate legally within the EU.\n\nThe core issue highlighted is that the implications of this CJEU decision appear to clash directly with the EU's own established rules prohibiting general monitoring requirements. This creates a significant, self-contradictory legal dilemma, described as an \"ouroboros situation,\" where EU law seemingly undermines itself. The author concludes by noting the formidable challenge this internal conflict poses for the EU to resolve.",
    "chinese_title": "欧盟法院实际上已使得用户生成内容平台无法合法运营。",
    "chinese_summary": "欧洲联盟法院（CJEU）最近的一项裁决，根据文章称，已使得用户生成内容（UGC）平台在欧盟境内合法运营“实际上不可能”。文章强调的核心问题是，这项CJEU裁决的后果似乎直接与欧盟自身禁止普遍监控要求的既定规则相冲突。这造成了一个重大的、自相矛盾的法律困境，被描述为一种“衔尾蛇式困境”（ouroboros situation），即欧盟法律似乎在自我削弱。作者最后指出，这种内部冲突给欧盟带来了巨大的解决挑战。"
  },
  {
    "id": "46141986",
    "title": "Vanilla CSS is all you need",
    "url": "https://www.zolkos.com/2025/12/03/vanilla-css-is-all-you-need",
    "summary": "The article, \"Vanilla CSS is all you need,\" explores how 37signals builds sophisticated web applications like Campfire, Writebook, and Fizzy using exclusively vanilla CSS, entirely without preprocessors or build tools. Inspired by Jason Zimdars' 2024 post, the author analyzed their evolving CSS architecture over three products.\n\n37signals employs an \"embarrassingly simple\" flat file structure and leverages modern CSS features extensively. Key elements include native custom properties, nesting, container queries, the powerful `:has()` selector, CSS Layers for specificity management, `color-mix()` for dynamic colors, and `clamp()` for responsive sizing. Their color system uses OKLCH for perceptually uniform colors, simplifying dark mode. Spacing is semantic, often using `ch` units (character widths) for horizontal dimensions.\n\nWhile utility classes exist, they are additive; core styling resides in semantic component classes, differentiating their approach from utility-first frameworks like Tailwind. The `:has()` selector is highlighted as a game-changer, enabling JavaScript-like state and conditional rendering directly in CSS. The team also utilizes advanced techniques like pure CSS loading spinners via masks and `@starting-style` for smooth HTML `<dialog>` animations.\n\nThe article showcases how 37signals progressively adopts more modern CSS features with each product, demonstrating increasing sophistication without added tooling complexity. It suggests developers reconsider their assumptions about build tools, arguing that modern vanilla CSS is powerful and capable enough for many projects, advocating for a simpler, more efficient development workflow.",
    "chinese_title": "原生CSS就够了",
    "chinese_summary": "文章《原生CSS足矣》探讨了37signals如何完全只使用原生CSS，彻底放弃预处理器或构建工具，来构建Campfire、Writebook和Fizzy等复杂的网络应用程序。受Jason Zimdars 2024年帖子的启发，作者分析了他们在三款产品中不断演进的CSS架构。\n\n37signals采用“极简”的扁平文件结构，并广泛利用现代CSS特性。关键元素包括原生自定义属性、嵌套、容器查询、强大的:has()选择器、用于特异性管理的CSS层、用于动态颜色的color-mix()，以及用于响应式尺寸的clamp()。他们的色彩系统使用OKLCH来实现感知均匀的颜色，从而简化了暗模式的实现。间距是语义化的，水平尺寸常使用ch单位（字符宽度）。\n\n虽然存在实用类，但它们是附加的；核心样式存在于语义化的组件类中，这使他们的方法有别于Tailwind等实用优先框架。:has()选择器被强调为一项颠覆性功能，它允许在CSS中直接实现类似JavaScript的状态和条件渲染。团队还利用了诸如通过掩码实现的纯CSS加载旋转器，以及使用@starting-style实现HTML <dialog>的平滑动画等高级技术。\n\n文章展示了37signals如何在每款产品中逐步采用更多现代CSS特性，在不增加工具复杂性的前提下，展现出日益提升的精巧性。它建议开发者重新审视他们对构建工具的假设，认为现代原生CSS对于许多项目来说已经足够强大和有能力，提倡一种更简单、更高效的开发工作流程。"
  },
  {
    "id": "46143622",
    "title": "The rapid growth of data centres is delaying new homes in London",
    "url": "https://www.bbc.com/news/articles/c0mpr1mvwj3o",
    "summary": "The rapid expansion of \"energy-hungry\" data centres is severely delaying new housing developments in London, especially in west London boroughs like Ealing, Hillingdon, and Hounslow, at a time when the housing crisis is \"at its worst.\"\n\nAccording to a London Assembly report, these centres, crucial for digital services and AI, require vast amounts of electricity, straining the National Grid to full capacity. Some new housing projects faced delays, with initial estimates suggesting waits until 2037 for electricity connections. While short-term fixes by the Greater London Authority, National Grid, and Ofgem prevented a complete pause on housing, many projects remain set back.\n\nData centres, while currently using under 10% of the UK's electricity, are projected to increase their demand by up to 600% between 2025 and 2050. One typical data centre consumes as much power as approximately 100,000 households, and over half of planned new UK centres are near London.\n\nIndustry bodies advocate for faster grid investment, deeming the 2037 target for additional power insufficient. The report recommends a separate planning category for data centres and a dedicated policy within the next London Plan for better energy coordination. The government is exploring \"bespoke options,\" and the Mayor of London is considering the recommendations to address the issue.",
    "chinese_title": "伦敦数据中心的快速增长正在推迟新建住房。",
    "chinese_summary": "能源密集型数据中心的快速扩张正严重延误伦敦的新建住宅项目，尤其是在伊灵、希灵登和豪士罗等伦敦西部行政区，而此时正值住房危机“最严重”之际。\n\n根据伦敦议会的一份报告，这些对数字服务和人工智能至关重要的数据中心需要大量电力，使得国家电网不堪重负，达到满负荷运行。一些新建住房项目因此面临延误，最初估计需要等到2037年才能获得电力连接。尽管大伦敦政府、国家电网和英国天然气与电力市场办公室（Ofgem）采取了短期补救措施，避免了住房建设的全面停滞，但许多项目仍然受到延误。\n\n数据中心目前消耗英国不到10%的电力，但预计在2025年至2050年间，其电力需求将增加高达600%。一个典型的数据中心所消耗的电量相当于约10万户家庭的总和，而英国半数以上规划中的新建数据中心都位于伦敦附近。\n\n行业机构呼吁加快电网投资，认为到2037年实现额外供电的目标远远不够。报告建议为数据中心设立独立的规划类别，并在下一版《伦敦计划》中制定专门政策，以更好地协调能源使用。政府正在探索“定制化方案”，伦敦市长也在考虑这些建议以解决该问题。"
  },
  {
    "id": "46139782",
    "title": "Checked-size array parameters in C",
    "url": "https://lwn.net/SubscriberLink/1046840/3eb9029084cc9e1e/",
    "summary": "The article explores methods to add compile-time size checking for array parameters in C functions, a common source of bugs and vulnerabilities, especially in cryptographic code.\n\nInitially, Ard Biesheuvel suggested changing array parameters from `const u8 nonce[SIZE]` to `const u8 (*nonce)[SIZE]`. This \"pointer-to-array\" approach forces the compiler to verify an exact size match and helps catch argument reordering, but requires callers to modify their code by adding an `&` operator.\n\nJason Donenfeld proposed a less common C feature: `const u8 nonce[static SIZE]`. This syntax also enables compiler size checking without requiring caller modifications. Unlike the pointer-to-array method, `static` only generates a warning if the passed array is *too small*, not necessarily for an exact mismatch.\n\nThough GCC often provides similar warnings (which the kernel currently disables), `static` could enhance diagnostics in Clang. Linus Torvalds approved its use, despite finding its syntax a \"horrible hack,\" noting its existing presence in the kernel and suggesting a clarifying macro.\n\nCommunity discussion highlights complexities: some argue `[static n]` is unnecessary and potentially problematic (e.g., implying non-null, Undefined Behavior if `n` is zero), as modern GCC already offers strong diagnostics for `[n]` parameters. Others noted the C standard views `static n` primarily as an optimizer hint rather than a diagnostic requirement. Despite this debate, the \"horrible hack\" feature might see wider use in the kernel for improved safety.",
    "chinese_title": "C语言中带大小检查的数组参数",
    "chinese_summary": "本文探讨了在C函数中为数组参数添加编译时大小检查的方法，这（数组参数处理不当）是常见的错误和漏洞来源，尤其是在加密代码中。\n\n最初，Ard Biesheuvel 建议将数组参数从 `const u8 nonce[SIZE]` 更改为 `const u8 (*nonce)[SIZE]`。这种“指向数组的指针”方法强制编译器验证精确的大小匹配，并有助于捕获参数重新排序问题，但要求调用者通过添加 `&` 运算符来修改其代码。\n\nJason Donenfeld 提出了一种不太常见的 C 语言特性：`const u8 nonce[static SIZE]`。这种语法也实现了编译器大小检查，同时无需调用者修改。与指向数组的指针方法不同，`static` 仅在传入数组*过小*时生成警告，而不会针对严格不匹配的情况（例如过大）。\n\n尽管 GCC 通常提供类似的警告（内核目前已禁用这些警告），但 `static` 可以增强 Clang 中的诊断功能。Linus Torvalds 批准了其使用，尽管他认为这种语法是“一个糟糕的技巧”，但他也指出它已存在于内核中，并建议使用一个澄清宏。\n\n社区讨论揭示了复杂性：一些人认为 `[static n]` 是不必要的，并且可能存在问题（例如，暗示非空，如果 `n` 为零则导致未定义行为），因为现代 GCC 已经为 `[n]` 参数提供了强大的诊断功能。另一些人指出，C 标准主要将 `static n` 视为优化器提示，而非诊断要求。尽管存在争议，这个“糟糕的技巧”特性可能会在内核中得到更广泛的使用以提高安全性。"
  },
  {
    "id": "46154344",
    "title": "StardustOS: Library operating system for building light-weight Unikernels",
    "url": "https://github.com/StardustOS",
    "summary": "StardustOS is a library operating system designed for building lightweight unikernels, enabling cloud applications to run in a protected, single-address space. It relies on an underlying hypervisor for physical resource management, treating it as a trusted platform. Stardust features a small, maintainable codebase that uses static linking to combine a minimal kernel, a single application, its libraries, and the required language runtime into an immutable, single-purpose virtual machine image.\n\nKey features include multi-core support, preemptive threads, and basic block and networking drivers. It also provides a collection of standard POSIX-compatible libraries. Stardust is actively utilized for teaching and research at the University of St Andrews.\n\nRelated projects include Stardust-oxide, a re-implementation of the unikernel in Rust, and Duster, a debugger for para-virtualized C unikernels running on the Xen hypervisor. The project has been presented at numerous workshops and seminars, with talks and published materials covering topics such as unikernel support for Lambda functions, distributed microservices, and debugging unikernel operating systems.",
    "chinese_title": "StardustOS：用于构建轻量级独核的库操作系统",
    "chinese_summary": "StardustOS是一个库操作系统，旨在构建轻量级unikernel，使云应用程序能够在受保护的单地址空间中运行。它依赖于底层虚拟机管理器进行物理资源管理，并将其视为一个信任平台。Stardust具有小型且易于维护的代码库，它使用静态链接将最小化内核、单个应用程序、其库以及所需的语言运行时组合成一个不可变、单用途的虚拟机镜像。\n\n主要特性包括多核支持、抢占式线程以及基本的块设备和网络驱动。它还提供了一系列标准POSIX兼容库。Stardust目前正积极用于圣安德鲁斯大学的教学和研究。\n\n相关项目包括Stardust-oxide（一个用Rust重新实现的unikernel）和Duster（一个用于在Xen虚拟机管理器上运行的半虚拟化C unikernel的调试器）。该项目已在众多研讨会和座谈会上展示，其演讲和发表的材料涵盖了unikernel对Lambda函数的支持、分布式微服务以及unikernel操作系统调试等主题。"
  },
  {
    "id": "46141429",
    "title": "Why doesn't Apple make a standalone Touch ID?",
    "url": "https://www.jeffgeerling.com/blog/2025/why-doesnt-apple-make-standalone-touch-id",
    "summary": "The author, having upgraded to a mechanical keyboard, expresses frustration that Apple doesn't offer a standalone Touch ID solution for non-Apple peripherals. Currently, the only way to get Touch ID with a third-party keyboard is a \"wasteful\" hack: disassembling an Apple Magic Keyboard with Touch ID, extracting its sensor and logic board, and installing them into a custom 3D-printed enclosure.\n\nTouch ID is a highly valued feature for macOS users, seamlessly integrating with login, password managers, and Apple Pay. The teardown process is described as \"daunting\" due to Apple's design, which uses layers of adhesive for the back cover and battery, and delicate, firmly glued flexible PCB ribbon cables. The author provides tips for others attempting the hack, emphasizing the need for heat, specialized tools like curved tweezers, and extreme care with fragile components.\n\nThe core question posed is why Apple doesn't sell a simple standalone Touch ID module. The author believes many users would willingly pay around $50 for such a device, avoiding the destruction of a $150 keyboard and hours of tedious work. Comments suggest Apple's reluctance might stem from a desire to keep users exclusively within its hardware ecosystem, despite many Mac users already utilizing non-Apple keyboards.",
    "chinese_title": "为什么苹果不做独立的Touch ID？",
    "chinese_summary": "作者在升级到机械键盘后，对苹果不为非苹果外设提供独立的触控ID解决方案表示不满。目前，想要在第三方键盘上使用触控ID，唯一的途径是一个“浪费的”改装方法：拆解一个带有触控ID的苹果妙控键盘，取出其传感器和逻辑板，然后将它们安装到一个定制的3D打印外壳中。\n\n触控ID是macOS用户高度重视的功能，它能无缝集成登录、密码管理器和Apple Pay。由于苹果的设计在后盖和电池上使用了多层粘合剂，并且柔性PCB排线纤细且牢固粘合，拆解过程被描述为“艰巨的”。作者为其他尝试此改装的人提供了技巧，强调需要加热、弯头镊子等专用工具，并对易碎部件要格外小心。\n\n核心问题是苹果为何不销售一个简单的独立触控ID模块。作者认为许多用户愿意为这样的设备支付大约50美元，从而避免了损坏一个150美元的键盘和数小时的繁琐工作。评论表明，苹果的这种不情愿可能源于希望将用户完全留在其硬件生态系统内，尽管许多Mac用户已经在使用非苹果键盘。"
  },
  {
    "id": "46144113",
    "title": "Show HN: A Minimal Monthly Task Planner (printable, offline, no signup)",
    "url": "https://printcalendar.top/",
    "summary": "PrintCalendar.top has launched \"Show HN: A Minimal Monthly Task Planner,\" a web-based, printable tool designed for organizing tasks and notes.\n\nThis planner offers a calm, printer-friendly canvas for mapping out the month, capturing notes, and maintaining a lightweight log. Its design is minimal and task-focused, ensuring monthly tasks are visible without distractions. Key features include a \"Year Plan\" for future goal setting, dedicated monthly notes, and the ability to jump between them.\n\nA significant aspect is its commitment to privacy and offline usability: all plans are saved locally on the device using LocalStorage, requiring no logins, sign-ups, or syncing. Users can easily print their plans or save them as PDFs.\n\nThe planner has seen recent updates, with version 0.0.2 (December 5, 2025) introducing the \"Year Plan\" feature, allowing users to plan for upcoming years like 2026. The initial version (0.0.1) was released on February 18, 2025. The developer also invites feature requests via email to enhance the planner.",
    "chinese_title": "HN 展示: 极简每月任务计划器 (可打印，离线，无需注册)",
    "chinese_summary": "PrintCalendar.top 推出了《Show HN：极简月度任务规划器》，这是一款基于网页、可打印的工具，旨在用于组织任务和笔记。\n\n该规划器提供了一个宁静、便于打印的画布，用于规划月份、记录笔记和维护一个轻量级日志。其设计极简且专注于任务，确保月度任务清晰可见，不受干扰。主要功能包括用于设定未来目标的“年度计划”、专属的月度笔记以及在它们之间跳转的能力。\n\n其一大特点是对隐私和离线可用性的重视：所有计划都通过 LocalStorage 本地保存在设备上，无需登录、注册或同步。用户可以轻松打印计划或将其保存为PDF文件。\n\n该规划器最近进行了更新，0.0.2 版（2025年12月5日）引入了“年度计划”功能，允许用户规划2026年等未来年份。初始版本（0.0.1）于2025年2月18日发布。开发者还邀请用户通过电子邮件提出功能请求，以改进该规划器。"
  },
  {
    "id": "46146204",
    "title": "Building optimistic UI in Rails (and learn custom elements)",
    "url": "https://railsdesigner.com/custom-elements/",
    "summary": "This article introduces custom elements, a Web Component feature, as a simple yet powerful way to define custom HTML tags with attached JavaScript behavior, similar to how Hotwire uses `<turbo-frame>` and `<turbo-stream>`.\n\nCustom elements allow you to create new tags like `<hello-world>`, defining their behavior within a class (e.g., `connectedCallback` for when an element is added to the page, similar to Stimulus's `connect`). They can read attributes (`getAttribute`) and react to changes using `attributeChangedCallback` and `static observedAttributes`. While they can extend built-in elements using the `is` attribute, autonomous custom elements (with hyphens in their names) are preferred for broader browser compatibility.\n\nComparing custom elements to Stimulus, the article notes that custom elements are browser-native and feel more like vanilla JavaScript, relying on standard DOM methods (`querySelector()`). Stimulus, conversely, is framework-dependent and convention-based, using `data-targets` and `data-actions`. Custom elements shine for reusable, self-contained components, while Stimulus is ideal for adding behavior to existing HTML.\n\nTwo examples illustrate their utility. First, a simple `ClickCounter` demonstrates incrementing a number on click. Second, an \"optimistic form\" provides instant UI updates. When a message form is submitted, the custom element immediately renders and appends a temporary message using a `<template response>` tag's content. The form still submits to Rails, which then responds with a Turbo Stream to `replace` the optimistic message with the server-rendered version, providing a seamless, instant user experience without loading spinners. This pattern is highly reusable and suitable for chat, comments, or to-do lists, ensuring the partials live within the HTML template, not duplicated in JavaScript.",
    "chinese_title": "Rails 乐观 UI 搭建 (并学习自定义元素)",
    "chinese_summary": "本文介绍了自定义元素，这是一个 Web Component 特性，作为一种简单而强大的方式来定义具有附加 JavaScript 行为的自定义 HTML 标签，类似于 Hotwire 如何使用 `<turbo-frame>` 和 `<turbo-stream>`。\n\n自定义元素允许您创建 `<hello-world>` 等新标签，并在类中定义它们的行为（例如，当元素添加到页面时调用的 `connectedCallback`，类似于 Stimulus 的 `connect`）。它们可以读取属性（`getAttribute`），并使用 `attributeChangedCallback` 和 `static observedAttributes` 对更改做出反应。虽然它们可以使用 `is` 属性扩展内置元素，但为了更广泛的浏览器兼容性，首选自主自定义元素（名称中带有连字符的）。\n\n将自定义元素与 Stimulus 进行比较，文章指出自定义元素是浏览器原生的，更像纯 JavaScript，依赖于标准的 DOM 方法（`querySelector()`）。相反，Stimulus 依赖于框架且基于约定，使用 `data-targets` 和 `data-actions`。自定义元素在可重用、自包含的组件方面表现出色，而 Stimulus 则非常适合为现有 HTML 添加行为。\n\n两个例子说明了它们的实用性。首先，一个简单的 `ClickCounter` 展示了点击时增加数字。其次，一个“乐观表单”提供了即时 UI 更新。当消息表单提交时，自定义元素会立即使用 `<template response>` 标签的内容渲染并追加一条临时消息。表单仍然提交给 Rails，然后 Rails 用 Turbo Stream 响应，将乐观消息替换为服务器渲染的版本，从而提供无缝、即时的用户体验，无需加载指示器。这种模式高度可重用，适用于聊天、评论或待办事项列表，确保局部模板位于 HTML 模板中，而不是在 JavaScript 中重复。"
  },
  {
    "id": "46140753",
    "title": "Greeting Vocalizations in Domestic Cats Are More Frequent with Male Caregivers",
    "url": "https://onlinelibrary.wiley.com/doi/10.1111/eth.70033",
    "summary": "The article \"Greeting Vocalizations in Domestic Cats Are More Frequent with Male Caregivers\" investigates factors influencing the frequency of greeting vocalizations (e.g., meows, purrs, trills) emitted by domestic cats (Felis catus) towards their human caregivers.\n\nThe study observed 41 cats in their home environments and recorded their interactions with male and female caregivers during a 10-minute separation and reunion paradigm. Researchers analyzed the occurrence and types of vocalizations.\n\nKey findings indicate that cats produced greeting vocalizations significantly more often when interacting with male caregivers compared to female caregivers. While the overall duration of vocalizations did not differ significantly between caregiver sexes, the *frequency* of greeting calls was distinctly higher with males. The study also found that cats vocalized more frequently when their caregivers exhibited higher levels of physical interaction (petting, stroking) and social play.\n\nThe authors suggest that this difference might stem from variations in interaction styles, with male caregivers potentially engaging in more rewarding physical interaction or vocalizing more towards their cats, which could reinforce feline vocal responses. Alternatively, it could be a compensatory mechanism if cats perceive male caregivers as less responsive to non-vocal cues, prompting them to vocalize more to elicit attention. The study highlights the nuanced role of caregiver sex and interaction styles in shaping cat-human communication.",
    "chinese_title": "家猫对男性照料者的问候叫声更频繁",
    "chinese_summary": "题为《家猫对雄性照护者发出问候性叫声更频繁》的文章，探讨了影响家猫（Felis catus）向人类照护者发出问候性叫声（例如：喵叫、咕噜声、颤音）频率的因素。\n\n这项研究在猫咪的家庭环境中观察了41只猫，并记录了它们在一个10分钟的分离与重聚范式中与雄性和雌性照护者的互动。研究人员分析了叫声的出现频率和类型。\n\n主要发现表明，与雌性照护者相比，猫咪在与雄性照护者互动时发出问候性叫声的频率显著更高。尽管不同性别照护者之间叫声的总体持续时间没有显著差异，但问候性叫声的*频率*在与雄性照护者互动时明显更高。研究还发现，当照护者表现出更高水平的身体互动（抚摸、轻抚）和社交游戏时，猫咪叫声的频率也更高。\n\n作者认为，这种差异可能源于互动方式的不同，雄性照护者可能进行更多有益的身体互动，或者更频繁地对猫咪发出声音，这可能会强化猫咪的发声反应。另一种可能是，如果猫咪认为雄性照护者对非声音线索的反应较少，这可能是一种补偿机制，促使它们通过更多发声来引起注意。这项研究强调了照护者性别和互动方式在塑造猫-人交流中的微妙作用。"
  },
  {
    "id": "46150447",
    "title": "PyTogether: Collaborative lightweight real-time Python IDE for teachers/learners",
    "url": "https://github.com/SJRiz/pytogether",
    "summary": "PyTogether is a collaborative, browser-based Python IDE designed to be \"Google Docs for Python,\" specifically tailored for teachers and learners. It offers real-time code editing with Y.js, live cursors, chat, voice calls, and drawing tools within projects, making it ideal for classrooms and pair programming. Users can securely log in (manual or Google OAuth), organize work into groups, and easily share code snippets.\n\nThe platform's primary goal is \"simplicity first,\" addressing the overwhelming complexity of traditional IDEs for beginners. PyTogether provides a lightweight, distraction-free environment that emphasizes immediate coding without downloads, installations, or complex configurations. It's built for educational purposes and quick collaborations, not large-scale production development.\n\nKey features include CodeMirror linting, smart autosave, and integrated Python execution via Pyodide in a web worker. The technology stack comprises Django/DRF for the backend, React/Tailwind CSS for the frontend, WebSockets (Django Channels) and Y.js for real-time functionality, and PostgreSQL. Local setup is simplified using Docker and Node. The project is authored by Jawad Rizvi.",
    "chinese_title": "PyTogether：面向教师/学习者的协作式轻量级实时Python集成开发环境",
    "chinese_summary": "PyTogether是一个协作式、基于浏览器的Python集成开发环境（IDE），旨在成为“Python版Google Docs”，专为教师和学习者量身定制。它在项目中提供基于Y.js的实时代码编辑、实时光标、聊天、语音通话和绘图工具，非常适合课堂教学和结对编程。用户可以安全登录（手动或通过Google OAuth），将工作分组，并轻松共享代码片段。\n\n该平台的首要目标是“简单至上”，旨在解决传统IDE对初学者而言过于复杂的问题。PyTogether提供了一个轻量级、无干扰的环境，强调即时编码，无需下载、安装或复杂的配置。它专为教育目的和快速协作而构建，而非大规模生产开发。\n\n主要功能包括CodeMirror代码检查、智能自动保存，以及通过Web Worker中的Pyodide实现的集成Python执行。其技术栈包括后端使用Django/DRF，前端使用React/Tailwind CSS，实时功能通过WebSockets（Django Channels）和Y.js实现，并使用PostgreSQL数据库。本地设置通过Docker和Node简化。该项目由Jawad Rizvi开发。"
  },
  {
    "id": "46149066",
    "title": "Feynman vs. Computer",
    "url": "https://entropicthoughts.com/feynman-vs-computer",
    "summary": "The article \"Feynman vs. Computer\" argues that for practical purposes, numerical integration using computers often outperforms arduous analytical methods. While analytical integration requires specialized tricks and extensive effort, a simple JavaScript function employing Monte Carlo methods can approximate integrals quickly and accurately.\n\nMonte Carlo integration works by sampling a function at uniformly distributed random points within an interval, summing their heights to estimate the area under the curve. The author provides a basic JavaScript `I` function demonstrating this principle.\n\nFor functions with complex behaviors like asymptotes, a technique called \"sample unit engineering\" significantly improves accuracy. This involves splitting the integration interval and allocating more samples to challenging regions, optimizing accuracy without increasing the total sample count. This method dramatically narrows confidence intervals, proving as effective as a tenfold increase in samples.\n\nCrucially, the article introduces a method (`Ic` function) to compute the standard error and a confidence interval for the approximation, allowing users to assess accuracy without knowing the true integral value.\n\nUltimately, the author asserts that for integrals yielding a numerical result, the speed and sufficient accuracy of computer-based Monte Carlo methods, especially with clever sample allocation, generally make them superior to manual analytical techniques, reserving the latter for specific cases requiring a functional outcome (e.g., in quantum dynamics).",
    "chinese_title": "费曼大战电脑",
    "chinese_summary": "文章《费曼与计算机》指出，出于实际目的，使用计算机进行数值积分通常优于费力的解析方法。虽然解析积分需要专业的技巧和大量的精力，但一个简单的采用蒙特卡罗方法的JavaScript函数可以快速准确地逼近积分。\n\n蒙特卡罗积分的工作原理是在给定区间内，对函数在均匀分布的随机点进行采样，然后将它们的高度求和以估计曲线下的面积。作者提供了一个基础的JavaScript函数`I`来演示这个原理。\n\n对于具有复杂行为（如渐近线）的函数，一种称为“样本分配优化”（sample unit engineering）的技术可以显著提高精度。这涉及划分积分区间，并将更多样本分配给具有挑战性的区域，从而在不增加总样本数的情况下优化精度。这种方法显著缩小了置信区间，证明其效果堪比将样本数增加十倍。\n\n至关重要的是，文章介绍了一种计算近似值的标准误差和置信区间的方法（`Ic`函数），允许用户在不知道真实积分值的情况下评估精度。\n\n最终，作者断言，对于产生数值结果的积分，基于计算机的蒙特卡罗方法，特别是通过巧妙的样本分配，其速度和足够的精度通常使其优于手动解析技术，而后者则保留用于需要函数结果的特定情况（例如，在量子动力学中）。"
  },
  {
    "id": "46144801",
    "title": "Show HN: Kraa – Writing App for Everything",
    "url": "https://kraa.io/about",
    "summary": "The provided content for the article \"Show HN: Kraa – Writing App for Everything\" consists only of the word \"Kraa.\"\n\nWithout the actual body of the article, it is impossible to provide a summary of its main points and key information. To summarize, I would need details about what Kraa is, its features, target audience, unique selling points, and any other information presented in the article.\n\nPlease provide the full article content to receive a concise summary.",
    "chinese_title": "展示 HN: Kraa — 全能写作App",
    "chinese_summary": "文章“Show HN: Kraa – 全能写作应用”所提供的内容仅包含“Kraa”一词。\n\n在没有文章正文的情况下，无法提供其主要观点和关键信息的摘要。要进行总结，我需要了解Kraa是什么、其功能、目标受众、独特卖点以及文章中呈现的任何其他信息。\n\n请提供完整的文章内容，以便获得一份简洁的摘要。"
  },
  {
    "id": "46155401",
    "title": "The Ofcom Files, Part 4: Ofcom Rides Again",
    "url": "https://prestonbyrne.com/2025/12/04/the-ofcom-files-part-4-ofcom-rides-again/",
    "summary": "Part 4 of \"The Ofcom Files\" details the escalating conflict between the UK's Ofcom, a censorship agency, and US-based company 4chan, represented by Preston Byrne. Ofcom sent another threatening letter, expanding its investigation into 4chan and claiming extraterritorial power to enforce its \"age assurance\" censorship laws against Americans in the United States, after 4chan refused to pay fines.\n\nPreston Byrne's sharp reply rejected Ofcom's claims of jurisdiction. He revealed that Ofcom's actions have inspired the proposed \"GRANITE Act,\" a federal foreign censorship shield law now under consideration by the US Congress, aiming to protect American entities from such foreign overreach. Byrne stated that 4chan would not implement Ofcom's age assurance rules, as they destroy anonymity protected by the First Amendment. He emphasized 4chan's cooperation with legitimate law enforcement on child safety, but not with Ofcom, branding it a \"censorship agency\" lacking proper jurisdiction. Byrne reiterated that 4chan answers to the First Amendment, not foreign governments, and expressed strong hope for US legislation to secure the American-led future of the internet, copying US government officials on his response.",
    "chinese_title": "Ofcom档案，第四部分：Ofcom再次出击",
    "chinese_summary": "《Ofcom档案》第4部分详细描述了英国审查机构Ofcom与由普雷斯顿·伯恩代表的美国公司4chan之间不断升级的冲突。在4chan拒绝支付罚款后，Ofcom又发出了一封威胁信，扩大了对4chan的调查，并声称拥有域外管辖权，以对美国的美国公民强制执行其“年龄保障”审查法。\n\n普雷斯顿·伯恩的严厉回复驳回了Ofcom的管辖权主张。他透露，Ofcom的行为已促成了拟议中的“GRANITE法案”，这是一项联邦外国审查保护法，目前正由美国国会审议，旨在保护美国实体免受此类外国越权行为的侵害。伯恩表示，4chan不会执行Ofcom的年龄保障规定，因为这些规定会破坏受第一修正案保护的匿名性。他强调，4chan在儿童安全方面与合法执法部门合作，但不会与Ofcom合作，并将其定性为缺乏适当管辖权的“审查机构”。伯恩重申，4chan服从的是第一修正案，而非外国政府，并对美国立法以确保互联网由美国主导的未来表达了强烈希望，其回复中抄送了美国政府官员。"
  },
  {
    "id": "46164419",
    "title": "The AI Backlash Is Here: Why Public Patience with Tech Giants Is Running Out",
    "url": "https://www.newsweek.com/ai-backlash-openai-meta-friend-10807425",
    "summary": "Public patience with generative AI is rapidly eroding, shifting from initial optimism in 2022 to widespread cynicism and hostility by 2025. This backlash is evident in public spaces, with AI-generated ad campaigns being vandalized and mocked online as \"slop.\" High-profile artists like Bad Bunny and Drake have also voiced strong opposition to AI models mimicking their voices without consent.\n\nCritics argue that generative AI has been \"wildly oversold,\" primarily benefiting wealthy technologists rather than solving practical problems for the general public. Concerns are rising over AI's impact on authenticity, social interaction, and its role in displacing human labor, automating tasks without accountability, and extracting data without consent. Surveys show a significant increase in U.S. adults who believe AI is more likely to harm than help them in the future.\n\nEconomically, despite billions flowing into AI infrastructure—$320 billion in the first half of 2025 alone—experts warn of a potential \"bubble.\" Professor Andrew Odlyzko notes that current spending far outpaces plausible future economic returns, driven by \"circular investment patterns\" among AI companies rather than genuine customer demand. The industry remains largely unprofitable at scale, facing a projected $800 billion annual revenue shortfall by 2030 to meet data center demands. Lawsuits over AI training data and style imitation are also piling up.\n\nWhile some experts foresee long-term benefits in AI taking over dangerous jobs, anxieties about labor displacement, particularly among younger generations, highlight a chaotic transition. The article concludes that the current AI economic model is unsustainable, and if the bubble bursts, its impact will be far-reaching.",
    "chinese_title": "AI反噬已至：为何公众对科技巨头耐心渐失",
    "chinese_summary": "公众对生成式AI的耐心正在迅速消退，从2022年的初步乐观情绪转变为到2025年普遍的怀疑和敌意。这种反弹在公共场所显而易见，AI生成的广告活动遭到破坏，并在网上被嘲讽为“劣质品”。Bad Bunny和Drake等知名艺人也强烈反对AI模型未经同意模仿他们的声音。\n\n批评者认为生成式AI被“过度吹捧”，主要使富有的技术专家受益，而非为普通大众解决实际问题。人们对AI影响真实性、社会互动，以及它在取代人类劳动力、在没有问责制的情况下自动化任务、未经同意提取数据方面的作用的担忧正在加剧。调查显示，认为AI在未来弊大于利的美国成年人显著增加。\n\n在经济方面，尽管数十亿美元涌入AI基础设施——仅2025年上半年就有3200亿美元——专家们仍警告可能存在一个“泡沫”。Andrew Odlyzko教授指出，目前的支出远远超过未来可能实现的经济回报，这是由AI公司之间的“循环投资模式”而非真正的客户需求驱动的。该行业在规模上仍大多无利可图，预计到2030年，为满足数据中心需求将面临8000亿美元的年度收入缺口。关于AI训练数据和风格模仿的诉讼也日益增多。\n\n尽管一些专家预见到AI接管危险工作所带来的长期益处，但对劳动力流失的担忧，尤其是在年轻一代中，凸显了这种混乱的转型。文章总结认为，当前的AI经济模式是不可持续的，如果泡沫破裂，其影响将是深远的。"
  },
  {
    "id": "46142843",
    "title": "Apple’s head of user interface design, Alan Dye, will join Meta",
    "url": "https://www.cnbc.com/2025/12/03/liquid-glass-alan-dye-leaving-apple.html",
    "summary": "Alan Dye, Apple's head of user interface design, is departing the company to join Meta, a notable executive shift in Silicon Valley. Apple confirmed Dye's exit, announcing that veteran designer Stephen Lemay, who has contributed to major Apple interfaces since 1999, will succeed him. Apple CEO Tim Cook reiterated the company's commitment to design excellence.\n\nAt Meta, Dye will lead a new creative studio focused on bringing together design, fashion, and technology, according to Meta CEO Mark Zuckerberg. Zuckerberg emphasized the goal to \"elevate design within Meta,\" though specific projects were not disclosed.\n\nDye, who joined Apple in 2006, rose to become one of the design studio's leads in 2015 after Jony Ive's transition. He played a key role in the software design for numerous Apple products, including the iPhone, iPad, Mac, Apple Watch, Apple TV, and Vision Pro. He is also credited with the 2017 iPhone redesign that removed the home button. Most recently, Dye unveiled the \"Liquid Glass\" software interface redesign for iPhones, Macs, and Apple Watch in June, featuring translucent elements and fluid animations.\n\nThis move highlights Meta's expanding ambitions in hardware, with products like its Quest VR headsets and the successful Ray-Ban Meta smart glasses. Mark Zuckerberg has frequently cited Apple as a primary competitor, viewing this as a \"new era\" for AI-powered devices.",
    "chinese_title": "苹果用户界面设计负责人艾伦·戴将加入Meta。",
    "chinese_summary": "苹果用户界面设计主管艾伦·戴（Alan Dye）将离开公司加入Meta，这是硅谷一次值得关注的高管变动。苹果证实了戴的离职，并宣布自1999年以来一直为苹果主要界面做出贡献的资深设计师斯蒂芬·勒梅（Stephen Lemay）将接替他的职务。苹果CEO蒂姆·库克重申了公司对卓越设计的承诺。\n\n据Meta首席执行官马克·扎克伯格（Mark Zuckerberg）透露，戴将在Meta领导一个全新的创意工作室，致力于融合设计、时尚和科技。扎克伯格强调了“提升Meta内部设计”的目标，但具体项目并未公布。\n\n戴于2006年加入苹果，在乔纳森·艾维（Jony Ive）转型后，于2015年升任设计工作室的负责人之一。他在多款苹果产品的软件设计中发挥了关键作用，包括iPhone、iPad、Mac、Apple Watch、Apple TV和Vision Pro。2017年取消Home键的iPhone重新设计也归功于他。最近，戴于六月公布了针对iPhone、Mac和Apple Watch的“液态玻璃”（Liquid Glass）软件界面重新设计，该设计以半透明元素和流畅动画为特色。\n\n此举凸显了Meta在硬件领域日益增长的雄心，其产品包括Quest VR头显和成功的Ray-Ban Meta智能眼镜。马克·扎克伯格经常将苹果列为主要竞争对手，并将此视为人工智能驱动设备的一个“新时代”。"
  },
  {
    "id": "46156379",
    "title": "Blogging in 2025: Screaming into the Void",
    "url": "https://askmike.org/articles/blogging-in-2025-screaming-into-the-void/",
    "summary": "The author reflects on the shift from the old, decentralized web of personal blogs to the current internet dominated by centralized social media platforms, noting a \"shrinking\" web. In 2025, open blogging faces severe challenges: AI summarization now provides instant answers to user queries, often bypassing direct visits to blogs and websites. Additionally, high-quality content increasingly moves behind paywalls and paid newsletters, benefiting writers but detracting from the open web's richness.\n\nDespite these obstacles, the author expresses a nostalgic desire to resume blogging. He embraces AI coding tools, not to create complex systems, but to simplify and strip down his existing blog software. His goal is \"open web hygiene,\" achieved by removing all external JavaScript trackers, third-party dependencies like Google fonts, and simplifying the HTML/CSS for a minimal, responsive design. He also migrated his site generation to a simple custom script.\n\nHis minimalist tech blog, travel blog, and an \"about me\" site are now live. Acknowledging that removing all trackers means he won't know his readership, the author concludes he is \"screaming into the void.\"",
    "chinese_title": "2025年博客：虚空呐喊",
    "chinese_summary": "作者反思了互联网从过去个人博客的去中心化网络，转向当前由中心化社交媒体平台主导的局面，并指出网络正在“萎缩”。进入2025年，开放式博客面临严峻挑战：AI摘要功能现在能即时回答用户查询，通常会绕过对博客和网站的直接访问。此外，高质量内容越来越多地转移到付费墙和付费新闻邮件背后，这虽惠及作者，却削弱了开放网络的丰富性。\n\n尽管面临这些障碍，作者仍表达了恢复博客写作的怀旧愿望。他采用AI编码工具，并非为了创建复杂系统，而是为了简化并精简他现有的博客软件。他的目标是实现“开放网络卫生”，方法是移除所有外部JavaScript追踪器、谷歌字体等第三方依赖，并简化HTML/CSS以实现极简、响应式设计。他还将网站生成迁移到一个简单的自定义脚本。\n\n他极简主义的科技博客、旅行博客和一个“关于我”的网站现已上线。作者承认，移除所有追踪器意味着他将无法了解自己的读者群，因此他总结说自己是在“对着虚空呐喊”。"
  },
  {
    "id": "46153332",
    "title": "Countdown until the AI bubble bursts",
    "url": "https://pop-the-bubble.xyz/",
    "summary": "This article describes a satirical project titled \"Countdown until the AI bubble bursts,\" which features a dynamic countdown in days, hours, minutes, and seconds leading to a predicted \"burst date.\" This project is explicitly stated as a thought experiment, not a real prediction, where an AI (Gemini) attempts to forecast its own industry's potential decline based on web news.\n\nEvery night, a script prompts Gemini to search the web for the latest AI news, including both hype and criticism. Based on the sentiment and economic indicators found, Gemini updates the predicted burst date and provides reasoning for its choice. Users can view a \"Prediction History\" to track changes over time.\n\nThe creators clarify they are not against AI, recognizing its utility, but are critical of the current \"massive hype cycle,\" the \"AI in everything\" trend, and the \"circular investment economy\" in the sector. Interestingly, the project itself was created with AI, and instructions are provided for users to replicate the analysis using any AI model with web search capabilities.",
    "chinese_title": "AI泡沫破裂倒计时",
    "chinese_summary": "本文描述了一个名为“AI泡沫破裂倒计时”的讽刺项目，该项目设有一个动态倒计时，以天、小时、分钟和秒为单位，指向一个预测的“破裂日期”。该项目明确指出是一个思想实验而非真实预测，其中一个AI（Gemini）试图根据网络新闻预测其自身行业的潜在衰退。\n\n每晚，一个脚本会提示Gemini在网上搜索最新的AI新闻，包括炒作和批评两方面。根据其发现的情绪和经济指标，Gemini会更新预测的破裂日期并提供选择理由。用户可以查看“预测历史”来跟踪随时间变化。\n\n创建者澄清他们不反对AI，并承认其用途，但他们批评当前“大规模的炒作周期”、“万物皆AI”的趋势以及该行业内的“循环投资经济”。有趣的是，该项目本身就是用AI创建的，并且提供了说明，供用户使用任何具备网络搜索能力的AI模型复制这项分析。"
  },
  {
    "id": "46139905",
    "title": "Agentic Development Environment by JetBrains",
    "url": "https://air.dev",
    "summary": "JetBrains is introducing an innovative concept: an \"Agentic Development Environment.\" This new paradigm, highlighted by a core feature named \"Air,\" aims to redefine developer workflows.\n\nThe essence of this environment is to empower users to \"multitask with agents.\" This implies leveraging AI-powered agents to assist with various development tasks, potentially automating routine actions, streamlining complex processes, and significantly boosting productivity.\n\nA crucial design principle underpinning \"Air\" is the commitment to ensuring developers \"stay in control.\" This addresses common concerns about AI autonomy, promising a collaborative model where intelligent agents augment human capabilities rather than dictate them, allowing users to maintain ultimate oversight and decision-making authority within their projects. The Agentic Development Environment by JetBrains positions itself as a tool for enhanced efficiency and control in software development.",
    "chinese_title": "JetBrains 代理式开发环境",
    "chinese_summary": "JetBrains 正在推出一个创新概念：“智能体开发环境”。这一以名为“Air”的核心功能为亮点的全新范式，旨在重新定义开发者工作流程。\n\n该环境的本质是赋能用户“与智能体协同处理多任务”。这意味着利用AI驱动的智能体协助完成各种开发任务，有望自动化例行操作、简化复杂流程，并显著提升生产力。\n\n“Air”的一个关键设计原则是致力于确保开发者“保持掌控”。这解决了对AI自主性的普遍担忧，承诺一种协作模式，其中智能体增强而非支配人类能力，允许用户在项目中保持最终的监督和决策权。JetBrains 的智能体开发环境将自身定位为提高软件开发效率和控制力的工具。"
  },
  {
    "id": "46156832",
    "title": "Rats Snatching Bats Out of the Air and Eating Them–Researchers Got It on Video",
    "url": "https://www.smithsonianmag.com/smart-news/rats-are-snatching-bats-out-of-the-air-and-eating-them-and-researchers-got-it-on-video-180987610/",
    "summary": "New research, published in *Global Ecology & Conservation*, provides the first scientific documentation of brown rats (Rattus norvegicus) actively hunting and consuming bats. Scientists used infrared cameras at urban bat hibernation sites in northern Germany between 2020 and 2024 to capture footage of this \"remarkable\" behavior.\n\nThe rats displayed two distinct hunting strategies: ambushing stationary bats and, more strikingly, standing on their hind legs to snatch flying bats mid-air. They killed the bats with a bite and dragged them away, likely relying on whiskers or sensing air currents due to their poor eyesight. At one site, Bad Segeberg, 13 confirmed kills were filmed, and remains of 52 bats were discovered. Researchers estimate a single rat could consume 140 bats over a three-month winter, potentially leading to 2,100-8,400 bat deaths per season—a minimum of 7% of the overwintering population.\n\nThis novel predation poses significant conservation and public health concerns. The invasive rats could decimate local bat populations already facing threats like light pollution. Furthermore, as both species carry various pathogens, these interactions could facilitate disease spillover to rodents, potentially increasing transmission risks to humans and domestic animals.\n\nLead author Florian Gloza-Rausch highlighted the rats' adaptability and the conservation challenge. Researchers suggest that controlling invasive brown rat populations at key bat sites, through improved garbage and sewer management, could simultaneously protect vulnerable bats and mitigate public health risks.",
    "chinese_title": "老鼠空中捕食蝙蝠——研究人员拍到视频",
    "chinese_summary": "发表在《全球生态学与保护》杂志上的一项新研究，首次提供了关于褐鼠（Rattus norvegicus）主动捕食蝙蝠的科学记录。科学家们在2020年至2024年间，利用红外摄像机在德国北部的城市蝙蝠冬眠地，捕捉到了这种“引人注目”行为的画面。\n\n老鼠展现出两种截然不同的捕食策略：伏击静止的蝙蝠，以及更令人震惊的是，后腿站立在半空中捕捉飞行中的蝙蝠。它们通过咬噬杀死蝙蝠并将其拖走，由于视力不佳，它们很可能依靠胡须或感知气流来定位。在一个地点，塞格贝格，拍摄到13起确认的捕杀事件，并发现了52只蝙蝠的残骸。研究人员估计，一只老鼠在三个月的冬季里可以捕食140只蝙蝠，可能导致每季2,100至8,400只蝙蝠死亡——这至少占越冬种群的7%。\n\n这种新颖的捕食行为带来了重大的保护和公共卫生问题。入侵性老鼠可能导致当地蝙蝠种群数量锐减，而这些种群已经面临光污染等威胁。此外，由于这两种物种都携带各种病原体，这些相互作用可能促进疾病溢出到啮齿动物，从而可能增加向人类和家畜传播的风险。\n\n主要作者弗洛里安·格洛扎-劳施强调了老鼠的适应能力以及保护方面的挑战。研究人员建议，通过改善垃圾和下水道管理，在关键蝙蝠栖息地控制入侵性褐鼠种群，可以同时保护脆弱的蝙蝠并减轻公共卫生风险。"
  },
  {
    "id": "46143841",
    "title": "Russia Bans Roblox",
    "url": "https://www.bbc.com/news/articles/cn41q11gy58o",
    "summary": "Russia has banned the popular online gaming platform Roblox, citing concerns over child safety and the spread of extremist content, including LGBT-related material. Roskomnadzor, the country's media regulator, stated that Roblox hosts \"inappropriate content\" negatively impacting children's moral development.\n\nThe regulator specifically flagged the presence of LGBT issues (classified as extremist in Russia), terrorism-related content, simulated terrorist attacks, gambling scenarios, sexual harassment of children, and the sharing of intimate images on the platform.\n\nRoblox, a multiplayer online platform where users create and share their own games, responded by asserting its respect for local laws and its deep commitment to safety, stating it provides a \"positive space\" for learning with \"robust\" preventative measures.\n\nDespite Roblox's assurances, the platform has faced significant global criticism for its child protection features. It is already banned in countries like Turkey due over safety concerns. Singapore raised issues in 2023 regarding ISIS-themed servers, and the Texas Attorney General recently sued Roblox over alleged safety law violations. This month, Roblox announced it would stop allowing children to chat with adult strangers, addressing long-standing criticism. The platform's user-generated content model makes its regulation particularly challenging.",
    "chinese_title": "俄罗斯封禁Roblox",
    "chinese_summary": "俄罗斯已封禁热门在线游戏平台Roblox，理由是担忧儿童安全以及极端内容（包括与LGBT相关材料）的传播。该国媒体监管机构Roskomnadzor表示，Roblox托管了“不当内容”，对儿童的道德发展产生负面影响。\n\n监管机构特别指出平台上存在LGBT议题（在俄罗斯被列为极端主义内容）、恐怖主义相关内容、模拟恐怖袭击、赌博场景、性骚扰儿童以及分享私密图片。\n\nRoblox是一个用户可以创建和分享自己游戏的多人在线平台，对此回应称其尊重当地法律并深切致力于安全，表示它提供了一个“积极空间”供学习，并有“强有力”的预防措施。\n\n尽管Roblox做出了保证，但该平台因其儿童保护功能在全球范围内面临着严重批评。出于安全担忧，它已在土耳其等国家被封禁。新加坡在2023年就其平台上存在的ISIS主题服务器提出了问题，德克萨斯州总检察长最近也因涉嫌违反安全法律而起诉Roblox。本月，Roblox宣布将停止允许儿童与陌生成年人聊天，以此回应长期以来的批评。该平台的用户生成内容（UGC）模式使其监管特别具有挑战性。"
  },
  {
    "id": "46139375",
    "title": "After nearly 30 years, Crucial will stop selling RAM to consumers",
    "url": "https://arstechnica.com/gadgets/2025/12/after-nearly-30-years-crucial-will-stop-selling-ram-to-consumers/",
    "summary": "Micron Technology announced it will exit the consumer RAM and SSD business under its Crucial brand by February 2026, concluding nearly three decades in the DIY PC market. The company attributes this decision to soaring demand from AI data centers, prompting a strategic pivot towards larger, more profitable enterprise customers. Crucial, established in 1996, will honor existing product warranties, and Micron will redeploy affected employees while continuing its enterprise-grade Micron-branded sales.\n\nThis move underscores a severe squeeze in the consumer memory market. RAM prices have surged, with a typical 32GB DDR5 kit skyrocketing from $82 to $310, and DRAM contract prices up 171% year-over-year. Industry experts anticipate worsening supply constraints through late 2027. The core driver is the unprecedented demand for high-bandwidth memory (HBM) essential for AI accelerators, leading manufacturers to reallocate production from consumer components. Micron, for instance, has presold its entire HBM output through 2026.\n\nMassive AI infrastructure projects, such as OpenAI's Stargate, which reportedly demands nearly 40% of global DRAM production, are exacerbating the supply imbalance. Other companies, like Framework, have already ceased selling standalone RAM kits. While Micron prioritizes the profitability of bulk enterprise sales, its exit leaves DIY PC builders with one fewer option amidst a challenging and constrained consumer tech landscape.",
    "chinese_title": "近30年后，Crucial将停止向消费者销售内存。",
    "chinese_summary": "美光科技宣布将于2026年2月前退出旗下Crucial品牌的消费级内存和固态硬盘业务，结束其在DIY PC市场近三十年的历程。该公司将此决定归因于AI数据中心需求飙升，促使其战略性转向规模更大、利润更高的企业客户。Crucial品牌成立于1996年，将履行现有产品保修，美光将重新部署受影响的员工，同时继续其美光品牌的企业级产品销售。\n\n此举凸显了消费级内存市场面临的严峻挤压。内存价格飙升，例如典型的32GB DDR5套件价格从82美元暴涨至310美元，DRAM合约价格同比上涨171%。行业专家预计供应紧张状况将持续恶化直至2027年末。核心驱动因素是AI加速器所需的高带宽内存（HBM）的空前需求，导致制造商将生产重心从消费级组件转移。例如，美光已预售其截至2026年的全部HBM产量。\n\n大规模AI基础设施项目，例如OpenAI的Stargate项目，据报道该项目需要全球近40%的DRAM产量，正在加剧供应失衡。其他公司，如Framework，已停止销售独立的内存套件。尽管美光优先考虑大批量企业销售的盈利能力，但其退出让DIY PC组装者在充满挑战和受限的消费科技环境中又少了一个选择。"
  },
  {
    "id": "46156645",
    "title": "Warner Bros Begins Exclusive Deal Talks With Netflix",
    "url": "https://www.bloomberg.com/news/articles/2025-12-05/warner-bros-is-said-to-begin-exclusive-deal-talks-with-netflix",
    "summary": "Warner Bros. Discovery Inc. is in exclusive negotiations to sell its film and TV studios, along with its HBO Max streaming service, to Netflix Inc. The discussions are private, but sources indicate Netflix has pulled ahead of competitors like Paramount Skydance Corp. and Comcast Corp. As part of the potential deal, Netflix is reportedly offering a $5 billion breakup fee if regulators do not approve the acquisition. An announcement could come within days if talks conclude successfully. Warner Bros. formally put its assets up for sale in October.",
    "chinese_title": "华纳兄弟开始与Netflix洽谈独家协议",
    "chinese_summary": "华纳兄弟探索公司正在就出售其影视工作室以及HBO Max流媒体服务给Netflix公司进行独家谈判。讨论是私密的，但消息人士指出，Netflix已领先于派拉蒙天空之舞公司和康卡斯特公司等竞争对手。作为潜在交易的一部分，据报道，如果监管机构不批准此次收购，Netflix将提供50亿美元的分手费。如果谈判成功结束，公告可能在几天内发布。华纳兄弟于10月正式将其资产挂牌出售。"
  },
  {
    "id": "46156880",
    "title": "Netflix becomes frontrunner in bidding war for Warner Bros. Discovery – sources",
    "url": "https://www.cnn.com/2025/12/04/media/netflix-paramount-wbd-bidding-war-warner-bros-discovery",
    "summary": "Netflix has become the frontrunner in a high-stakes bidding war for Warner Bros. Discovery (WBD)'s studio and streaming assets, submitting the highest bid to date. Sources indicate Netflix's offer values the Warner Bros. studio and HBO Max at around $28 per share, and the companies have reportedly entered exclusive talks.\n\nParamount, led by CEO David Ellison, also submitted a new bid closer to $27 per share, but unlike Netflix and Comcast, Paramount is attempting to acquire *all* of WBD, including CNN and other cable channels. Paramount has expressed \"grave concerns\" about the auction process, alleging it favors Netflix.\n\nThe bidding war intensified after WBD's stock plummeted post-merger, leading the board to consider selling assets or proceeding with a planned company split. A significant factor is the \"Trump card\": Paramount is perceived to have an advantage with the Trump administration due to CEO Ellison's strong ties, potentially easing US regulatory approval. However, a sale would also face scrutiny in the UK, EU, and Latin America. Senator Mike Lee (R) has already raised alarms about a potential Netflix-WBD streaming merger, warning it would pose \"serious competition questions\" and effectively consolidate the streaming market.",
    "chinese_title": "网飞领跑争夺华纳兄弟探索公司的竞购战——消息人士称",
    "chinese_summary": "奈飞已成为高风险竞购战的领跑者，竞购对象是华纳兄弟探索公司（WBD）的制片厂和流媒体资产，并提交了迄今为止最高的出价。消息人士指出，奈飞的出价对华纳兄弟制片厂和HBO Max的估值约为每股28美元，据报道两家公司已进入独家谈判阶段。\n\n由首席执行官大卫·埃里森领导的派拉蒙也提交了一份新的出价，接近每股27美元，但与奈飞和康卡斯特不同的是，派拉蒙试图收购WBD的*所有*资产，包括CNN和其他有线电视频道。派拉蒙对拍卖过程表示“严重关切”，声称该过程偏袒奈飞。\n\n在WBD股票在合并后暴跌之后，竞购战加剧，导致董事会考虑出售资产或按计划进行公司拆分。一个重要因素是“特朗普牌”：由于首席执行官埃里森的强大关系，派拉蒙被认为在特朗普政府中拥有优势，可能有助于美国监管审批的顺利进行。然而，这项出售也将在英国、欧盟和拉丁美洲面临审查。参议员迈克·李（共和党）已经对潜在的奈飞-WBD流媒体合并发出警告，称这将引发“严重的竞争问题”，并有效地整合流媒体市场。"
  },
  {
    "id": "46138493",
    "title": "The only winning move is not to play",
    "url": "https://gregg.io/the-only-winning-move",
    "summary": "Gregg Bernstein argues that incorporating generative AI into user research for core tasks like planning, interviewing, and synthesis debases the profession and renders researchers redundant. He contends that while AI excels at pattern recognition, its application to human research yields only \"average\" results, stifling innovation and differentiation. This outsourcing, he states, undermines the unique value of human experts who apply their skills to uncover relevant information from participants.\n\nBernstein dismisses the narrative of \"professional evolution\" as a marketing ploy by tool vendors and stakeholders aiming to sell AI as an alternative to hiring human researchers. He critiques unethical marketing practices, such as undisclosed sponsorships by \"thought leaders,\" which create a false sense of expert adoption. He refutes claims that rigorous research \"takes too long,\" asserting that inadequate time allocation reflects a lack of organizational value for research itself.\n\nThe author acknowledges AI's utility for specific tasks (e.g., transcription, coding) but draws a \"red line\" against its use for human meaning-making, which he considers the most valuable and enjoyable aspect of user research. He argues that research is inherently a human-to-human loop, and adding a human to merely review AI output is inefficient and devalues expertise. Bernstein urges researchers to advocate for their unique skills, establish professional boundaries, and resist participating in practices that ultimately serve to replace them.",
    "chinese_title": "The only winning move is not to play",
    "chinese_summary": "格雷格·伯恩斯坦认为，将生成式AI融入用户研究的核心任务，如规划、访谈和综合，会贬低该职业并使研究人员变得多余。他断言，尽管AI擅长模式识别，但将其应用于人类研究只会产生“平庸”的结果，扼杀创新和差异化。他指出，这种外包削弱了人类专家运用自身技能从参与者那里发现相关信息的独特价值。\n\n伯恩斯坦驳斥了“职业演进”的说法，认为这是工具供应商和利益相关者旨在将AI作为替代雇用人类研究人员的营销伎俩。他批评了不道德的营销行为，例如“思想领袖”未披露的赞助，这制造了一种专家采纳的虚假印象。他驳斥了关于严谨研究“耗时过长”的说法，坚称时间分配不足反映了组织对研究本身缺乏重视。\n\n作者承认AI在特定任务（例如转录、编码）上的用处，但对将其用于人类意义建构划定了“红线”，他认为这是用户研究中最有价值和最令人愉悦的方面。他认为研究本质上是一个人与人之间的循环，而仅仅让人类审查AI输出是低效且贬低专业知识的。伯恩斯坦敦促研究人员倡导其独特技能，建立职业界限，并抵制参与最终旨在取代他们的做法。"
  },
  {
    "id": "46160465",
    "title": "Linus Torvalds thinks Elon Musk is 'too stupid' to be working at a tech company",
    "url": "https://www.neowin.net/news/linux-creator-torvalds-thinks-elon-musk-is-too-stupid-to-be-working-at-a-tech-company/",
    "summary": "Linus Torvalds, the creator of Linux, has publicly stated his strong belief that Elon Musk is \"too stupid\" to be working at a tech company. Torvalds expressed these views on a private mailing list, responding to a user's question about Musk's influence on open source.\n\nTorvalds labeled Musk an \"absolute idiot,\" particularly criticizing his handling of Twitter (now X) as a \"train wreck.\" He argued that Musk \"personifies the 'I'm a genius and can just buy things and run them into the ground' kind of idiocy,\" suggesting that if Musk were genuinely intelligent, he would have left the company largely untouched after acquiring it.\n\nHe implied that Musk's perceived genius lies more in public relations and marketing rather than actual technological leadership or sound business management. Torvalds' comments highlight a deep skepticism about Musk's capabilities to lead complex tech enterprises, contrasting Musk's actions with what he considers true innovation and sensible leadership.",
    "chinese_title": "莱纳斯·托瓦兹认为埃隆·马斯克“太蠢了”，不适合在科技公司工作。",
    "chinese_summary": "Linus Torvalds, the creator of Linux, has publicly stated his strong belief that Elon Musk is \"too stupid\" to be working at a tech company. Torvalds expressed these views on a private mailing list, responding to a user's question about Musk's influence on open source.\n\nTorvalds labeled Musk an \"absolute idiot,\" particularly criticizing his handling of Twitter (now X) as a \"train wreck.\" He argued that Musk \"personifies the 'I'm a genius and can just buy things and run them into the ground' kind of idiocy,\" suggesting that if Musk were genuinely intelligent, he would have left the company largely untouched after acquiring it.\n\nHe implied that Musk's perceived genius lies more in public relations and marketing rather than actual technological leadership or sound business management. Torvalds' comments highlight a deep skepticism about Musk's capabilities to lead complex tech enterprises, contrasting Musk's actions with what he considers true innovation and sensible leadership."
  },
  {
    "id": "46163609",
    "title": "Patterns for Defensive Programming in Rust",
    "url": "https://corrode.dev/blog/defensive-programming/",
    "summary": "生成摘要时出错",
    "chinese_title": "Patterns for Defensive Programming in Rust",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46151335",
    "title": "Hammersmith Bridge – Where did 25k vehicles go?",
    "url": "https://nickmaini.substack.com/p/hammersmith-bridge",
    "summary": "生成摘要时出错",
    "chinese_title": "Hammersmith Bridge – Where did 25k vehicles go?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46150994",
    "title": "Rsync.net Technical Notes – Q4 2025",
    "url": "https://www.rsync.net/resources/notes/2025-q4-rsync.net_technotes.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Rsync.net Technical Notes – Q4 2025",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46141665",
    "title": "Palantir CEO Says Making War Crimes Constitutional Would Be Good for Business",
    "url": "https://gizmodo.com/palantir-ceo-says-making-war-crimes-constitutional-would-be-good-for-business-2000695162",
    "summary": "生成摘要时出错",
    "chinese_title": "Palantir CEO Says Making War Crimes Constitutional Would Be Good for Business",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46140038",
    "title": "Chips for the Rest of Us",
    "url": "https://engineering.nyu.edu/about/unconventional-engineer/chips-for-us",
    "summary": "生成摘要时出错",
    "chinese_title": "Chips for the Rest of Us",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46153514",
    "title": "YouTuber accidentally crashes the rare plant market with viral cloning technique",
    "url": "https://www.dexerto.com/youtube/youtuber-accidentally-crashes-the-rare-plant-market-with-a-viral-cloning-technique-3289808/",
    "summary": "生成摘要时出错",
    "chinese_title": "YouTuber accidentally crashes the rare plant market with viral cloning technique",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46151363",
    "title": "Who Hooked Up a Laptop to a 1930s Dance Hall Machine?",
    "url": "https://www.chrisbako.com/posts/2025-12-04-speelkok-museam",
    "summary": "生成摘要时出错",
    "chinese_title": "Who Hooked Up a Laptop to a 1930s Dance Hall Machine?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46163804",
    "title": "Jony Ive's OpenAI Device Barred from Using 'Io' Name",
    "url": "https://www.macrumors.com/2025/12/05/openai-device-barred-from-io-name/",
    "summary": "生成摘要时出错",
    "chinese_title": "Jony Ive's OpenAI Device Barred from Using 'Io' Name",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46138226",
    "title": "Formally verifying Advent of Code using Dijkstra's program construction",
    "url": "https://haripm.com/blog/aoc-day-3-without-thinking/",
    "summary": "生成摘要时出错",
    "chinese_title": "Formally verifying Advent of Code using Dijkstra's program construction",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46163671",
    "title": "Synadia and TigerBeetle Pledge $512,000 to the Zig Software Foundation",
    "url": "https://tigerbeetle.com/blog/2025-10-25-synadia-and-tigerbeetle-pledge-512k-to-the-zig-software-foundation/",
    "summary": "生成摘要时出错",
    "chinese_title": "Synadia and TigerBeetle Pledge $512,000 to the Zig Software Foundation",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46155868",
    "title": "How Brussels writes so many laws",
    "url": "https://www.siliconcontinent.com/p/how-brussels-writes-so-many-laws",
    "summary": "生成摘要时出错",
    "chinese_title": "How Brussels writes so many laws",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46163721",
    "title": "X hit with $140M EU fine for breaching content rules",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/eu-fines-x-140-mln-breaching-online-content-rules-tiktok-settles-with-2025-12-05/",
    "summary": "生成摘要时出错",
    "chinese_title": "X hit with $140M EU fine for breaching content rules",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46163308",
    "title": "Gemini 3 Pro: the frontier of vision AI",
    "url": "https://blog.google/technology/developers/gemini-3-pro-vision/",
    "summary": "生成摘要时出错",
    "chinese_title": "Gemini 3 Pro: the frontier of vision AI",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46154484",
    "title": "SMS phishers pivot to points, taxes, fake retailers",
    "url": "https://krebsonsecurity.com/2025/12/sms-phishers-pivot-to-points-taxes-fake-retailers/",
    "summary": "生成摘要时出错",
    "chinese_title": "SMS phishers pivot to points, taxes, fake retailers",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46139145",
    "title": "Apple Design Official Alan Dye Poached by Meta in Major Coup",
    "url": "https://www.bloomberg.com/news/articles/2025-12-03/apple-design-executive-alan-dye-poached-by-meta-in-major-coup",
    "summary": "生成摘要时出错",
    "chinese_title": "Apple Design Official Alan Dye Poached by Meta in Major Coup",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46138224",
    "title": "Micron to exit consumer memory business amid global supply shortage",
    "url": "https://www.reuters.com/business/micron-exit-crucial-consumer-memory-business-2025-12-03/",
    "summary": "生成摘要时出错",
    "chinese_title": "Micron to exit consumer memory business amid global supply shortage",
    "chinese_summary": "生成摘要时出错"
  }
]