[
  {
    "id": "45996860",
    "title": "CBP is monitoring US drivers and detaining those with suspicious travel patterns",
    "url": "https://apnews.com/article/immigration-border-patrol-surveillance-drivers-ice-trump-9f5d05469ce8c629d6fecf32d32098cd",
    "summary": "The U.S. Border Patrol operates a secretive, nationwide program monitoring millions of American drivers using license plate readers (LPRs). An algorithm flags vehicles with \"suspicious\" travel patterns (origin, destination, route), leading to stops by federal or local law enforcement, often using minor traffic violations as pretexts for aggressive questioning and searches.\n\nInitially targeting border-related crimes, this system has expanded over five years into the country's interior, functioning akin to a domestic intelligence operation. It collaborates with DEA, private companies, and local police, drawing on nationwide LPR networks, and is poised to integrate AI. LPRs are often hidden in traffic equipment, and Border Patrol defines suspicion broadly (e.g., rental cars, trips to border regions). The network extends far beyond the border, impacting major cities like Phoenix, Detroit, Chicago, and Houston.\n\nLegal scholars raise Fourth Amendment concerns, calling it \"dragnet surveillance\" of ordinary Americans. Examples include Lorenzo Gutierrez Lugo, stopped for speeding (a pretext) based on Border Patrol intel, interrogated, and arrested on money laundering charges later dropped. Similarly, Alek Schott was stopped and searched after an overnight trip near the border, with nothing found. These \"whisper\" or \"intel\" stops conceal federal involvement, often coordinated through group chats where detailed driver information is informally shared. Despite authorization in 2017 for temporary investigations, the program has become a widespread, permanent surveillance network.",
    "chinese_title": "CBP正在监控美国司机并拘留有可疑出行模式的人。",
    "chinese_summary": "美国边境巡逻队运作着一项秘密的全国性项目，利用车牌识别器（LPR）监控数百万美国司机。算法会标记出具有“可疑”出行模式（起点、目的地、路线）的车辆，导致联邦或地方执法部门进行拦截，他们常常以轻微交通违规为借口，进行带有侵略性的盘问和搜查。\n\n该系统最初旨在打击与边境相关的犯罪，但在五年内已扩展到美国腹地，其运作方式类似于国内情报行动。它与美国缉毒局（DEA）、私营公司和地方警察合作，利用全国范围的LPR网络，并准备整合人工智能。LPR设备通常隐藏在交通设备中，边境巡逻队对“可疑”的定义非常宽泛（例如，租车、前往边境地区的旅行）。该网络远远超出了边境地区，影响着凤凰城、底特律、芝加哥和休斯顿等主要城市。\n\n法律学者对此提出第四修正案方面的担忧，称其为对普通美国人的“撒网式监控”。例子包括洛伦佐·古铁雷斯·卢戈（Lorenzo Gutierrez Lugo），他因超速（一个借口）被拦截，依据是边境巡逻队的情报，随后被审问并因洗钱指控被捕，但这些指控后来被撤销。类似地，亚历克斯·肖特（Alek Schott）在边境附近过夜旅行后被拦截搜查，但一无所获。这些“耳语”或“情报”拦截掩盖了联邦政府的参与，它们通常通过群聊进行协调，在群聊中，详细的司机信息被非正式地共享。尽管该项目在2017年获得授权用于临时调查，但它已发展成为一个广泛而永久的监控网络。"
  },
  {
    "id": "46006616",
    "title": "Helping Valve to power up Steam devices",
    "url": "https://www.igalia.com/2025/11/helpingvalve.html",
    "summary": "Igalia has detailed its extensive contributions to Valve's newly unveiled Steam devices: the ARM-based Steam Frame VR headset, Steam Machine console, and Steam Controller. Their work on SteamOS is crucial for these devices, especially the Frame.\n\nFor the ARM-powered Steam Frame, Igalia implemented and refined the FEX translation layer, enabling x86 PC games to run on ARM chips by converting machine code. This challenging process, as engineer Paulo Matos explains, often requires intensive manual debugging.\n\nIgalia also significantly enhanced Mesa3D Turnip, a FOSS Vulkan driver for Qualcomm Adreno GPUs. They added support for Adreno 700-series GPUs, critical optimizations like LRZ, and numerous Vulkan extensions, achieving superior correctness and performance compared to proprietary drivers. Engineer Danylo Piliaiev noted their success in ensuring D3D11/12/OpenGL games render flawlessly. This work, including contributions to graphics compilers, benefits the wider open-source community.\n\nFurther, Igalia engineers actively contribute to the Khronos Group, developing Vulkan standards, extensions, and ensuring compliance through millions of Conformance Test Suite (CTS) tests. They also implemented robust continuous integration testing to prevent rendering regressions.\n\nBeyond graphics, Igalia's Changwoo Min developed LAVD, a Rust-based, energy-efficient CPU scheduler vital for the battery-powered Steam Frame. Melissa Wen improved AMD kernel display drivers for enhanced color management and HDR on the Steam Deck and Machine.\n\nValve's commitment to open software like Mesa3D Turnip and FEX ensures these advancements benefit the entire Linux gaming ecosystem, with Igalia continuing to drive improvements for SteamOS.",
    "chinese_title": "助力Valve为Steam设备供电",
    "chinese_summary": "Igalia详细阐述了其对Valve新发布的Steam设备的广泛贡献：基于ARM的Steam Frame VR头显、Steam Machine主机和Steam控制器。他们在SteamOS上的工作对这些设备至关重要，特别是对Frame。\n\n对于ARM驱动的Steam Frame，Igalia实施并完善了FEX转译层，通过转换机器码使x86 PC游戏能够在ARM芯片上运行。正如工程师Paulo Matos所解释的，这个极具挑战性的过程通常需要大量的手动调试。\n\nIgalia还显著增强了Mesa3D Turnip，这是一个用于高通Adreno GPU的FOSS Vulkan驱动。他们增加了对Adreno 700系列GPU的支持，以及LRZ等关键优化和众多Vulkan扩展，与专有驱动相比，实现了卓越的正确性和性能。工程师Danylo Piliaiev指出，他们成功确保了D3D11/12/OpenGL游戏能够完美渲染。这项工作，包括对图形编译器的贡献，造福了更广泛的开源社区。\n\n此外，Igalia工程师积极贡献于Khronos Group，开发Vulkan标准、扩展，并通过数百万次一致性测试套件（CTS）测试确保合规性。他们还实施了强大的持续集成测试，以防止渲染退步。\n\n除了图形方面，Igalia的Changwoo Min开发了LAVD，这是一款基于Rust、能效高的CPU调度器，对电池供电的Steam Frame至关重要。Melissa Wen改进了AMD内核显示驱动程序，以增强Steam Deck和Steam Machine上的色彩管理和HDR。\n\nValve对Mesa3D Turnip和FEX等开源软件的承诺，确保了这些进步造福于整个Linux游戏生态系统，而Igalia将继续推动SteamOS的改进。"
  },
  {
    "id": "46006016",
    "title": "Show HN: Wealthfolio 2.0- Open source investment tracker. Now Mobile and Docker",
    "url": "https://wealthfolio.app/?v=2.0",
    "summary": "Wealthfolio 2.0 is an open-source, privacy-first investment tracker designed for individuals to manage their wealth across Desktop, Mobile, and Web platforms. Emphasizing security and transparency, it runs locally, ensuring user data never leaves their device. The application is free to use, offering an optional one-time payment instead of subscriptions.\n\nIt provides a comprehensive suite of features, including accounts aggregation with CSV import functionality, a clear holdings overview for stocks, ETFs, and cryptocurrencies, and a performance dashboard to compare accounts against market benchmarks. Users can track dividend and interest income, monitor individual account performance over time, and set and track financial goals.\n\nAdditionally, Wealthfolio helps manage contribution limits for tax-advantaged accounts (like IRAs, 401(k)s, TFSAs) to prevent over-contribution. The platform is also extensible, offering add-ons such as an Investment Fees Tracker, Goal Progress Tracker, and Stock Trading Tracker. It aims to replace messy spreadsheets with a secure, beautifully crafted, and personal wealth management solution.",
    "chinese_title": "HN 展示：Wealthfolio 2.0 — 开源投资追踪器。现已支持移动端和 Docker。",
    "chinese_summary": "Wealthfolio 2.0是一款开源、隐私优先的投资追踪器，旨在帮助个人跨桌面、移动和网络平台管理财富。它强调安全性与透明度，在本地运行，确保用户数据永不离开其设备。该应用程序免费使用，提供可选的一次性付款而非订阅制。\n\n它提供一套全面的功能，包括带有CSV导入功能的账户聚合、清晰的股票、ETF和加密货币持仓概览，以及用于将账户与市场基准进行比较的业绩仪表盘。用户可以追踪股息和利息收入，监控个人账户的长期表现，以及设定并追踪财务目标。\n\n此外，Wealthfolio有助于管理税收优惠账户（如IRA、401(k)、TFSA）的供款限额，以防止超额供款。该平台还具有可扩展性，提供诸如投资费用追踪器、目标进度追踪器和股票交易追踪器等附加组件。它的目标是用一个安全、精美且个性化的财富管理解决方案来取代杂乱的电子表格。"
  },
  {
    "id": "46009894",
    "title": "Personal blogs are back, should niche blogs be next?",
    "url": "https://disassociated.com/personal-blogs-back-niche-blogs-next/",
    "summary": "The article proposes that following the current revival of personal blogs, a resurgence of niche blogs should be the next step. It harks back to the \"golden age\" of blogging, where specialized sites like Darren Rowse's Problogger exemplified successful, focused content, often with commercial aims. Niche blogs were valued for establishing author expertise and aiding search engine visibility.\n\nWhile acknowledging that not all successful blogs need a singular niche, the author notes that commercial blogging advice often didn't apply to personal sites. Today, despite social media's dominance, a \"backlash\" and the growth of the IndieWeb/SmallWeb community are driving a comeback for personal, largely non-commercial websites.\n\nThe author argues this revival should extend to *quality, topic-focused niche blogs*. This is presented as a vital countermeasure against the rising tide of misinformation on social media and \"AI slop.\" These new niche blogs should be independently produced by writers passionate about their subjects, offering reliable and accurate information. The piece emphasizes the importance of finding ethical ways to compensate writers without compromising the reader experience with intrusive ads, learning from past monetization strategies. Ultimately, restoring accessible and trusted niche information is presented as the next crucial step for rebuilding a vibrant web.",
    "chinese_title": "个人博客回归，小众博客会是下一个热潮吗？",
    "chinese_summary": "文章提出，继当前个人博客复兴之后，利基博客的再度崛起应是下一步。这让人回想起博客的“黄金时代”，当时像Darren Rowse的Problogger这类专业网站，是成功、专注内容（常带有商业目的）的典范。利基博客因其能确立作者的专业性并有助于提高搜索引擎可见度而备受重视。\n\n作者承认并非所有成功的博客都需要单一的利基市场，但也指出商业博客建议通常不适用于个人网站。如今，尽管社交媒体占据主导地位，但一场“反弹”以及独立网络/小型网络社区的发展，正在推动个人（大多是非商业性）网站的回归。\n\n作者认为，这种复兴应延伸到高质量、专注于特定主题的利基博客。这被视为对抗社交媒体上日益增长的虚假信息和“AI垃圾内容”的关键对策。这些新型利基博客应由对主题充满热情的作者独立创作，提供可靠、准确的信息。文章强调，在不以侵入性广告损害读者体验的前提下，寻找道德的方式来补偿作者的重要性，并应从过去的盈利策略中吸取经验。最终，恢复可访问且值得信赖的利基信息，被认为是重建充满活力的网络的下一个关键步骤。"
  },
  {
    "id": "46003778",
    "title": "How a French judge was digitally cut off by the USA",
    "url": "https://www.heise.de/en/news/How-a-French-judge-was-digitally-cut-off-by-the-USA-11087561.html",
    "summary": "A French judge, David de Pas, investigating bribery allegations against the French multinational Alstom for contracts in Asia, faced significant obstruction from the United States, effectively cutting off his access to crucial digital evidence. While de Pas pursued a parallel investigation, the US Department of Justice (DOJ) also investigated Alstom, ultimately imposing a $772 million fine and imprisoning executives.\n\nDe Pas urgently needed access to emails and documents stored on Microsoft servers in the US to advance the French inquiry. However, the US Department of State intervened, explicitly forbidding Microsoft from providing the data to French authorities. Citing US sovereignty and the potential impact on their own ongoing investigation, the US threatened Microsoft with legal consequences if they complied with the French judicial assistance request, using secrecy orders to block access.\n\nThis action highlighted the extraterritorial reach of US law, preventing the French investigation from obtaining vital evidence. Even before the CLOUD Act, the US asserted jurisdiction over data held by US companies, regardless of its physical location. This maneuver effectively crippled the French probe into high-level individuals involved in the Alstom corruption scandal. The article underscores how US legal frameworks can impede the justice systems of allied nations, particularly regarding digital evidence and conflicting legal jurisdictions in the modern era.",
    "chinese_title": "法国法官如何被美国数字切断",
    "chinese_summary": "法国法官戴维·德·帕（David de Pas）在调查法国跨国公司阿尔斯通（Alstom）在亚洲合同中的贿赂指控时，遭遇了美国的严重阻挠，这有效地切断了他获取关键数字证据的途径。在德·帕进行平行调查的同时，美国司法部（DOJ）也对阿尔斯通进行了调查，最终处以7.72亿美元的罚款并监禁了高管。\n\n德·帕迫切需要访问存储在美国微软服务器上的电子邮件和文件，以推进法国的调查。然而，美国国务院介入，明确禁止微软向法国当局提供这些数据。美国援引其主权以及对自身正在进行的调查可能产生的影响，威胁微软称，如果其遵守法国的司法协助请求，将面临法律后果，并使用保密令阻止访问。\n\n此举凸显了美国法律的域外管辖权，阻止了法国调查获取重要证据。甚至在《云法案》（CLOUD Act）出台之前，美国就主张对美国公司持有的数据拥有管辖权，无论其物理位置何处。这一策略有效地削弱了法国对阿尔斯通腐败丑闻中涉案高层人员的调查。本文强调了美国法律框架如何阻碍盟国司法系统的运作，尤其是在现代数字证据和冲突的法律管辖权方面。"
  },
  {
    "id": "46005111",
    "title": "We should all be using dependency cooldowns",
    "url": "https://blog.yossarian.net/2025/11/21/We-should-all-be-using-dependency-cooldowns",
    "summary": "The article strongly advocates for the widespread use of \"dependency cooldowns\" as a free, easy, and highly effective strategy to mitigate the majority of open source supply chain attacks. It posits that while supply chain security is a serious issue, many commercial solutions are overhyped.\n\nThe core argument is based on the typical structure of these attacks: an attacker compromises a project, uploads malicious code, and then has a limited \"window of opportunity\" (often hours to days) before the compromise is detected and addressed by security vendors and upstream registries.\n\nA dependency cooldown is a specified waiting period—for instance, 7 days—between when a new version of a dependency is published and when it's considered suitable for use by a project. This delay allows security tools and human review to identify and report malicious updates before they are automatically adopted. Empirical data from recent attacks (e.g., xz-utils, Ultralytics, tj-actions) shows that most have exploitation windows under a week; a 7-day cooldown would have prevented the vast majority of these from reaching end-users.\n\nCooldowns are simple and often free to implement using tools like Dependabot or Renovate, or through features in some package managers. Beyond their proven effectiveness (offering an 80-90% reduction in exposure), they also incentivize security vendors to focus on rapid, impactful detection. While not a complete solution, cooldowns offer a significant risk reduction for minimal effort, and the author suggests package managers should integrate them directly.",
    "chinese_title": "我们都应该使用依赖项冷却时间。",
    "chinese_summary": "文章强烈主张广泛采用“依赖项冷却期”，认为它是一种免费、简单且高效的策略，能够缓解绝大多数开源供应链攻击。文章指出，尽管供应链安全是一个严重问题，但许多商业解决方案被过度吹嘘。\n\n其核心论点基于这类攻击的典型结构：攻击者入侵一个项目，上传恶意代码，然后在安全供应商和上游注册表检测并解决该漏洞之前，会有一个有限的“机会窗口”（通常是数小时到数天）。\n\n依赖项冷却期是指从依赖项新版本发布到项目认为其适合使用之间的一个指定等待期，例如7天。这种延迟使得安全工具和人工审查能够在恶意更新被自动采用之前识别并报告它们。来自近期攻击（例如xz-utils、Ultralytics、tj-actions）的经验数据表明，大多数攻击的利用窗口期都不到一周；7天的冷却期本可以阻止绝大多数此类攻击触达最终用户。\n\n冷却期实现起来很简单，通常可以使用Dependabot或Renovate等工具，或通过某些包管理器中的功能免费实现。除了其已证实的有效性（可将风险暴露降低80-90%），它们还激励安全供应商专注于快速、有影响力的检测。尽管不是一个完整的解决方案，但冷却期以最小的努力提供了显著的风险降低，作者建议包管理器应直接集成它们。"
  },
  {
    "id": "46001889",
    "title": "Olmo 3: Charting a path through the model flow to lead open-source AI",
    "url": "https://allenai.org/blog/olmo3",
    "summary": "Olmo 3 represents a significant open-source initiative, emphasizing access to the *entire model flow* – every stage, checkpoint, dataset, and dependency – rather than just final model weights. This comprehensive approach aims to foster trust, enable deep customization, and accelerate AI research by allowing users to inspect, adapt, and extend models at any point in their development lifecycle.\n\nThe Olmo 3 family includes compact, dense models (7B and 32B parameters) across several specialized variants:\n*   **Olmo 3-Base:** A powerful base model (7B, 32B) offering state-of-the-art performance among fully open models and competitive results with leading open-weight counterparts in math, code, and reading comprehension. It supports extended context lengths.\n*   **Olmo 3-Think:** The flagship reasoning model (7B, 32B) designed for advanced experiments. It enables inspection of intermediate reasoning traces and demonstrates strong performance on reasoning benchmarks, often matching or exceeding comparable open-weight models.\n*   **Olmo 3-Instruct:** A 7B model optimized for chat, instruction-following, and tool use, matching or outperforming several open-weight models.\n*   **Olmo 3-RL Zero:** A 7B model providing a fully open reinforcement learning pathway for research and benchmarking.\n\nOlmo 3 utilizes a multi-stage training pipeline and specific post-training recipes (SFT, DPO, RLVR) for each pathway. All components – including expanded, high-quality training data, code, and model weights – are released under permissive open-source licenses, promoting full transparency and empowering the community to build their own AI systems.",
    "chinese_title": "Olmo 3: 规划模型流程路径，引领开源人工智能",
    "chinese_summary": "Olmo 3 代表着一项重要的开源举措，强调可访问“完整的模型流”——包括每一个阶段、检查点、数据集和依赖项——而不仅仅是最终的模型权重。这种全面的方法旨在培养信任、实现深度定制并加速人工智能研究，通过允许用户在其开发生命周期的任何阶段检查、调整和扩展模型。\n\nOlmo 3 系列包括紧凑、密集型模型（70亿和320亿参数），涵盖了多种专用变体：\n*   **Olmo 3-Base：** 一个功能强大的基础模型（70亿、320亿参数），在完全开源模型中提供最先进的性能，并在数学、编程和阅读理解方面与领先的开源权重模型具有竞争力。它支持扩展的上下文长度。\n*   **Olmo 3-Think：** 旗舰推理模型（70亿、320亿参数），专为高级实验设计。它支持检查中间推理痕迹，并在推理基准测试中表现出强大的性能，经常达到或超过同类开源权重模型。\n*   **Olmo 3-Instruct：** 一个70亿参数模型，针对聊天、指令遵循和工具使用进行了优化，达到或超越了多个开源权重模型。\n*   **Olmo 3-RL Zero：** 一个70亿参数模型，为研究和基准测试提供了一个完全开放的强化学习路径。\n\nOlmo 3 利用多阶段训练管道和针对每条路径的特定后训练配方（SFT、DPO、RLVR）。所有组件——包括扩展的高质量训练数据、代码和模型权重——均在宽松的开源许可下发布，以促进完全透明并赋能社区构建自己的人工智能系统。"
  },
  {
    "id": "46005553",
    "title": "Arduino published updated terms and conditions: no longer an open commons",
    "url": "https://www.molecularist.com/2025/11/did-qualcomm-kill-arduino-for-good.html",
    "summary": "Qualcomm's recent acquisition of Arduino has led to updated terms and conditions that have deeply concerned the maker community, signaling an end to Arduino's open commons ethos. The new terms introduce standard corporate provisions like mandatory arbitration, data integration with Qualcomm’s ecosystem, export controls, AI use restrictions, and critically, explicitly state that using the platform grants no patent licenses whatsoever, and forbid reverse engineering \"the Platform.\"\n\nThis directly conflicts with Arduino's open-source IDE (AGPL) and CLI (GPL v3), creating significant legal uncertainty for library contributors and \"Arduino-compatible\" hardware makers. The community speculates whether this is bad lawyering, a test, or a deliberate move to lock down the ecosystem, particularly given the ambiguity of \"the Platform\" (cloud services versus core tools).\n\nAdafruit, a respected leader in open hardware, emphasizes that Qualcomm misunderstands Arduino's true value. Arduino isn't just an IoT hardware company; it's the \"IBM PC of the maker world\" – a foundational standard and the lingua franca for hobby electronics, supporting a vast ecosystem of libraries, tutorials, and educational programs. Applying restrictive enterprise legal frameworks to this commons risks poisoning the entire maker ecosystem, stranding decades of institutional knowledge, and making electronics inaccessible for new makers, as there are no equally beginner-friendly alternatives.\n\nWhile possibly stemming from corporate legal standardization rather than malice, this tone-deafness has eroded trust. To salvage the situation, Qualcomm must explicitly clarify that the restrictive terms apply only to cloud services, unequivocally protect the open-source IDE, CLI, and core libraries under their existing licenses, and ideally, establish a foundation or community governance model. The coming months will reveal whether Arduino survives as an open commons or becomes another corporate platform.",
    "chinese_title": "Arduino发布了更新的条款和条件：不再是开放共享",
    "chinese_summary": "高通最近收购Arduino后，更新的条款和条件引起了创客社区的深切关注，预示着Arduino开放共享精神的终结。新条款引入了标准的企业规定，如强制仲裁、与高通生态系统的数据整合、出口管制、AI使用限制，以及关键性的明确声明：使用该平台不授予任何专利许可，并禁止对“该平台”进行逆向工程。\n\n这直接与Arduino的开源IDE（AGPL）和CLI（GPL v3）冲突，给库贡献者和“Arduino兼容”硬件制造商带来了重大的法律不确定性。社区猜测这究竟是律师业务不精、一次试探，还是旨在锁定生态系统的蓄意举动，尤其考虑到“该平台”的模糊定义（是指云服务还是核心工具）。\n\n开放硬件领域的知名领导者Adafruit强调，高通误解了Arduino的真正价值。Arduino不仅仅是一家物联网硬件公司；它是“创客世界的IBM PC”——一个基础标准，也是业余电子领域的通用语言，支持着庞大的库、教程和教育项目生态系统。将限制性企业法律框架应用于这一共享领域，可能会毒害整个创客生态系统，使得数十年的机构知识陷入困境，并让新创客无法接触到电子技术，因为目前没有同样对初学者友好的替代方案。\n\n尽管这可能源于企业法律标准化而非恶意，但这种迟钝的做法已经侵蚀了信任。为挽救局面，高通必须明确澄清限制性条款仅适用于云服务，明确无误地保护其现有许可下的开源IDE、CLI和核心库，理想情况下，还应建立一个基金会或社区治理模式。未来几个月将揭示Arduino是作为开放共享平台幸存下来，还是沦为另一个企业平台。"
  },
  {
    "id": "45999038",
    "title": "Over-regulation is doubling the cost",
    "url": "https://rein.pk/over-regulation-is-doubling-the-cost",
    "summary": "The author, a former software entrepreneur now building \"hardtech\" companies Charm Industrial (carbon removal) and Revoy (electric trucking), argues that over-regulation and bureaucracy are doubling costs and stifling innovation in the US. He asserts that regulatory bottlenecks account for over half his companies' expenses, delaying climate solutions, raising consumer costs, and actively working against environmental improvement.\n\nCharm Industrial, which injects bio-oil to remove CO2, faced a four-year delay merely to determine the correct permit type, leading to a 5.5-year permitting process. This delay cost Charm $90 million in lost operational time and imposed an estimated $300 million societal burden in healthcare costs due to continued pollution.\n\nSimilarly, Revoy's electric \"converter dolly\" for semi-trucks, designed to cut fuel consumption by 94%, encountered years of delay in classification across agencies. One state agency demanded $27 million in testing to prove the device, designed to *reduce* emissions, wasn't *increasing* them—a cost the author deems wasteful and counterproductive.\n\nThe author attributes these issues to a regulatory system plagued by over-specificity, understaffing, and a fear of legal challenges, leading to a culture of ultra-caution where \"no\" is the default for new technologies. He advocates for simplifying regulations, empowering and trusting regulators, limiting activist lawsuits, and implementing expedited reviews and \"permits by right\" to unleash innovation, improve the environment, and bolster US manufacturing.",
    "chinese_title": "过度监管导致成本翻番",
    "chinese_summary": "作者曾是一名软件企业家，现在正在创建“硬科技”公司：Charm Industrial（碳清除）和Revoy（电动卡车运输）。他认为，过度监管和官僚作风使美国的成本翻倍，并扼杀了创新。他断言，监管瓶颈占了他公司一半以上的开支，延迟了气候解决方案，提高了消费者成本，并积极阻碍了环境改善。\n\nCharm Industrial通过注入生物油来去除二氧化碳，仅仅为了确定正确的许可证类型就面临了四年的延迟，导致整个许可过程长达5.5年。这一延迟使Charm损失了9000万美元的运营时间，并因持续污染造成了估计3亿美元的社会医疗负担。\n\n同样，Revoy为半挂卡车设计的电动“转换拖车”，旨在将燃油消耗降低94%，在跨机构分类方面遭遇了数年的延迟。一个州机构要求进行2700万美元的测试，以证明这个旨在“减少”排放的设备并没有“增加”排放——作者认为这笔费用是浪费且适得其反的。\n\n作者将这些问题归因于一个充斥着过度具体、人员不足和对法律挑战的恐惧的监管体系，这导致了一种极度谨慎的文化，对新技术而言，“不”是默认答案。他主张简化法规，赋权并信任监管机构，限制激进主义诉讼，并实施快速审查和“权利许可”，以释放创新，改善环境，并支持美国制造业。"
  },
  {
    "id": "45997212",
    "title": "New OS aims to provide (some) compatibility with macOS",
    "url": "https://github.com/ravynsoft/ravynos",
    "summary": "ravynOS is a new open-source operating system project designed to provide a macOS-like experience and compatibility on x86-64 and eventually ARM systems. Built on the robust FreeBSD foundation, it aims for source compatibility with macOS applications, allowing them to be compiled and run on ravynOS.\n\nKey design goals include a familiar macOS-style GUI and UX (e.g., top menu bar, file manager), compatibility with macOS folder layouts (/Library, /System, /Users), and potential support for HFS+ and APFS filesystems, alongside full ZFS support. It promotes an installer-less application experience through App Bundles, AppDirs, and AppImage files. ravynOS also maintains compatibility with the FreeBSD base system and X11, offering a standard Unix environment, and supports Linux binaries via FreeBSD's built-in capabilities. A future objective is direct compatibility with x86-64/arm64 macOS binaries (Mach-O) and libraries. The project prioritizes being pleasant to use, secure, stable, and performant.\n\nFurther information, screenshots, and contribution details are available on ravynos.com and through their community channels. The underlying FreeBSD is a continuously developed operating system, over 30 years old, widely used for servers, desktops, and embedded platforms, noted for its advanced networking, security, and storage features.",
    "chinese_title": "新系统旨在部分兼容 macOS",
    "chinese_summary": "ravynOS 是一个全新的开源操作系统项目，旨在 x86-64 和最终 ARM 系统上提供类似 macOS 的体验和兼容性。它基于强大的 FreeBSD 基础构建，旨在实现与 macOS 应用程序的源代码兼容性，使其能够在 ravynOS 上编译和运行。\n\n主要设计目标包括熟悉的 macOS 风格 GUI 和用户体验（例如，顶部菜单栏、文件管理器）、与 macOS 文件夹布局（/Library、/System、/Users）的兼容性，以及对 HFS+ 和 APFS 文件系统的潜在支持，同时全面支持 ZFS。它通过 App Bundles、AppDirs 和 AppImage 文件推广免安装的应用程序体验。ravynOS 还保持与 FreeBSD 基础系统和 X11 的兼容性，提供标准的 Unix 环境，并通过 FreeBSD 内置功能支持 Linux 二进制文件。未来的目标是直接兼容 x86-64/arm64 macOS 二进制文件（Mach-O）和库。该项目优先考虑易用性、安全性、稳定性和高性能。\n\n更多信息、屏幕截图和贡献详情可在 ravynos.com 及其社区渠道获取。其底层 FreeBSD 是一个持续开发的操作系统，拥有超过 30 年的历史，广泛用于服务器、桌面和嵌入式平台，以其先进的网络、安全和存储功能而闻名。"
  },
  {
    "id": "46006082",
    "title": "You can make PS2 games in JavaScript",
    "url": "https://jslegenddev.substack.com/p/you-can-now-make-ps2-games-in-javascript",
    "summary": "The article introduces PS2.JS, a JavaScript-based engine that empowers web developers to create games mimicking the distinct aesthetic and feel of the PlayStation 2 era. Built upon the popular Three.js library, PS2.JS isn't designed to emulate an actual PS2 console, but rather to reproduce the visual characteristics common in late 90s and early 2000s console games.\n\nKey features include support for low-poly models, pixelated textures, fixed camera perspectives, and specific lighting styles, allowing developers to craft experiences reminiscent of early 3D console titles. The project aims to make game development more accessible to JavaScript developers, enabling them to leverage their existing skills to quickly prototype and build retro-inspired games. These games run directly in a web browser, offering a unique way to explore nostalgic game design without the need for complex game engines or low-level programming. PS2.JS focuses on capturing the \"vibe\" and stylistic limitations of the era, providing a fresh avenue for creative expression within the browser environment.",
    "chinese_title": "你可以用 JavaScript 制作 PS2 游戏",
    "chinese_summary": "本文介绍了PS2.JS，一个基于JavaScript的引擎，它使网页开发者能够创建模仿PlayStation 2时代独特美学和感觉的游戏。PS2.JS建立在流行的Three.js库之上，其设计目的并非模拟真实的PS2主机，而是重现90年代末和2000年代初主机游戏中常见的视觉特征。\n\n其主要特性包括支持低多边形模型、像素化纹理、固定摄像机视角和特定的光照风格，使开发者能够打造出让人回想起早期3D主机游戏体验的作品。该项目旨在降低JavaScript开发者进行游戏开发的门槛，使他们能够利用现有技能快速原型设计并构建复古风格的游戏。这些游戏直接在网页浏览器中运行，提供了一种独特的方式来探索怀旧游戏设计，而无需复杂的游戏引擎或底层编程。PS2.JS专注于捕捉那个时代的“氛围”和风格限制，为在浏览器环境中进行创意表达提供了一条新途径。"
  },
  {
    "id": "46012328",
    "title": "Original Superman comic becomes the highest-priced comic book ever sold",
    "url": "https://www.bbc.com/news/articles/c8e9rp0knj6o",
    "summary": "An original copy of Superman #1, a June 1939 first edition, has become the highest-priced comic book ever sold, fetching $9.12 million (£7m) at auction by Texas-based Heritage Auctions.\n\nThe remarkably pristine comic, graded 9.0 on a 10-point scale by CGC, was discovered last Christmas by three brothers cleaning out their late mother's California loft. They found it, along with five other comics, in a cardboard box under old newspapers. Their mother had acquired the collection between the Great Depression and World War Two and had often told her sons about her valuable comics, though she never showed them. The cool northern California climate was cited as crucial for the comic's exceptional preservation.\n\nThe sale price easily surpassed the previous record of $6 million, held by Action Comics No. 1 (1938), which first introduced Superman and sold last year. Heritage Auctions hailed the sale as the \"pinnacle of comic collecting.\" The youngest brother described the find as a \"testament to memory, family and the unexpected ways the past finds its way back to us.\"",
    "chinese_title": "《超人》创刊号漫画成为史上售价最高的漫画书",
    "chinese_summary": "一本1939年6月第一版的《超人 #1》原版漫画，在位于德克萨斯州的传统拍卖行（Heritage Auctions）举办的拍卖会上以912万美元（约合700万英镑）的价格成交，成为有史以来售价最高的漫画书。\n\n这本品相极佳的漫画，经CGC（漫画鉴评公司）评级，在10分制中获得9.0分。去年圣诞节，三兄弟在清理他们已故母亲位于加利福尼亚的阁楼时发现了它。他们在一个旧报纸下面的纸箱里找到了它，同时还有另外五本漫画。他们的母亲在大萧条和第二次世界大战之间收藏了这些漫画，并经常告诉儿子们她拥有珍贵的漫画，尽管从未展示给他们看。凉爽的北加州气候被认为是这本漫画得以非凡保存的关键。\n\n此次售价轻松超越了此前由《动作漫画 #1》（1938年）保持的600万美元纪录，这本首次引入超人的漫画于去年售出。传统拍卖行（Heritage Auctions）称此次拍卖是“漫画收藏的巅峰”。最小的弟弟形容这次发现是“对记忆、家庭以及过去以意想不到的方式回归我们的证明”。"
  },
  {
    "id": "45999622",
    "title": "Prozac 'no better than placebo' for treating children with depression, experts",
    "url": "https://www.theguardian.com/society/2025/nov/20/prozac-no-better-than-placebo-for-treating-children-with-depression-experts-say",
    "summary": "A new meta-analysis of 12 trials conducted by academics in Austria and the UK concludes that Prozac (fluoxetine) is clinically no better than a placebo for treating depression in children and adolescents. Published in the Journal of Clinical Epidemiology, the study found that any improvement in depressive symptoms from fluoxetine was too small to be considered clinically meaningful.\n\nThis finding leads experts to argue that current clinical guidelines in the UK, US, and Canada should change, as they presently recommend antidepressants like Prozac for under-18s with moderate to severe depression, often alongside therapy. The authors suggest an initial \"novelty bias\" might have inflated early trial results, with later studies failing to confirm these effects.\n\nGiven the lack of clinical benefit over placebo, experts like co-author Mark Horowitz state that exposing young people to a drug with known side effects—including weight gain, sleep disturbance, concentration problems, and increased suicidal ideation—is unjustifiable. They urge clinicians to focus on understanding and addressing the underlying causes of depression.\n\nThe National Institute for Health and Care Excellence (Nice) responded by emphasizing that psychological therapies are first-line treatments for young people, and antidepressants are only considered for moderate to severe cases under specialist supervision. However, Prof Allan Young of the Royal College of Psychiatrists advised caution in interpreting the study, noting that guidelines consider multiple factors beyond just average effect size.",
    "chinese_title": "专家称，百忧解治疗儿童抑郁症“不比安慰剂强”。",
    "chinese_summary": "奥地利和英国学者进行的一项新的12项试验荟萃分析得出结论，百忧解（氟西汀）在临床上治疗儿童和青少年抑郁症方面不优于安慰剂。这项发表在《临床流行病学杂志》上的研究发现，氟西汀对抑郁症状的任何改善都微乎其微，不具有临床意义。\n\n这一发现促使专家们主张，英国、美国和加拿大当前的临床指南应进行修改，因为这些指南目前推荐百忧解等抗抑郁药用于18岁以下中度至重度抑郁症患者，通常还会伴随心理治疗。作者认为，最初的“新颖性偏倚”可能夸大了早期试验结果，而后续研究未能证实这些效果。\n\n鉴于相对于安慰剂缺乏临床益处，共同作者马克·霍洛维茨等专家指出，让年轻人接触一种已知具有副作用——包括体重增加、睡眠障碍、注意力不集中和自杀意念增加——的药物是不合理的。他们敦促临床医生专注于理解和解决抑郁症的根本原因。\n\n英国国家健康与护理优化研究所（Nice）回应称，强调心理疗法是青少年的一线治疗方法，抗抑郁药仅在专家监督下对中度至重度病例才予以考虑。然而，英国皇家精神科医师学院的艾伦·杨教授建议谨慎解读这项研究，指出指南在制定时会考虑平均效应量之外的多种因素。"
  },
  {
    "id": "45999842",
    "title": "Homeschooling hits record numbers",
    "url": "https://reason.com/2025/11/19/homeschooling-hits-record-numbers/",
    "summary": "Homeschooling in the U.S. is experiencing record growth, expanding at 5.4% in 2024-2025, nearly triple its pre-pandemic rate of 2%. This trend, initially supercharged by COVID-19 school closures and dissatisfaction with remote learning, has persisted and even accelerated, with over a third of states reporting their highest homeschooling numbers ever. Experts like Angela Watson of Johns Hopkins note this represents a \"fundamental shift\" in American education, not merely a \"pandemic hangover.\" The total homeschooling population now accounts for approximately 6% of students nationwide, doubling from about 3% pre-pandemic.\n\nThis surge is part of a broader movement away from traditional public schools towards non-public alternatives. Research indicates public schools could lose millions of students by mid-century if current trends continue. The primary driver for this shift is growing parental dissatisfaction with public K-12 education, which 59% of parents believe is heading in the wrong direction – a decade high. Public school parents consistently report lower satisfaction than those choosing private schools, homeschooling, or charter schools.\n\nReasons for this discontent include perceived rigidity, politicization of curriculum, declining learning outcomes, and frustration over pandemic-era policies and remote learning competence. Homeschooling, with a 70% favorability rating among all parents, offers a customizable alternative. The trend shows strong resilience, with even states that experienced brief dips now reporting double-digit growth, cementing homeschooling's status as an increasingly popular and mainstream educational option.",
    "chinese_title": "在家教育人数创历史新高",
    "chinese_summary": "美国家庭教育正经历创纪录的增长，2024-2025学年增长率为5.4%，几乎是疫情前2%增长率的三倍。这一趋势最初由COVID-19学校停课和对远程学习的不满所推动，此后持续存在并甚至加速，超过三分之一的州报告其家庭教育人数达到历史新高。约翰霍普金斯大学的安吉拉·沃森等专家指出，这代表着美国教育的“根本性转变”，而不仅仅是“疫情的遗留影响”。目前，全国家庭教育学生总数约占学生总数的6%，是疫情前约3%的两倍。\n\n这一激增是更广泛的趋势的一部分，即从传统的公立学校转向非公立的替代方案。研究表明，如果当前趋势持续下去，到本世纪中叶公立学校可能流失数百万学生。这一转变的主要驱动因素是家长对公立K-12教育日益增长的不满，59%的家长认为公立教育正朝着错误的方向发展——这是十年来最高比例。公立学校的家长满意度始终低于选择私立学校、家庭教育或特许学校的家长。\n\n这种不满的原因包括感知到的僵化、课程的政治化、学习成果的下降，以及对疫情期间政策和远程学习能力的沮丧。家庭教育在所有家长中拥有70%的支持率，提供了一种可定制的替代方案。这一趋势显示出强大的韧性，即使是曾短暂下降的州现在也报告了两位数的增长，这巩固了家庭教育作为一种日益流行和主流教育选择的地位。"
  },
  {
    "id": "46013935",
    "title": "Agent design is still hard",
    "url": "https://lucumr.pocoo.org/2025/11/21/agents-are-hard/",
    "summary": "Armin Ronacher shares insights on the continued challenges of agent design. He advises against higher-level SDKs like Vercel AI SDK, advocating for direct platform SDKs (e.g., Anthropic, OpenAI) to maintain control over significant model differences, tool integration, and caching.\n\nExplicit cache management, exemplified by Anthropic's approach, is preferred for its predictability and control, enabling strategies like conversation splitting and context editing. Reinforcement within the agent loop is crucial for guiding the agent, reminding it of objectives, providing failure hints, and relaying state changes.\n\nFailures should be isolated, often by running iterative tasks in subagents and reporting only successes or summarized failed approaches. A shared virtual file system is essential for agents relying on code execution and generation, allowing different tools and subagents to seamlessly share data and prevent \"dead ends.\"\n\nDedicated output tools for user communication (e.g., emails) present challenges, as steering their tone is difficult, and sub-LLMs for this purpose increase latency and reduce quality. Model choice is critical: Haiku and Sonnet are favored for main agent loops due to superior tool calling, while Gemini 2.5 is strong for summarization and image extraction. Testing and evaluation remain the most difficult aspect, requiring instrumented test runs rather than external systems. Ronacher also notes trialing Amp for its well-designed sub-agent interactions and the trend of AI-generated utilities replacing small open-source libraries.",
    "chinese_title": "智能体设计仍然很难",
    "chinese_summary": "阿明·罗纳赫 (Armin Ronacher) 分享了他对代理设计持续挑战的见解。他建议不要使用 Vercel AI SDK 等高级别 SDK，而是提倡直接使用平台 SDK（例如 Anthropic、OpenAI），以便更好地控制显著的模型差异、工具集成和缓存。Anthropic 采用的显式缓存管理方法因其可预测性和可控性而备受推崇，它支持对话拆分和上下文编辑等策略。代理循环内的强化对于指导代理、提醒其目标、提供失败提示以及传递状态变化至关重要。故障应该被隔离，通常通过在子代理中运行迭代任务，并且只报告成功或总结失败的方法。对于依赖代码执行和生成的代理来说，共享虚拟文件系统至关重要，它能让不同的工具和子代理无缝共享数据，并防止“死胡同”。用于用户通信（例如电子邮件）的专用输出工具面临挑战，因为很难控制其语气，而且为此目的使用子大型语言模型会增加延迟并降低质量。模型选择至关重要：Haiku 和 Sonnet 因其卓越的工具调用能力而受到主代理循环的青睐，而 Gemini 2.5 在总结和图像提取方面表现出色。测试和评估仍然是最困难的方面，它需要进行内嵌检测的测试运行，而不是依赖外部系统。罗纳赫还提到正在试用 Amp，因为它拥有精心设计的子代理交互功能，并且注意到人工智能生成的实用工具正在取代小型开源库的趋势。"
  },
  {
    "id": "46009994",
    "title": "California DMV approves map increase in Waymo driverless operations",
    "url": "https://www.dmv.ca.gov/portal/vehicle-industry-services/autonomous-vehicles/autonomous-vehicle-testing-permit-holders/waymo-approved-areas-of-operation-for-driverless-testing-and-deployment/",
    "summary": "The California Department of Motor Vehicles (DMV) has approved a significant expansion of Waymo's driverless testing and deployment operations across California. This authorization permits Waymo to operate fully autonomous vehicles in all approved operational design domains (ODDs) throughout the state.\n\nWaymo's approved fleet for these operations includes the Jaguar I-Pace (2021 and 2024 models) and the Zeekr RT (2022 and 2025 models). These vehicles are cleared to operate at all times of day and night, under various conditions including rain and fog, and at all speeds.\n\nThe core of this approval is the vast increase in Waymo's operational map. The expanded ODDs encompass numerous cities and counties across California. This includes extensive coverage in Alameda, Contra Costa, Los Angeles, Marin, Napa, Orange, Riverside, Sacramento, San Bernardino, San Diego, San Francisco, San Mateo, Santa Clara, Santa Cruz, Solano, Sonoma, Ventura, and Yolo counties. This widespread geographical approval marks a substantial advancement for Waymo's autonomous vehicle services and development in California.",
    "chinese_title": "加州DMV批准Waymo无人驾驶运营扩大地图范围",
    "chinese_summary": "加州机动车辆管理局（DMV）已批准Waymo在加州大幅扩张其无人驾驶测试和部署业务。此授权允许Waymo在全州所有已批准的运营设计域（ODD）内运行全自动驾驶车辆。\n\nWaymo获批用于这些运营的车辆包括捷豹I-Pace（2021年和2024年款）以及极氪RT（2022年和2025年款）。这些车辆获准在全天候、雨雾等各种条件下以及所有速度下运行。\n\n此项批准的核心是Waymo运营地图的大幅扩展。扩展后的运营设计域（ODD）涵盖了加州境内的众多城市和县。这包括在阿拉米达、康特拉科斯塔、洛杉矶、马林、纳帕、奥兰治、河滨、萨克拉门托、圣贝纳迪诺、圣迭戈、旧金山、圣马特奥、圣克拉拉、圣克鲁斯、索拉诺、索诺玛、文图拉和约洛等县的广泛覆盖。这种广泛的地理批准标志着Waymo在加州的自动驾驶汽车服务和发展取得了重大进展。"
  },
  {
    "id": "46002989",
    "title": "HP and Dell disable HEVC support built into their laptops' CPUs",
    "url": "https://arstechnica.com/gadgets/2025/11/hp-and-dell-disable-hevc-support-built-into-their-laptops-cpus/",
    "summary": "HP and Dell are disabling HEVC (H.265) hardware decoding on processors in some of their laptops, despite the CPUs having integrated support since Intel 6th-gen Core and AMD 2015 models. This decision renders users unable to play HEVC content efficiently in web browsers, forcing workarounds like disabling hardware acceleration, which degrades performance and features (e.g., no background blurring in video calls).\n\nAffected models include HP ProBook and EliteBook G11 series, where the disabling is noted in datasheets. For Dell, it impacts some business notebooks like the Dell 16 Plus 2-in-1; information is harder to find, typically on a general support page specifying HEVC playback only with configurations like discrete graphics, 4K displays, Dolby Vision, or CyberLink Blu-ray software. Both companies confirmed the change, recommending third-party software or \"premium\" systems for HEVC support.\n\nThe likely motive is rising HEVC licensing costs. Licensing administrator Access Advance announced royalty rate increases, effective January, from $0.20 to $0.24 per unit for sales over 100,001 units. This financial burden, which OEMs may bear, appears to be a significant factor. Other companies like Synology have also scaled back HEVC support. The move is causing frustration among users, particularly for higher-end \"Pro\" line laptops where HEVC is commonly used.",
    "chinese_title": "惠普和戴尔禁用其笔记本电脑CPU内置的HEVC支持",
    "chinese_summary": "惠普和戴尔正在停用其部分笔记本电脑处理器中的HEVC (H.265) 硬件解码功能，尽管自英特尔第六代酷睿和AMD 2015年型号处理器以来，CPU就已集成了此功能。这一决定导致用户无法在网络浏览器中高效播放HEVC内容，迫使他们采取禁用硬件加速等权宜之计，这会降低性能并削弱功能（例如，视频通话中无法进行背景虚化）。\n\n受影响的型号包括惠普ProBook和EliteBook G11系列，其数据表中已注明此停用。对于戴尔，它影响了一些商用笔记本电脑，如戴尔16 Plus二合一；相关信息更难找到，通常出现在一个通用的支持页面上，指出HEVC播放仅支持特定配置，如独立显卡、4K显示器、杜比视界或CyberLink蓝光软件。两家公司都证实了这一变化，建议用户使用第三方软件或“高端”系统来支持HEVC。\n\n可能的原因是HEVC授权费用上涨。授权管理机构Access Advance宣布，自1月起，销量超过100,001台的单位特许权使用费将从每台0.20美元增至0.24美元。这一可能由原始设备制造商（OEM）承担的财务负担，似乎是一个重要因素。其他公司如群晖（Synology）也已缩减了对HEVC的支持。此举正引起用户的不满，特别是对于HEVC常用场景的高端“专业版”笔记本电脑用户。"
  },
  {
    "id": "46015763",
    "title": "In a U.S. First, New Mexico Opens Doors to Free Child Care for All",
    "url": "https://www.wsj.com/us-news/in-a-u-s-first-new-mexico-opens-doors-to-free-child-care-for-all-2dfdea96",
    "summary": "Unable to access the article link.",
    "chinese_title": "全美首创，新墨西哥州推行全民免费托儿服务",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46002161",
    "title": "It's hard to build an oscillator",
    "url": "https://lcamtuf.substack.com/p/its-hard-to-build-an-oscillator",
    "summary": "Michal Zalewski's article \"It's hard to build an oscillator\" illuminates the unexpected complexities in designing reliable and stable electronic oscillators, despite their theoretical simplicity. While the concept—a gain stage, a frequency-dependent phase shift, and a feedback loop—appears straightforward, real-world implementation presents numerous practical challenges.\n\nThe fundamental difficulty stems from the non-ideal nature of physical components. Resistors, capacitors, and active devices are not perfect; their values are subject to manufacturing tolerances, temperature variations, and aging, making it hard to achieve the precise phase shift and gain necessary for stable oscillation. Moreover, oscillators are highly susceptible to noise (thermal, power supply, EMI) which can easily disrupt their delicate feedback mechanisms. Parasitic capacitances and inductances, arising from circuit traces and component leads, introduce unintended effects that significantly alter expected behavior, especially at higher frequencies.\n\nThe article emphasizes the hurdles in ensuring an oscillator reliably *starts* and then maintains *clean, stable* oscillation with consistent frequency, amplitude, and waveform purity. Even crystal oscillators, prized for their stability, require meticulously designed supporting circuitry to avoid issues like spurious modes or startup failures. The author highlights the \"last mile\" problem in engineering: creating a functional prototype is distinct from designing a robust, production-ready oscillator that performs consistently across varying conditions (temperature, voltage, component variations). The piece underscores the intricate interplay of analog physics and real-world imperfections in hardware design.",
    "chinese_title": "构建振荡器很难",
    "chinese_summary": "Michal Zalewski 的文章“振荡器构建之难”揭示了设计可靠稳定电子振荡器时意想不到的复杂性，尽管它们在理论上很简单。虽然其概念——一个增益级、一个频率相关的相移和一个反馈回路——看似简单，但实际实现却面临诸多实践挑战。\n\n根本困难源于物理元件的非理想性。电阻器、电容器和有源器件并非完美无缺；它们的数值受制于制造公差、温度变化和老化，这使得难以实现稳定振荡所需的精确相移和增益。此外，振荡器极易受到噪声（热噪声、电源噪声、电磁干扰）的影响，这些噪声会轻易干扰其精密的反馈机制。源自电路走线和元件引线的寄生电容和电感，引入了意想不到的影响，显著改变了预期行为，尤其是在高频下。\n\n文章强调了确保振荡器可靠*启动*并随后保持*干净、稳定*的振荡，同时具有一致的频率、幅度和波形纯度的障碍。即使是因其稳定性而备受推崇的晶体振荡器，也需要精心设计的支持电路，以避免杂散模式或启动失败等问题。作者强调了工程中的“最后一公里”问题：创建一个功能原型不同于设计一个在各种条件（温度、电压、元件变化）下都能持续表现稳健的、可投入生产的振荡器。这篇文章强调了模拟物理学与硬件设计中现实世界缺陷之间错综复杂的相互作用。"
  },
  {
    "id": "46003144",
    "title": "FAWK: LLMs can write a language interpreter",
    "url": "https://martin.janiczek.cz/2025/11/21/fawk-llms-can-write-a-language-interpreter.html",
    "summary": "The author, finding traditional AWK insufficient for modern functional programming paradigms while tackling an Advent of Code problem, dreamed of \"FAWK\" – a modernized AWK incorporating features like first-class arrays and functions, lexical scope, explicit globals, and pipelines.\n\nInstead of manual implementation, the author tasked an LLM (Sonnet 4.5 via Cursor Agent) to generate a Python interpreter for FAWK. To their surprise, the LLM not only delivered a working interpreter but competently handled complex features like closures, multidimensional arrays, I/O redirection, and even GAWK backward compatibility. The only notable struggle was with arbitrary-precision floating-point math without an external library.\n\nThis experience drastically shifted the author's perception of LLM capabilities for complex software engineering, realizing a new language could be \"vibe-coded\" in a day. However, a significant downside is the author's complete lack of familiarity with the generated codebase, raising questions about future maintenance and the balance between LLM generation and human understanding. The author plans to \"dogfood\" FAWK for future puzzles and explores further LLM-assisted development, making the project available on GitHub.",
    "chinese_title": "FAWK: 大语言模型能编写语言解释器",
    "chinese_summary": "作者在解决一个Advent of Code问题时，发现传统AWK不足以支持现代函数式编程范式，于是构想了\"FAWK\"——一个现代化的AWK，它融入了诸如第一类数组和函数、词法作用域、显式全局变量和管道等特性。\n\n作者没有手动实现，而是委托一个大型语言模型（LLM，通过Cursor Agent使用Sonnet 4.5）来生成FAWK的Python解释器。令他们惊讶的是，该LLM不仅提供了一个可工作的解释器，而且出色地处理了闭包、多维数组、I/O重定向乃至GAWK向后兼容性等复杂功能。唯一值得注意的难题是，在没有外部库的情况下，处理任意精度浮点数学计算。\n\n这次经历彻底改变了作者对LLM在复杂软件工程中能力的看法，意识到一门新语言可以在一日之内被“凭感觉编写”（vibe-coded）出来。然而，一个显著的缺点是作者对所生成的代码库完全不熟悉，这引发了关于未来维护以及LLM生成与人类理解之间平衡的问题。作者计划在未来的谜题中“以身试用”（dogfood）FAWK，并探索更多LLM辅助开发的可能性，同时已将该项目发布到GitHub上。"
  },
  {
    "id": "45996585",
    "title": "Data-at-Rest Encryption in DuckDB",
    "url": "https://duckdb.org/2025/11/19/encryption-in-duckdb",
    "summary": "DuckDB v1.4 introduces transparent data-at-rest encryption, addressing security and compliance needs (like SOC 2), a feature often limited or costly in other databases like PostgreSQL and SQLite.\n\nThe system uses industry-standard symmetric AES encryption, supporting AES-GCM-256 (recommended for data authentication with a tag) and AES-CTR-256 (faster, without authentication). These ciphers require a plaintext, an initialization vector (IV/nonce), and an encryption key.\n\nDuckDB's implementation keeps the main database header plaintext, storing essential metadata like a database identifier (salt) and an encrypted \"canary\" to verify the encryption key. All subsequent headers, data blocks, and the Write-Ahead Log (WAL) are encrypted. User-provided keys are never used directly; instead, a secure key is derived via a Key Derivation Function (KDF), stored in a secure memory cache, and the original input key is immediately wiped.\n\nEncrypted data blocks have an expanded 40-byte header containing a nonce/IV and an optional authentication tag, with the checksum itself encrypted for security. WAL entries are individually encrypted, including their length, nonce, encrypted checksum, and the entry itself, plus a tag for GCM.\n\nCrucially, temporary files used for out-of-core operations are also automatically encrypted. These utilize internally generated temporary keys, ensuring that if the database crashes, leftover temporary files are irrecoverable \"garbage,\" preventing data leakage.\n\nUsers enable encryption using the `ATTACH` command, specifying `ENCRYPTION_KEY` and `ENCRYPTION_CIPHER`. Databases can be initialized, encrypted, or re-encrypted. Successful encryption can be verified by observing high data entropy, making the file content appear as random noise.",
    "chinese_title": "DuckDB 静态数据加密",
    "chinese_summary": "DuckDB v1.4 引入了透明的静态数据加密功能，以满足安全性与合规性需求（如SOC 2）。在PostgreSQL和SQLite等其他数据库中，此功能通常受限或成本高昂。\n\n该系统使用行业标准的对称AES加密，支持AES-GCM-256（推荐用于带标签的数据认证）和AES-CTR-256（速度更快，无认证）。这些密码算法需要明文、初始化向量 (IV/nonce) 和加密密钥。\n\nDuckDB 的实现将主数据库头保持明文，存储必要的元数据，如数据库标识符（盐值）和一个加密的“金丝雀”值，用于验证加密密钥。所有后续的头部、数据块和预写日志 (WAL) 均已加密。用户提供的密钥从不直接使用；相反，系统通过密钥派生函数 (KDF) 派生出安全的密钥，将其存储在安全的内存缓存中，并立即清除原始输入密钥。\n\n加密的数据块具有一个扩展的40字节头部，其中包含 nonce/IV 和一个可选的认证标签，并且校验和本身也经过加密以增强安全性。WAL 条目是单独加密的，包括其长度、nonce、加密校验和以及条目本身，外加GCM的标签。\n\n至关重要的是，用于外部存储操作的临时文件也会自动加密。这些文件利用内部生成的临时密钥，确保即使数据库崩溃，残留的临时文件也是不可恢复的“垃圾”，从而防止数据泄露。\n\n用户可以使用 `ATTACH` 命令，并通过指定 `ENCRYPTION_KEY` 和 `ENCRYPTION_CIPHER` 来启用加密。数据库可以被初始化、加密或重新加密。通过观察高数据熵，使文件内容呈现为随机噪声，即可验证加密是否成功。"
  },
  {
    "id": "46009591",
    "title": "LAPD helicopter tracker with real-time operating costs",
    "url": "https://lapdhelicoptertracker.com/",
    "summary": "This content introduces the \"LAPD Helicopter Tracker,\" an innovative system designed to provide real-time monitoring of police aviation. A key feature is its integrated cost calculator, which displays the real-time operating expenses associated with each LAPD helicopter in flight. The tracker aims to offer a transparent view into the deployment and financial implications of the department's air support operations, allowing users to track police activity and understand its immediate costs.",
    "chinese_title": "洛杉矶警局含实时运行成本的直升机追踪器",
    "chinese_summary": "本文介绍了“洛杉矶警察局直升机追踪器”，这是一套旨在提供警用航空实时监控的创新系统。其主要特点是内置成本计算器，可显示每架在飞的洛杉矶警察局直升机的实时运行费用。该追踪器旨在透明地展示警局空中支援行动的部署和财务影响，让用户能够追踪警务活动并了解其即时成本。"
  },
  {
    "id": "46004293",
    "title": "Making a Small RPG",
    "url": "https://jslegenddev.substack.com/p/making-a-small-rpg",
    "summary": "The article \"Making a Small RPG\" by JSLegendDev offers practical guidance for developers aiming to create a manageable RPG rather than an ambitious, large-scale project. The author defines \"small\" as a game with limited scope, suggesting around 5-8 hours of playtime, one main city, a single main dungeon, and a few side quests.\n\nIt outlines five core pillars essential for any RPG: character development (stats, skills, equipment, leveling), narrative (a clear story or purpose), exploration (areas to discover), combat/interaction (how players engage), and loot/progression (rewards and growth). For a small RPG, the key is to focus on these fundamentals without overcomplicating them.\n\nStrategies for maintaining a small scope include prioritizing only essential RPG features, crafting a simple yet engaging story, and limiting art assets by reusing existing ones or opting for simpler visual styles. The article also advises a modular design approach, breaking tasks into manageable pieces, and iterating quickly to establish a functional core gameplay loop. Practical advice extends to utilizing existing game engines like Unity, Godot, or RPG Maker, embracing limitations, maintaining concise documentation, and conducting continuous playtesting. The overarching message is to build a focused, enjoyable experience by starting small and iterating effectively.",
    "chinese_title": "制作小RPG",
    "chinese_summary": "JSLegendDev的博文《制作小型RPG》为旨在开发可管理RPG而非雄心勃勃的大型项目的开发者提供了实用指导。作者将“小型”定义为范围有限的游戏，建议游戏时长约5-8小时，包含一个主城、一个主地牢和少量支线任务。\n\n文章概述了任何RPG都不可或缺的五个核心支柱：角色发展（属性、技能、装备、升级）、叙事（清晰的故事或目的）、探索（可发现的区域）、战斗/互动（玩家的参与方式）以及战利品/进程（奖励与成长）。对于小型RPG，关键在于专注于这些基础要素，而不使其过于复杂。\n\n保持小规模的策略包括优先考虑必要的RPG功能，创作一个简单但引人入胜的故事，并通过重用现有资源或选择更简单的视觉风格来限制美术资产。文章还建议采用模块化设计方法，将任务分解为可管理的小块，并快速迭代以建立功能性的核心玩法循环。实用建议还包括利用Unity、Godot或RPG Maker等现有游戏引擎，拥抱局限性，保持简洁的文档，并进行持续的玩家测试。其核心信息是通过从小处着手并有效迭代，来构建一个专注且令人愉快的游戏体验。"
  },
  {
    "id": "46006521",
    "title": "How Cops Are Using Flock's ALPR Network to Surveil Protesters and Activists",
    "url": "https://www.eff.org/deeplinks/2025/11/how-cops-are-using-flock-safetys-alpr-network-surveil-protesters-and-activists",
    "summary": "An analysis of Flock Safety's automated license plate reader (ALPR) network data from December 2024 to October 2025 reveals that over 50 federal, state, and local law enforcement agencies, including U.S. Border Patrol, ran hundreds of searches related to protest activity. Flock ALPRs capture and log every vehicle's license plate, characteristics, time, and location into a massive, searchable, nationwide database shared among agencies.\n\nAgencies targeted major demonstrations such as the \"No Kings\" movement (against government overreach), \"50501 protests,\" and rallies concerning deportation raids and police shootings. Officers frequently logged vague terms like \"protest\" or specific protest names into the search's \"reason\" field, often without articulating an actual crime, raising serious concerns about First Amendment infringement.\n\nThe U.S. Border Patrol made extensive use of Flock data for immigration enforcement and to monitor those critical of its tactics, accessing the system via local agencies even after its direct access was paused. The network was also specifically used to surveil animal rights activists from Direct Action Everywhere (DxE), linking searches to their investigations and direct actions, demonstrating its reach beyond large political demonstrations.\n\nWhile some searches may relate to crimes, ALPRs collect data on everyone near a protest, creating a \"chilling effect\" on free expression. The report advises protesters to consider alternative transportation to demonstrations to protect their privacy. It also urges local officials to shut down these surveillance networks, arguing that the right to dissent should not lead to individuals being added to a database. The analysis suggests actual surveillance is likely higher, given many searches used vague reasons like \"investigation.\"",
    "chinese_title": "警察如何利用Flock的ALPR网络监视抗议者和活动人士",
    "chinese_summary": "对Flock Safety的自动车牌识别（ALPR）网络数据从2024年12月至2025年10月的分析显示，包括美国边境巡逻队在内的50多个联邦、州和地方执法机构进行了数百次与抗议活动相关的搜索。Flock的ALPR系统捕捉并记录每辆车的车牌、特征、时间以及位置，存入一个巨大的、可搜索的全国性数据库中，该数据库在各机构之间共享。\n\n各机构针对了主要的示威活动，例如“无君主”运动（反对政府越权）、“50501抗议活动”，以及与驱逐出境突袭和警察枪击事件相关的集会。警官们经常在搜索的“理由”字段中输入“抗议”或具体的抗议名称等模糊词语，通常没有明确说明实际犯罪行为，这引发了对侵犯第一修正案权利的严重担忧。\n\n美国边境巡逻队广泛使用Flock数据进行移民执法，并监控那些批评其策略的人，即使在其直接访问被暂停后，仍通过地方机构访问该系统。该网络还专门用于监视“直接行动无处不在”（DxE）的动物权利活动家，将搜索与他们的调查和直接行动联系起来，这表明其影响力已超越大型政治示威活动。\n\n尽管一些搜索可能与犯罪有关，但ALPR系统收集了抗议活动附近每个人的数据，这对言论自由造成了“寒蝉效应”。报告建议抗议者考虑乘坐其他交通工具前往示威地点，以保护他们的隐私。报告还敦促地方官员关闭这些监控网络，认为异议权不应导致个人被添加到数据库中。分析表明，鉴于许多搜索使用了“调查”等模糊理由，实际监控程度可能更高。"
  },
  {
    "id": "45999024",
    "title": "France is taking state actions against GrapheneOS?",
    "url": "https://grapheneos.social/@GrapheneOS/115584160910016309",
    "summary": "The article highlights a claim made by GrapheneOS through its official Mastodon account, stating that \"France is taking state actions\" against the project. The title frames this as a question, \"France is taking state actions against GrapheneOS?\", indicating the nature of the report. The provided content directly quotes GrapheneOS making this assertion on Mastodon, though the full context of their statement is not included. The article does not elaborate on the specific nature or reasons for these alleged governmental actions. A separate, unrelated part of the provided text is a standard Mastodon message about enabling JavaScript for its web application.",
    "chinese_title": "法国正在对GrapheneOS采取国家行动？",
    "chinese_summary": "这篇文章强调了 GrapheneOS 通过其官方 Mastodon 账户提出的一项主张，称“法国正在对该项目采取国家行动”。该文章的标题将此框定为一个问题：“法国正在对 GrapheneOS 采取国家行动吗？”，表明了报告的性质。所提供的内容直接引用了 GrapheneOS 在 Mastodon 上提出的这一断言，但并未包含其声明的完整背景。文章没有详细阐述这些所谓的政府行动的具体性质或原因。所提供文本中一个单独的、不相关部分是一条关于为 Mastodon 网络应用程序启用 JavaScript 的标准 Mastodon 消息。"
  },
  {
    "id": "46008156",
    "title": "Discontinuation of ARM Notebook with Snapdragon X Elite SoC",
    "url": "https://www.tuxedocomputers.com/en/Discontinuation-of-ARM-notebooks-with-Snapdragon-X-Elite-SoC.tuxedo",
    "summary": "The main announcement is the discontinuation of ARM notebooks featuring the Snapdragon X Elite SoC.\n\nAccompanying this, the vendor promotes general product and service benefits: Linux compatibility, up to 5 years warranty, immediate readiness for use, assembly in Germany, German data privacy, and German tech support. Additionally, users are instructed to activate JavaScript and deactivate script blockers to use the store.",
    "chinese_title": "搭载骁龙X Elite SoC的ARM笔记本停产",
    "chinese_summary": "主要公告是停产搭载骁龙X Elite SoC的ARM笔记本电脑。\n\n与此同时，该供应商也推广了其产品和服务的通用优势：兼容Linux、长达5年保修、即买即用、德国组装、德国数据隐私保护和德国技术支持。此外，用户需启用JavaScript并禁用脚本拦截器才能使用商店。"
  },
  {
    "id": "46006598",
    "title": "Solving Fizz Buzz with Cosines",
    "url": "https://susam.net/fizz-buzz-with-cosines.html",
    "summary": "This article explores an unconventional mathematical approach to solving the classic Fizz Buzz problem, replacing traditional modulo operations with trigonometric functions. The author aims to encode the periodic nature of the Fizz Buzz sequence into a single closed-form expression using discrete Fourier series.\n\nThe solution begins by defining four \"symbol functions\" (`s_0` for numbers, `s_1` for 'Fizz', `s_2` for 'Buzz', `s_3` for 'FizzBuzz') and an \"index function\" `f(n)` that determines which symbol to output for a given `n`. This `f(n)` is initially structured as a piecewise function based on divisibility rules.\n\nA key simplification uses \"indicator functions\" `I_m(n)` (which is 1 if `m` divides `n`, and 0 otherwise). The article cleverly observes that `f(n)` can be expressed as `I_3(n) + 2 * I_5(n)`, effectively treating `I_5(n)` and `I_3(n)` as binary digits forming `f(n)`. A Python program demonstrating this simplified logic is provided.\n\nThe core of the article then translates these indicator functions into complex exponentials and subsequently into cosine functions using Euler's formula. It shows that `I_m(n)` can be written as `(1/m) * sum(e^(2*pi*i*k*n/m))`. Applying this, `I_3(n)` is expressed as `(1/3) + (2/3)cos(2*pi*n/3)`, and `I_5(n)` as `(1/5) + (2/5)cos(2*pi*n/5) + (2/5)cos(4*pi*n/5)`.\n\nBy substituting these cosine forms back into `f(n) = I_3(n) + 2 * I_5(n)`, a complete closed-form expression for `f(n)` using only cosines is derived. A Python implementation using `round()` on this cosine formula is presented. The article concludes by noting that this solution is a finite Fourier series, briefly outlining how the same result could be obtained through a more \"tedious\" Discrete Fourier Transform calculation.",
    "chinese_title": "余弦解Fizz Buzz",
    "chinese_summary": "本文探讨了一种非传统的数学方法来解决经典的Fizz Buzz问题，即用三角函数取代传统的模运算。作者旨在利用离散傅里叶级数，将Fizz Buzz序列的周期性编码成一个单一的闭式表达式。\n\n该解决方案首先定义了四个“符号函数”（`s_0`代表数字，`s_1`代表“Fizz”，`s_2`代表“Buzz”，`s_3`代表“FizzBuzz”）以及一个“索引函数”`f(n)`，它决定了给定`n`时要输出哪个符号。这个`f(n)`最初被构造为一个基于可除性规则的分段函数。\n\n一个关键的简化是使用了“指示函数”`I_m(n)`（如果`m`能整除`n`则为1，否则为0）。文章巧妙地观察到`f(n)`可以表示为`I_3(n) + 2 * I_5(n)`，有效地将`I_5(n)`和`I_3(n)`视为构成`f(n)`的二进制位。文章提供了一个Python程序来演示这种简化逻辑。\n\n文章的核心接着将这些指示函数转换为复指数，并随后利用欧拉公式转换为余弦函数。它表明`I_m(n)`可以写成`(1/m) * sum(e^(2*pi*i*k*n/m))`。应用此方法，`I_3(n)`被表示为`(1/3) + (2/3)cos(2*pi*n/3)`，`I_5(n)`被表示为`(1/5) + (2/5)cos(2*pi*n/5) + (2/5)cos(4*pi*n/5)`。\n\n通过将这些余弦形式代回到`f(n) = I_3(n) + 2 * I_5(n)`中，导出了一个仅使用余弦的`f(n)`的完整闭式表达式。文章提供了一个使用`round()`函数处理此余弦公式的Python实现。文章最后指出，该解决方案是一个有限傅里叶级数，并简要概述了如何通过更“繁琐”的离散傅里叶变换计算获得相同的结果。"
  },
  {
    "id": "46005349",
    "title": "XBMC 4.0 for the Original Xbox",
    "url": "https://www.xbox-scene.info/articles/announcing-xbmc-40-for-the-original-xbox-r64/",
    "summary": "XBMC 4.0 has been released for the Original Xbox, marking a significant modernization and the first major update since 2016 for the console's iconic media center platform. Originating as XboxMediaPlayer in 2002, XBMC influenced the development of both Kodi and Plex.\n\nThis new version revitalizes the software, bringing a modern interface powered by the Estuary skin, first seen in Kodi v17. This required porting the contemporary GUIlib engine, making future skin development easier. XBMC 4.0 introduces a fully realized games library system, offering rich metadata support, artwork, and descriptions for Xbox and emulated games, akin to its movie and music libraries.\n\nOnline metadata scrapers for movies and television are fully restored, enabling comprehensive media library creation. Task scheduling improvements allow for concurrent background activities like library updates on the Xbox's limited hardware. The music experience is enhanced with lossless codec support (FLAC) and visualizers.\n\nThe release includes an accessible online add-ons repository and continues Python-based add-on support, with plans to upgrade to Python 3.4.10. Settings, network services (SMB, FTP, UPnP), and system tools have been revised for clarity and control.\n\nDistinct from XBMC4Gamers and not affiliated with The Kodi Foundation, XBMC 4.0 is in active development. It welcomes community contributions, aiming to expand the Original Xbox's capabilities as a versatile media center for years to come.",
    "chinese_title": "XBMC 4.0 初代Xbox版",
    "chinese_summary": "XBMC 4.0 已针对初代 Xbox 发布，标志着一次重大的现代化，也是该主机标志性媒体中心平台自 2016 年以来的首次重大更新。它最初于 2002 年以 XboxMediaPlayer 的身份出现，XBMC 影响了 Kodi 和 Plex 的开发。\n\n这个新版本使软件焕发了生机，带来了由 Estuary 皮肤驱动的现代界面，首次出现在 Kodi v17 中。这需要移植现代的 GUIlib 引擎，使未来的皮肤开发变得更容易。XBMC 4.0 引入了一个完整的游戏库系统，为 Xbox 和模拟游戏提供丰富的元数据支持、艺术作品和描述，类似于其电影和音乐库。\n\n电影和电视的在线元数据抓取器已完全恢复，从而实现全面的媒体库创建。任务调度方面的改进允许在 Xbox 有限的硬件上同时进行后台活动，例如库更新。音乐体验通过支持无损编解码器（FLAC）和可视化工具得到增强。\n\n此版本包含一个易于访问的在线插件库，并继续支持基于 Python 的插件，计划升级到 Python 3.4.10。设置、网络服务（SMB、FTP、UPnP）和系统工具都经过修订，以提高清晰度和控制性。\n\nXBMC 4.0 独立于 XBMC4Gamers，且不隶属于 Kodi 基金会，它正在积极开发中。它欢迎社区贡献，旨在未来多年内扩展初代 Xbox 作为多功能媒体中心的能力。"
  },
  {
    "id": "45997294",
    "title": "Kagi Assistants",
    "url": "https://blog.kagi.com/kagi-assistants",
    "summary": "Kagi launched its new Quick Assistant and Research Assistant on November 20, 2025, designed to enhance, not replace, the human search experience with AI. The Quick Assistant, available on all plans, provides fast, concise answers. The Research Assistant, for ultimate tier users, offers in-depth, exhaustive analysis, capable of executing multiple searches and synthesizing findings into high-quality, sourced answers. Both are accessible via the Kagi Assistant webapp and directly from the search bar using bangs like `!quick` and `!research`.\n\nIn August 2025, Kagi's Research Assistant achieved a 95.5% score on the SimpleQA benchmark, a \"happy accident\" as Kagi prioritizes product usefulness over benchmark scores. They explain their reluctance to aim for 100% scores due to potential overfitting, conflicting official data, ethical concerns (like aggressive web crawling), and the inherent biases of benchmark creators.\n\nNotably, Kagi discovered its search engine acts as a superior backend for LLMs on benchmarks like SimpleQA, outperforming Google/Bing by providing less noisy and more relevant results, thus improving LLM accuracy. The assistants also have access to advanced tools beyond web search, including code execution and specific APIs. Kagi emphasizes building empowering tools for users rather than forcing AI or chasing artificial benchmarks.",
    "chinese_title": "柯吉助手",
    "chinese_summary": "Kagi 于 2025 年 11 月 20 日推出了新的快速助手 (Quick Assistant) 和研究助手 (Research Assistant)，旨在利用人工智能增强而非取代人类的搜索体验。快速助手适用于所有套餐，提供快速、简洁的答案。研究助手面向最高级套餐用户，提供深入、详尽的分析，能够执行多次搜索并将发现结果综合为高质量、带来源的答案。两者均可通过 Kagi 助手网页应用访问，也可以直接在搜索栏中使用 `!quick` 和 `!research` 等命令调用。\n\n2025 年 8 月，Kagi 的研究助手在 SimpleQA 基准测试中取得了 95.5% 的分数，Kagi 称其为“意外之喜”，因为它优先考虑产品实用性而非基准分数。他们解释说，不愿追求 100% 分数的原因包括潜在的过拟合、相互冲突的官方数据、伦理问题（如激进的网络爬虫），以及基准测试创建者固有的偏见。\n\n值得注意的是，Kagi 发现其搜索引擎在 SimpleQA 等基准测试中作为大型语言模型 (LLMs) 的卓越后端，表现优于 Google/Bing，因为它提供了更少噪音和更相关的结果，从而提高了大型语言模型的准确性。助手还可以访问网络搜索之外的先进工具，包括代码执行和特定 API。Kagi 强调为用户构建赋能工具，而不是强推人工智能或追逐人为设定的基准。"
  },
  {
    "id": "45997914",
    "title": "New Glenn Update",
    "url": "https://www.blueorigin.com/news/new-glenn-upgraded-engines-subcooled-components-drive-enhanced-performance",
    "summary": "Blue Origin has announced significant upgrades to its New Glenn rocket, focusing on enhanced performance for upcoming missions. The primary improvements include the transition to a full complement of seven BE-4 engines on the first stage, each capable of 550,000 pounds of thrust, and the adoption of subcooled liquid oxygen (LOX) and liquid natural gas (LNG) propellants.\n\nThe use of subcooled propellants, which are chilled to a lower temperature, increases their density. This allows more propellant to be loaded into the existing tank volume, effectively boosting the rocket's mass fraction and increasing overall performance without redesigning the core structure. The upgrades provide the flexibility to deliver heavier payloads to various orbits, including geosynchronous transfer orbit (GTO), low Earth orbit (LEO), and lunar trajectories.\n\nThese enhancements support a diverse range of missions, from NASA's Commercial Lunar Payload Services (CLPS) program to national security launches under the NSSL Phase 3 contract, as well as commercial satellite deployments. The updated New Glenn is poised to offer greater mission versatility and capability for its maiden flight and subsequent operations.",
    "chinese_title": "新格伦更新",
    "chinese_summary": "蓝色起源公司宣布对其“新格伦”火箭进行重大升级，旨在提升其未来任务的性能。主要改进包括：将第一级发动机全面换装为七台BE-4发动机，每台推力可达55万磅；以及采用过冷液氧（LOX）和液化天然气（LNG）推进剂。\n\n使用过冷推进剂（即将其冷却至更低温度），能够增加其密度。这使得更多推进剂能够装载到现有储罐体积中，有效提高了火箭的质量分数，并在不重新设计核心结构的情况下，提升了整体性能。此次升级提供了将更重有效载荷送往不同轨道的灵活性，包括地球同步转移轨道（GTO）、近地轨道（LEO）以及月球轨道。\n\n这些增强功能将支持多种任务，涵盖美国宇航局（NASA）的商业月球有效载荷服务（CLPS）计划、NSSL第三阶段合同下的国家安全发射，以及商业卫星部署。升级后的“新格伦”火箭有望在其首次飞行及后续任务中提供更强大的任务多样性和能力。"
  },
  {
    "id": "46016249",
    "title": "The privacy nightmare of browser fingerprinting",
    "url": "https://kevinboone.me/fingerprinting.html",
    "summary": "The article \"The privacy nightmare of browser fingerprinting\" argues that browser fingerprinting poses a significant and growing privacy threat, surpassing traditional tracking cookies. It explains that fingerprinting works by extracting a unique combination of discrete information from a user's browser and system. This includes basic details like browser version, OS, language, and timezone, as well as more sophisticated data such as installed fonts, browser extensions, hardware information, and \"canvas fingerprints\" (subtle pixel variations from rendered text due to unique graphics hardware/OS interactions). Even minor preferences like window size contribute to a unique identifier.\n\nAttempts to counter fingerprinting are challenging. Disabling JavaScript makes a user stand out and breaks websites, while spoofing user-agents is easily detected. Rigorous spoofing methods can leave traces or disrupt site functionality.\n\nDespite these difficulties, the author notes that real-world tracking is often more statistical than absolute, and a temporarily unique fingerprint doesn't guarantee long-term traceability. Browser developers are also starting to integrate more robust countermeasures, with Brave, Mullvad, and Librewolf being notable examples.\n\nFor users seeking to resist fingerprinting, advice includes using a VPN, preventing long-lived cookies, and striving to be \"unremarkable\" – using popular browsers/OS setups with stock configurations, minimal extensions, and default settings. Utilizing browsers with built-in resistance is also recommended.\n\nHowever, these measures have downsides: inconvenience like forced window sizes, more CAPTCHA challenges, and potential website functionality issues. Even with all precautions, effectiveness is limited, potentially only reducing traceability to about 50%.\n\nThe legality of browser fingerprinting remains unclear, likely violating the spirit of GDPR but unproven in court, partly due to legitimate uses like fraud detection. The author concludes that new legislation is ultimately needed to address this invisible and intrusive technology, which primarily benefits the online advertising industry.",
    "chinese_title": "浏览器指纹的隐私噩梦",
    "chinese_summary": "本文《浏览器指纹识别的隐私噩梦》指出，浏览器指纹识别构成了一个重大且日益增长的隐私威胁，其影响超越了传统的追踪Cookie。文章解释说，指纹识别的工作原理是提取用户浏览器和系统中离散信息的独特组合。这包括浏览器版本、操作系统、语言和时区等基本细节，以及已安装字体、浏览器扩展、硬件信息和“画布指纹”（由独特的图形硬件/操作系统交互导致渲染文本的细微像素差异）等更复杂的数据。即使是像窗口大小这样的微小偏好，也有助于形成一个独特的标识符。\n\n对抗指纹识别的尝试充满挑战。禁用JavaScript会使​​用户显得与众不同并破坏网站功能，而伪造用户代理则很容易被检测到。严格的伪造方法可能会留下痕迹或破坏网站功能。\n\n尽管存在这些困难，作者指出，现实世界中的追踪更多是统计性的而非绝对的，并且一个暂时独特的指纹并不能保证长期可追溯性。浏览器开发商也开始整合更强大的反制措施，其中Brave、Mullvad和Librewolf是值得注意的例子。\n\n对于寻求抵制指纹识别的用户，建议包括使用VPN、阻止长期有效的Cookie，并努力做到“不引人注目”——即使用流行浏览器/操作系统、默认配置、最少扩展和默认设置。使用内置抵抗机制的浏览器也被推荐。\n\n然而，这些措施也有缺点：例如强制窗口大小带来的不便、更多的验证码挑战以及潜在的网站功能问题。即使采取了所有预防措施，效果也有限，可能只能将可追溯性降低到50%左右。\n\n浏览器指纹识别的合法性仍不明确，可能违反了GDPR的精神，但在法庭上尚未得到证实，部分原因是其合法用途，例如欺诈检测。作者总结道，最终需要新的立法来解决这种隐形且具有侵扰性的技术，这种技术主要使在线广告行业受益。"
  },
  {
    "id": "46010329",
    "title": "How I learned Vulkan and wrote a small game engine with it (2024)",
    "url": "https://edw.is/learning-vulkan/",
    "summary": "In \"How I learned Vulkan and wrote a small game engine with it (2024),\" a self-taught professional programmer recounts their three-month journey building a small 3D game engine, EDBR, and two game demos using Vulkan, having prior OpenGL experience.\n\nThe author advises starting with OpenGL (recommending learnopengl.com, Anton's Tutorials) to grasp graphics fundamentals before tackling Vulkan's complexity. Key advice includes avoiding \"bike-shedding\" – not over-engineering, starting with small games, getting things working first, and refactoring later.\n\nChoosing Vulkan for desktop games (Windows/Linux) due to its open-source nature and modern capabilities (unlike deprecated OpenGL or limited WebGPU), the author emphasizes that Vulkan is more accessible now. Top learning resources recommended are `vkguide.dev` and TU Wien's Vulkan Lecture Series, alongside advanced books. Libraries like `vk-bootstrap` are praised for simplifying boilerplate.\n\nThe EDBR engine (19k lines of code) is described as tailored for smaller, level-based games. Its frame analysis covers compute skinning, Cascaded Shadow Mapping (CSM), Physically Based Rendering (PBR), depth resolve, post-effects (fog, bloom), and UI rendering. The author's journey underscores patience and incremental learning, proving that building with Vulkan is achievable for dedicated self-learners.",
    "chinese_title": "我是如何学习Vulkan并用它编写小型游戏引擎的 (2024)",
    "chinese_summary": "在《我是如何学习Vulkan并用它编写一个小型游戏引擎的 (2024)》一文中，一位自学成才的专业程序员讲述了他们为期三个月的旅程，在拥有OpenGL经验的基础上，使用Vulkan构建了一个小型3D游戏引擎EDBR和两个游戏演示。\n\n作者建议先从OpenGL开始学习（推荐learnopengl.com、Anton's Tutorials），以掌握图形学基础知识，然后再应对Vulkan的复杂性。核心建议包括避免“自行车棚效应”——即不要过度设计，从小型游戏入手，先让功能运行起来，之后再进行重构。\n\n由于Vulkan的开源性质和现代功能（不同于已废弃的OpenGL或功能有限的WebGPU），作者选择Vulkan来开发桌面游戏（Windows/Linux），并强调现在Vulkan更易于上手。推荐的主要学习资源包括`vkguide.dev`和维也纳工业大学的Vulkan讲座系列，以及一些高级书籍。`vk-bootstrap`等库因简化了样板代码而受到称赞。\n\nEDBR引擎（1.9万行代码）被描述为专为小型、基于关卡的游戏量身定制。其帧分析涵盖计算蒙皮、级联阴影贴图 (CSM)、基于物理的渲染 (PBR)、深度解析、后处理效果（雾、泛光）和UI渲染。作者的旅程强调了耐心和渐进式学习的重要性，证明了对于专注的自学者来说，使用Vulkan进行开发是可行的。"
  },
  {
    "id": "46005388",
    "title": "Make product worse, get money",
    "url": "https://dynomight.net/worse/",
    "summary": "The article criticizes the common theory that companies intentionally make products worse to maximize profits, using dating apps as a prime example. The author argues this \"make product worse, get money\" idea is simplistic and unhelpful because it applies universally to all businesses (e.g., pizza, cars, blogging). While producers inherently desire to charge high prices for low-cost, inferior goods, competitive markets usually prevent this by forcing companies to offer value.\n\nThe real, interesting question, according to the author, is *why* companies are *able* to get away with seemingly suboptimal products. Four main reasons are proposed:\n1.  **People are cheap:** Consumers often prioritize lower prices over higher quality (e.g., cramped airline seats), meaning companies provide what the market demands.\n2.  **Information asymmetries:** Consumers lack the knowledge to discern quality, allowing inferior or even harmful products (e.g., longevity scams, hidden ingredients) to succeed.\n3.  **People have bad taste:** Consumers genuinely prefer products that others might consider \"bad.\"\n4.  **Pricing power:** Companies with significant \"moats\" (e.g., technological barriers, brand loyalty, network effects) face less competition and thus have less pressure to improve quality or lower prices.\n\nThe author concludes that for dating apps or any product, if they are genuinely bad, the mystery isn't their incentive, but why a better competitor doesn't emerge, implying either competitive impossibility or specific consumer preferences are at play.",
    "chinese_title": "降低产品质量，赚钱",
    "chinese_summary": "本文批判了公司为实现利润最大化而故意将产品质量做差的普遍理论，并以约会应用为例进行了说明。作者认为，“把产品做差赚钱”的观点过于简单且没有帮助，因为它普遍适用于所有业务（例如，披萨、汽车、博客）。尽管生产者天生希望对低成本、劣质商品收取高价，但竞争性市场通常通过迫使公司提供价值来阻止这种情况。\n\n作者指出，真正有趣的问题是：公司 *为什么* 能够通过看似次优的产品来蒙混过关。对此，文章提出了四个主要原因：\n1.  **消费者贪图便宜：** 消费者通常优先考虑低价而非高质量（例如，拥挤的飞机座位），这意味着公司提供的是市场所需。\n2.  **信息不对称：** 消费者缺乏辨别产品质量的知识，这使得劣质甚至有害的产品（例如，养生骗局、隐藏成分）得以成功。\n3.  **消费者品味不佳：** 消费者确实喜欢那些在别人看来可能“糟糕”的产品。\n4.  **定价权：** 拥有显著“护城河”（例如，技术壁垒、品牌忠诚度、网络效应）的公司面临的竞争较少，因此改善质量或降低价格的压力也较小。\n\n作者总结道，对于约会应用或任何产品，如果它们确实很差，那么谜团不在于它们的动机，而在于为什么没有更好的竞争对手出现，这暗示着要么是竞争不可能，要么是特定的消费者偏好在起作用。"
  },
  {
    "id": "46008769",
    "title": "Pixar: The Early Days A never-before-seen 1996 interview",
    "url": "https://stevejobsarchive.com/stories/pixar-early-days",
    "summary": "This article introduces a never-before-seen 1996 interview with Steve (Jobs), to be released by the Steve Jobs Archive in 2025 for *Toy Story*'s 30th anniversary. The interview took place on November 22, 1996, one year after *Toy Story*—the world's first entirely computer-animated feature—debuted.\n\n*Toy Story* was an instant success, transforming Pixar into a public company with a $1.5 billion valuation, marking the largest IPO of 1995, and earning a Special Achievement Oscar. By the time of the interview, Pixar was rapidly expanding: its stock price had nearly doubled, the team grew 70%, *A Bug’s Life* was in production, and Steve was using his leverage to renegotiate Pixar’s partnership with Disney, having closed the TV-commercial unit to focus on feature films.\n\nIn the interview footage, Steve elaborates on the \"long game\" behind Pixar's success. He discusses its unique business model, which provides artists and engineers a stake in their creations, and shares insights learned from Disney about focus and discipline. He also addresses the challenges of leading an exceptionally talented team that inverts traditional hierarchies, the incentives that retain employees, and their unifying mission: to tell enduring stories and contribute lasting cultural value. Steve's close collaboration with Ed Catmull at Pixar, focusing on creating conditions for talent to thrive, significantly shaped his approach to leadership. His experience at Pixar directly influenced his vision for Apple upon his return as CEO weeks later, emphasizing building a company on timeless ideas merged with technology.",
    "chinese_title": "皮克斯：早期 前所未见的1996年访谈",
    "chinese_summary": "本文介绍了一段史蒂夫·乔布斯（Steve Jobs）1996年的访谈，这段访谈此前从未公开，并将由史蒂夫·乔布斯档案馆（Steve Jobs Archive）于2025年为庆祝《玩具总动员》（Toy Story）上映30周年而发布。该访谈于1996年11月22日进行，正值全球首部完全由电脑制作的动画长片《玩具总动员》首映一年之后。\n\n《玩具总动员》一经推出便大获成功，将皮克斯（Pixar）打造成一家估值15亿美元的上市公司，成为1995年规模最大的首次公开募股（IPO），并荣获一项奥斯卡特别成就奖。访谈进行时，皮克斯正处于快速扩张期：其股价几乎翻了一番，团队规模增长了70%，《虫虫危机》（A Bug’s Life）正在制作中，史蒂夫正利用其影响力重新谈判皮克斯与迪士尼（Disney）的合作关系，为此他关闭了电视广告部门以专注于长片制作。\n\n在访谈中，史蒂夫详细阐述了皮克斯成功背后的“长期策略”（long game）。他讨论了其独特的商业模式，该模式让艺术家和工程师能够在其创作中拥有股份，并分享了从迪士尼那里学到的关于专注和纪律的见解。他还谈到了领导一支颠覆传统层级结构的杰出团队所面临的挑战，留住员工的激励措施，以及他们共同的使命：讲述经久不衰的故事并贡献持久的文化价值。史蒂夫在皮克斯与艾德·卡特姆（Ed Catmull）的紧密合作，尤其关注为人才创造茁壮成长的条件，极大地塑造了他的领导方式。他在皮克斯的经历直接影响了他数周后重返苹果（Apple）担任首席执行官时的愿景，强调要将公司建立在永恒的理念与科技的融合之上。"
  },
  {
    "id": "46008628",
    "title": "Boom, bubble, bust, boom. Why should AI be different?",
    "url": "https://crazystupidtech.com/2025/11/21/boom-bubble-bust-boom-why-should-ai-be-different/",
    "summary": "The article argues that the three-year-old AI revolution is experiencing a massive technology bubble, akin to, but potentially larger and scarier than, the 1999 internet bubble. Authors Fred Vogelstein and Om Malik, drawing on their internet bubble experience, note exaggerated claims of rapid progress (\"AI dog years\") and recent stock declines in major AI players like Microsoft, Amazon, and Meta, despite strong NVIDIA earnings.\n\nThey contend that while AI holds profound long-term potential, current investment is wildly disproportionate to proven business models. Global AI spending estimates for 2025 ($600B-$1.5T) dwarf the 1999 internet bubble's peak ($360B in 2025 dollars), having inflated in two-thirds the time.\n\nUnlike 1999's public market craze, this bubble is primarily fueled by big tech's deep pockets and private investors. This concentration, leverage, and risk of massive write-downs on data centers make it \"scarier.\" Additional concerns include US economic instability and China competition, with industry leaders even acknowledging \"excess investment.\"\n\nThe authors identify four key vulnerabilities: too much spending, too much leverage, crazy deals, and China. OpenAI is highlighted as a prime example: valued at $500B (potentially $1T), it is burning billions annually ($8B in 2025, $17B in 2026), not expecting to be cash flow positive until 2029 after projected half a trillion in server costs. This \"get big fast\" strategy, with OpenAI's projected spending being 16 times Amazon's first five years (adjusted), signals an inevitable bust with more losers than winners.",
    "chinese_title": "繁荣，泡沫，破灭，繁荣。为什么AI会是例外呢？",
    "chinese_summary": "文章指出，历时三年的AI革命正在经历一场巨大的科技泡沫，其规模和恐怖程度可能超越1999年的互联网泡沫。作者弗雷德·沃格斯坦和奥姆·马利克借鉴他们互联网泡沫的经验指出，尽管英伟达盈利强劲，但仍存在对快速进展的夸大主张（“AI狗年”），且微软、亚马逊和Meta等主要AI公司的股价近期出现下跌。\n\n他们认为，尽管AI具有深远的长期潜力，但目前的投资与已证实商业模式极不相称。2025年全球AI支出估计（6000亿至1.5万亿美元）远超1999年互联网泡沫的峰值（以2025年美元计算为3600亿美元），且泡沫膨胀所需时间仅为其三分之二。\n\n与1999年公众市场的狂热不同，这次泡沫主要由科技巨头的雄厚财力和私人投资者推动。这种集中、高杠杆以及数据中心面临大规模减记的风险使其“更令人恐惧”。其他担忧包括美国经济不稳定和中国竞争，甚至有行业领袖承认存在“过度投资”。\n\n作者指出了四个主要弱点：支出过高、杠杆过高、疯狂交易和中国。OpenAI被视为一个典型例子：估值5000亿美元（可能达到1万亿美元），每年烧掉数十亿美元（2025年80亿美元，2026年170亿美元），预计在服务器成本达到5000亿美元之后，直到2029年才能实现现金流为正。这种“快速做大”的策略，加上OpenAI的预计支出是亚马逊前五年（调整后）的16倍，预示着一场不可避免的破产，届时输家将多于赢家。"
  },
  {
    "id": "45999872",
    "title": "Why top firms fire good workers",
    "url": "https://www.rochester.edu/newscenter/employee-turnover-why-top-firms-churn-good-workers-681832/",
    "summary": "The provided text is a promotional statement for the Simon Business School at the University of Rochester. It highlights the institution's commitment to an \"unabashedly analytical\" approach, where researchers and students apply \"rigorous analysis\" across various business domains, \"from markets to management.\" The ultimate goal is to \"advance ideas with real-world impact,\" asserting that they facilitate \"Business done better.\"\n\nNotably, while the title poses the question \"Why top firms fire good workers,\" the content itself does not address this topic but instead focuses on the school's methodology and mission.",
    "chinese_title": "为什么顶尖公司会解雇优秀员工？",
    "chinese_summary": "这段文字是罗切斯特大学西蒙商学院的一份宣传声明。它强调该机构致力于采用一种“不折不扣的分析”方法，研究人员和学生将“严谨的分析”应用于“从市场到管理”的各个商业领域。其最终目标是“推进具有现实世界影响力的思想”，并声称他们能促成“更卓越的商业实践”。\n\n值得注意的是，尽管标题提出了“为什么顶尖公司会解雇优秀员工”的问题，但内容本身并未涉及此主题，而是侧重于学院的方法论和使命。"
  },
  {
    "id": "46000015",
    "title": "Nursing excluded as 'professional' degree by Department of Education",
    "url": "https://nurse.org/news/nursing-excluded-as-professional-degree-dept-of-ed/",
    "summary": "The U.S. Department of Education (DOE) has ignited controversy within the nursing community by excluding nursing degrees from its definition of \"professional degrees\" in new guidance for \"gainful employment\" (GE) regulations. While fields such as medicine, law, dentistry, and even veterinary medicine are explicitly recognized as professional, Bachelor of Science in Nursing (BSN), Associate Degree in Nursing (ADN), and Master of Science in Nursing (MSN) programs are notably absent from this classification.\n\nThis exclusion carries significant implications. GE regulations aim to protect students from programs that result in excessive debt relative to earning potential. Professional degrees typically receive exemptions from certain GE reporting requirements, meaning nursing programs could now face increased scrutiny or be implicitly categorized as vocational rather than professional.\n\nLeading nursing organizations, including the American Association of Colleges of Nursing (AACN), American Nurses Association (ANA), National League for Nursing (NLN), and American Organization for Nursing Leadership (AONE), are vigorously protesting the decision. They argue that nursing is a highly skilled, science-based profession indispensable to healthcare, and that this oversight devalues the profession, its rigorous education, and its critical societal role. Nursing leaders are urging the DOE to rectify this error, emphasizing the BSN as the entry-level for professional practice and advocating for proper recognition of nursing as a professional discipline.",
    "chinese_title": "教育部不将护理学列为“专业”学位",
    "chinese_summary": "美国教育部(DOE)在针对“有偿就业”(GE)法规的新指南中，将其对“专业学位”的定义中排除护理学位，在护理界引发了争议。尽管医学、法律、牙科乃至兽医学等领域都被明确认定为专业，护理学学士(BSN)、护理学副学士(ADN)和护理学硕士(MSN)课程却明显缺席这一分类。\n\n这一排除带来了重大影响。GE法规旨在保护学生免受那些导致债务过高（相对于其收入潜力）的课程的影响。专业学位通常可免除某些GE报告要求，这意味着护理课程现在可能面临更严格的审查，或被默认为职业而非专业。\n\n包括美国护理学院协会(AACN)、美国护士协会(ANA)、美国护理联盟(NLN)和美国护理领导组织(AONE)在内的主要护理组织，正在强烈抗议这一决定。他们认为，护理是一项高度专业化、以科学为基础的职业，对医疗保健不可或缺，并且这一疏忽贬低了该专业、其严谨的教育及其重要的社会作用。护理界领导者正敦促DOE纠正这一错误，强调BSN是专业实践的入门级要求，并倡导将护理正式认定为一门专业学科。"
  },
  {
    "id": "45997722",
    "title": "Run Docker containers natively in Proxmox 9.1 (OCI images)",
    "url": "https://raymii.org/s/tutorials/Finally_run_Docker_containers_natively_in_Proxmox_9.1.html",
    "summary": "Proxmox VE 9.1 introduces a new feature that allows users to run Docker containers (OCI images) more \"natively,\" bypassing the need for separate virtual machines or error-prone Docker-in-LXC configurations. Proxmox VE achieves this by converting OCI images into standard LXC containers, leveraging tools like `skopeo` for the translation process.\n\nCurrently a tech preview, this functionality has some limitations: it doesn't support live migration or container orchestration, and image layers are squashed upon creation, meaning direct updates (like `docker pull`) are not straightforward and often require container recreation. While the container's console might not always provide a shell, `pct enter` allows access. Environment variables are configurable post-creation but not during initialization, and `docker-compose` files are not supported.\n\nThe process involves two main steps:\n1.  **Downloading the OCI image:** In the Proxmox GUI, navigate to your storage, click \"Pull from OCI Registry,\" and enter the full image URL (e.g., `docker.io/eclipse-mosquitto`).\n2.  **Creating the container:** Use the \"Create CT\" button, select the downloaded OCI image as the template, and configure volumes for persistent data (similar to Docker's `-v` option) and other standard LXC settings.\n\nProxmox VE automatically handles the conversion during container creation. Despite the underlying conversion and current limitations, this feature significantly streamlines running application containers directly on Proxmox VE, proving to be a major time-saver for users.",
    "chinese_title": "在 Proxmox 9.1 中原生运行 Docker 容器 (OCI 镜像)",
    "chinese_summary": "Proxmox VE 9.1 引入了一项新功能，允许用户更“原生”地运行 Docker 容器（OCI 镜像），无需单独的虚拟机或易出错的 Docker-in-LXC 配置。Proxmox VE 通过将 OCI 镜像转换为标准 LXC 容器来实现此功能，并利用 `skopeo` 等工具进行转换。\n\n作为一项技术预览功能，它目前存在一些限制：不支持实时迁移或容器编排，并且镜像层在创建时会被扁平化处理，这意味着直接更新（例如 `docker pull`）并不直接，通常需要重新创建容器。尽管容器的控制台可能不总能提供 shell 访问，但可以使用 `pct enter` 进入。环境变量可在创建后配置，但不能在初始化期间配置，并且不支持 `docker-compose` 文件。\n\n该过程主要包括两个步骤：\n1.  **下载 OCI 镜像：** 在 Proxmox GUI 中，导航到您的存储，点击“从 OCI 注册表拉取”（Pull from OCI Registry），然后输入完整的镜像 URL（例如 `docker.io/eclipse-mosquitto`）。\n2.  **创建容器：** 使用“创建 CT”（Create CT）按钮，选择已下载的 OCI 镜像作为模板，并配置用于持久化数据的卷（类似于 Docker 的 `-v` 选项）以及其他标准 LXC 设置。\n\nProxmox VE 在容器创建过程中会自动处理转换。尽管存在底层转换和当前的局限性，但此功能显著简化了在 Proxmox VE 上直接运行应用程序容器的过程，从而为用户节省了大量时间。"
  },
  {
    "id": "46005928",
    "title": "The New AI Consciousness Paper",
    "url": "https://www.astralcodexten.com/p/the-new-ai-consciousness-paper",
    "summary": "The article criticizes the generally low quality of discourse surrounding AI consciousness, highlighting a new paper in *Trends In Cognitive Science* by Yoshua Bengio and David Chalmers as a rare \"bright spot.\" This paper restricts itself to computational theories of consciousness, such as Recurrent Processing Theory (RPT), Global Workspace Theory (GWT), and Higher Order Theory (HOT), all of which involve some form of \"feedback.\"\n\nBased on a related technical report, the authors tentatively conclude that while current AI systems (like LLMs, which are mostly feedforward) are not conscious, there are \"no obvious technical barriers\" to building future AIs that satisfy these computational indicators (e.g., architectures like MaMBA).\n\nHowever, the reviewer critiques the philosophical contribution. The paper correctly distinguishes between \"access consciousness\" (what one can report or introspect) and \"phenomenal consciousness\" (internal experience, \"what it's like\"). While AIs might demonstrate rudimentary access consciousness (e.g., Anthropic's \"lie detector\" test), the key question is phenomenal consciousness. The author argues that despite acknowledging this distinction, the paper ultimately \"cuts corners\" by interpreting computational theories—which are arguably better suited to describing access consciousness—as indicators of phenomenal consciousness. This leads to absurd conclusions, such as suggesting a company or a microphone feedback loop could be considered phenomenally conscious based on these criteria, revealing a fundamental mismatch between the computational indicators and the elusive nature of inner experience.",
    "chinese_title": "新AI意识论文",
    "chinese_summary": "该文章批评了围绕AI意识的讨论普遍质量低下，并重点提到Yoshua Bengio和David Chalmers在《认知科学趋势》上发表的一篇新论文，认为其是罕见的“亮点”。该论文仅限于探讨意识的计算理论，例如循环处理理论（RPT）、全局工作空间理论（GWT）和高阶理论（HOT），这些理论都涉及某种形式的“反馈”。\n\n基于一份相关的技术报告，作者们初步得出结论，尽管当前的AI系统（如大多采用前馈架构的大语言模型）不具备意识，但在技术上“没有明显障碍”来构建满足这些计算指标的未来AI系统（例如MaMBA等架构）。\n\n然而，评论者批评了该论文的哲学贡献。论文正确地区分了“可通达意识”（即一个人能报告或内省的内容）和“现象意识”（即内部体验，其主观感受）。尽管AI可能展现出初步的可通达意识（例如Anthropic的“测谎仪”测试），但关键问题在于现象意识。评论者认为，尽管论文承认了这一区别，但最终却“含糊处理”，将更适合描述可通达意识的计算理论解释为现象意识的指标。这导致了荒谬的结论，例如根据这些标准，一家公司或一个麦克风反馈回路可能被认为是具有现象意识的，揭示了计算指标与内在体验的难以捉摸的本质之间存在根本性的不匹配。"
  },
  {
    "id": "46011978",
    "title": "Moss Survives 9 Months in Space Vacuum",
    "url": "https://scienceclock.com/moss-survives-9-months-in-space-vacuum/",
    "summary": "Scientists have discovered that spreading earthmoss (Physcomitrium patens) spores can survive the harsh conditions of open space for nine months. Researchers mounted spore capsules of this small moss species on the exterior of the International Space Station (ISS), exposing them to direct solar radiation, vacuum, and extreme temperature fluctuations.\n\nTo their surprise, over 80 percent of the spores germinated successfully upon returning to Earth, a much higher survival rate than the \"almost zero\" expected. The spores showed only a slight decrease in chlorophyll a and otherwise grew normally, indicating no major stress from their time in orbit.\n\nThis remarkable toughness is attributed to the evolutionary history of bryophytes (mosses, liverworts, hornworts), which were among the first plants to colonize land about 500 million years ago, developing protective structures to withstand drying and direct sunlight.\n\nThe findings place moss spores alongside a select group of organisms, like tardigrades and certain microbes, known for tolerating direct space exposure. This durability has significant implications for understanding life's potential in extreme extraterrestrial environments. Researchers suggest mosses, which require minimal soil and can extract nutrients from rock, could be prime candidates for establishing early ecosystems on the Moon or Mars, opening a \"new frontier\" for extraterrestrial colonization. The research was published in iScience.",
    "chinese_title": "苔藓太空真空存活9个月",
    "chinese_summary": "科学家们发现，匍匐土藓 (Physcomitrium patens) 的孢子能在外太空的恶劣环境下存活长达九个月。研究人员将这种小型苔藓的孢子胶囊安装在国际空间站 (ISS) 的外部，使其暴露于太阳直接辐射、真空和极端温度波动之中。\n\n令他们惊讶的是，超过80%的孢子在返回地球后成功发芽，这一存活率远高于预期“几乎为零”的水平。这些孢子仅表现出叶绿素 a 的轻微下降，并且在其他方面生长正常，表明它们在轨道上没有受到重大压力。\n\n这种非凡的韧性归因于苔藓植物（包括苔藓、地钱和角苔）的进化史，它们是大约5亿年前首批在陆地定居的植物之一，进化出了抵抗干燥和阳光直射的保护结构。\n\n这些发现将苔藓孢子与水熊虫和某些微生物等少数已知能耐受直接太空暴露的生物并列。这种顽强性对于理解生命在极端地外环境中的潜力具有重要意义。研究人员认为，苔藓只需少量土壤即可生长，并能从岩石中提取养分，这使其成为在月球或火星上建立早期生态系统的主要候选者，为地外殖民开辟了“新前沿”。该研究发表在《iScience》杂志上。"
  },
  {
    "id": "46009660",
    "title": "Is Matrix Multiplication Ugly?",
    "url": "https://mathenchant.wordpress.com/2025/11/21/is-matrix-multiplication-ugly/",
    "summary": "The article refutes Stephen Witt's claim that matrix multiplication is \"ugly\" due to its non-commutative property (AB ≠ BA). The author argues Witt misunderstands matrices, which are fundamentally about \"transformations,\" particularly geometric ones like reflections.\n\nMatrix multiplication represents the composition of these transformations. The author demonstrates that the order in which transformations are applied naturally affects the outcome (e.g., flipping an image then reflecting it yields a different result than reflecting then flipping). Thus, AB ≠ BA is not a flaw, but an inherent and elegant property reflecting the nature of transformations. Far from lacking symmetry, matrix theory is a crucial tool for understanding symmetry.\n\nThe author speculates that Witt's perception of ugliness stems from the *tediousness* of manual matrix calculations, rather than the concept itself. He clarifies that G. H. Hardy, Witt's cited mathematician, disliked lengthy calculations within mathematical *proofs*, not the mathematical concepts or their practical applications. The repetitive, \"soul-crushing\" work of calculation is distinct from the conceptual beauty and power of matrix algebra, which now underpins fields like AI. Computers handle the tedious calculations, leaving the conceptual elegance of matrices intact.",
    "chinese_title": "矩阵乘法丑陋吗？",
    "chinese_summary": "文章反驳了斯蒂芬·威特关于矩阵乘法因其不具备交换律 (AB ≠ BA) 而“很丑”的说法。作者认为威特误解了矩阵，矩阵本质上是关于“变换”的，尤其是像反射这样的几何变换。\n\n矩阵乘法代表了这些变换的复合。作者证明了变换的应用顺序自然会影响结果（例如，先翻转图像再反射与先反射再翻转会得到不同的结果）。因此，AB ≠ BA并非缺陷，而是反映变换本质的内在而优雅的特性。矩阵理论非但不缺乏对称性，反而是理解对称性的重要工具。\n\n作者推测，威特对“丑陋”的看法源于手动矩阵计算的*繁琐*，而非概念本身。他澄清说，威特所引用的数学家G. H. Hardy，不喜欢数学*证明*中的冗长计算，而非数学概念或其实际应用。重复且“令人心力交瘁”的计算工作，与矩阵代数的概念之美和强大功能是截然不同的，矩阵代数现在支撑着人工智能等领域。计算机处理繁琐的计算，从而保留了矩阵的概念之美。"
  },
  {
    "id": "46010806",
    "title": "Sharper MRI scans may be on horizon thanks to new physics-based model",
    "url": "https://news.rice.edu/news/2025/sharper-mri-scans-may-be-horizon-thanks-new-physics-based-model",
    "summary": "Sharper MRI scans may be on the horizon due to a new physics-based model developed by Rice University researchers. The model aims to overcome a fundamental limitation in MRI technology: the trade-off between image clarity and scan speed. Currently, achieving high-resolution images often requires longer scan times, making the process less practical for patients and more susceptible to motion artifacts.\n\nThe Rice team, led by electrical and computer engineer Ashok Veeraraghavan and physicist Anatoly Kolomensky, developed an algorithm that can extract more information from existing low-resolution, noisy MRI data. Their model leverages the principles of quantum mechanics, specifically the concept that quantum states are naturally sparse and can be described by a limited set of parameters. By treating the detected signals as quantum states, their algorithm can reconstruct high-fidelity images even from sparse measurements.\n\nThis new approach has the potential to significantly improve the quality of MRI scans without requiring hardware upgrades or extending scan times. It could lead to clearer images for diagnosing conditions like cancer and neurological disorders, as well as making scans more comfortable and efficient for patients. The researchers are now working on applying this model to reconstruct 3D images and exploring its implications for various medical imaging applications.",
    "chinese_title": "新的物理学模型有望带来更清晰的核磁共振成像。",
    "chinese_summary": "莱斯大学研究人员开发了一种新的基于物理的模型，有望带来更清晰的核磁共振（MRI）扫描。该模型旨在克服MRI技术的一个根本性局限：图像清晰度与扫描速度之间的权衡。目前，获取高分辨率图像通常需要更长的扫描时间，这使得该过程对患者来说实用性降低，并且更容易受到运动伪影的影响。\n\n由电气与计算机工程师Ashok Veeraraghavan和物理学家Anatoly Kolomensky领导的莱斯大学团队开发了一种算法，可以从现有的低分辨率、有噪声的MRI数据中提取更多信息。他们的模型利用了量子力学原理，具体来说是量子态本质上是稀疏的，并且可以用有限的参数集来描述这一概念。通过将检测到的信号视为量子态，他们的算法即使从稀疏的测量数据中也能重建高保真图像。\n\n这种新方法有潜力显著提高核磁共振扫描的质量，而无需硬件升级或延长扫描时间。它可以带来更清晰的图像，用于诊断癌症和神经系统疾病等病症，同时使扫描过程对患者来说更舒适、更高效。研究人员目前正在致力于将该模型应用于重建3D图像，并探索其在各种医学成像应用中的潜力。"
  },
  {
    "id": "46004118",
    "title": "Jmail: Gmail Clone with Epstein's Emails",
    "url": "https://jmail.world",
    "summary": "The provided content simulates \"Jmail,\" a Gmail-like interface logged in as \"Jeffrey Epstein, [email protected],\" showcasing \"real emails released by Congress.\" The platform allows users to explore emails by name, star messages, search, or navigate randomly through 2235 entries.\n\nThe displayed emails, predominantly from 2018-2019, reveal a mix of news consumption and personal correspondence. Many entries are digests from Quora and Flipboard, covering current events such as the Mueller investigation, Alex Acosta's resignation following Epstein's arrest, global politics (e.g., Kim-Trump meeting), and economic news.\n\nNotable individual correspondents include Steve Bannon, Joichi Ito, and Paul Morris. Their exchanges touch on topics like capital market outlooks, academic gifts, and political commentary. Several emails directly relate to Epstein's legal context, such as a forwarded article titled \"Epstein prosecutor was rebuked for prior child sex case\" and a message from Nicholas Ribis stating \"More bad news for our friend.\" There are also multiple references to Donald Trump, including articles about \"Trump @ War\" and \"Donald Trump's High Crimes and Misdemeanors,\" often with Epstein or Bannon's brief reactions. The interface provides a glimpse into Epstein's digital communications and the news he followed during this period.",
    "chinese_title": "Jmail：Gmail 克隆版，含爱泼斯坦的邮件",
    "chinese_summary": "所提供的内容模拟了一个名为“Jmail”、类似于Gmail的界面，该界面以“Jeffrey Epstein, [email protected]”的身份登录，并展示了“国会发布的真实电子邮件”。该平台允许用户通过姓名浏览邮件、给邮件加星标、搜索，或随机查看2235条条目。\n\n所展示的电子邮件主要来自2018-2019年，内容混合了新闻阅读和私人通信。许多条目是来自Quora和Flipboard的摘要，涵盖了当前事件，例如穆勒调查、爱泼斯坦被捕后亚历克斯·阿科斯塔的辞职、全球政治（如金正恩-特朗普会晤）以及经济新闻。\n\n值得注意的个人通信对象包括史蒂夫·班农、伊藤穰一和保罗·莫里斯。他们的交流涉及资本市场前景、学术馈赠和政治评论等话题。有几封电子邮件直接与爱泼斯坦的法律背景相关，例如一篇题为“爱泼斯坦案检察官因先前儿童性侵案受指责”的转发文章，以及尼古拉斯·里比斯发来的一条消息，写道“对我们的朋友来说是更多的坏消息”。此外，还有多处提及唐纳德·特朗普，包括关于“特朗普在战争中”和“唐纳德·特朗普的重罪和轻罪”的文章，通常附有爱泼斯坦或班农的简短评论。该界面让人们得以一窥爱泼斯坦在此期间的数字通信以及他所关注的新闻。"
  },
  {
    "id": "45996433",
    "title": "Mozilla says it's finally done with Onerep",
    "url": "https://krebsonsecurity.com/2025/11/mozilla-says-its-finally-done-with-two-faced-onerep/",
    "summary": "Mozilla is finally ending its partnership with Onerep, an identity protection service, after a 16-month delay. The decision stems from a March 2024 KrebsOnSecurity investigation that revealed Onerep's founder, Dimitri Shelest, also created and operated numerous people-search services, including the active data broker Nuwber.\n\nDespite initially announcing a wind-down in March 2024, Mozilla continued promoting Onerep. This week, Mozilla confirmed the partnership will officially conclude next month. As a result, its \"Monitor Plus\" service, which offered automated data removal via Onerep, will be discontinued.\n\nMozilla will continue to offer its free \"Monitor\" data breach service and aims to integrate more privacy features, such as its VPN, directly into Firefox. Current Monitor Plus subscribers will retain full access until December 17, 2025, after which they will receive prorated refunds. Mozilla stated that maintaining high vendor standards and the complexities of the data broker ecosystem made it challenging to consistently deliver expected value and reliability. Shelest had acknowledged his ownership stake in Nuwber, founded around the same time as Onerep in 2015.",
    "chinese_title": "谋智表示终于与Onerep了结了",
    "chinese_summary": "Mozilla 在拖延了16个月之后，终于终止了与身份保护服务 Onerep 的合作。该决定源于 KrebsOnSecurity 在2024年3月的一项调查，该调查揭示 Onerep 的创始人 Dimitri Shelest 还创建并运营了众多人员搜索服务，其中包括活跃的数据经纪公司 Nuwber。\n\n尽管 Mozilla 最初在2024年3月宣布将逐步停止合作，但它却继续推广 Onerep。本周，Mozilla 证实该合作将于下个月正式结束。因此，其通过 Onerep 提供自动数据删除的“Monitor Plus”服务将停止。\n\nMozilla 将继续提供其免费的“Monitor”数据泄露服务，并计划将更多隐私功能（例如其 VPN）直接集成到 Firefox 中。现有的 Monitor Plus 订阅用户将保留全部访问权限直至2025年12月17日，此后将获得按比例退款。Mozilla 表示，维护高标准的供应商以及数据经纪生态系统的复杂性，使其难以持续提供预期的价值和可靠性。Shelest 曾承认他在 Nuwber 持有所有权股份，该公司于2015年与 Onerep 大致同时成立。"
  },
  {
    "id": "46006848",
    "title": "McDonald's is losing its low-income customers",
    "url": "https://www.latimes.com/business/story/2025-11-16/mcdonalds-is-losing-its-low-income-customers",
    "summary": "Fast-food prices have risen significantly, causing McDonald's and the broader industry to lose their core low-income customer base. These patrons are increasingly being replaced by higher earners, a trend confirmed by McDonald's CEO Christopher Kempczinski, who noted a double-digit drop in low-income traffic.\n\nThe average McDonald's menu item price increased by 40% from 2019 to 2024. This surge is attributed to soaring costs for restaurant essentials like labor and beef (due to drought, tariffs, and alleged price-fixing in the meat industry), compounded by general inflation in housing, childcare, and groceries.\n\nLow-income households, particularly those earning under $45,000 annually, are severely impacted. They face \"huge year-over-year increases\" in credit delinquencies, and half of all renters are cost-burdened, spending over 30% of their income on housing. For those earning under $30,000, residual income for other needs has plummeted to a median of just $250 per month. This highlights a \"K-shaped economy\" where wealthier consumers maintain spending while lower-income individuals pull back.\n\nHistorically, McDonald's saw a major turnaround in the early 2000s with its Dollar Menu, specifically appealing to budget-conscious consumers. However, this menu became unsustainable due to inflation. Recent attempts by McDonald's to attract cash-strapped customers with $5 deals and other value offers have yielded mixed results, despite a recent modest sales lift.\n\nEconomists warn that economic and policy headwinds disproportionately affect lower-income households, making affordability a pressing issue. Businesses are wary of passing on further price increases, recognizing that consumers have little tolerance left after years of inflation.",
    "chinese_title": "麦当劳正在失去低收入顾客",
    "chinese_summary": "快餐价格大幅上涨，导致麦当劳和整个行业失去了其核心的低收入客户群。这些顾客正越来越多地被高收入者取代，麦当劳首席执行官克里斯托弗·肯普钦斯基证实了这一趋势，他指出低收入顾客流量出现了两位数的下降。\n\n从2019年到2024年，麦当劳菜单商品的平均价格上涨了40%。这一涨幅归因于劳动力和牛肉等餐厅必需品成本的飙升（受干旱、关税以及肉类行业涉嫌价格操纵的影响），同时住房、育儿和食品杂货等方面的普遍通胀也加剧了这一情况。\n\n低收入家庭，特别是年收入低于4.5万美元的家庭，受到了严重影响。他们面临信贷违约“同比大幅增长”的情况，并且一半的租房者承受着过高的租金负担，将超过30%的收入用于住房。对于年收入低于3万美元的人来说，用于其他需求的剩余收入已降至每月中位数仅250美元。这凸显了“K型经济”的特点，即富裕消费者保持消费，而低收入个人则削减开支。\n\n历史上，麦当劳在21世纪初通过其“一元菜单”实现了重大转机，特别吸引了精打细算的消费者。然而，由于通货膨胀，这一菜单变得不可持续。麦当劳最近尝试通过5美元套餐和其他超值优惠来吸引手头拮据的顾客，尽管近期销售额略有提升，但结果喜忧参半。\n\n经济学家警告称，经济和政策逆风不成比例地影响着低收入家庭，使得可负担性成为一个紧迫的问题。企业不愿进一步转嫁价格上涨的成本，因为他们认识到，在经历了多年的通货膨胀后，消费者已所剩无几的忍耐度。"
  },
  {
    "id": "45995918",
    "title": "RFK Jr.'s loathesome edits: CDC website now falsely links vaccines and autism",
    "url": "https://arstechnica.com/health/2025/11/rfk-jr-s-loathesome-edits-cdc-website-now-falsely-links-vaccines-and-autism/",
    "summary": "Under Robert F. Kennedy Jr.'s leadership as the country’s top health official, the CDC's \"Autism and Vaccines\" webpage was abruptly changed to falsely suggest a link between vaccines and autism. Previously, the site accurately stated that studies show \"no link between receiving vaccines and developing autism spectrum disorder (ASD).\" Now, it claims that \"The claim ‘vaccines do not cause autism’ is not an evidence-based claim because studies have not ruled out the possibility that infant vaccines cause autism.\"\n\nThis move is predicted to sow distrust, erode vaccination rates, and lead to more disease. HHS attributed the changes to \"gold standard, evidence-based science,\" but career CDC scientists reportedly were not consulted. The updated page cherry-picks fringe studies, misrepresents old data, and falsely implicates aluminum adjuvants, even in vaccines that don't contain them. It ignores a recent high-quality study of 1.2 million children refuting the aluminum link, which Kennedy had unsuccessfully demanded be retracted.\n\nMedical experts have expressed dismay and anger. The American Academy of Pediatrics, through its President Susan Kressly, blasted the changes, reiterating that over 40 high-quality studies involving 5.6 million people confirm \"no link between vaccines and autism.\" Kressly accused those promoting the myth of being \"misinformed or intentionally trying to mislead parents\" and urged the CDC to stop amplifying false claims.",
    "chinese_title": "小罗伯特·F·肯尼迪的恶劣修改：疾控中心网站现竟虚假地将疫苗与自闭症联系起来",
    "chinese_summary": "在小罗伯特·F·肯尼迪担任该国最高卫生官员的领导下，疾控中心（CDC）的“自闭症与疫苗”网页突然被修改，错误地暗示疫苗与自闭症之间存在关联。此前，该网站准确指出研究显示“接种疫苗与患上自闭症谱系障碍（ASD）之间没有关联”。现在，它声称“‘疫苗不会导致自闭症’这一说法并非基于证据的主张，因为研究尚未排除婴儿疫苗导致自闭症的可能性。”\n\n预计此举将播下不信任的种子，侵蚀疫苗接种率，并导致更多疾病。卫生与公众服务部（HHS）将这些修改归因于“黄金标准、循证科学”，但据报道，疾控中心的职业科学家并未被征求意见。更新后的页面断章取义地选择边缘研究，歪曲旧数据，并错误地牵连铝佐剂，甚至在不含铝佐剂的疫苗中也如此。它忽视了一项近期针对120万儿童的高质量研究，该研究驳斥了铝的关联性，而肯尼迪曾要求撤回该研究但未成功。\n\n医学专家对此表示震惊和愤怒。美国儿科学会通过其主席苏珊·克雷斯利（Susan Kressly）严厉抨击了这些修改，重申超过40项涉及560万人的高质量研究证实“疫苗与自闭症之间没有关联”。克雷斯利指责那些宣扬这一神话的人“要么被误导，要么是蓄意误导家长”，并敦促疾控中心停止放大虚假主张。"
  },
  {
    "id": "45998531",
    "title": "Gmail can read your emails and attachments to train its AI, unless you opt out",
    "url": "https://www.malwarebytes.com/blog/news/2025/11/gmail-is-reading-your-emails-and-attachments-to-train-its-ai-unless-you-turn-it-off",
    "summary": "Google has reportedly started automatically opting Gmail users in to allow their private messages and attachments to be used for training its AI models, including Gemini. This move, aimed at powering new Gmail features like Smart Compose and AI-generated replies, means user data could be analyzed to refine Google's AI assistants.\n\nThe change is rolling out quietly, with settings switched on by default, requiring users to manually opt out if they don't want their emails used for AI training. While Google promises privacy measures like anonymization, the lack of explicit consent and the use of sensitive information raise significant privacy concerns for many, despite the potential for smarter, more personalized Gmail features.\n\nTo fully opt out, users must adjust settings in two separate locations:\n1.  **Turn off \"Smart Features in Gmail, Chat, and Meet\"**: Go to Gmail settings, find this section, uncheck the option, and save.\n2.  **Turn off \"Google Workspace smart features\"**: Still in settings, navigate to \"Manage Workspace smart feature settings,\" and toggle off both \"Smart features in Google Workspace\" and \"Smart features in other Google products,\" then save.\n\nIt's crucial to disable both as one covers Workspace apps (email, chat, meet) and the other covers smart features across other Google products. Users should verify that both toggles remain off. Google is gradually rolling this out, so while settings might not be enabled for everyone yet, checking them is advised for privacy-conscious individuals.",
    "chinese_title": "Gmail 可以读取你的电子邮件和附件来训练其人工智能，除非你选择退出。",
    "chinese_summary": "谷歌据报道已开始默认让Gmail用户选择加入，允许其私人邮件和附件用于训练包括Gemini在内的人工智能模型。此举旨在为Gmail的新功能（如智能撰写和AI生成回复）提供支持，意味着用户数据可能被分析以改进谷歌的AI助手。\n\n这一改变正在悄然推出，设置默认开启，用户若不希望自己的邮件被用于AI训练，需要手动选择退出。尽管谷歌承诺采取匿名化等隐私措施，但缺乏明确同意和敏感信息的使用，引发了许多人对隐私的重大担忧，即便这可能带来更智能、更个性化的Gmail功能。\n\n要完全选择退出，用户必须在两个不同的位置调整设置：\n1.  **关闭“Gmail、Chat 和 Meet 中的智能功能”**：前往Gmail设置，找到此部分，取消勾选该选项并保存。\n2.  **关闭“Google Workspace 智能功能”**：仍在设置中，导航至“管理 Workspace 智能功能设置”，然后关闭“Google Workspace 中的智能功能”和“其他 Google 产品中的智能功能”这两个选项，并保存。\n\n同时禁用这两个选项至关重要，因为一个涵盖Workspace应用（邮件、聊天、会议），另一个则涵盖其他Google产品中的智能功能。用户应核实这两个开关都保持关闭状态。谷歌正在逐步推行此功能，因此虽然并非所有用户的设置都已启用，但建议关注隐私的用户检查一下。"
  },
  {
    "id": "46004364",
    "title": "EXIF orientation info in PNGs isn't used for image-orientation: from-image",
    "url": "https://bugzilla.mozilla.org/show_bug.cgi?id=1627423",
    "summary": "This bug report, titled \"EXIF orientation info in PNGs isn't used for image-orientation: from-image,\" describes an issue where browsers, specifically Firefox, fail to correctly orient PNG images based on their embedded EXIF data when `image-orientation: from-image` is applied.\n\nFiled by Eric Portis five years ago, the reporter demonstrated that a JPEG and a PNG, both containing the same EXIF \"Rotate 90 CW\" orientation information, displayed differently in browsers. The JPEG rotated correctly, but the PNG did not, contrary to expectations.\n\nFurther investigation revealed that while the PNG specification (PNG-3) defines an `eXIf` chunk for EXIF data, its placement within the file (before or after image data) affected browser interpretation. At the time, Firefox and Chrome did not respect EXIF orientation in PNGs at all, while Safari only did if the EXIF data appeared before the image data. The `eXIf` chunk was noted as a valid, though less common, PNG extension.\n\nThe bug's status changed over time, blocking several other related issues. It was eventually marked \"RESOLVED DUPLICATE\" two months ago, indicating that the problem was addressed and fixed as part of another bug, Bug 1682759. This suggests that the capability to properly interpret EXIF orientation in PNGs is now expected to be implemented.",
    "chinese_title": "PNG图像中的EXIF方向信息不用于`image-orientation: from-image`。",
    "chinese_summary": "这份题为“PNG中的EXIF方向信息未用于`image-orientation: from-image`”的bug报告，描述了一个问题，即当应用`image-orientation: from-image`时，浏览器（尤其是Firefox）未能根据PNG图像中嵌入的EXIF数据正确地调整其方向。\n\n该报告由Eric Portis于五年前提交，报告者演示了包含相同EXIF“旋转90度顺时针”方向信息的一张JPEG图像和一张PNG图像在浏览器中显示不同。JPEG图像正确旋转，而PNG图像则没有，这与预期相反。\n\n进一步调查显示，尽管PNG规范（PNG-3）为EXIF数据定义了一个`eXIf`数据块，但它在文件中的位置（在图像数据之前或之后）影响了浏览器的解释。当时，Firefox和Chrome完全不遵守PNG中的EXIF方向信息，而Safari只有当EXIF数据出现在图像数据之前时才遵守。`eXIf`数据块被认为是一个有效但不太常见的PNG扩展。\n\n这个bug的状态随着时间而改变，阻塞了其他几个相关问题。它最终在两个月前被标记为“RESOLVED DUPLICATE”（已解决，重复），表明该问题已作为另一个bug（Bug 1682759）的一部分得到处理和修复。这表明，现在预计已实现正确解释PNG中EXIF方向信息的功能。"
  },
  {
    "id": "46003876",
    "title": "Brexit Hit to UK Economy Double Official Estimate, Study Finds",
    "url": "https://www.bloomberg.com/news/articles/2025-11-21/brexit-hit-to-uk-economy-double-official-estimate-study-finds",
    "summary": "A new study co-authored by a senior Bank of England economist suggests Brexit has inflicted almost double the economic damage on the UK compared to official estimates.\n\nThe research, presented to the Office for Budget Responsibility (OBR), calculates that the 2016 vote to leave the European Union has cost the UK between 6% and 8% of GDP per person over the past decade. This translates to an economic hit ranging from £180 billion ($235 billion) to £240 billion. In contrast, the OBR, the government’s independent forecaster, currently estimates the damage at 4% of GDP.",
    "chinese_title": "脱欧冲击英国经济达官方估算两倍，研究发现",
    "chinese_summary": "一项由英格兰银行高级经济学家合著的新研究表明，与官方估计相比，英国脱欧给英国造成的经济损失几乎是官方估计的两倍。\n\n该研究已提交给预算责任办公室（OBR），并计算得出，2016年投票脱离欧盟在过去十年中使英国人均GDP损失了6%至8%。这相当于1800亿英镑（2350亿美元）到2400亿英镑的经济损失。相比之下，预算责任办公室（OBR）——政府的独立预测机构——目前估计损失为GDP的4%。"
  },
  {
    "id": "46013960",
    "title": "ADHD and monotropism (2023)",
    "url": "https://monotropism.org/adhd/",
    "summary": "The article explores the potential link between ADHD and monotropism, a theory initially formulated to explain autistic experiences as a tendency to concentrate attention on a small number of things. Despite differing diagnostic criteria – ADHD as attentional, autism as social, with seemingly contradictory traits like rigid interests versus impulsivity – many diagnosed with ADHD identify strongly with monotropism.\n\nThe author, Fergus Murray, suggests that autism and ADHD, or \"Kinetic Cognitive Style (KCS),\" might share an underlying monotropic cause. He proposes that ADHD traits like impulsivity, inattention, and hyperactivity could stem from a monotropic processing style. Impulsivity might arise from losing awareness when attention shifts, and inattention from profound difficulty redirecting attention away from current interests. Hyperactivity, whether a need to move (like stimming) or cognitive \"attention-hopping,\" can be reconciled by considering monotropism combined with factors like difficulty accessing flow states, high novelty-seeking, or rapid \"serial monotropism.\"\n\nThe article notes that outward presentation heavily influences current diagnoses, potentially masking underlying monotropic cognitive styles in individuals who develop coping mechanisms. While speculative, the significant overlap and strong correlation between monotropism and both ADHD and autism warrant extensive future research to understand these neurodivergences from an internal, cognitive perspective rather than solely surface-level observations.",
    "chinese_title": "注意力缺陷多动障碍 和 单一模式 (2023)",
    "chinese_summary": "文章探讨了注意力缺陷多动障碍（ADHD）与单向聚焦理论之间的潜在联系，后者最初是为解释自闭症体验而提出的，即倾向于将注意力集中在少数事物上。尽管诊断标准不同——ADHD侧重于注意力，自闭症侧重于社交，且存在刻板兴趣与冲动性等看似矛盾的特质——许多被诊断为ADHD的人强烈认同单向聚焦理论。\n\n作者弗格斯·默里提出，自闭症和ADHD，或称“动力认知风格（KCS）”，可能共享一个潜在的单向聚焦原因。他认为，ADHD的特质，如冲动性、注意力不集中和多动性，可能源于一种单向聚焦的处理风格。冲动性可能源于注意力转移时意识的丧失，而注意力不集中则源于难以将注意力从当前兴趣中转移开。多动性，无论是需要移动（如刻板行为）还是认知上的“注意力跳跃”，都可以通过将单向聚焦理论与难以进入心流状态、高度寻求新奇或快速的“连续单向聚焦”等因素结合起来加以调和。\n\n文章指出，外在表现严重影响当前的诊断，这可能掩盖了那些发展出应对机制的个体中潜在的单向聚焦认知风格。尽管具有推测性，但单向聚焦理论与ADHD和自闭症之间显著的重叠和强烈相关性，值得未来进行广泛研究，以从内部、认知的角度而非仅仅是表面观察来理解这些神经多样性。"
  },
  {
    "id": "45997729",
    "title": "U.S. Coast Guard will no longer classify swastikas, nooses as hate symbols",
    "url": "https://www.washingtonpost.com/national-security/2025/11/20/coast-guard-swastika-noose/",
    "summary": "Unable to access the article link.",
    "chinese_title": "美国海岸警卫队不再将万字符、绞索认定为仇恨符号",
    "chinese_summary": "无法访问文章链接"
  },
  {
    "id": "46015379",
    "title": "'The French people want to save us': help pours in for glassmaker Duralex",
    "url": "https://www.theguardian.com/world/2025/nov/22/french-people-want-to-save-us-help-pours-glassmaker-duralex",
    "summary": "French glassmaker Duralex, a brand evoking deep nostalgia and national pride, experienced an astonishing outpouring of public support, raising its €5 million emergency funding target in just five hours and 40 minutes. Pledges subsequently soared to over €19 million, though as a staff cooperative, Duralex could only accept the initial €5 million.\n\nDirector General François Marciano stated the response \"astonished everyone,\" attributing it to \"The French people want to save us. They are fed up with factories closing.\" This success comes after Duralex faced receivership four times in two decades, with Marciano leading a staff buyout 18 months ago, making 180 of 243 employees associates.\n\nThe appeal sparked a \"tsunami of orders,\" with the factory now struggling to keep up. Duralex is renowned for its highly durable, microwave, freezer, and dishwasher-safe glassware, particularly the iconic Picardie tumbler, celebrated as a design classic. The manufacturing process, largely unchanged since 1945, involves heating raw materials to 1,400C and rigorous quality control.\n\nDespite the fundraising boost, high gas and electricity costs remain a significant concern. The €5 million will fund factory modernization and new products, including a partnership with the Élysée presidential palace and plans for international expansion into the UK and US with pint glasses, acknowledging the challenge of building brand recognition abroad. The company hopes to break even by 2027, having already seen turnover increase by 22% since becoming a co-op.",
    "chinese_title": "“法国人想救我们”：玻璃制造商杜拉丽获援助如潮",
    "chinese_summary": "法国玻璃制造商杜拉乐士（Duralex）是一个唤起人们深深怀旧情感和民族自豪感的品牌，它获得了惊人的公众支持，仅在5小时40分钟内就筹集到了500万欧元的紧急资金目标。随后的认捐额飙升至逾1900万欧元，但作为一家员工合作社，杜拉乐士只能接受最初的500万欧元。\n\n总经理弗朗索瓦·马西亚诺表示，这一反响“让所有人感到震惊”，他将其归因于“法国人民想拯救我们。他们厌倦了工厂倒闭。”这一成功是在杜拉乐士在二十年内四次面临破产管理之后取得的，马西亚诺在18个月前领导了一次员工收购，使243名员工中的180人成为合作社成员。\n\n这次呼吁引发了“订单海啸”，工厂现在难以跟上生产。杜拉乐士以其高度耐用、可用于微波炉、冰箱和洗碗机的玻璃器皿而闻名，尤其是其标志性的皮卡第（Picardie）玻璃杯，被誉为设计经典。其制造工艺自1945年以来基本未变，包括将原材料加热到1400摄氏度以及严格的质量控制。\n\n尽管筹集到了资金，高昂的天然气和电力成本仍然是一个重大担忧。这500万欧元将用于工厂现代化改造和新产品开发，包括与爱丽舍宫（法国总统府）的合作，并计划通过品脱杯进军英国和美国市场，同时认识到在海外建立品牌知名度的挑战。该公司希望到2027年实现收支平衡，自成为合作社以来，其营业额已增长了22%。"
  },
  {
    "id": "46003266",
    "title": "Germany: States Pass Porn Filters for Operating Systems",
    "url": "https://www.heise.de/en/news/Youth-Protection-States-Pass-Porn-Filters-for-Operating-Systems-11086768.html",
    "summary": "The German states (Länder) have passed a bill requiring operating systems sold in Germany to include a pre-installed \"porn filter\" as part of their youth protection measures. This filter, aimed at blocking \"youth-endangering content,\" would be inactive by default and require explicit activation by the user, likely involving an age verification process.\n\nThe proposal has drawn significant criticism, particularly from the Chaos Computer Club (CCC) and other digital rights advocates. Critics argue that such filters are technically ineffective, easily circumvented, and could create a false sense of security while potentially leading to censorship or surveillance. They also raise concerns about the technical feasibility for operating system manufacturers and the broad definition of \"youth-endangering content.\"\n\nDespite these objections, the states' decision reflects an ongoing effort to enhance youth protection online. The bill is not yet law and must still undergo further legislative stages, including approval by the Bundestag, before it can be enacted. The debate highlights the tension between safeguarding minors and upholding digital freedoms and technical realities.",
    "chinese_title": "德国：各州通过操作系统色情过滤器",
    "chinese_summary": "德国各州（Länder）通过了一项法案，要求在德国销售的操作系统必须包含一个预装的“色情过滤器”，作为其青少年保护措施的一部分。该过滤器旨在屏蔽“危害青少年内容”，默认情况下处于非活动状态，需要用户明确激活，这可能涉及年龄验证过程。\n\n该提案遭到了大量批评，特别是来自混沌电脑俱乐部（CCC）和其他数字权利倡导者的批评。批评者认为，此类过滤器在技术上无效，易于规避，并可能制造一种虚假的安全感，同时可能导致审查或监控。他们还对操作系统制造商的技术可行性以及“危害青少年内容”的宽泛定义表示担忧。\n\n尽管存在这些反对意见，但各州的决定反映了其在加强在线青少年保护方面的持续努力。该法案尚未成为法律，在生效前仍需经过进一步的立法阶段，包括获得联邦议院的批准。这场辩论凸显了保护未成年人与维护数字自由及技术现实之间的紧张关系。"
  },
  {
    "id": "46013477",
    "title": "Roblox CEO Makes a Fool of Himself in Car-Crash Interview",
    "url": "https://kotaku.com/roblox-new-york-times-interview-baszucki-2000646174",
    "summary": "Roblox CEO David Baszucki gave a widely criticized \"car-crash\" interview on the New York Times' Hard Fork podcast, discussing child safety amidst mounting legal pressure and accusations of being a \"pedophile hellscape.\" Roblox is implementing new facial recognition for chat age verification, but Baszucki's responses were deemed tone-deaf and incoherent.\n\nWhen questioned about the \"scope of the problem\" of predators, Baszucki astonishingly called it an \"opportunity.\" He provided vague answers regarding the new ID checks and deflected questions about the 19-year delay in implementing basic safety measures, often citing Roblox's 150 million users as an excuse. Pressed on the ineffectiveness of existing filters, he became incoherent, refusing to comment on lawsuits and suggesting \"sophisticated\" users or older kids bypass filters. He denied a predator problem, focusing instead on \"innovation.\"\n\nLater, Baszucki became openly hostile and immature when discussing a Hindenburg Research report on safety spending, demanding the interviewer agree that AI, now central to Roblox's safety strategy, was superior, and sarcastically demanding \"high-fives.\" Most controversially, he expressed interest in integrating Polymarket, a cryptoscam-based prediction market, into Roblox for children to \"gamble\" in \"legal\" and \"educational\" ways, a suggestion openly mocked by the hosts. The article concludes Baszucki remains unprepared and out of touch with his platform's severe safety issues, prioritizing growth and investor concerns over child protection.",
    "chinese_title": "罗布乐思CEO在翻车采访中出洋相",
    "chinese_summary": "罗布乐思首席执行官戴维·巴斯祖奇在《纽约时报》的《Hard Fork》播客上接受了一次备受批评的“灾难性”采访，他在日益增加的法律压力和被指控为“恋童癖地狱”的背景下，讨论了儿童安全问题。罗布乐思正在推行新的面部识别技术用于聊天年龄验证，但巴斯祖奇的回应被认为是不合时宜且语无伦次的。\n\n当被问及掠食者的“问题范围”时，巴斯祖奇竟将其称作一个“机会”。他对新的身份验证措施含糊其辞，避开关于在实施基本安全措施方面19年延误的问题，经常以罗布乐思拥有1.5亿用户作为借口。当被追问现有过滤器的无效性时，他变得语无伦次，拒绝评论诉讼，并暗示“老练”的用户或年龄较大的孩子会绕过过滤器。他否认存在掠食者问题，反而将重点放在“创新”上。\n\n后来，当讨论兴登堡研究公司关于安全开支的报告时，巴斯祖奇变得公然带有敌意且不成熟，他要求采访者同意人工智能（现在是罗布乐思安全战略的核心）是优越的，并嘲讽地要求“击掌”。最具争议的是，他表示有兴趣将基于加密骗局的预测市场Polymarket整合到罗布乐思中，让孩子们以“合法”和“教育性”的方式“赌博”，这一提议被主持人公开嘲笑。文章总结称，巴斯祖奇对他平台严重的安全性问题仍然毫无准备且脱节，优先考虑增长和投资者担忧，而非儿童保护。"
  },
  {
    "id": "46008788",
    "title": "We remain alive also in a dead internet",
    "url": "https://slavoj.substack.com/p/why-we-remain-alive-also-in-a-dead-954",
    "summary": "Slavoj Žižek's \"Why we remain alive also in a dead internet\" delves into the popular \"dead internet theory\"—the notion that the internet is now predominantly populated by AI-generated content and bots, diminishing authentic human interaction. Rather than dismissing this as a mere conspiracy, Žižek uses it as a philosophical springboard, interpreting it through the lens of Lacanian psychoanalysis.\n\nHe posits that the internet is not truly \"dead\" but \"undead,\" much like a zombie. This \"undead\" quality, Žižek argues, mirrors Lacan's concept of \"the Real\"—a traumatic, meaningless, and intrusive presence that resists symbolization and imagination. The deluge of AI content represents a new manifestation of this Real, a constant \"gaze\" that subtly shapes our perceptions and desires, even when we recognize its artificiality.\n\nŽižek contends that this \"dead internet\" compels us not to simply reject AI or retreat into a search for pure human authenticity. Instead, it challenges us to confront the inherent \"deadness\" or \"lack\" that exists even within human reality itself. True human freedom and aliveness, he suggests, lie in recognizing and engaging with this \"undead\" dimension of both the digital realm and our own subjectivity, allowing it to reframe our understanding of what it means to be alive and to foster new forms of creativity and connection.",
    "chinese_title": "我们也在一片死寂的互联网中依然存活。",
    "chinese_summary": "斯拉沃热·齐泽克的《为何我们仍在“死寂互联网”中生存》深入探讨了流行的“死寂互联网理论”——即互联网如今主要由AI生成内容和机器人占据，从而减少了真实的人类互动。齐泽克并未将其斥为单纯的阴谋论，而是将其作为哲学跳板，通过拉康精神分析的视角进行解读。\n\n他提出互联网并非真正“已死”，而是“不死”，如同僵尸一般。齐泽克认为，这种“不死”的特质映照了拉康的“实在界”（the Real）概念——一个创伤性、无意义、侵入性的存在，它抵抗符号化和想象。大量的AI内容代表了这种实在界的一种新表现，一种持续的“凝视”（gaze），即使我们认识到其人工性，它也悄然塑造着我们的感知和欲望。\n\n齐泽克主张，这个“死寂互联网”并非促使我们简单地拒绝AI或退回到对纯粹人类真实性的追求。相反，它挑战我们去正视即使在人类现实本身中也存在的内在“死寂”或“匮乏”（lack）。他指出，真正的人类自由和生命力在于认识并参与到数字领域和我们自身主体性的这种“不死”维度中，让它重新定义我们对“活着”的理解，并培育新形式的创造力和联结。"
  },
  {
    "id": "46006183",
    "title": "Private Equity's New Venture: Youth Sports",
    "url": "https://jacobin.com/2025/11/youth-sports-hockey-private-equity",
    "summary": "Private equity firms are increasingly dominating the $40 billion youth sports industry, transforming it into a profit-driven venture that is pricing out many families. A prime example is the growing trend of corporate-owned facilities and leagues, particularly in hockey, banning parents from recording their children's games. Instead, companies like Black Bear Sports Group, the largest owner-operator of hockey rinks, force parents to subscribe to their exclusive streaming services, which can cost significantly more than subscriptions for professional sporting events.\n\nSenator Chris Murphy (D-CT) highlighted this issue, recounting threats that his child's team would be penalized for unauthorized livestreaming at a Black Bear-owned rink. Black Bear also implements additional fees, such as a $50 \"registration and insurance\" charge, adding to already skyrocketing costs in youth sports. The average family now spends over $1,000 annually on a child's primary sport, with hockey averaging over $2,500, making it inaccessible for lower-income families.\n\nOther firms, like Unrivaled Sports and Bain Capital-backed Varsity Brands (cheerleading), employ similar tactics, consolidating markets, controlling venues, equipment, and streaming rights. Varsity Brands even faced an antitrust lawsuit for alleged anticompetitive practices. Critics argue that these private equity strategies prioritize investor profits over children's development, leading to degraded services and creating an \"affordability crisis\" that turns youth sports into a luxury activity.",
    "chinese_title": "私募股权新业务：青少年体育",
    "chinese_summary": "私募股权公司正日益主导价值400亿美元的青少年体育产业，将其转变为以利润为导向的商业企业，令许多家庭望而却步。一个主要例子是，企业拥有的设施和联盟——尤其是在冰球运动中——日益普遍地禁止家长录制孩子比赛。相反，像最大的冰球场馆所有者兼运营商Black Bear Sports Group这样的公司，强迫家长订阅他们独有的流媒体服务，其费用可能远高于专业体育赛事的订阅费。\n\n康涅狄格州民主党参议员克里斯·墨菲强调了这个问题，他讲述了在一个Black Bear旗下的冰球场馆，他孩子的球队曾因未经授权的直播而面临处罚的威胁。Black Bear还收取额外费用，例如50美元的“注册和保险”费，这进一步增加了青少年体育已经飞涨的成本。现在，普通家庭每年在孩子的主要体育项目上花费超过1000美元，其中冰球平均超过2500美元，这使得低收入家庭难以承担。\n\n其他公司，如Unrivaled Sports和贝恩资本支持的Varsity Brands（啦啦队），也采用类似的策略，整合市场，控制场馆、设备和流媒体版权。Varsity Brands甚至因涉嫌反竞争行为而面临反垄断诉讼。批评者认为，这些私募股权策略将投资者利润置于儿童发展之上，导致服务质量下降，并制造了“可负担性危机”，使青少年体育成为一项奢侈活动。"
  },
  {
    "id": "45998047",
    "title": "GitHut – Programming Languages and GitHub (2014)",
    "url": "https://githut.info/",
    "summary": "GitHut, a project by Carlo Zapponi from 2014, is a visualization tool designed to explore and understand the universe of programming languages used across repositories hosted on GitHub, the world's largest code host. Its primary goal is to shed light on language popularity, unique characteristics, and the historical quest for better problem-solving and collaboration in software development.\n\nThe quantitative data for GitHut is collected quarterly from GitHub Archive, which aggregates publicly available GitHub API data and is accessible via Google BigQuery. To measure language popularity, GitHut utilizes the \"Activity value,\" defined as the number of changes pushed to repositories. This metric was chosen because \"Create Events\" (new repository creations) frequently lack specified language information, making them unsuitable for tracking trending languages. The release year of programming languages is sourced from Wikipedia.\n\nGitHut emphasizes that programming languages are not merely tools but instruments reflecting creativity and facilitating human collaboration. The project aims to provide insights into how languages are used, their evolution, and their role in the open-source community. The work is licensed under a Creative Commons BY-NC-SA License.",
    "chinese_title": "GitHut — 编程语言与GitHub (2014)",
    "chinese_summary": "GitHut 是 Carlo Zapponi 在2014年发起的一个项目，它是一个可视化工具，旨在探索和理解全球最大代码托管平台 GitHub 上各个代码仓库中使用的编程语言的“宇宙”。其主要目标是揭示语言的流行度、独特特性，以及软件开发中为实现更好的问题解决和协作而进行的历史探索。\n\nGitHut 的定量数据每季度从 GitHub Archive 收集，GitHub Archive 聚合了公开的 GitHub API 数据，可通过 Google BigQuery 访问。为了衡量语言的流行度，GitHut 利用了“活跃度值”，该值被定义为推送到代码仓库的更改次数。选择此指标是因为“创建事件”（新代码仓库创建）通常缺乏指定的语言信息，使其不适合追踪流行语言。编程语言的发布年份则来自维基百科。\n\nGitHut 强调，编程语言不仅仅是工具，更是反映创造力和促进人类协作的媒介。该项目旨在深入探讨语言的使用方式、演变历程以及它们在开源社区中的作用。该作品采用知识共享署名-非商业性使用-相同方式共享（CC BY-NC-SA）许可协议。"
  },
  {
    "id": "46009056",
    "title": "Arduino Terms of Service and Privacy Policy update: setting the record straight",
    "url": "https://blog.arduino.cc/2025/11/21/the-arduino-terms-of-service-and-privacy-policy-update-setting-the-record-straight/",
    "summary": "Arduino has addressed community concerns regarding recent updates to its Terms of Service and Privacy Policy, reaffirming its unwavering 20-year commitment to open-source principles. The company explicitly states that the Qualcomm acquisition does not change user data handling or open-source practices.\n\nArduino clarifies that all previously open-source hardware, software, tooling, and libraries remain open. Restrictions on reverse-engineering apply specifically to their Software-as-a-Service (SaaS) cloud applications, not to open components. Users also retain ownership of content published on the Arduino platform.\n\nThe updates aim for clarity, compliance, and to support an innovative environment. Key changes include:\n*   **Enhanced transparency:** More precise data practice disclosures.\n*   **New product capabilities:** Reflecting the introduction of optional AI-powered features (e.g., Arduino UNO Q, Arduino App Lab).\n*   **Commercial terms:** Clarifying billing, recurring payments, and refund rights for Premium Services.\n*   **Legal compliance:** Addressing US privacy laws, export controls, and global standards.\n*   **Minors’ data and privacy:** Strengthened protections, updated data retention policies, and age limits. Inactive accounts are deactivated after 24 months, with forum usernames preserved for content attribution unless full account deletion is requested.\n\nArduino encourages users to read the full documents, consult their FAQ, or contact `privacy@arduino.cc` for further questions, emphasizing their dedication to an open and collaborative community.",
    "chinese_title": "Arduino 服务条款和隐私政策更新：以正视听",
    "chinese_summary": "Arduino已回应社区对其服务条款和隐私政策近期更新的担忧，重申其20年来对开源原则的坚定承诺。该公司明确表示，高通的收购不会改变用户数据处理或开源实践。\n\nArduino澄清，所有此前开源的硬件、软件、工具和库仍然保持开源。逆向工程的限制专门适用于其软件即服务（SaaS）云应用程序，而非开源组件。用户也保留其在Arduino平台发布内容的权利。\n\n此次更新旨在提高清晰度、符合法规并支持创新环境。主要变化包括：\n*   **增强透明度：** 更精确的数据实践披露。\n*   **新产品功能：** 反映了可选AI驱动功能的引入（例如Arduino UNO Q、Arduino App Lab）。\n*   **商业条款：** 澄清高级服务的计费、循环付款和退款权利。\n*   **法律合规：** 解决美国隐私法、出口管制和全球标准问题。\n*   **未成年人数据和隐私：** 加强保护、更新数据保留政策和年龄限制。不活跃账户将在24个月后停用，论坛用户名将保留用于内容归属，除非用户要求完全删除账户。\n\nArduino鼓励用户阅读完整文件、查阅常见问题解答或联系`privacy@arduino.cc`以获取更多问题解答，并强调其致力于建立一个开放和协作的社区。"
  },
  {
    "id": "45997099",
    "title": "OOP is shifting between domains, not disappearing",
    "url": "https://blog.jsbarretto.com/post/actors",
    "summary": "The article argues that Object-Oriented Programming (OOP) isn't disappearing but is shifting its core principle of attenuating information flow and enforcing separation between components to new domains, which the author believes is a negative development.\n\nHistorically, OOP evolved to manage complexity and enable collaboration within programs, using interfaces, encapsulation, inheritance, and polymorphism to control how components interact. However, with the rise of distributed systems and a dissolving trust between programs and developers, the imperative for isolation moved from language-level constructs to process and network boundaries.\n\nThis shift is evident in modern paradigms like microservices, Docker, and Kubernetes. The author contends that this distributed \"replacement\" for OOP, despite its skepticism towards traditional OOP, replicates its flaws but magnifies them tenfold. Concepts like OpenAPI schemas, Docker Compose, and Kubernetes effectively serve as externalized versions of OOP's internal mechanisms, but with significantly increased overhead. Inter-component communication now accrues numerous failure modes, slow (de)serialization, kernel scheduling, and network latency. The author concludes that while not convinced by OOP's original promises, they are \"even less convinced\" by the magnified complexity and inefficiencies of the distributed systems that have taken its place.",
    "chinese_title": "OOP 正在领域间转移，并非消失。",
    "chinese_summary": "文章认为，面向对象编程（OOP）并未消亡，而是正在将其核心原则——减少信息流和强制组件间分离——转移到新的领域，作者认为这是一个负面发展。\n\n历史上，OOP的发展是为了管理程序内部的复杂性并促进协作，利用接口、封装、继承和多态来控制组件如何交互。然而，随着分布式系统的兴起以及程序与开发者之间信任的瓦解，隔离的需求从语言层面的结构转向了进程和网络边界。\n\n这种转变在微服务、Docker和Kubernetes等现代范式中显而易见。作者认为，这种分布式对OOP的“替代”，尽管对传统OOP持怀疑态度，却复制了其缺陷，并将其放大了十倍。OpenAPI规范、Docker Compose和Kubernetes等概念实质上是OOP内部机制的外部化版本，但伴随着显著增加的开销。组件间通信现在带来了众多故障模式、缓慢的（反）序列化、内核调度和网络延迟。作者总结道，尽管他们不相信OOP最初的承诺，但对于那些取代OOP的分布式系统所带来的被放大的复杂性和低效率，他们“更难信服”。"
  },
  {
    "id": "46011521",
    "title": "The death of tech idealism and rise of the homeless in Northern California",
    "url": "https://lithub.com/on-the-death-of-tech-idealism-and-rise-of-the-homeless-in-northern-california/",
    "summary": "The article \"On the Death of Tech Idealism (and Rise of the Homeless) in Northern California\" chronicles the sharp decline of Silicon Valley's utopian vision and the concurrent surge in homelessness. The author recounts visiting a former client, a venture capitalist, who has evolved from a charming progressive to a cynical libertarian, spewing expletives and dismissing efforts to address homelessness as inefficient and idealistic. This VC believes \"innovators\" could solve the problem if not for \"incompetent\" public sector and non-profits, asserting that only the profit motive drives solutions.\n\nThe author, who fled California's high housing costs twelve years prior, returns to find real estate prices tripled and homelessness rampant, even in his former home of Santa Cruz. He contrasts the VC's current disdain with the Valley's historical roots in countercultural idealism. Early tech pioneers like Steve Jobs and Stewart Brand (of the Whole Earth Catalog) blended hippie values with technology, envisioning computers as tools for personal liberation and community-building, a \"New Communalist dream.\"\n\nHowever, this idealism, often masking individualism, has morphed. Figures like Brand now build elaborate projects for tech titans like Jeff Bezos, reflecting a shift to intellectual hubris. The Valley, once the \"Valley of Heart's Delight\" carpeted with orchards, became a tech hub founded on the military-industrial complex, with defense industry \"DNA\" embedded in today's giants. The article highlights the grim irony of tech's utopian claims against the backdrop of escalating inequality, environmental degradation (the \"ass cloud\" from the bay), and the bulldozing of homeless camps in the shadows of corporate campuses.",
    "chinese_title": "科技理想主义的破灭与北加州无家可归者的崛起",
    "chinese_summary": "文章《北加州科技理想主义之死（以及无家可归者之增多）》记载了硅谷乌托邦愿景的急剧衰落以及伴随而来的无家可归者数量的激增。作者讲述了他拜访一位前客户，一位风险投资家，此人已从一个富有魅力的进步主义者演变为一个愤世嫉俗的自由意志主义者，满口粗话，并将解决无家可归问题的努力斥为低效和不切实际的理想主义。这位风投认为，“创新者”本能够解决问题，如果不是因为“无能的”公共部门和非营利组织，他坚称只有利润动机才能驱动解决方案。\n\n作者十二年前因加州高昂的住房成本而逃离，他重返故地，发现房地产价格翻了三倍，无家可归现象猖獗，甚至在他曾经的家园圣克鲁斯也是如此。他将这位风投目前的蔑视与硅谷根植于反主流文化理想主义的历史根源进行对比。早期的科技先驱，如史蒂夫·乔布斯和斯图尔特·布兰德（《全球概览》的创始人），将嬉皮士价值观与技术融合，设想计算机是实现个人解放和社区建设的工具，一种“新公社主义梦想”。\n\n然而，这种理想主义，往往掩盖着个人主义，已经变质。像布兰德这样的人物现在为杰夫·贝佐斯等科技巨头打造精心设计的项目，这反映出向智力傲慢的转变。硅谷，这个曾经遍布果园的“心悦谷”，变成了建立在军事工业复合体基础上的科技中心，国防工业的“DNA”根植于当今的巨头企业之中。文章强调了科技乌托邦主张的残酷讽刺，其背景是不平等日益加剧、环境恶化（海湾上空那片“屁云”），以及在企业园区阴影下对无家可归者营地的推土机式拆除。"
  },
  {
    "id": "46009209",
    "title": "The Untold History of Arduino (2016)",
    "url": "https://arduinohistory.github.io/",
    "summary": "Hernando Barragán wrote this article to clarify the history of Wiring and Arduino, aiming to correct misinformation and provide documented facts. He created Wiring in 2003 as his Master's thesis at the Interaction Design Institute Ivrea (IDII), supervised by Massimo Banzi and Casey Reas. Its objective was to simplify electronics for artists and designers, abstracting complexities so they could focus on their projects.\n\nWiring introduced key elements: a simple IDE based on Processing, a user-friendly programming language for microcontrollers (with commands like `pinMode()`, `digitalWrite()`), open-source software, and hardware designs based on Atmel microcontrollers. Barragán detailed the design process, including hardware prototypes—from the Javelin Stamp to Atmel ATmega128, incorporating Brian Dean's \"avrdude\" and FTDI for USB communication. The first Wiring board design emerged in early 2004, with 25 boards hand-soldered and tested.\n\nWiring gained significant traction, especially with the \"Strangely Familiar\" project at IDII in late 2004, and by 2005, it was being used globally.\n\nIn 2005, Massimo Banzi, David Mellis, and David Cuartielles forked (copied) Wiring's source code to create Arduino, adding support for the cheaper ATmega8 microcontroller. Barragán states he was never asked to join the Arduino team, finding the fork puzzling as he had planned to integrate such developments. Gianluca Martino later joined Arduino for manufacturing. Despite the separation, Barragán continued Wiring's development, and many improvements from Wiring were subsequently merged into the Arduino codebase, a situation Barragán found redundant. He later co-authored a book chapter that referenced both Wiring and Arduino.",
    "chinese_title": "阿尔杜伊诺不为人知的历史 (2016)",
    "chinese_summary": "赫尔南多·巴拉甘撰写本文，旨在澄清Wiring和Arduino的历史，纠正错误信息并提供有据可查的事实。他于2003年在伊夫雷亚交互设计学院（IDII）创作了Wiring作为其硕士论文，导师是马西莫·班齐和凯西·里亚斯。其目的是为艺术家和设计师简化电子学，抽象化复杂性，使他们能专注于自己的项目。\n\nWiring引入了关键要素：一个基于Processing的简单集成开发环境（IDE），一种用于微控制器的用户友好型编程语言（包含`pinMode()`、`digitalWrite()`等命令），开源软件，以及基于Atmel微控制器的硬件设计。巴拉甘详细介绍了设计过程，包括硬件原型——从Javelin Stamp到Atmel ATmega128，其中整合了布赖恩·迪恩的\"avrdude\"和FTDI用于USB通信。首个Wiring板设计于2004年初问世，有25块板子经过手工焊接和测试。\n\nWiring获得了显著关注，特别是在2004年末IDII的\"Strangely Familiar\"项目之后；到2005年，它已在全球范围内使用。\n\n2005年，马西莫·班齐、大卫·梅利斯和大卫·夸蒂列斯分叉（复制）了Wiring的源代码以创建Arduino，并增加了对更便宜的ATmega8微控制器的支持。巴拉甘表示他从未被邀请加入Arduino团队，他觉得这次分叉令人费解，因为他原本计划整合此类开发。吉安卢卡·马蒂诺后来加入Arduino负责制造。尽管分道扬镳，巴拉甘继续了Wiring的开发，而Wiring的许多改进后来被合并到Arduino的代码库中，巴拉甘认为这种情况是多余的。他后来合著了一本书的章节，其中引用了Wiring和Arduino。"
  },
  {
    "id": "46008983",
    "title": "The senior population is booming. Caregiving is struggling to keep up",
    "url": "https://www.cnbc.com/2025/11/21/senior-caregiving-labor.html",
    "summary": "The U.S. senior population is booming, with those aged 65 and older increasing from 12.4% in 2004 to 18% in 2024. This surge, largely due to aging baby boomers, has created unprecedented demand for senior care, which the labor force is struggling to meet. Personal experiences, like Beth Pinsker's, highlight a trend of skyrocketing prices and declining service quality.\n\nData confirms this crisis: senior care prices are rising faster than inflation (over 4% annually), and Harvard Public Health projects 4.6 million unfulfilled home care jobs by 2032. The long-term care sector faces a labor gap more severe than any other healthcare segment.\n\nExperts attribute this \"critical labor shortage\" to low wages, poor job quality, and limited career advancement. Home health aides earn only marginally more per hour ($16.82) than fast-food workers ($15.07), despite demanding more training and strenuous work. This understaffing results in compromised resident care, such as long waits for basic needs and a severe lack of medical professionals in facilities.\n\nProposed solutions include increasing wages, allowing more immigration to fill jobs, and establishing clearer career ladders and affordable training programs. Companies like Care.com are expanding services to meet the growing, often sudden, demand for senior care, recognizing it as their fastest-growing segment. The crisis disproportionately affects the \"sandwich generation\" and poses a significant drag on economic growth, underscoring an urgent, often unseen, societal challenge.",
    "chinese_title": "老年人口激增，养老服务难以跟上。",
    "chinese_summary": "美国老年人口正在激增，65岁及以上人口比例从2004年的12.4%增至2024年的18%。这一激增主要归因于“婴儿潮”一代的老龄化，对老年护理产生了前所未有的需求，而劳动力市场正努力应对这种需求。贝丝·平斯克（Beth Pinsker）等人的亲身经历凸显了价格飞涨和服务质量下降的趋势。\n\n数据证实了这场危机：老年护理价格的上涨速度快于通货膨胀（年均超过4%），哈佛公共卫生学院预计到2032年将有460万个家庭护理职位空缺。长期护理行业面临的劳动力缺口比任何其他医疗保健领域都更为严重。\n\n专家将这种“关键劳动力短缺”归因于低工资、恶劣的工作条件和有限的职业发展机会。尽管家庭健康助理需要更多培训和繁重工作，但他们的时薪（16.82美元）仅比快餐店员工（15.07美元）略高。人手不足导致居民护理质量受损，例如基本需求等待时间过长以及机构中严重缺乏医护专业人员。\n\n拟议的解决方案包括提高工资、允许更多移民填补职位空缺、建立更清晰的职业晋升阶梯和提供负担得起的培训项目。像Care.com这样的公司正在扩大服务范围，以满足日益增长且往往突发的老年护理需求，并将其视为增长最快的业务板块。这场危机不成比例地影响着“夹心一代”，并对经济增长构成巨大阻碍，凸显了一个紧迫且往往不为人知的社会挑战。"
  },
  {
    "id": "46005549",
    "title": "CDC to end all monkey research; will phase out HIV, infectious disease studies",
    "url": "https://www.science.org/content/article/exclusive-cdc-end-all-monkey-research",
    "summary": "The Centers for Disease Control and Prevention (CDC) is discontinuing virtually all research involving nonhuman primates, a decision that will phase out decades-long studies on HIV and other infectious diseases at its Atlanta campus. This significant policy shift follows years of internal review and pressure from animal welfare groups, including PETA.\n\nThe CDC confirmed it will launch no new monkey studies, and existing projects involving its fewer than 100 macaques and other primates will be phased out. These animals will either be transferred to sanctuaries or retired from research. A CDC spokesperson indicated the move reflects the agency's \"commitment to the ethical treatment of animals\" and acknowledges progress in alternative research methods, such as in vitro and computational models.\n\nWhile the National Institutes of Health (NIH) ended most of its chimpanzee research in 2015, it continues significant monkey research. The CDC's decision has been lauded by animal rights advocates but has raised concerns among some scientists about its potential impact on understanding complex infectious diseases and vaccine development, areas where animal models are still considered crucial by a segment of the research community.",
    "chinese_title": "疾控中心将终止所有猴类研究；逐步取消艾滋病和传染病研究",
    "chinese_summary": "疾病控制与预防中心（CDC）将停止几乎所有涉及非人灵长类动物的研究，这一决定将逐步淘汰其亚特兰大校区数十年来进行的关于艾滋病及其他传染病的长期研究。这一重大的政策转变是在多年内部审查以及包括善待动物组织（PETA）在内的动物福利团体的压力之后做出的。\n\nCDC证实将不再开展新的猴子研究，而现有涉及其不足100只猕猴及其他灵长类动物的项目也将逐步停止。这些动物将被转移到动物收容所，或从研究中“退役”。一位CDC发言人表示，此举反映了该机构“对动物伦理对待的承诺”，并承认替代研究方法（例如体外和计算模型）的进展。\n\n尽管美国国立卫生研究院（NIH）已于2015年结束了大部分黑猩猩研究，但仍在继续进行大量的猴子研究。CDC的这一决定受到了动物权利倡导者的赞扬，但也引起了一些科学家的担忧，担心其可能对理解复杂的传染病和疫苗开发产生影响，而在这些领域，动物模型仍被部分研究界认为至关重要。"
  },
  {
    "id": "46004386",
    "title": "Building a Minimal Viable Armv7 Emulator from Scratch",
    "url": "https://xnacly.me/posts/2025/building-a-minimal-viable-armv7-emulator/",
    "summary": "This article details the creation of \"stinkarm,\" a minimal viable Armv7 userspace emulator built from scratch in 1.3k lines of Rust with zero dependencies. The author's motivation stems from a desire to deeply understand the ELF format, Arm 32-bit instruction encoding, and execution flow, which will inform the JIT for a custom programming language.\n\n`stinkarm` can parse and validate 32-bit Arm ELF binaries, map their segments, decode a subset of Arm instructions, translate guest and host memory interactions, and forward Arm Linux syscalls to x86-64 System V equivalents. It successfully executes a basic Armv7 \"hello world\" binary in 1.9ms (0.015ms raw emulation), a significant improvement over QEMU's 12.3ms for the same task, though still 100-1000x slower than native execution.\n\nThe development process is outlined, starting with crafting a minimal Arm assembly \"exit\" syscall. A Rust build script (`bld_exmpl`) and Nix flake are used to cross-compile Arm assembly into an Armv7 ELF binary on an x86 system. A core focus is on ELF parsing, specifically the `Elf32_Ehdr` (ELF header) and `Elf32_Phdr` (program headers). The `Ehdr` is rigorously validated for Armv7, 32-bit, little-endian architecture, and static executable type using Rust's `TryFrom` trait and custom little-endian byte-to-integer macros (`le16!`, `le32!`). The `Phdr` is then used to extract critical segment information for memory mapping.",
    "chinese_title": "从零构建最小可行Armv7模拟器",
    "chinese_summary": "本文详细介绍了 \"stinkarm\" 的创建，这是一个用 1.3k 行 Rust 代码、零依赖、从零开始构建的最小可行 Armv7 用户空间模拟器。作者的动机源于希望深入理解 ELF 格式、Arm 32 位指令编码和执行流程，这将为一种自定义编程语言的 JIT 编译器提供参考。\n\n`stinkarm` 能够解析并验证 32 位 Arm ELF 二进制文件，映射其段，解码一部分 Arm 指令，转换访客和主机内存交互，并将 Arm Linux 系统调用转发到 x86-64 System V 对应的实现。它成功地在 1.9 毫秒内（其中原始模拟仅需 0.015 毫秒）执行了一个基本的 Armv7 \"hello world\" 二进制文件，与 QEMU 完成相同任务所需的 12.3 毫秒相比，这是一个显著的提升，尽管仍比原生执行慢 100-1000 倍。\n\n文章概述了开发过程，首先从编写一个最小的 Arm 汇编 \"exit\" 系统调用开始。使用 Rust 构建脚本 (`bld_exmpl`) 和 Nix flake 在 x86 系统上将 Arm 汇编代码交叉编译成一个 Armv7 ELF 二进制文件。核心关注点是 ELF 解析，特别是 `Elf32_Ehdr` (ELF 头) 和 `Elf32_Phdr` (程序头)。`Ehdr` 被严格验证其是否为 Armv7、32 位、小端架构和静态可执行文件类型，这通过使用 Rust 的 `TryFrom` trait 和自定义的小端字节到整数宏 (`le16!`, `le32!`) 来实现。随后，`Phdr` 被用于提取关键的段信息，以便进行内存映射。"
  },
  {
    "id": "46009962",
    "title": "A time-travelling door bug in Half Life 2",
    "url": "https://mastodon.gamedev.place/@TomF/115589875974658415",
    "summary": "The article highlights a discussion initiated by Tom Forsyth on Gamedev Mastodon concerning \"the perils of doors in games.\" Specifically, the topic revolves around a unique \"time-travelling door bug\" encountered in Half-Life 2. This suggests that interactive doors can present complex and sometimes unusual technical challenges for game developers. The accompanying Chinese text is a technical note about needing JavaScript to use the Mastodon web application and is not part of the game development discussion itself.",
    "chinese_title": "半衰期2的时空穿梭门bug",
    "chinese_summary": "文章重点介绍Tom Forsyth在Gamedev Mastodon上发起的一场关于“游戏中门的危险”的讨论。具体来说，该话题围绕着《半条命2》中遇到的一个独特的“时间旅行门bug”。这表明交互式门可能会给游戏开发者带来复杂且有时不寻常的技术挑战。附带的中文文本是一条关于使用Mastodon网络应用程序需要JavaScript的技术说明，不属于游戏开发讨论本身。"
  },
  {
    "id": "46007294",
    "title": "Brazil charges 31 people in major carbon credit fraud investigation",
    "url": "https://news.mongabay.com/short-article/2025/11/brazil-charges-31-people-in-major-carbon-credit-fraud-investigation/",
    "summary": "Brazil's Federal Police have indicted 31 people for fraud and land-grabbing in the largest known carbon credit fraud investigation in the nation's history, dubbed \"Operation Greenwashing.\" The scheme, based in the Brazilian Amazon, involved two REDD+ carbon credit projects, Unitor and Fortaleza Ituxi, covering over 140,000 hectares in Lábrea, Amazonas state.\n\nThe investigation, prompted by a Mongabay report and analysis by the Center for Climate Crime Analysis, confirmed that these projects were simultaneously generating carbon credits while also being used to launder illegal timber from other deforested areas.\n\nThree interconnected groups were involved. One was led by Ricardo Stoppe Júnior, Brazil's largest individual carbon credit seller, who sold millions in credits to corporations like Nestlé, Spotify, and Boeing. The other groups were led by Élcio Aparecido Moço and José Luiz Capelasso, both with prior convictions related to illegal timber or forest product certificates. The fraud was facilitated by corrupt public servants in Brazil’s land reform agency (Incra), registrar offices, and the Amazonas state environmental protection institute (Ipaam). Both Incra and Ipaam have stated their support for the police investigation.",
    "chinese_title": "巴西就重大碳信用欺诈案起诉31人。",
    "chinese_summary": "巴西联邦警察在该国历史上已知最大规模的碳信用欺诈调查（代号“洗绿行动”）中，起诉了31名涉嫌欺诈和非法侵占土地的人。该骗局以巴西亚马逊地区为基地，涉及Unitor和Fortaleza Ituxi两个REDD+碳信用项目，这两个项目覆盖亚马逊州拉布雷亚市超过14万公顷的土地。\n\n这项调查由Mongabay的一份报告和气候犯罪分析中心（Center for Climate Crime Analysis）的分析促成，证实这些项目在同时生成碳信用的同时，也被用于洗白来自其他被砍伐区域的非法木材。\n\n有三个相互关联的团伙涉案。其中一个由巴西最大的个人碳信用卖家里卡多·斯托佩·儒尼奥尔（Ricardo Stoppe Júnior）领导，他曾向雀巢（Nestlé）、Spotify和波音（Boeing）等公司出售了数百万碳信用额。另两个团伙则由埃尔西奥·阿帕雷西多·莫索（Élcio Aparecido Moço）和若泽·路易斯·卡佩拉索（José Luiz Capelasso）领导，两人都有与非法木材或林产品证书相关的前科。这起欺诈案由巴西土地改革机构（Incra）、登记处和亚马逊州环境保护研究所（Ipaam）的腐败公职人员提供便利。Incra和Ipaam都已表示支持警方调查。"
  },
  {
    "id": "45998396",
    "title": "Virgin and Qantas to ban use of portable power banks after string of fires",
    "url": "https://www.abc.net.au/news/2025-11-21/airlines-virgin-australia-qantas-ban-power-banks/106033982",
    "summary": "Australian airlines Virgin Australia, Qantas, QantasLink, and Jetstar are implementing new bans on the use and charging of portable power banks during flights, effective December 1 for Virgin Australia and December 15 for the Qantas group. This decision follows a string of international and domestic incidents involving lithium battery fires, including a mid-air fire on a Virgin Australia flight in July.\n\nUnder the new regulations, passengers are prohibited from using or charging power banks on board, although in-seat charging for other devices remains permitted. Passengers will be limited to carrying two power banks in their cabin baggage. Virgin Australia will require airline approval for units between 100-160 watt-hours (Wh) and prohibit those over 160 Wh, while Qantas and Jetstar will cap individual units at 160 Wh. All power banks are strictly forbidden in checked-in luggage and must be kept easily accessible in cabin baggage, not stowed in overhead lockers (especially for Virgin Australia).\n\nThese changes align Australian carriers with international safety standards, as global airlines like Emirates and Cathay Pacific have already banned power bank use. The Australian Transport Safety Bureau (ATSB) has recorded five in-flight power bank fires on Australian aircraft since 2016. Both the Flight Attendants Association of Australia (FAAA) and the Australian Competition and Consumer Commission (ACCC), which reported a 92% jump in lithium battery incidents between 2020-2022, have highlighted the significant risks posed by these devices, particularly defective ones.",
    "chinese_title": "维珍航空与澳洲航空将在多起火灾后禁用充电宝",
    "chinese_summary": "澳大利亚航空公司维珍澳大利亚航空、澳洲航空、澳航快运和捷星航空正在实施新的规定，禁止乘客在航班上使用和为移动电源充电。该规定对维珍澳大利亚航空于12月1日生效，对澳航集团则于12月15日生效。这一决定是在发生一系列涉及锂电池火灾的国际和国内事件之后做出的，其中包括7月维珍澳大利亚航空一架航班上发生的空中火灾。\n\n根据新规定，乘客被禁止在机上使用或为移动电源充电，但其他设备的座位充电仍被允许。每位乘客随身行李中最多可携带两个移动电源。维珍澳大利亚航空要求容量介于100-160瓦时（Wh）的移动电源需经航空公司批准，并禁止携带容量超过160瓦时的设备；而澳洲航空和捷星航空则将单个设备的容量上限设为160瓦时。所有移动电源均严禁托运，必须随身携带并易于取用，不得存放在头顶行李舱中（维珍澳大利亚航空尤其如此）。\n\n这些改变使澳大利亚航空公司符合国际安全标准，因为阿联酋航空和国泰航空等全球航空公司已经禁止使用移动电源。自2016年以来，澳大利亚运输安全局（ATSB）已记录了五起移动电源在澳大利亚飞机上起火的事件。澳大利亚空乘人员协会（FAAA）和澳大利亚竞争和消费者委员会（ACCC）（后者报告称2020年至2022年间锂电池事故增加了92%）均强调了这些设备，特别是存在缺陷的设备，所带来的重大风险。"
  },
  {
    "id": "46006004",
    "title": "Command Lines",
    "url": "https://www.wreflection.com/p/command-lines-ai-coding",
    "summary": "The article \"Command Lines\" argues that AI coding assistants are ushering in a paradigm shift in software development, similar to how compilers freed programmers from machine code. This rapidly growing market, featuring startups like Cursor achieving record revenues and giants like Google and AWS launching new tools, allows engineers to focus on higher-level logic by generating code from natural language.\n\nThe author categorizes users into three types: \"Handcrafted Coding\" (engineers avoiding AI), \"Vibe Coding\" (non-engineers prototyping concepts with minimal review), and \"Architect + AI Coding\" (engineers using AI as a pair programmer for routine tasks while maintaining control). These user types lead to two market splits: \"Hands-off\" tools for non-engineers building prototypes, and \"Hands-on\" tools for professional engineers integrating AI into production workflows, the latter being the larger segment.\n\nA critical factor in this competition is model quality, which the author deems decisive. While some companies develop in-house models, reliance on frontier models from OpenAI and Anthropic is still prevalent. Incumbents like Microsoft's GitHub Copilot leverage bundling and distribution to maintain market leadership, challenging newcomers. Ultimately, AI tools are freeing developers from boilerplate code, paving the way for autonomous software generation. Success will depend on delivering superior model quality, shipping reliable code, offering deep features, and achieving user stickiness.",
    "chinese_title": "命令行",
    "chinese_summary": "文章《命令行》认为，AI编程助手正在引领软件开发领域的范式转变，类似于编译器将程序员从机器代码中解放出来的方式。这一快速增长的市场，其中Cursor等初创公司实现了创纪录的收入，谷歌、AWS等巨头也纷纷推出新工具，它允许工程师通过自然语言生成代码，从而专注于更高级别的逻辑。\n\n作者将用户分为三类：“手工编程”（工程师避免使用AI）、“随性编程”（非工程师以最少审查来构建概念原型），以及“架构师+AI编程”（工程师使用AI作为结对程序员来处理日常任务，同时保持控制）。这些用户类型导致了两种市场划分：“不插手”工具，面向非工程师构建原型；以及“亲力亲为”工具，面向将AI集成到生产工作流中的专业工程师，后者是更大的市场部分。\n\n这场竞争中的一个关键因素是模型质量，作者认为这是决定性的。尽管有些公司开发内部模型，但对OpenAI和Anthropic等公司前沿模型的依赖仍然普遍存在。微软的GitHub Copilot等现有企业利用捆绑销售和分发来保持市场领先地位，对新进入者构成挑战。最终，AI工具正在将开发者从样板代码中解放出来，为自主软件生成铺平道路。成功将取决于提供卓越的模型质量、交付可靠的代码、提供深度功能以及实现用户粘性。"
  },
  {
    "id": "46013816",
    "title": "My private information is worth $30",
    "url": "https://blog.melashri.net/micro/privacy-price/",
    "summary": "The author expresses profound anger and disappointment regarding a $30 compensation offer from the University of Minnesota for a 2021 data breach. As an alumnus, their personal information, including sensitive data like Social Security numbers, was exposed. The university settled a class action lawsuit for $5 million without admitting wrongdoing, offering affected individuals $30 along with two years of identity theft protection services.\n\nThe author finds this amount \"insulting\" and a \"slap in the face,\" particularly given the university's frequent requests for donations and its failure to honor previous commitments like lifetime email access. They criticize the university for prioritizing its reputation and financial bottom line over accountability, a formal apology, and the trust of affected individuals.\n\nThis behavior, according to the author, is not unique to the University of Minnesota but reflects a systemic issue where institutions, both public and commercial, avoid genuine responsibility for data breaches due to weak regulations and insufficient legal penalties. The author argues that current fines and settlements are too low to incentivize better data security.\n\nRefusing the $30 settlement, the author advocates for stronger regulations and harsher penalties to hold institutions accountable for data breaches. They believe increased financial consequences would force universities to invest more in protecting personal information rather than continuing to allocate vast sums to administrative costs and executive salaries.",
    "chinese_title": "我的个人信息值30美元",
    "chinese_summary": "作者对明尼苏达大学就2021年数据泄露事件提出的30美元赔偿金深感愤怒和失望。作为校友，他们的个人信息，包括社会安全号码等敏感数据，遭到泄露。该大学以500万美元和解了一项集体诉讼，但未承认任何不当行为，仅向受影响的个人提供30美元以及两年身份盗窃保护服务。\n\n作者认为，这笔赔偿金额“具有侮辱性”，简直是“一记耳光”，尤其考虑到大学频繁要求捐款，却未能兑现之前诸如终身邮件访问权限等承诺。他们批评大学将声誉和财务底线置于问责制、正式道歉以及受影响个人的信任之上。\n\n作者指出，这种行为并非明尼苏达大学独有，而是反映了一个系统性问题：由于监管不力和法律惩罚不足，无论是公共机构还是商业机构，都逃避对数据泄露的真正责任。作者认为，当前的罚款和和解金过低，无法激励机构改进数据安全措施。\n\n作者拒绝了这笔30美元的和解金，并呼吁制定更严格的法规和更严厉的惩罚，以追究机构在数据泄露方面的责任。他们相信，增加经济后果将迫使大学投入更多资金保护个人信息，而非继续将巨额资金分配给行政开支和高管薪资。"
  },
  {
    "id": "46010230",
    "title": "Apple's Problem with Bodies",
    "url": "https://drobinin.com/posts/apples-problem-with-bodies/",
    "summary": "Apple's App Store struggles with classifying apps related to personal intimacy and body-related wellbeing, a problem stemming from its foundational design. The author illustrates this through their app, \"Silk,\" a private, on-device intimacy journal. Despite being a benign wellbeing tool, Silk was assigned a 16+ rating—typically for gambling or \"unrestricted web access\"—highlighting a \"grey zone\" for which no appropriate category exists.\n\nThis issue originates from the App Store's early days, where its vocabulary derived from iTunes and film ratings, built for visual \"content\" rather than user-generated personal data. While the current iOS 26 rating matrix is forensically precise for violence or medical risk, it defines everything by \"content\" within the app bundle, not the user's context. This leads to misclassification of apps like Silk, which has no objectionable content but is flagged due to keywords that hint at \"mature themes.\"\n\nThe lack of a specific category for relational wellbeing impacts search discoverability and forces developers to navigate a \"metadata minefield,\" as terms like \"intimacy tracker\" trigger stricter reviews. Even Apple HealthKit, despite expanding, avoids modeling intimacy. The system's \"conservatism,\" driven by past incidents and liability concerns, leads it to err on caution when encountering undefined cases.\n\nThe author's strategy is to treat the App Store as a black box, experimenting with metadata and screenshots to infer its rules. While new categories like sleep and cycle tracking eventually emerge, the process is slow. Developers must build within the platform's current \"language,\" operating in this grey zone until Apple's taxonomy evolves to catch up with user needs.",
    "chinese_title": "苹果的人体问题",
    "chinese_summary": "苹果的App Store在对与个人亲密关系和身体健康相关的应用进行分类时遇到困难，这是一个源于其基础设计的问题。作者通过他们的应用“Silk”（一款私密的、运行于设备上的亲密关系日记）来说明这一点。尽管“Silk”是一款良性的健康工具，却被评定为16+，这个评级通常适用于赌博或“不受限制的网络访问”应用，这突出表明了一个“灰色地带”，目前没有合适的类别。\n\n这个问题源于App Store的早期，其词汇体系来源于iTunes和电影评级，专为视觉“内容”而非用户生成的个人数据而设计。尽管当前的iOS 26评级矩阵对于暴力或医疗风险的界定极其精确，但它通过应用包内的“内容”而非用户的上下文来定义一切。这导致了像“Silk”这类应用的错误分类，它本身没有令人反感的内容，但因暗示“成人主题”的关键词而被标记。\n\n缺乏针对关系健康的特定类别，影响了应用的搜索可见性，并迫使开发者们在“元数据雷区”中摸索，因为“亲密追踪器”之类的词语会触发更严格的审查。即使是不断扩展的Apple HealthKit，也避免对亲密关系进行建模。该系统由过去的事件和责任担忧驱动的“保守主义”，使其在遇到未定义情况时倾向于过度谨慎。\n\n作者的策略是将App Store视为一个黑盒子，通过试验元数据和屏幕截图来推断其规则。尽管睡眠和经期追踪等新类别最终会出现，但这个过程很缓慢。开发者必须在平台当前的“语言”范围内进行开发，在这个灰色地带中运营，直到苹果的分类体系发展到能够满足用户需求。"
  },
  {
    "id": "46016074",
    "title": "Our babies were taken after 'biased' parenting test",
    "url": "https://www.bbc.co.uk/news/articles/c1wlw2qj113o",
    "summary": "The article details the distressing experiences of Greenlandic families in Denmark whose children have been removed following \"biased\" parental competency tests (FKUs). These tests, now banned for Greenlandic families but still used for others, are heavily criticised for cultural bias, being administered in Danish, and lacking scientific validity for predicting parenting ability.\n\nKeira's daughter Zammi was taken just two hours after birth, based on a test that deemed her unfit. She highlights culturally specific questions and alleges a psychologist told her to \"act like a human being.\" Similarly, Johanne and Ulrik's son was adopted after Johanne's test labelled her \"narcissistic\" and \"mentally retarded,\" and she claims being called a \"barbarian\" for a Rorschach test answer. The Danish government refuses to review adoption cases, citing children are settled.\n\nGreenlandic parents are 5.6 times more likely to have children removed. While the government promised to review approximately 300 cases, only 10 have been assessed, with no children returned. Families like Keira's continue their fight for reunification, feeling profound heartbreak and cultural alienation, while Pilinguaq's recent reunification with her daughter offers a rare glimpse of hope.",
    "chinese_title": "我们的宝宝在“偏颇”的亲职测试后被夺走",
    "chinese_summary": "本文详细介绍了格陵兰家庭在丹麦的痛苦经历，他们的孩子在“带有偏见的”父母能力测试（FKU）后被带走。这些测试现在已被禁止用于格陵兰家庭，但仍用于其他家庭，因其文化偏见、用丹麦语进行以及在预测育儿能力方面缺乏科学有效性而受到严厉批评。\n\n凯拉的女儿扎米在出生仅两小时后就被带走，原因是她的测试结果被认定为不适合抚养孩子。她指出测试中存在文化特定问题，并声称一位心理医生告诉她“表现得像个人样”。同样，约翰娜和乌尔里克在约翰娜的测试被贴上“自恋”和“智力迟钝”的标签后，他们的儿子被收养了。她还声称在罗夏测试的一个答案后被称作“野蛮人”。丹麦政府拒绝审查收养案件，理由是孩子们已经安定下来。\n\n格陵兰父母的孩子被带走的可能性是其他父母的5.6倍。尽管政府承诺审查约300个案件，但目前仅评估了10个，并且没有孩子被送回。像凯拉这样的家庭继续为骨肉团聚而奋斗，感受着深深的心痛和文化异化。而皮林瓜最近与女儿的团聚则带来了一线罕见的希望。"
  },
  {
    "id": "46002138",
    "title": "The Qtile Window Manager: A Python-Powered Tiling Experience",
    "url": "https://tech.stonecharioteer.com/posts/2025/qtile-window-manager/",
    "summary": "This article details the author's journey from XFCE to Qtile, a Python-powered tiling window manager, driven by a desire for a more productive Linux environment. Frustrated with previous attempts at i3wm and xmonad, Qtile's Python configurability proved enticing.\n\nThe author emphasizes an isolated installation approach, using virtual environments via the `deadsnakes` PPA, and manually setting up a `.desktop` entry. A key philosophy is modularizing the Python configuration, separating variable declarations for better maintainability and error handling.\n\nTheir refined Qtile setup boasts a consistent color scheme and custom assets. Noteworthy features include a \"smart mouse movement\" function for seamless multi-monitor navigation (Super + .), logical Vim-style keybindings, and powerful hardware-aware widgets. These widgets dynamically display battery status (only on laptops), current IP address, and real-time AMD GPU VRAM usage integrated with `amdgpu_top`. The configuration also dynamically adapts to the number of connected monitors and utilizes startup hooks for initial and recurring scripts.\n\nLessons learned highlight the immense power of Python for complex logic and integration, the importance of starting simple and iterating, the necessity of hardware awareness, and performance considerations for custom widgets. Future plans include developing more custom widgets (e.g., One Piece chapter notifications, Kubernetes context) and enhanced multi-monitor support. Qtile has significantly transformed the author's Linux desktop experience and productivity.",
    "chinese_title": "Qtile 窗口管理器：基于 Python 的平铺体验",
    "chinese_summary": "本文详细讲述了作者为了寻求更高效的Linux环境，从XFCE转向Qtile（一个由Python驱动的平铺式窗口管理器）的历程。在对i3wm和xmonad的先前尝试感到失望之后，Qtile基于Python的可配置性使其极具吸引力。\n\n作者强调了一种隔离的安装方法，即通过`deadsnakes` PPA利用虚拟环境，并手动设置`.desktop`入口。一个核心理念是对Python配置进行模块化，分离变量声明，以提高可维护性和错误处理能力。\n\n作者精炼后的Qtile配置具备一致的配色方案和自定义资源。值得注意的特性包括一个用于无缝多显示器导航的“智能鼠标移动”功能（Super + .）、逻辑Vim风格的键位绑定，以及强大的硬件感知小部件。这些小部件动态显示电池状态（仅限笔记本电脑）、当前IP地址，以及与`amdgpu_top`集成的实时AMD GPU VRAM使用情况。该配置还动态适应连接显示器的数量，并利用启动钩子来运行初始和周期性脚本。\n\n所汲取的经验教训强调了Python在复杂逻辑和集成方面的巨大能力、从简单开始并迭代的重要性、硬件感知的必要性以及自定义小部件的性能考量。未来的计划包括开发更多自定义小部件（例如《海贼王》章节通知、Kubernetes上下文）和增强的多显示器支持。Qtile显著改变了作者的Linux桌面体验和生产力。"
  },
  {
    "id": "46010173",
    "title": "3D printing with unconventional vase mode",
    "url": "https://vorpal.se/posts/2025/jun/23/3d-printing-with-unconventional-vase-mode/",
    "summary": "This article details advanced 3D printing techniques for \"unconventional vase mode,\" aimed at experienced users to save print time and material. Vase mode typically prints a single-perimeter spiral path without seams, but lacks internal geometry, infill, or top layers.\n\nThe first trick involves creating extremely thin \"slits\" (e.g., 0.0001 mm) within the model. The slicer interprets these as external perimeters dipping inward, forming internal support. Crucially, PrusaSlicer's \"Slice gap closing radius\" must be set to 0.0 to prevent these slits from merging.\n\nBuilding on this, \"double walls\" allow for stronger sections or securely anchoring internal slits to the outer wall. The width of these double walls must precisely match the slicer's calculated perimeter width for the current settings. Additionally, increasing \"extrusion width\" (up to 2x nozzle diameter) can further strengthen vase mode prints.\n\nThe author also introduces \"fake vase mode,\" where users manually configure slicer settings—like a single perimeter, no top layers or infill, and disabling \"ensure vertical shell thickness\"—to mimic vase mode's benefits without the continuous spiral path. This offers greater flexibility, allowing for features like printable top surfaces or specific internal geometry, as demonstrated in a case study of printed spheres. The author concludes that while slits can be visible, \"fake vase mode\" combined with \"scarf seams\" often yields better aesthetic and functional results, providing most of the benefits of true vase mode without its limitations.",
    "chinese_title": "非常规花瓶模式3D打印",
    "chinese_summary": "本文详细介绍了“非常规花瓶模式”的先进3D打印技术，旨在帮助经验丰富的用户节省打印时间和材料。花瓶模式通常打印单层螺旋路径，没有接缝，但缺少内部几何结构、填充或顶层。\n\n第一个技巧是在模型内部创建极薄的“狭缝”（例如0.0001毫米）。切片软件将其解释为向内凹陷的外周边，从而形成内部支撑。关键是，PrusaSlicer的“切片间隙闭合半径”必须设置为0.0，以防止这些狭缝合并。\n\n在此基础上，“双壁”可以实现更坚固的区域，或将内部狭缝牢固地锚定到外壁。这些双壁的宽度必须与切片软件根据当前设置计算出的周边宽度精确匹配。此外，增加“挤出宽度”（可达喷嘴直径的2倍）可以进一步加强花瓶模式打印件。\n\n作者还介绍了“伪花瓶模式”，用户手动配置切片软件设置——例如单层周边、无顶层或填充，并禁用“确保垂直外壳厚度”——以模拟花瓶模式的优点，但没有连续的螺旋路径。这提供了更大的灵活性，允许实现可打印的顶面或特定的内部几何结构，正如打印球体案例研究中所示。作者总结道，虽然狭缝可能可见，“伪花瓶模式”结合“围巾接缝”通常能产生更好的美学和功能效果，提供了真实花瓶模式的大部分优点而没有其局限性。"
  },
  {
    "id": "45999256",
    "title": "RI judge intervenes after ICE mistakenly detains Superior Court intern",
    "url": "https://www.wpri.com/news/local-news/providence/ri-judge-intervenes-after-ice-mistakenly-detains-superior-court-intern/",
    "summary": "A Rhode Island Superior Court intern, Luis Angel Reyes, 21, was mistakenly detained by U.S. Immigration and Customs Enforcement (ICE) while en route to a court hearing where a minor domestic violence charge against him was expected to be dismissed. Reyes, a recipient of Deferred Action for Childhood Arrivals (DACA), was pulled over for a broken taillight when an old ICE warrant, stemming from the 2017 domestic violence charge for which he was never convicted, appeared. He was detained for about 24 hours.\n\nSuperior Court Presiding Justice Alice Gibney swiftly intervened, contacting the U.S. Attorney’s office and ICE directly. She clarified Reyes's role as her intern and his scheduled court appearance. The domestic violence charge was indeed dismissed as anticipated.\n\nThe incident has highlighted concerns regarding federal immigration enforcement policies, particularly how they affect DACA recipients and the smooth operation of the justice system. Reyes's legal team from the Roger Williams University School of Law Immigration Clinic is now working to permanently remove the ICE detainer. Judge Gibney underscored the valuable contributions of DACA recipients like Reyes to the community, emphasizing the broader implications of such mistaken detentions. Reyes has since been released.",
    "chinese_title": "移民局误拘高等法院实习生，罗德岛法官介入",
    "chinese_summary": "罗德岛州高等法院实习生路易斯·安赫尔·雷耶斯（Luis Angel Reyes，21岁）在前往法院出庭的途中，被美国移民和海关执法局（ICE）错误拘留。此前，预计针对他的一项轻微家庭暴力指控将在庭上被撤销。雷耶斯是“童年入境者暂缓遣返”计划（DACA）的受益人。他因车尾灯损坏被拦下，此时一张源于2017年家庭暴力指控（他从未因此被定罪）的旧ICE逮捕令浮现。他被拘留了大约24小时。\n\n高等法院首席法官爱丽丝·吉布尼（Alice Gibney）迅速介入，直接联系了美国联邦检察官办公室和ICE。她澄清了雷耶斯作为她的实习生身份及其预定的出庭安排。该家庭暴力指控确如预期被撤销。\n\n该事件引发了人们对联邦移民执法政策的担忧，特别是这些政策如何影响DACA受益人以及司法系统的顺畅运作。雷耶斯的法律团队（来自罗杰威廉姆斯大学法学院移民诊所）目前正致力于永久解除ICE的拘留令。吉布尼法官强调了像雷耶斯这样DACA受益人对社区的宝贵贡献，并强调了此类错误拘留的更广泛影响。雷耶斯此后已被释放。"
  },
  {
    "id": "46004541",
    "title": "More tales about outages and numeric limits",
    "url": "https://rachelbythebay.com/w/2025/11/18/down/",
    "summary": "The article \"More tales about outages and numeric limits\" by Rachel by the Bay explores how reaching numeric limits, particularly with integers, can trigger significant system outages. The author recounts an incident where a system failed because it hit the maximum value for a 32-bit signed integer storing a timestamp. This caused dates beyond a certain point to \"roll over\" and be interpreted as values far in the past, leading services to stop processing new data.\n\nThe piece emphasizes that outages are rarely caused by a single, obvious bug. Instead, they often result from a complex interplay of factors, including: overlooked numeric limits (like 32-bit vs. 64-bit integers or signed vs. unsigned interpretations), inadequate monitoring that fails to detect critical states, intricate system interdependencies where one failure cascades, and implicit assumptions made by developers about data ranges or time representation.\n\nTesting for these \"far future\" or \"too big\" edge cases is inherently difficult during development. The article underscores the importance of proactive system design that anticipates such limitations, robust monitoring to catch anomalies early, and a thorough understanding of how different components interact and depend on each other. Ultimately, these \"numeric limit\" failures are a recurring, subtle, yet potent cause of unexpected downtime.",
    "chinese_title": "更多停机与数值限制的故事",
    "chinese_summary": "Rachel by the Bay 所撰写的文章《故障与数字限制的更多故事》探讨了达到数字限制（特别是整数限制）如何引发重大的系统中断。作者讲述了一个系统故障的案例，原因是一个存储时间戳的32位有符号整数达到了其最大值。这导致某个时间点之后的日期“翻转”，被错误地解读为遥远的过去的值，从而使得服务停止处理新数据。\n\n文章强调，系统中断很少是由单一、明显的错误引起的。相反，它们往往是多种复杂因素相互作用的结果，包括：被忽视的数字限制（例如32位与64位整数的区别，或有符号与无符号的解释差异），未能检测到关键状态的不足的监控，一个故障可能引发连锁反应的复杂系统依赖关系，以及开发者对数据范围或时间表示所做的隐式假设。\n\n在开发过程中，测试这些“遥远的未来”或“过大”的边界情况本质上是困难的。文章强调了主动式系统设计的重要性，即预先考虑到此类限制，实施强大的监控以尽早发现异常，并透彻理解不同组件如何相互作用和依赖。最终，这些“数字限制”故障是导致意外停机的一个反复出现、不易察觉但却威力巨大的原因。"
  },
  {
    "id": "45996921",
    "title": "The AI bubble is bigger than you think",
    "url": "https://prospect.org/2025/11/19/ai-bubble-bigger-than-you-think/",
    "summary": "The article warns of a looming financial crash driven by a massive AI bubble, fueled by a collaboration between Silicon Valley and Wall Street through sketchy credit deals. The colossal investment required for AI infrastructure, such as GPUs and data centers—projected to need $2 trillion in annual revenue by decade's end—is being financed largely by \"private credit\" funds. These unregulated non-bank lenders, rebranded from \"shadow banks,\" now manage $1.6 trillion in assets.\n\nBig Tech firms, aiming to avoid debt on their balance sheets, leverage \"Special Purpose Vehicles\" (SPVs) to construct data centers. These SPVs secure Big Tech as \"anchor tenants\" and then issue debt, implicitly guaranteeing repayment to investors via Big Tech payments. For example, Blue Owl, a private credit fund, finances Meta’s Hyperion data center via such an SPV, with Meta holding a minority stake.\n\nHowever, numerous red flags are emerging: AI GPUs have very short lifespans (often less than two years due to rapid obsolescence and intense use) but are being depreciated over much longer periods, leading to overstated revenues. This risks creating \"stranded assets\" in data centers and power plants. Securitization of data center loans further exacerbates the risk by packaging rapidly depreciating assets.\n\nCritically, the enormous projected revenue needed to justify current AI investments is nowhere in sight, with major AI players like OpenAI losing billions. The industry's self-reinforcing financial model, where cloud providers subsidize AI model training, is described as a classic bubble. The author likens the situation to a dangerous combination of the 2000s housing bubble's financial engineering, 1920s unregulated lending, and the scale of 1990s tech expansion. While private credit is central, traditional banks, private equity, and even ordinary 401(k) investors are increasingly exposed. Experts and key players are quietly exiting, signaling deep instability.",
    "chinese_title": "AI泡沫比你想象的要大",
    "chinese_summary": "这篇文章警告称，一场由巨大AI泡沫驱动、迫在眉睫的金融危机正在逼近，这一泡沫是由硅谷和华尔街通过可疑的信贷交易合作助长的。AI基础设施（如GPU和数据中心）所需的巨额投资——预计到本十年末每年需要2万亿美元的营收——主要由“私募信贷”基金提供资金。这些不受监管的非银行贷款机构，从“影子银行”更名而来，目前管理着1.6万亿美元的资产。\n\n科技巨头公司为了避免资产负债表上出现债务，利用“特殊目的载体”（SPV）来建设数据中心。这些SPV将科技巨头锁定为“主要租户”，然后发行债券，通过科技巨头的支付，隐含地向投资者担保还款。例如，私募信贷基金Blue Owl通过这种SPV为Meta的Hyperion数据中心提供资金，Meta在其中持有少数股权。\n\n然而，诸多危险信号正在显现：AI GPU的寿命非常短（由于快速过时和高强度使用，通常不足两年），但却以远长于实际的期限进行折旧，导致收入虚高。这有可能在数据中心和发电厂造成“搁浅资产”。数据中心贷款的证券化，通过将快速贬值的资产打包，进一步加剧了风险。\n\n关键在于，为当前AI投资提供合理依据的巨大预期收入根本没有实现，像OpenAI这样的主要AI参与者却亏损数十亿美元。该行业云服务提供商补贴AI模型训练的自我强化金融模式，被描述为一个典型的泡沫。作者将这种情况比作21世纪初房地产泡沫的金融工程、20世纪20年代不受监管的贷款以及20世纪90年代科技扩张规模的危险组合。虽然私募信贷是核心，但传统银行、私募股权，甚至普通的401(k)投资者都面临着越来越大的风险敞口。专家和关键参与者正在悄然退出，预示着深层的不稳定性。"
  },
  {
    "id": "46005402",
    "title": "Git 3.0 Defaults to \"main\" Branch Instead of \"master",
    "url": "https://www.phoronix.com/news/Git-2.52-Released",
    "summary": "Git 2.52 has been released, introducing new features and significant preparations for the upcoming Git 3.0, expected by the end of 2026.\n\nA pivotal change slated for Git 3.0 is the adoption of \"main\" as the default branch name, replacing \"master.\" Git 2.52 integrates new hints to assist users with this transition, also detailing how to rename branches back to \"master\" if desired.\n\nAnother major development for Git 3.0 involves transitioning from SHA1 hashing to SHA256. Git 2.52 initiates this effort with early SHA1-SHA256 interoperability work, aiming for a smooth transition by Git 3.0's release.\n\nBeyond these forward-looking preparations, Git 2.52 brings its own set of enhancements. These include improvements to various Git sub-commands, the introduction of a new \"git repo\" sub-command for repository characteristics, and a \"git last-modified\" sub-command to show the closest ancestor commit for each path. The release also features general performance improvements, bug fixes, and other incremental updates. Further details can be found in the official release highlights and on the GitHub Blog.",
    "chinese_title": "Git 3.0 默认分支为 \"main\"，取代 \"master\"",
    "chinese_summary": "Git 2.52 已发布，引入了新功能，并为预计于 2026 年底发布的 Git 3.0 做了重要准备。\n\nGit 3.0 的一项关键变化是采用 \"main\" 作为默认分支名，取代 \"master\"。Git 2.52 集成了新的提示来协助用户完成这一过渡，也详细说明了如果需要，如何将分支重命名回 \"master\"。\n\nGit 3.0 的另一个主要发展是从 SHA1 哈希算法过渡到 SHA256。Git 2.52 通过早期的 SHA1-SHA256 互操作性工作启动了这项努力，旨在 Git 3.0 发布时实现平稳过渡。\n\n除了这些前瞻性准备之外，Git 2.52 本身也带来了一系列增强功能。其中包括对各种 Git 子命令的改进，引入了用于显示仓库特性的新子命令 \"git repo\"，以及用于显示每个路径最接近的祖先提交的子命令 \"git last-modified\"。此次发布还包括了通用性能改进、错误修复以及其他增量更新。更多详细信息可在官方发布亮点和 GitHub 博客上查阅。"
  },
  {
    "id": "46003906",
    "title": "Trump administration eliminates protections for endangered species",
    "url": "https://www.cbsnews.com/news/trump-administration-endangered-species-act-rollback/",
    "summary": "The Trump administration is proposing to roll back protections under the Endangered Species Act (ESA), reviving changes previously blocked. Key proposals include eliminating the \"blanket rule\" that automatically protects threatened species, requiring time-consuming species-specific rules instead. Additionally, officials would analyze economic impacts when designating critical habitat, and the definition of \"harm\" under the ESA may be revised to potentially bypass protections for logging.\n\nThese changes are supported by Republicans and industries like oil, gas, mining, and agriculture, who argue the ESA impedes economic growth. Interior Secretary Doug Burgum stated the revisions restore the ESA's original intent, provide certainty, and respect American livelihoods.\n\nEnvironmentalists and scientists, however, warn the changes could cause years-long delays in conservation efforts, accelerating extinctions for species like the monarch butterfly and Florida manatee. They argue the proposals undermine protections, citing cases like the Yarrow's spiny lizard, where economic analysis could delay critical habitat designation for climate-threatened species. The ESA has historically been credited with saving 99% of listed species, including the bald eagle, but global extinctions are accelerating due to habitat loss and climate change. Past Trump administration rollbacks on species like the northern spotted owl were later reversed.",
    "chinese_title": "特朗普政府废除濒危物种保护措施",
    "chinese_summary": "特朗普政府提议撤销《濒危物种法案》（ESA）下的保护措施，重新启动此前受阻的修改。主要提案包括取消自动保护受威胁物种的“一揽子规则”，转而要求耗时的特定物种规则。此外，官员在划定关键栖息地时将分析经济影响，并且ESA下“伤害”的定义可能会被修改，以潜在地规避对伐木的保护。\n\n这些修改得到了共和党人以及石油、天然气、采矿和农业等行业的支持，他们认为ESA阻碍了经济增长。内政部长道格·伯格姆表示，这些修订旨在恢复ESA的初衷，提供确定性，并尊重美国人民的生计。\n\n然而，环保人士和科学家警告称，这些改变可能导致保护工作多年的延误，加速帝王蝶和佛罗里达海牛等物种的灭绝。他们认为这些提案削弱了保护，并引用了例如亚罗氏棘蜥的案例，其中经济分析可能延迟受气候威胁物种的关键栖息地划定。ESA历史上被认为拯救了99%的列名物种，包括白头海雕，但由于栖息地丧失和气候变化，全球物种灭绝正在加速。特朗普政府过去对北方斑点猫头鹰等物种的撤销保护措施后来被推翻。"
  },
  {
    "id": "46013633",
    "title": "Jack Ma's family shifted wealth to UK after years-long 'disappearance'",
    "url": "https://www.source-material.org/jack-ma-bought-uk-home-after-years-long-disappearance/",
    "summary": "Jack Ma's wife, Cathy Ying Zhang, purchased a £19.5 million mansion in London's Belgravia district in October 2024, marking the family's first known property holding in the UK. This acquisition occurred amid Jack Ma's gradual return to public life after years of \"disappearance\" and scrutiny following his 2020 criticism of China's financial system.\n\nAnalysts view the purchase as a \"precautionary diversification\" against \"regime risk,\" a growing trend among wealthy Chinese families seeking to hedge against potential hostile policies and asset freezes by moving wealth to \"rule of law societies.\" Zhang, who has acquired Singaporean citizenship, has also invested in properties in Singapore and is linked to offshore companies for French assets. The London purchase, potentially funded by Alibaba share sales in 2023, was reportedly rushed through ahead of a rise in the UK's stamp duty surcharge for overseas buyers.\n\nMa resurfaced in China in 2023 after being reportedly fined nearly $3 billion and having Ant Group's IPO halted. While he has since met President Xi Jinping, his public remarks remain unreported by state media, suggesting he may not be \"completely rehabilitated.\" Allegations also surfaced that Chinese authorities enlisted Ma to pressure a dissident businessman. This shift of wealth follows previous international property acquisitions by the Ma family in Hong Kong and New York in 2015.",
    "chinese_title": "马云家族多年“消失”后将财富转移至英国",
    "chinese_summary": "马云的妻子张瑛于2024年10月在伦敦贝尔格莱维亚区购入一处价值1950万英镑的豪宅，标志着该家族首次在英国拥有已知房产。此次收购发生之际，马云在经历数年“消失”和审查之后，正逐步回归公众视野，此前他曾在2020年批评中国的金融体系。\n\n分析人士认为，此次购买是对“政权风险”的“预防性多元化投资”，这是中国富裕家庭日益增长的趋势，他们寻求通过将财富转移到“法治社会”来对冲潜在的敌对政策和资产冻结。张瑛已获得新加坡公民身份，还在新加坡投资了房产，并被曝与持有法国资产的离岸公司有关联。这笔伦敦房产的购买，可能由2023年阿里巴巴股票出售所得资助，据报道是为了赶在英国上调海外买家印花税附加费之前匆忙完成的。\n\n马云于2023年在中国重新露面，此前他据报道被罚款近30亿美元，蚂蚁集团的IPO也被叫停。尽管此后他曾与习近平主席会面，但他的公开言论仍未被官方媒体报道，这表明他可能尚未“完全平反”。还有指控称，中国当局曾利用马云向一名异见商人施压。此次财富转移发生在该家族于2015年在香港和纽约进行国际房地产收购之后。"
  },
  {
    "id": "46011115",
    "title": "Cryptographers cancel election results after losing decryption key",
    "url": "https://arstechnica.com/security/2025/11/cryptography-group-cancels-election-results-after-official-loses-secret-key/",
    "summary": "The International Association of Cryptologic Research (IACR) has canceled its annual leadership election results because a trustee lost a critical decryption key. The election was conducted using Helios, an open-source voting system designed to be verifiable, confidential, and privacy-preserving through advanced cryptography.\n\nHelios encrypts each vote, and to ensure security and prevent collusion, the decryption key material was split among three independent election committee trustees, each holding one-third. Unfortunately, one trustee, Moti Yung, \"irretrievably lost their private key.\" This \"honest but unfortunate human mistake\" rendered it technically impossible to complete the decryption process and verify the election's outcome.\n\nAs a result, the IACR has canceled the election. To prevent similar incidents, the organization will adopt a new key management mechanism, requiring only two of the three key chunks for future decryptions. Moti Yung has resigned and been replaced by Michel Abdalla.\n\nThe IACR, a nonprofit scientific organization dedicated to cryptology research, is now holding a new election, which began Friday and runs through December 20.",
    "chinese_title": "密码学家丢失解密密钥后取消选举结果",
    "chinese_summary": "国际密码学研究协会（IACR）取消了其年度领导层选举结果，原因是其中一名理事丢失了关键的解密密钥。本次选举是使用Helios进行的，这是一个开源投票系统，旨在通过先进的密码学技术实现可验证、保密和隐私保护。\n\nHelios对每张选票进行加密，为了确保安全并防止串通，解密密钥材料被分发给了三名独立的选举委员会理事，每人持有三分之一。不幸的是，其中一名理事Moti Yung“不可挽回地丢失了他们的私钥”。这种“真诚但不幸的人为失误”导致在技术上无法完成解密过程并验证选举结果。\n\n因此，IACR取消了此次选举。为了防止类似事件再次发生，该组织将采用一种新的密钥管理机制，未来解密时只需三个密钥分块中的两个即可。Moti Yung已辞职，并由Michel Abdalla接替。\n\nIACR作为一个致力于密码学研究的非营利科学组织，正在举行一次新的选举，该选举已于周五开始并将持续到12月20日。"
  },
  {
    "id": "46007267",
    "title": "How/why to sweep async tasks under a Postgres table",
    "url": "https://taylor.town/pg-task",
    "summary": "The article advocates \"sweeping\" asynchronous task complexity under a PostgreSQL table, promoting \"slim and stupid\" servers that prioritize fast, dumb database queries for smooth user experiences. It argues against mixing multiple external systems (like SQS, Redis, Celery) for task management, which often leads to distributed state, painful debugging, and the \"sin\" of handrolling two-phase commits.\n\nInstead, Postgres, with its robust transaction guarantees, is proposed as the central \"source of truth.\" It can effectively act as a unified platform for queues, pipelines, and async data, eliminating entire classes of errors. This approach fosters \"TODO-Driven Development\" by tracking incomplete or unimplemented tasks directly in the database, and enhances \"Human Fault Tolerance\" by letting computers manage complex retries.\n\nThe implementation involves a `task` table (with `task_type` and `params` as `jsonb`) and a worker process. This worker continuously fetches and deletes tasks using `DELETE ... FOR UPDATE SKIP LOCKED LIMIT 1` within a transaction. Key features include: automatic task retry on failure (due to transaction rollback), support for parallel workers via `SKIP LOCKED`, resilience through random task ordering (or prioritized queues), and preventing overzealous polling with delays.",
    "chinese_title": "如何/为何将异步任务归集到Postgres表中处理",
    "chinese_summary": "该文章倡导将异步任务的复杂性收敛到一个PostgreSQL表中，推广“精简愚笨”的服务器，这些服务器优先进行快速、简单的数据库查询以提供流畅的用户体验。文章反对将多个外部系统（如 SQS、Redis、Celery）混合用于任务管理，因为这常常导致分布式状态、痛苦的调试以及“手搓”两阶段提交的“罪恶”。\n\n相反，Postgres 凭借其强大的事务保证，被提议作为中心的“单一事实来源”。它能有效地充当队列、管道和异步数据的统一平台，从而消除了一整类错误。这种方法通过直接在数据库中跟踪未完成或未实现的任务，促进了“待办事项驱动开发”（TODO-Driven Development），并通过让计算机管理复杂的重试，增强了“人为容错性”（Human Fault Tolerance）。\n\n具体实现包括一个 `task` 表（其中 `task_type` 和 `params` 字段为 `jsonb` 类型）以及一个工作进程。这个工作进程在一个事务中，持续地使用 `DELETE ... FOR UPDATE SKIP LOCKED LIMIT 1` 语句获取并删除任务。主要特点包括：任务失败时自动重试（得益于事务回滚）、通过 `SKIP LOCKED` 支持并行工作进程、通过随机任务排序（或优先级队列）增强弹性，以及通过延迟来防止过度频繁的轮询。"
  },
  {
    "id": "46001727",
    "title": "Microsoft AI CEO Puzzled by People Being Unimpressed by AI",
    "url": "https://80.lv/articles/microsoft-ai-ceo-puzzled-by-people-being-unimpressed-by-ai",
    "summary": "Microsoft AI CEO Mustafa Suleyman expressed bewilderment over public skepticism towards artificial intelligence, calling those \"unimpressed\" by it \"cynics.\" His reaction came after backlash against Microsoft's Windows and Devices President Pavan Davuluri's statement that Windows is evolving into an \"agentic OS\" integrating AI.\n\nSuleyman found it \"mindblowing\" that people could be unimpressed by AI's ability to hold fluent conversations or generate images and videos. However, users criticized Microsoft for prioritizing AI integration – which many don't use – over fixing long-standing Windows issues. Commenters argued their lack of impression wasn't about the technology itself, but rather Microsoft's tendency to force AI into products to appease shareholders instead of addressing user concerns like improving UI (similar to Windows 7), fixing security problems, and enhancing user privacy. This highlights a contrast between big tech's unanimous embrace of AI and the public's more critical view.",
    "chinese_title": "微软AI CEO困惑人们对AI不以为然",
    "chinese_summary": "微软人工智能首席执行官穆斯塔法·苏莱曼对公众对人工智能的怀疑态度表示不解，称那些对此“不以为然”的人为“愤世嫉俗者”。他的此番言论，是在微软Windows和设备总裁帕万·达乌鲁里声明Windows正演变为一个集成人工智能的“智能代理操作系统”后，遭遇强烈反对而发表的。\n\n苏莱曼认为，人们竟然对人工智能流畅对话或生成图像和视频的能力不以为然，这“令人难以置信”。然而，用户批评微软优先整合人工智能功能（而许多人并不使用这些功能），却忽视了解决Windows长期存在的问题。评论者认为，他们对此不以为然并非针对技术本身，而是微软为了安抚股东，倾向于将人工智能强制整合到产品中，而不是解决用户关心的问题，例如改进用户界面（类似于Windows 7）、修复安全问题以及提升用户隐私。这凸显了科技巨头一致拥抱人工智能与公众更为批判的态度之间的反差。"
  },
  {
    "id": "46000303",
    "title": "Measuring Latency (2015)",
    "url": "https://bravenewgeek.com/everything-you-know-about-latency-is-wrong/",
    "summary": "This article, based on Gil Tene's work, asserts that common latency measurement tools and methodologies are fundamentally flawed, often misrepresenting system performance. Latency is the time for a single operation, meaning its behavior must be described by its *complete distribution*, not just averages or medians, which are useless for multi-modal systems exhibiting \"hiccups\" (e.g., GC pauses).\n\nMany tools inadequately capture data, fixating on \"common cases\" like the 95th percentile, which can be irrelevant to most users. Averaging percentiles is mathematically unsound, and the maximum latency, often dismissed as noise, is a critical signal. The 99th percentile is not rare; many users frequently encounter it. Monitoring systems often lack the fidelity to capture critical \"nines\" (e.g., 99.999th percentile) due to data summarization.\n\nThe most prevalent issue is \"coordinated omission.\" This occurs when load generators or monitoring code inadvertently ignore or miss bad latency events. For example, a load generator might delay sending requests when the system is slow, or monitoring might only record a long operation once, effectively hiding queueing delays. This omission drastically skews results, making problematic systems appear perfect and sometimes making real improvements look like regressions. A \"CTRL+Z\" test can expose this. Coordinated omission measures service time, not true response time.\n\nTo properly measure latency, one must understand the entire distribution, especially tail latencies, and test under various loads between idle and saturation. Tools like HdrHistogram can capture high-resolution data and correct for coordinated omission. The core message is to be deeply critical of reported latency numbers, recognizing their potential to mislead.",
    "chinese_title": "测量延迟 (2015)",
    "chinese_summary": "本文基于 Gil Tene 的研究指出，常见的延迟测量工具和方法存在根本性缺陷，常常错误地反映系统性能。延迟是单个操作所需的时间，这意味着其行为必须通过其**完整分布**来描述，而非仅仅通过平均值或中位数；对于表现出“打嗝”（例如，GC 暂停）的多模式系统而言，这些平均值或中位数是无用的。\n\n许多工具无法充分捕获数据，专注于“常见情况”，例如第95百分位，这可能与大多数用户无关。对百分位数求平均在数学上是不严谨的，而最大延迟，通常被视为噪声，实则是一个关键信号。第99百分位并不罕见；许多用户会频繁遇到它。由于数据汇总，监控系统通常缺乏足够的精度来捕获关键的“N个9”（例如，99.999百分位）。\n\n最普遍的问题是“协调遗漏”。当负载生成器或监控代码无意中忽略或遗漏了糟糕的延迟事件时，就会发生这种情况。例如，当系统变慢时，负载生成器可能会延迟发送请求，或者监控可能只记录一次长时间操作，从而有效地隐藏了排队延迟。这种遗漏会严重扭曲结果，使有问题系统看起来完美，有时甚至使实际的改进看起来像是性能退化。“CTRL+Z”测试可以揭示这一点。协调遗漏衡量的是服务时间，而非真正的响应时间。\n\n为了准确测量延迟，必须了解整个分布，尤其是尾部延迟，并在空闲到饱和之间的各种负载下进行测试。HdrHistogram 等工具可以捕获高分辨率数据并纠正协调遗漏问题。核心信息是对报告的延迟数据持高度批判态度，认识到它们可能具有误导性。"
  },
  {
    "id": "46011569",
    "title": "Microsoft Will Preload Windows 11 File Explorer to Fix Bad Performance",
    "url": "https://blogs.windows.com/windows-insider/2025/11/21/announcing-windows-11-insider-preview-build-26100-7271-dev-beta-channels/",
    "summary": "Microsoft has released Windows 11 Insider Preview Build 26220.7271 for both Dev and Beta Channels, based on version 25H2. Insiders currently have a temporary window to switch from the Dev to Beta Channel.\n\nThis build introduces several new features and improvements. Key additions include the Xbox full screen experience (FSE) for PC, offering console-style navigation for controller-first gaming. A new point-in-time restore feature allows users to quickly roll back their device to a previous state for easier troubleshooting and reduced downtime. Fluid Dictation has been added to Voice Typing for NPU devices, providing smoother dictation with automatic grammar, punctuation, and filler word corrections.\n\nImprovements include enhanced app continuity, allowing users of specific Android phones (Honor, Huawei, Oppo, Samsung, vivo) to seamlessly resume Spotify tracks, browser activity, and M365 Copilot files from their phone to PC. File Explorer receives context menu refinements for better organization. Crucially, Microsoft is exploring **preloading File Explorer in the background to improve launch performance**, with an option to disable this feature available in Folder Options. The Microsoft Store now also allows uninstalling apps directly from the library page. The update also addresses various bug fixes across the OS and lists several known issues.",
    "chinese_title": "微软将预加载 Windows 11 文件资源管理器以解决性能不佳问题",
    "chinese_summary": "Microsoft has released Windows 11 Insider Preview Build 26220.7271 for both Dev and Beta Channels, based on version 25H2. Insiders currently have a temporary window to switch from the Dev to Beta Channel.\n\nThis build introduces several new features and improvements. Key additions include the Xbox full screen experience (FSE) for PC, offering console-style navigation for controller-first gaming. A new point-in-time restore feature allows users to quickly roll back their device to a previous state for easier troubleshooting and reduced downtime. Fluid Dictation has been added to Voice Typing for NPU devices, providing smoother dictation with automatic grammar, punctuation, and filler word corrections.\n\nImprovements include enhanced app continuity, allowing users of specific Android phones (Honor, Huawei, Oppo, Samsung, vivo) to seamlessly resume Spotify tracks, browser activity, and M365 Copilot files from their phone to PC. File Explorer receives context menu refinements for better organization. Crucially, Microsoft is exploring **preloading File Explorer in the background to improve launch performance**, with an option to disable this feature available in Folder Options. The Microsoft Store now also allows uninstalling apps directly from the library page. The update also addresses various bug fixes across the OS and lists several known issues."
  },
  {
    "id": "45996810",
    "title": "Google cracked Apple's AirDrop and is adding it to Pixel phones",
    "url": "https://www.theverge.com/news/825228/iphone-airdrop-android-quick-share-pixel-10",
    "summary": "生成摘要时出错",
    "chinese_title": "Google cracked Apple's AirDrop and is adding it to Pixel phones",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46015262",
    "title": "A looming 'insect apocalypse' could endanger global food supplies",
    "url": "https://www.livescience.com/animals/insects/a-looming-insect-apocalypse-could-endanger-global-food-supplies-can-we-stop-it-before-its-too-late",
    "summary": "生成摘要时出错",
    "chinese_title": "A looming 'insect apocalypse' could endanger global food supplies",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46013579",
    "title": "Libpng 1.6.51: Four buffer overflow vulnerabilities fixed",
    "url": "https://www.openwall.com/lists/oss-security/2025/11/22/1",
    "summary": "生成摘要时出错",
    "chinese_title": "Libpng 1.6.51: Four buffer overflow vulnerabilities fixed",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46013463",
    "title": "Google tells employees it must double capacity every 6 months to meet AI demand",
    "url": "https://arstechnica.com/ai/2025/11/google-tells-employees-it-must-double-capacity-every-6-months-to-meet-ai-demand/",
    "summary": "生成摘要时出错",
    "chinese_title": "Google tells employees it must double capacity every 6 months to meet AI demand",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46001823",
    "title": "Streaming platform Twitch added to Australia's teen social media ban",
    "url": "https://www.bbc.com/news/articles/cx2n2955g10o",
    "summary": "生成摘要时出错",
    "chinese_title": "Streaming platform Twitch added to Australia's teen social media ban",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46012119",
    "title": "Microsoft's head of AI doesn't understand why people don't like AI",
    "url": "https://www.pcgamer.com/software/ai/microsofts-head-of-ai-doesnt-understand-why-people-dont-like-ai-and-i-dont-understand-why-he-doesnt-understand-because-its-pretty-obvious/",
    "summary": "生成摘要时出错",
    "chinese_title": "Microsoft's head of AI doesn't understand why people don't like AI",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45998620",
    "title": "Grok's Elon Musk worship is getting weird",
    "url": "https://www.theverge.com/ai-artificial-intelligence/825675/groks-elon-musk-worship-is-getting-weird",
    "summary": "生成摘要时出错",
    "chinese_title": "Grok's Elon Musk worship is getting weird",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46011158",
    "title": "Lawmakers Are Rolling Back Food Safety Rules",
    "url": "https://jacobin.com/2025/11/listeria-food-labeling-shutdown-deal",
    "summary": "生成摘要时出错",
    "chinese_title": "Lawmakers Are Rolling Back Food Safety Rules",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46003500",
    "title": "The FBI spied on a Signal group chat of immigration activists, records reveal",
    "url": "https://www.theguardian.com/us-news/2025/nov/21/fbi-signal-group-chat-immigration",
    "summary": "生成摘要时出错",
    "chinese_title": "The FBI spied on a Signal group chat of immigration activists, records reveal",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46000098",
    "title": "Microsoft admits almost all major Windows 11 core features are broken",
    "url": "https://www.neowin.net/news/microsoft-finally-admits-almost-all-major-windows-11-core-features-are-broken/",
    "summary": "生成摘要时出错",
    "chinese_title": "Microsoft admits almost all major Windows 11 core features are broken",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45999514",
    "title": "Trump accuses 6 Democratic lawmakers of seditious behavior, punishable by death",
    "url": "https://rhodeislandcurrent.com/2025/11/20/repub/trump-accuses-6-democratic-lawmakers-of-seditious-behavior-punishable-by-death/",
    "summary": "生成摘要时出错",
    "chinese_title": "Trump accuses 6 Democratic lawmakers of seditious behavior, punishable by death",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46010021",
    "title": "The Algorithm That Detected a $610B Fraud",
    "url": "https://substack.com/inbox/post/179453867",
    "summary": "生成摘要时出错",
    "chinese_title": "The Algorithm That Detected a $610B Fraud",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46001738",
    "title": "While Eyes Are on Takaichi, Taiwan's Lai Is Quietly Redefining the Status Quo",
    "url": "https://jonathancc.substack.com/p/while-eyes-are-on-takaichi-taiwans",
    "summary": "生成摘要时出错",
    "chinese_title": "While Eyes Are on Takaichi, Taiwan's Lai Is Quietly Redefining the Status Quo",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46002001",
    "title": "So Long, Firefox, Part One",
    "url": "https://hackaday.com/2025/11/20/so-long-firefox-part-one/",
    "summary": "生成摘要时出错",
    "chinese_title": "So Long, Firefox, Part One",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46015578",
    "title": "New Apple Study Shows LLMs Can Tell What You're Doing from Audio and Motion Data",
    "url": "https://9to5mac.com/2025/11/21/apple-research-llm-study-audio-motion-activity/",
    "summary": "生成摘要时出错",
    "chinese_title": "New Apple Study Shows LLMs Can Tell What You're Doing from Audio and Motion Data",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46016639",
    "title": "China Reaches Energy Milestone by \"Breeding\" Uranium from Thorium",
    "url": "https://humanprogress.org/china-reaches-energy-milestone-by-breeding-uranium-from-thorium/",
    "summary": "生成摘要时出错",
    "chinese_title": "China Reaches Energy Milestone by \"Breeding\" Uranium from Thorium",
    "chinese_summary": "生成摘要时出错"
  }
]