[
  {
    "id": "46075320",
    "title": "Pocketbase – open-source realtime back end in 1 file",
    "url": "https://pocketbase.io/",
    "summary": "Pocketbase is introduced as an open-source, real-time backend solution notable for its packaging \"in 1 file.\" This characteristic highlights its extreme simplicity, ease of setup, and portability. As a real-time backend, it presumably offers essential functionalities like a database, API, and user authentication, all designed for rapid application development. The article encourages immediate engagement by inviting users to explore a live demo and delves deeper into its features by reading the comprehensive documentation. Overall, Pocketbase aims to provide a lightweight, efficient, and quick-to-deploy backend for developers.",
    "chinese_title": "口袋基地：单文件的开源实时后端",
    "chinese_summary": "Pocketbase 是一款开源的实时后端解决方案，其“单文件”打包的特性尤为突出。这一特性凸显了其极致的简洁性、易于设置和可移植性。作为一款实时后端，它想必提供了数据库、API和用户认证等核心功能，所有这些都旨在实现快速应用开发。文章鼓励用户通过体验实时演示来立即参与，并通过查阅详尽的文档来深入了解其功能。总之，Pocketbase 旨在为开发者提供一个轻量、高效且快速部署的后端。"
  },
  {
    "id": "46077393",
    "title": "EU Council Approves New \"Chat Control\" Mandate Pushing Mass Surveillance",
    "url": "https://reclaimthenet.org/eu-council-approves-new-chat-control-mandate-pushing-mass-surveillance",
    "summary": "The EU Council has provisionally approved a contentious \"Chat Control\" mandate, officially known as the CSAM (Child Sexual Abuse Material) Regulation. This compromise text aims to combat CSAM by compelling communication service providers to scan private messages and content.\n\nA central element of the proposal is \"upload moderation\" or client-side scanning (CSS), where content is scanned on users' devices *before* it is encrypted. While the current compromise labels this as \"voluntary\" for providers based on risk assessments, critics argue it effectively pressures them to deploy technologies that could undermine end-to-end encryption (E2EE) and introduce significant security vulnerabilities.\n\nPrivacy advocates, security experts, and tech companies widely condemn the mandate, viewing it as a form of mass surveillance that infringes on fundamental rights. Concerns also include a high potential for false positives from AI detection systems and the broad applicability of the regulation to most communication services.\n\nThis approval establishes the Council's negotiating stance. The proposal now moves to \"trilogue\" negotiations with the European Parliament, which has historically been more resistant to client-side scanning measures. The outcome of these discussions will determine the final form of the legislation.",
    "chinese_title": "欧盟理事会通过新“聊天控制”授权 推动大规模监控",
    "chinese_summary": "欧盟理事会已临时批准一项备受争议的“聊天控制”指令，其官方名称为CSAM（儿童性虐待材料）条例。该妥协文本旨在通过强制通信服务提供商扫描私人消息和内容来打击CSAM。\n\n该提案的核心要素是“上传审核”或客户端扫描（CSS），即在内容加密*之前*在用户设备上进行扫描。尽管当前的妥协方案基于风险评估将其称为提供商的“自愿”行为，但批评人士认为，这实际上是在迫使他们部署可能破坏端到端加密（E2EE）并引入重大安全漏洞的技术。\n\n隐私倡导者、安全专家和科技公司普遍谴责该指令，认为它是一种侵犯基本权利的大规模监控形式。担忧还包括人工智能检测系统产生高误报的可能性，以及该条例对大多数通信服务的广泛适用性。\n\n此次批准确立了理事会的谈判立场。该提案现在将与欧洲议会进行“三方对话”谈判，欧洲议会历来对客户端扫描措施持更抵制态度。这些讨论的结果将决定该立法的最终形式。"
  },
  {
    "id": "46078770",
    "title": "Petition to formally recognize open source work as civic service in Germany",
    "url": "https://www.openpetition.de/petition/online/anerkennung-von-open-source-arbeit-als-ehrenamt-in-deutschland#petition-main",
    "summary": "A petition in Germany is advocating for the formal recognition of open-source work as civic service, or \"Ehrenamt.\" The initiative seeks to strengthen open-source contributions by granting developers a status equivalent to those engaged in traditional volunteer or club activities (\"Vereinsarbeit\"). News reports indicate a growing call for this official acknowledgement, highlighting the value of open-source work to society and aiming to elevate its standing within German civic structures.",
    "chinese_title": "请愿在德国正式承认开源工作为公民服务",
    "chinese_summary": "德国一项请愿正在倡导正式承认开源工作为公益服务（即“Ehrenamt”）。该倡议旨在通过赋予开发者与从事传统志愿或社团活动（即“Vereinsarbeit”）的人同等的地位，从而加强开源贡献。新闻报道指出，这种官方认可的呼声日益高涨，突显了开源工作对社会的价值，并旨在提升其在德国公民体系中的地位。"
  },
  {
    "id": "46075882",
    "title": "Show HN: Glasses to detect smart-glasses that have cameras",
    "url": "https://github.com/NullPxl/banrays",
    "summary": "The \"Ban-Rays\" project is developing glasses to detect smart-glasses with cameras, specifically Meta Raybans, drawing parallels to past efforts against early camera phones. The creator is exploring two main detection methods: optics and networking.\n\nThe **optics** approach attempts to identify cameras by detecting the \"cat-eye effect,\" where CMOS sensors retro-reflect infrared light. Using IR LEDs and a photodiode, the system aims to classify reflections. While the principle is sound, initial tests with Meta Raybans yielded weak and inconsistent signals, making reliable differentiation from other reflective surfaces challenging without relying on a camera or complex machine learning, which the project intends to avoid. Future work in this area involves testing different IR wavelengths, sweeping patterns, and collimation.\n\nThe **networking** approach, primarily using Bluetooth Low-Energy (BLE), has shown more promise. The system successfully fingerprints Meta Raybans by detecting their unique manufacturer ID (0x01AB) and service UUID (0xFD5F) during power-on, pairing, or when taken from their case, triggering an audible alert. This is currently deemed the easiest and most reliable method. However, detecting the glasses during active usage (when communicating with a paired phone) is difficult, as this involves directed BLE traffic that requires following hopping channels, which current hardware isn't set up for. Future plans include exploring nRF modules and active probing.",
    "chinese_title": "HN 展示：识别带摄像头智能眼镜的眼镜",
    "chinese_summary": "“禁光”项目正在开发一种眼镜，用于检测带有摄像头的智能眼镜，特别是Meta Ray-Ban眼镜，这与过去针对早期拍照手机的努力有异曲同工之处。开发者正在探索两种主要的检测方法：光学和网络。\n\n**光学**方法试图通过检测“猫眼效应”来识别摄像头，即CMOS传感器会逆向反射红外光。该系统利用红外LED和光电二极管，旨在对反射光进行分类。尽管原理可行，但对Meta Ray-Ban眼镜的初步测试产生了微弱且不一致的信号，在不依赖摄像头或复杂机器学习（这正是项目想要避免的）的情况下，很难可靠地将其与其他反光表面区分开。该领域的未来工作包括测试不同的红外波长、扫描模式和准直。\n\n主要利用低功耗蓝牙 (BLE) 的**网络**方法已显示出更大的前景。该系统通过检测Meta Ray-Ban眼镜在开机、配对或从眼镜盒中取出时的独特制造商ID (0x01AB) 和服务UUID (0xFD5F)，成功识别其特征，从而触发声音警报。这目前被认为是最简单、最可靠的方法。然而，在主动使用期间（当与已配对手机通信时）检测眼镜是困难的，因为这涉及定向BLE流量，需要跟踪跳频信道，而当前硬件尚未为此配置。未来的计划包括探索nRF模块和主动探测。"
  },
  {
    "id": "46081188",
    "title": "Imgur geo-blocked the UK, so I geo-unblocked my network",
    "url": "https://blog.tymscar.com/posts/imgurukproxy/",
    "summary": "The author faced the problem of Imgur geo-blocking UK users, rendering countless embedded images on older websites, forums, and documentation inaccessible. Rejecting a client-side VPN due to speed concerns on their 2.5 Gbps internet and the inconvenience of per-device setup, they engineered a network-wide solution using their homelab.\n\nThe system works as follows:\n1.  **Pi-hole** intercepts DNS requests for `i.imgur.com`, redirecting them to the local **Traefik** reverse proxy.\n2.  **Traefik** uses TCP routing with TLS passthrough to forward these requests to a **Gluetun** container.\n3.  **Gluetun** establishes a VPN connection, providing a non-UK exit point.\n4.  An **Nginx** proxy, running within Gluetun’s network namespace, performs TCP passthrough to the real `i.imgur.com` through the VPN tunnel.\n5.  The entire Docker Compose stack (Gluetun and Nginx) is managed declaratively by **NixOS** as a systemd service, with VPN credentials secured using **Agenix**.\n\nThis setup allows every device on the network to access Imgur images automatically and transparently, without any client-side configuration. The latency increase is negligible and only affects Imgur traffic, preserving full speed for all other internet usage. While acknowledging it might be \"overkill,\" the author values the clean, low-maintenance, and efficient solution that integrates seamlessly into their homelab.",
    "chinese_title": "Imgur地理封锁了英国，所以我解除了我网络的地理封锁。",
    "chinese_summary": "作者面临Imgur对英国用户实施地域限制的问题，导致旧网站、论坛和文档中无数嵌入图片无法访问。作者排除了客户端VPN方案，原因是其2.5 Gbps互联网的速度顾虑以及每台设备单独设置的不便。他们利用自己的家庭实验室，设计了一个网络范围的解决方案。\n\n该系统的工作原理如下：\n1. **Pi-hole** 拦截对 `i.imgur.com` 的DNS请求，将其重定向到本地的 **Traefik** 反向代理。\n2. **Traefik** 使用带TLS直通的TCP路由，将这些请求转发给一个 **Gluetun** 容器。\n3. **Gluetun** 建立VPN连接，提供一个非英国的出口点。\n4. 一个在Gluetun网络命名空间内运行的 **Nginx** 代理，通过VPN隧道对真实的 `i.imgur.com` 执行TCP直通。\n5. 整个Docker Compose堆栈（Gluetun和Nginx）由 **NixOS** 作为systemd服务进行声明式管理，VPN凭据则使用 **Agenix** 进行保护。\n\n这种设置使得网络上的每台设备都能自动、透明地访问Imgur图片，无需任何客户端配置。延迟增加微乎其微，且仅影响Imgur流量，保留了所有其他互联网使用的全速。作者承认这可能有些“过度设计”，但他们珍视这种干净、低维护、高效且能无缝融入其家庭实验室的解决方案。"
  },
  {
    "id": "46083004",
    "title": "Airbus A320 – intense solar radiation may corrupt data critical for flight",
    "url": "https://www.airbus.com/en/newsroom/press-releases/2025-11-airbus-update-on-a320-family-precautionary-fleet-action",
    "summary": "Airbus announced on November 28, 2025, that intense solar radiation may corrupt data critical for flight controls in its A320 Family aircraft. This issue was identified following analysis of a recent event. A significant number of in-service A320 Family aircraft are potentially impacted.\n\nIn response, Airbus has proactively collaborated with aviation authorities, issuing an Alert Operators Transmission (AOT) to operators. This AOT requests immediate precautionary action, including the implementation of available software and/or hardware protection, to ensure the fleet's continued safety. The European Union Aviation Safety Agency (EASA) will subsequently issue an Emergency Airworthiness Directive (EAD) reflecting these recommendations.\n\nAirbus acknowledged that these necessary actions will lead to operational disruptions for passengers and customers, for which it apologizes. The company stated it would work closely with operators, maintaining safety as its number one priority.",
    "chinese_title": "空客A320：强烈太阳辐射可能破坏飞行关键数据",
    "chinese_summary": "空中客车公司于2025年11月28日宣布，强烈的太阳辐射可能会损坏其A320系列飞机中对飞行控制至关重要的数据。在对近期一起事件进行分析后，发现了这个问题。大量在役的A320系列飞机可能受到影响。\n\n为此，空中客车公司已主动与航空当局合作，向运营商发布了《警示运营商通告》（AOT）。该AOT要求立即采取预防措施，包括实施可用的软件和/或硬件保护，以确保机队的持续安全。欧洲航空安全局（EASA）随后将发布一份《紧急适航指令》（EAD），以反映这些建议。\n\n空中客车公司承认，这些必要的措施将给乘客和客户带来运营中断，并为此表示歉意。该公司表示将与运营商紧密合作，将安全作为其首要任务。"
  },
  {
    "id": "46072002",
    "title": "AI CEO – Replace your boss before they replace you",
    "url": "https://replaceyourboss.ai/",
    "summary": "The article \"AI CEO – Replace Your Boss Before They Replace You\" posits a rapidly approaching future where artificial intelligence (AI) is no longer just a supportive tool, but a viable, and perhaps superior, alternative to human leadership, even at the highest executive levels.\n\nThe central premise presents a dual challenge and opportunity:\n1.  **Embrace AI to elevate your own standing:** Individuals are urged to proactively learn and integrate AI tools and strategies into their work. By leveraging AI to automate, optimize, and innovate tasks traditionally performed by their superiors, employees can effectively \"replace\" the functional aspects of their boss's role, demonstrating enhanced value and strategic foresight.\n2.  **Act now to avoid redundancy:** The urgent warning \"before they replace you\" underscores the disruptive power of AI. If employees fail to adapt, upskill, and harness AI, they risk being made obsolete – either by AI-savvy managers who embrace new technologies, or directly by AI systems capable of performing their jobs (and even their boss's job) more efficiently and effectively.\n\nIn essence, the piece serves as a stark call to action for professional transformation. It argues that navigating the AI-driven future successfully requires individuals to be proactive innovators, using AI as a strategic lever to secure and advance their careers, rather than passively waiting to be impacted by its inevitable disruption.",
    "chinese_title": "AI CEO — 取代你的老板，趁他们还没取代你。",
    "chinese_summary": "文章《AI CEO——在他们取代你之前，先取代你的老板》提出了一个快速临近的未来，在这个未来中，人工智能(AI)不再仅仅是一个辅助工具，而是一种可行且可能更优越的人类领导替代方案，即使在最高执行层面也是如此。\n\n核心前提提出了双重挑战和机遇：\n1.  **拥抱AI以提升自身地位：** 鼓励个人积极学习并将AI工具和策略融入到工作中。通过利用AI自动化、优化和创新传统上由上级执行的任务，员工可以有效地“取代”老板角色中的职能部分，展示出更高的价值和战略远见。\n2.  **立即行动以避免被淘汰：** “在他们取代你之前”这一紧急警告强调了AI的颠覆性力量。如果员工未能适应、提升技能并驾驭AI，他们将面临被淘汰的风险——这可能是由拥抱新技术的精通AI的管理者造成的，或者直接由能够更高效、更有效地完成他们工作（甚至老板工作）的AI系统造成的。\n\n本文实质上是对职业转型发出的严厉号召。它认为，成功驾驭AI驱动的未来需要个人成为积极的创新者，将AI作为战略杠杆来巩固和发展自己的职业生涯，而不是被动等待其不可避免的颠覆所影响。"
  },
  {
    "id": "46086771",
    "title": "Leak confirms OpenAI is preparing ads on ChatGPT for public roll out",
    "url": "https://www.bleepingcomputer.com/news/artificial-intelligence/leak-confirms-openai-is-preparing-ads-on-chatgpt-for-public-roll-out/",
    "summary": "A recent leak confirms that OpenAI is internally testing an \"ads feature\" within the ChatGPT Android app (version 1.2025.329 beta), signaling a significant shift towards monetizing the platform. Spotted by Tibor on X, the app's code includes references to \"bazaar content,\" \"search ad,\" and \"search ads carousel.\"\n\nThis move aims to replicate Google Search's ad model, potentially disrupting the web economy. Unlike its current ad-free user experience (apart from premium plans), ChatGPT plans to integrate ads. Experts suggest these ads could be highly personalized and effective due to OpenAI's deep user knowledge, potentially even \"sneaking in\" ads within search results.\n\nInitially, ads are expected to be limited to the search experience, though this may expand. ChatGPT's massive and rapidly growing user base makes it a prime candidate for successful advertising. The platform now boasts roughly 800 million weekly users (up from 100 million in November 2023), handles about 2.5 billion prompts daily, and counts India as its single biggest user base. This substantial engagement provides a robust foundation for a successful ad rollout.",
    "chinese_title": "泄露消息证实，OpenAI 正准备在 ChatGPT 上推出广告，面向公众。",
    "chinese_summary": "最近泄露的消息证实，OpenAI正在ChatGPT安卓应用（版本1.2025.329测试版）内部测试一项“广告功能”，这标志着该平台正朝着商业化方向迈出重要一步。据Tibor在X上发现，该应用的代码包含“bazaar内容”、“搜索广告”和“搜索广告轮播”等引用。\n\n此举旨在复制谷歌搜索的广告模式，可能扰乱网络经济。与目前无广告的用户体验（付费方案除外）不同，ChatGPT计划整合广告。专家认为，由于OpenAI对用户有深入了解，这些广告可能具有高度个性化和有效性，甚至可能“悄悄地”嵌入到搜索结果中。\n\n最初，广告预计将仅限于搜索体验，尽管这可能会扩大。ChatGPT庞大且快速增长的用户群，使其成为成功投放广告的理想选择。该平台目前拥有约8亿周活跃用户（2023年11月时为1亿），每天处理约25亿次提示，印度是其最大的单一用户群体。这种巨大的用户参与度为成功推出广告奠定了坚实基础。"
  },
  {
    "id": "46081053",
    "title": "28M Hacker News comments as vector embedding search dataset",
    "url": "https://clickhouse.com/docs/getting-started/example-datasets/hackernews-vector-search-dataset",
    "summary": "This article outlines how to build a large-scale vector embedding search and summarization application using 28.74 million Hacker News comments within ClickHouse.\n\nThe dataset contains 28.74 million Hacker News posts and their 384-dimensional vector embeddings, generated by the SentenceTransformers `all-MiniLM-L6-v2` model. The guide details steps for setting up a `hackernews` table in ClickHouse, loading the data from an S3 Parquet file, and building a HNSW vector similarity index on the `vector` column using `cosineDistance` for efficient Approximate Nearest Neighbor (ANN) searches.\n\nFor performing searches, users are shown how to generate query embeddings using the same `all-MiniLM-L6-v2` model in Python, then execute SQL queries in ClickHouse to retrieve semantically similar posts.\n\nFurthermore, a generative AI summarization application is presented. This Python-based tool takes a user-defined topic, performs a vector similarity search to retrieve relevant Hacker News posts, and then utilizes LangChain and OpenAI's `gpt-3.5-turbo` API to summarize the retrieved content. This demonstrates a powerful use case where vector search provides context for large language models, applicable to various enterprise domains like customer sentiment analysis or technical support automation.",
    "chinese_title": "2800万条Hacker News评论：向量嵌入搜索数据集",
    "chinese_summary": "本文阐述了如何使用 ClickHouse 中的 2874 万条 Hacker News 评论构建一个大规模向量嵌入搜索和摘要应用。\n\n该数据集包含 2874 万条 Hacker News 帖子及其 384 维向量嵌入，这些嵌入由 SentenceTransformers 的 `all-MiniLM-L6-v2` 模型生成。本指南详细介绍了在 ClickHouse 中设置 `hackernews` 表、从 S3 Parquet 文件加载数据，以及在 `vector` 列上使用 `cosineDistance` 构建 HNSW 向量相似性索引以实现高效的近似最近邻 (ANN) 搜索的步骤。\n\n为了执行搜索，用户将了解到如何使用相同的 `all-MiniLM-L6-v2` 模型在 Python 中生成查询嵌入，然后通过在 ClickHouse 中执行 SQL 查询来检索语义相似的帖子。\n\n此外，本文还介绍了一个生成式 AI 摘要应用。该基于 Python 的工具接收用户定义的主题，执行向量相似性搜索以检索相关的 Hacker News 帖子，然后利用 LangChain 和 OpenAI 的 `gpt-3.5-turbo` API 对检索到的内容进行摘要。这展示了一个强大的用例，即向量搜索为大型语言模型提供了上下文，适用于客户情感分析或技术支持自动化等各种企业领域。"
  },
  {
    "id": "46079868",
    "title": "Credit report shows Meta keeping $27B off its books through advanced geometry",
    "url": "https://stohl.substack.com/p/exclusive-credit-report-shows-meta",
    "summary": "This article, presented as an exclusive report based on a \"leaked\" credit report from \"Equiplex,\" claims that Meta is using advanced geometric techniques to keep $27 billion off its books. The report suggests Meta is employing \"Minkowski Sums\" and \"hyperbolic tessellations\" to create non-Euclidean spaces within its financial records.\n\nThe author, a former geometry teacher, explains that Minkowski Sums allow for the \"fusion of financial entities into a single, yet geometrically expanded, accounting space,\" effectively hiding value. Hyperbolic tessellations further complexify this by creating \"infinite sub-accounts\" within finite ledger spaces, making the true scale of assets difficult to ascertain.\n\nThe article highlights a suspicious \"Negative Space Equity\" entry, which the author interprets as Meta leveraging the inherent value of non-existence within its financial dimensions. The \"Equiplex\" analyst noted a \"dizzying array of polyhedral structures\" in Meta's \"Asset-Liability Nexus Diagram,\" implying a deliberate obfuscation strategy. The conclusion is that Meta is utilizing these abstract geometric principles not for technological innovation, but for \"galactic-level tax evasion,\" by maintaining a \"mathematically sound, yet fiscally invisible, empire.\" The author suggests this practice could herald a new era of \"Geometric Accountancy.\"",
    "chinese_title": "信用报告显示，Meta通过先进的几何学将270亿美元不计入其账目。",
    "chinese_summary": "这篇以一份来自“Equiplex”的“泄露”信用报告为基础的独家报道声称，Meta正在利用先进的几何技术，使其270亿美元不计入账目。该报告指出，Meta正在使用“闵可夫斯基和”和“双曲密铺”在其财务记录中创建非欧几里得空间。\n\n作者，一位前几何学教师，解释说闵可夫斯基和允许“将金融实体融合到一个单一但几何上扩展的会计空间中”，有效地隐藏了价值。双曲密铺通过在有限的账本空间内创建“无限的子账户”进一步使其复杂化，使得资产的真实规模难以确定。\n\n文章强调了一个可疑的“负空间权益”条目，作者将其解读为Meta正在利用其财务维度中“非存在”的内在价值。“Equiplex”的分析师在Meta的“资产-负债关联图”中注意到“令人眼花缭乱的多面体结构”，这暗示了一种故意的混淆策略。结论是，Meta利用这些抽象的几何原理并非用于技术创新，而是用于“宇宙级逃税”，通过维持一个“在数学上严谨，但在财务上隐形”的帝国。作者认为这种做法可能预示着一个“几何会计”新时代的到来。"
  },
  {
    "id": "46080916",
    "title": "Molly: An Improved Signal App",
    "url": "https://molly.im/",
    "summary": "Molly is an independent fork of the Signal app for Android, designed to be an improved version with enhanced features and privacy. Unlike Signal, Molly is fully FOSS (Free and Open-Source Software) and contains no proprietary blobs.\n\nKey features and improvements include:\n*   **Enhanced Security:** Database protection with Passphrase Encryption, RAM Shredding for sensitive data, and Automatic Locking after inactivity.\n*   **Multi-Device Support:** Ability to pair multiple devices to a single account.\n*   **Privacy-Focused Notifications:** Integrates UnifiedPush for an ungoogled notification system.\n*   **Tor Support:** Offers Tor connectivity via SOCKS proxy and Orbot.\n*   **Aesthetic Customization:** Includes a Material You theme that follows your device's palette.\n\nMolly is presented as a continually evolving app with more new features planned. It is available for download on GitHub, and users are encouraged to donate to support its development.",
    "chinese_title": "莫莉：Signal改进版",
    "chinese_summary": "Molly是Signal安卓应用的一个独立分支，旨在成为一个具有增强功能和隐私保护的改进版本。与Signal不同，Molly是完全的FOSS（自由及开源软件），不含任何专有二进制文件。\n\n主要特点和改进包括：\n*   **增强安全性**：通过密码加密保护数据库，敏感数据进行内存粉碎（RAM Shredding），以及不活动时自动锁定。\n*   **多设备支持**：能够将多个设备配对到一个账户。\n*   **注重隐私的通知**：集成UnifiedPush，实现非谷歌的通知系统。\n*   **Tor支持**：通过SOCKS代理和Orbot提供Tor连接。\n*   **美学定制**：包含一个遵循设备调色板的Material You主题。\n\nMolly被定位为一个不断发展的应用程序，并计划推出更多新功能。它可在GitHub上下载，并鼓励用户捐赠以支持其开发。"
  },
  {
    "id": "46080473",
    "title": "Bringing Sexy Back. Internet surveillance has killed eroticism",
    "url": "https://lux-magazine.com/article/privacy-eroticism/",
    "summary": "The article \"Bringing Sexy Back. Internet surveillance has killed eroticism\" argues that pervasive internet surveillance, driven by both corporate and state actors, fundamentally eradicates the conditions essential for eroticism to thrive. Author Jessica Fjeld posits that eroticism extends beyond mere sex, encompassing risk, vulnerability, intimacy, and the thrill of the unknown – elements that demand a private, unobserved space.\n\nSurveillance erodes this crucial privacy by ensuring nearly all digital and many physical interactions are constantly monitored and recorded. This omnipresent gaze fosters a chilling effect, leading individuals to self-censor due to fear of exposure, data breaches, or the weaponization of personal information. The loss of privacy stifles spontaneity and genuine vulnerability, which are core to erotic connection. Moreover, the algorithmic commercialization of desire predicts and packages preferences, replacing organic, personal discovery with commodified solutions. This sanitizes and strips away the unpredictable, \"forbidden\" aspects that are vital to eroticism.\n\nHistorically, eroticism has always flourished in spaces of freedom and partial concealment, away from the scrutiny of authority. The article concludes that reclaiming privacy and actively resisting pervasive surveillance are critical steps to revive eroticism, enabling vulnerability, risk, and the unknown to flourish once again, free from constant observation and algorithmic control.",
    "chinese_title": "性感回归。网络监控扼杀了情色。",
    "chinese_summary": "文章《重拾性感：互联网监控扼杀了情色》认为，由企业和国家行为者共同推动的无处不在的互联网监控，从根本上扼杀了情色繁荣所必需的条件。作者杰西卡·菲耶尔德提出，情色不仅仅是性，它还包含风险、脆弱、亲密以及未知带来的刺激——这些要素都需要一个私密的、未受观察的空间。\n\n监控通过确保几乎所有数字和许多物理互动都受到持续监控和记录，从而侵蚀了这一至关重要的隐私。这种无处不在的凝视造成了一种寒蝉效应，导致个人出于对曝光、数据泄露或个人信息武器化的恐惧而进行自我审查。隐私的丧失扼杀了自发性和真实的脆弱性，而这些正是情色连接的核心。此外，欲望的算法商业化预测并包装了偏好，用商品化的解决方案取代了有机的、个性化的发现。这净化并剥离了对情色至关重要的不可预测的、“禁忌”的方面。\n\n从历史上看，情色总是在自由和部分隐秘的空间中繁荣，远离权威的审视。该文章总结认为，重新获得隐私并积极抵制无处不在的监控是重振情色的关键步骤，使脆弱、风险和未知能够再次蓬勃发展，不受持续观察和算法控制。"
  },
  {
    "id": "46082223",
    "title": "How good engineers write bad code at big companies",
    "url": "https://www.seangoedecke.com/bad-code-at-big-companies/",
    "summary": "The article explores the paradox of competent engineers at big tech companies producing surprisingly sloppy code. The primary reason is frequent engineer turnover and internal mobility; engineers often stay only 1-2 years due to compensation structures, and frequent re-organizations move them between teams and codebases. This means many code changes are made by \"beginners\" unfamiliar with the specific system or even language, contrasting with codebases often a decade or more old.\n\nWhile \"old hands\"—experienced engineers with deep system knowledge—can help with reviews, their support is informal and they are typically overloaded, unable to catch every issue without sacrificing their own output. The \"median productive engineer\" is competent but often new to their current codebase or juggling numerous deadlines, leading to hacky solutions quickly reviewed and shipped.\n\nThe author argues this is a deliberate trade-off by big tech. Companies prioritize \"internal legibility\"—the ability to treat engineers as fungible resources and rapidly deploy them to solve immediate problems (e.g., AI pivots)—over cultivating deep, long-term expertise and code quality. This systemic choice forces engineers into \"impure engineering,\" working on unfamiliar projects under pressure, making less-than-ideal code an inevitable outcome.\n\nUltimately, the article concludes that blaming individual engineers is misguided. The root cause is the organizational dynamic that compels even highly skilled professionals to constantly work in unfamiliar codebases, creating an environment where \"bad\" code is a systemic rather than individual failure.",
    "chinese_title": "大公司里，好工程师如何写出烂代码",
    "chinese_summary": "本文探讨了大型科技公司中，有能力的工程师却产出令人惊讶的糟糕代码这一悖论。主要原因是工程师频繁的流动和内部调动；由于薪酬结构，工程师往往只在公司停留1-2年，而频繁的组织重构又让他们在不同团队和代码库间辗转。这意味着许多代码修改是由不熟悉特定系统甚至编程语言的“新手”完成的，而这些代码库却往往已有十年甚至更久的历史。\n\n尽管“老手”（拥有深厚系统知识的资深工程师）可以协助代码审查，但他们的支持往往是非正式的，且通常工作量过大，无法在不牺牲自身产出的情况下发现所有问题。“普通高效工程师”能力很强，但通常对当前代码库不熟悉，或者需要同时处理大量截止日期，这导致他们写出的临时性解决方案在快速审查后便被发布。\n\n作者认为，这是大型科技公司有意识的权衡。公司优先考虑的是“内部可理解性”——即能够将工程师视为可互换的资源，并迅速调动他们去解决眼前的问题（例如，人工智能转型）——而非培养深厚的长期专业知识和代码质量。这种系统性选择迫使工程师从事“不纯粹的工程”，在压力下处理不熟悉的项目，使得不尽如人意的代码成为必然结果。\n\n最终，文章总结道，将问题归咎于单个工程师是错误的。根本原因是组织动态，这种动态迫使即使是高技能专业人士也持续在不熟悉的代码库中工作，从而创造了一个“糟糕”代码是系统性而非个人失败的环境。"
  },
  {
    "id": "46080364",
    "title": "So you wanna build a local RAG?",
    "url": "https://blog.yakkomajuri.com/blog/local-rag",
    "summary": "The article details Skald's efforts to build a fully self-hostable, privacy-preserving RAG (Retrieval Augmented Generation) system that operates without sending data to third parties. This involves replacing proprietary SaaS solutions for core RAG components—vector database, embeddings model, LLM, reranker, and document parsing—with local, open-source alternatives.\n\nSkald's current local stack uses Postgres with pgvector for the vector database, configurable Sentence Transformers (e.g., all-MiniLM-L6-v2, bge-m3) for embeddings, user-managed open-source LLMs (tested with GPT-OSS 20B), configurable Sentence Transformers cross-encoders (e.g., ms-marco-MiniLM-L6-v2, mmarco-mMiniLMv2-L12-H384-v1) for reranking, and Docling for document parsing.\n\nBenchmarking against a PostHog website dataset revealed:\n1.  **Voyage AI + Claude Sonnet 3.7 (proprietary):** Excellent performance, scoring 9.45.\n2.  **Voyage AI + GPT-OSS 20B (hybrid):** Very good, scoring 9.18, demonstrating strong open-source LLM capability.\n3.  **Fully local (default Sentence Transformers):** Decent for English point queries (7.10), but failed on non-English queries and aggregation tasks.\n4.  **Fully local (multi-lingual bge-m3 embeddings + mmarco-mMiniLMv2-L12-H384-v1 reranker):** Very good (8.63), handled multi-lingual queries but still struggled with aggregating information across multiple documents.\n\nThe author concludes that fully local RAG is viable, performs well for many use cases, and is continuously improving. Skald plans further refinements and more legitimate benchmarks.",
    "chinese_title": "你是不是想搭建本地 RAG？",
    "chinese_summary": "本文详细介绍了Skald在构建一个完全可自托管、保护隐私的RAG（检索增强生成）系统方面的努力，该系统无需将数据发送给第三方即可运行。这包括用本地开源替代方案取代RAG核心组件——向量数据库、嵌入模型、大型语言模型（LLM）、重排序器和文档解析——的专有SaaS解决方案。\n\nSkald当前的本地技术栈使用带有pgvector的Postgres作为向量数据库，可配置的Sentence Transformers（例如all-MiniLM-L6-v2、bge-m3）用于生成嵌入，用户自行管理的开源LLM（已使用GPT-OSS 20B进行测试），可配置的Sentence Transformers交叉编码器（例如ms-marco-MiniLM-L6-v2、mmarco-mMiniLMv2-L12-H384-v1）用于重排序，以及Docling用于文档解析。\n\n针对PostHog网站数据集进行的基准测试显示：\n1. **Voyage AI + Claude Sonnet 3.7（专有）：** 性能卓越，得分9.45。\n2. **Voyage AI + GPT-OSS 20B（混合）：** 非常出色，得分9.18，展示了强大的开源LLM能力。\n3. **完全本地化（默认Sentence Transformers）：** 对于英语点查询表现尚可（7.10），但在非英语查询和聚合任务上失败。\n4. **完全本地化（多语言bge-m3嵌入 + mmarco-mMiniLMv2-L12-H384-v1重排序器）：** 非常出色（8.63），能够处理多语言查询，但仍难以聚合多个文档中的信息。\n\n作者总结认为，完全本地化的RAG是可行的，在许多用例中表现良好，并且正在持续改进。Skald计划进一步完善并进行更具说服力的基准测试。"
  },
  {
    "id": "46078138",
    "title": "A Remarkable Assertion from A16Z",
    "url": "https://nealstephenson.substack.com/p/a-remarkable-assertion-from-a16z",
    "summary": "Neal Stephenson's article discusses a \"remarkable assertion\" made by a partner at Andreessen Horowitz (A16Z), Scott Kupor, regarding the viability of building a \"full stack AI\" company. Kupor's assertion, highlighted in an a16z newsletter, suggested that it's challenging to integrate hardware and software in AI effectively, leading to difficulty in creating defensible full-stack companies. He argued that the cost-effectiveness and rapid evolution of off-the-shelf hardware make it a better strategy for AI companies to focus primarily on software.\n\nStephenson, drawing on his experience with physical engineering and his novel *Termination Shock*, finds this assertion counter-intuitive and potentially alarming. He notes that throughout history, foundational technological shifts, like the steam engine or computing, have often required deep integration of hardware and software (or their equivalents) to achieve breakthrough performance and competitive advantage. He implies that A16Z, a major venture capital firm, potentially downplaying the importance of this integration might reflect a disconnect between the world of venture capital and the fundamental engineering challenges necessary for genuine, long-term innovation in AI, particularly when considering the physical world. He suggests that such a viewpoint risks overlooking the potential for true technological breakthroughs that emerge from \"deep hardware-software co-design.\"",
    "chinese_title": "A16Z的重磅论断",
    "chinese_summary": "Neal Stephenson的文章讨论了Andreessen Horowitz (A16Z) 的合伙人Scott Kupor关于建立“全栈AI”公司可行性所做出的“一个显著论断”。Kupor的论断在a16z的一份通讯中被强调，他认为在AI领域有效整合硬件和软件具有挑战性，这导致难以创建具有防御性的全栈公司。他认为，现成硬件的成本效益和快速演进使其成为AI公司主要专注于软件的更好策略。\n\nStephenson结合他在物理工程方面的经验以及他的小说《终结冲击》，发现这一论断与直觉相悖，并可能令人担忧。他指出，纵观历史，基础性的技术变革，如蒸汽机或计算，往往需要硬件和软件（或其等价物）的深度整合，才能实现突破性性能和竞争优势。他暗示，A16Z作为一家主要的风险投资公司，可能淡化这种整合的重要性，这可能反映了风险投资界与AI领域真正、长期创新所必需的基础工程挑战之间存在脱节，尤其是在考虑物理世界时。他认为，这种观点可能忽视了源于“深层软硬件协同设计”的真正技术突破的潜力。"
  },
  {
    "id": "46073855",
    "title": "250MWh 'Sand Battery' to start construction in Finland",
    "url": "https://www.energy-storage.news/250mwh-sand-battery-to-start-construction-in-finland-for-both-heating-and-ancillary-services/",
    "summary": "Polar Night Energy and utility Lahti Energia are partnering to construct a 250MWh 'Sand Battery' thermal energy storage (TES) system in Vääksy, Finland. Set to be the largest sand-based TES project globally, it will have a heating power of 2MW and a 125-hour storage capacity.\n\nConstruction is slated to begin in early 2026, with completion expected by summer 2027. The Sand Battery will primarily supply heat to Lahti Energia's district heating network, significantly cutting fossil-based emissions by approximately 60% annually (reducing natural gas use by 80%). Its considerable scale also enables it to participate in Fingrid’s reserve and grid balancing markets, providing crucial ancillary services.\n\nThe technology involves heating locally sourced natural sand with electricity, storing the heat, and then discharging it for heating purposes. This project follows Polar Night Energy's successful deployment of a 1MW/100MWh Sand Battery using soapstone for another utility earlier this year. Lahti Energia received a grant from Business Finland for this initiative, which aims to deliver affordable, renewable district heating and support grid stability.",
    "chinese_title": "芬兰将开建250兆瓦时“沙电池”",
    "chinese_summary": "极夜能源公司与芬兰拉赫蒂能源公司正在合作，在芬兰瓦克斯建造一座250兆瓦时（MWh）的“沙子电池”热能储存（TES）系统。该项目将成为全球最大的沙基热储能项目，拥有2兆瓦的供热功率和125小时的储存容量。\n\n建设工作计划于2026年初开始，预计于2027年夏季完工。“沙子电池”将主要向拉赫蒂能源公司的区域供热网络供热，每年可大幅减少约60%的化石燃料排放（减少80%的天然气使用）。其相当大的规模也使其能够参与芬兰电网公司Fingrid的备用和电网平衡市场，提供重要的辅助服务。\n\n该技术包括用电加热当地采购的天然沙，储存热量，然后将其释放用于供热。此前，极夜能源公司已于今年早些时候为另一家能源公司成功部署了一台使用皂石的1兆瓦/100兆瓦时沙子电池。拉赫蒂能源公司为此项目获得了芬兰商业局的资助，旨在提供负担得起的、可再生的区域供热并支持电网稳定。"
  },
  {
    "id": "46083303",
    "title": "Confessions of a Software Developer: No More Self-Censorship",
    "url": "https://kerrick.blog/articles/2025/confessions-of-a-software-developer-no-more-self-censorship/",
    "summary": "The article \"Confessions of a Software Developer: No More Self-Censorship\" by Kerrick Staley is a personal declaration from the author to abandon self-censorship in his professional and public communication. Staley reflects on a long-standing habit of filtering his thoughts, opinions, and experiences, particularly those that might be considered controversial, unconventional, or simply not perfectly polished.\n\nHe attributes this self-imposed restraint to various factors, including a desire to appear competent, avoid criticism, or conform to perceived professional norms. However, he now views this habit as detrimental, leading to a loss of authenticity, stifled creativity, and missed opportunities for genuine connection and deeper discussion.\n\nStaley asserts his intention to share his perspectives more openly, even if they are unfinished, imperfect, or challenge the status quo. This includes expressing frustrations, discussing unconventional approaches, and revealing the messy realities of software development. His aim is to foster more honest conversations, learn more effectively, and ultimately contribute to a more transparent and human-centric tech community. The article serves as both a personal commitment and an invitation for others to embrace similar authenticity.",
    "chinese_title": "软件开发者的忏悔录：不再自我审查",
    "chinese_summary": "Kerrick Staley 的文章《一个软件开发者的自白：不再自我审查》是作者一份个人声明，旨在放弃在职业和公共交流中的自我审查。Staley 反思了他长期以来过滤思想、观点和经验的习惯，尤其是那些可能被视为有争议、非传统或仅仅是不够完善的内容。\n\n他将这种自我设限归因于多种因素，包括渴望显得能干、避免批评或遵从被普遍认同的职业规范。然而，他现在认为这种习惯是有害的，导致了真实性的丧失、创造力的扼杀以及错失了建立真正联系和进行更深入讨论的机会。\n\nStaley 声明他打算更开放地分享自己的观点，即使这些观点尚未成熟、不尽完美，或者挑战现状。这包括表达挫折、讨论非传统方法以及揭示软件开发中凌乱的现实。他的目标是促进更真诚的对话、更有效地学习，并最终为建立一个更透明、更以人为本的科技社区做出贡献。这篇文章既是作者的个人承诺，也是邀请他人拥抱类似真诚的呼吁。"
  },
  {
    "id": "46079721",
    "title": "Can Dutch universities do without Microsoft?",
    "url": "https://dub.uu.nl/en/news/can-dutch-universities-do-without-microsoft",
    "summary": "I apologize, but the article content is missing. The text provided only says \"HOP\".\n\nPlease provide the full article so I can summarize it for you.",
    "chinese_title": "荷兰大学能否摆脱微软？",
    "chinese_summary": "我很抱歉，但是文章内容缺失了。您提供的文本只写着“HOP”。请提供完整的文章，以便我为您总结。"
  },
  {
    "id": "46084956",
    "title": "System 7 natively boots on the Mac mini G4",
    "url": "https://macos9lives.com/smforum/index.php?topic=7711.0",
    "summary": "A forum post on \"Mac OS 9 Lives\" announces a significant achievement: System 7 has successfully booted natively on the Mac mini G4. The topic, titled \"System 7 natively boots on the Mac mini G4!\", was posted by user RonsCompVids on November 29, 2025, in the \"Mac OS 9 on Unsupported Hardware\" section.\n\nThis development highlights the community's ongoing efforts to run classic Mac operating systems on hardware not officially supported. The topic has already garnered substantial interest, with 49,381 reads. It appears to be a progression from or related to earlier discussions, such as \"Mac OS 9 booting on: Mac mini G4 (Detailed Posts)\" from November 27, 2025, indicating a concerted push to expand classic Mac OS compatibility to later G4-era machines like the Mac mini.",
    "chinese_title": "系统 7 在 Mac mini G4 上原生启动。",
    "chinese_summary": "“Mac OS 9 Lives”论坛上的一篇帖子宣布了一项重大成就：System 7 已成功在 Mac mini G4 上原生启动。这篇题为“System 7 在 Mac mini G4 上原生启动！”的帖子由用户 RonsCompVids 于2025年11月29日在“非官方硬件上的 Mac OS 9”板块发布。\n\n这一进展彰显了社区持续努力，旨在非官方支持的硬件上运行经典 Mac 操作系统。该帖子已获得巨大关注，浏览量达 49,381 次。这似乎是之前讨论的延续或相关内容，例如2025年11月27日的“Mac OS 9 在 Mac mini G4 上启动：详细帖子”，表明了社区正齐心协力，将经典 Mac OS 的兼容性扩展到 Mac mini 等更晚期的 G4 时代机器上。"
  },
  {
    "id": "46080289",
    "title": "Airloom – 3D Flight Tracker",
    "url": "https://objectiveunclear.com/airloom.html",
    "summary": "Airloom is a 3D flight tracker application designed for visualizing flight paths in a three-dimensional environment. Users can locate flights by searching for airports, using their current position, or defining a search radius, with real-time aircraft counts.\n\nThe interface offers extensive navigation, including an immersive \"Fly Mode\" (WASD controls) for moving around the 3D space, view resets, and the ability to clear flight trails. \"Flight Following\" allows users to track specific aircraft, with a \"Surf Mode\" for easy selection. Display settings are highly customizable, covering trail length, thickness, color (by speed or altitude), and visibility of airport/city labels.\n\nVarious map layers are available, from satellite and wireframe to 3D views, along with options to show borders, GPS elevation, and detailed airspace classifications (Class B, C, D) with adjustable opacity. Data settings include customizable update rates and robust filters for aircraft based on callsign, type, and altitude.\n\nA key feature is the \"Recording & Playback\" system, enabling users to start, save, load, and play back flight data with a timeline and variable speeds. Advanced settings provide fine-tuned control over altitude scale, fog distance, map brightness, wireframe density, and color schemes, ensuring a highly personalized and interactive flight tracking experience.",
    "chinese_title": "艾尔隆 – 3D 飞行追踪器",
    "chinese_summary": "Airloom是一款三维飞行追踪应用程序，旨在三维环境中可视化飞行路径。用户可以通过搜索机场、使用当前位置或定义搜索半径来定位航班，并能查看实时飞机数量。\n\n界面提供广泛的导航功能，包括沉浸式“飞行模式”（WASD控制），用于在三维空间中移动、重置视图以及清除飞行轨迹。“航班追踪”允许用户追踪特定飞机，并配有便于选择的“浏览模式”。显示设置高度可定制，包括轨迹长度、粗细、颜色（按速度或高度）以及机场/城市标签的可见性。\n\n提供多种地图图层，从卫星图、线框图到三维视图，并可选择显示边界、GPS海拔以及具有可调不透明度的详细空域分类（B、C、D类）。数据设置包括可定制的更新速率和强大的飞机过滤器，可根据呼号、类型和高度进行筛选。\n\n一个关键功能是“录制与回放”系统，用户可以通过时间轴和可变速度来启动、保存、加载和回放飞行数据。高级设置提供对高度比例、雾距离、地图亮度、线框密度和配色方案的精细控制，确保高度个性化和交互式的飞行追踪体验。"
  },
  {
    "id": "46077992",
    "title": "The mysterious black fungus from Chernobyl that may eat radiation",
    "url": "https://www.bbc.com/future/article/20251125-the-mysterious-black-fungus-from-chernobyl-that-appears-to-eat-radiation",
    "summary": "A mysterious black fungus discovered thriving in Chernobyl's radioactive ruins by Nelli Zhdanova exhibits a unique ability to grow towards ionising radiation, a phenomenon dubbed \"radiotropism.\" These fungi are rich in melanin, a pigment initially thought to shield them from harmful radiation.\n\nFurther research by Ekaterina Dadachova proposed that these melanised fungi don't just protect themselves but actively convert radiation energy into usable energy for growth, a process called \"radiosynthesis.\" Her studies showed melanised fungi growing faster in radioactive environments, suggesting a potential new foundation of life.\n\nThe same fungal strain, *Cladosporium sphaerospermum*, was later sent to the International Space Station, where it grew faster in the presence of galactic cosmic radiation and demonstrated significant radiation-blocking capabilities. This has opened exciting possibilities for space exploration. Scientists envision using these fungi to create self-regenerating \"myco-architecture\" for future lunar and Martian bases, providing a lightweight, durable shield for astronauts against cosmic rays, eliminating the need to transport heavy conventional shielding materials from Earth.",
    "chinese_title": "可能吞噬辐射的切尔诺贝利神秘黑真菌",
    "chinese_summary": "Nelli Zhdanova在切尔诺贝利核废墟中发现了一种神秘的黑色真菌，它表现出一种独特的趋向电离辐射生长的能力，这种现象被称为“趋辐射性”。这些真菌富含黑色素，这种色素最初被认为可以保护它们免受有害辐射。\n\nEkaterina Dadachova的进一步研究提出，这些含黑色素的真菌不仅保护自身，还能主动将辐射能转化为可用于生长的能量，这一过程被称为“辐射合成”。她的研究表明，含黑色素的真菌在放射性环境中生长更快，这暗示了一种潜在的新的生命基础。\n\n同样的真菌菌株——*球形枝孢菌*（*Cladosporium sphaerospermum*），后来被送往国际空间站，在那里它在银河宇宙射线的存在下生长得更快，并展现出显著的辐射阻挡能力。这为太空探索开辟了激动人心的可能性。科学家设想利用这些真菌为未来的月球和火星基地建造自我再生的“真菌建筑”，为宇航员提供轻质、耐用的宇宙射线防护罩，从而无需从地球运输笨重的传统屏蔽材料。"
  },
  {
    "id": "46088192",
    "title": "Iceland declares ocean-current instability a national security risk",
    "url": "https://edition.cnn.com/2025/11/15/climate/iceland-warming-current-amoc-collapse-threat",
    "summary": "Iceland has made the unprecedented move of designating the potential collapse of the Atlantic Meridional Overturning Circulation (AMOC) — a crucial system of ocean currents — as a national security risk. This decision stems from mounting evidence that the AMOC, which transports warm water northward and maintains Iceland's relatively mild climate, is slowing down due to global warming.\n\nScientists consider an AMOC collapse among the most terrifying potential climate impacts. For Iceland, its shutdown would mean severe regional cooling, increased storminess, and surrounding sea ice, devastating infrastructure, transport, and vital industries like fishing. Minister Jóhann Páll Jóhannsson called it an \"existential threat\" to the nation's climate, economy, and security.\n\nFollowing recent research highlighting \"grave concerns\" about the AMOC's stability, Iceland's National Security Council officially made the designation in September. This triggers a high-level, coordinated government response to understand and mitigate the threat. While the exact timing of a collapse is uncertain, some studies project it could happen this century, with experts stating it's no longer a low-likelihood risk.\n\nScientists commend Iceland's proactive stance, urging other countries to follow suit, as the global impacts of an AMOC collapse would be catastrophic, including rising sea levels, disrupted monsoons, and a deep winter freeze across Europe. Iceland's decision marks a significant shift, recognizing that such drastic climate change could make adaptation impossible, making it a \"matter of national survival and security.\"",
    "chinese_title": "冰岛将洋流不稳定列为国家安全风险",
    "chinese_summary": "冰岛做出了前所未有的举动，将大西洋经向翻转环流（AMOC）——一个重要的洋流系统——的潜在崩溃定性为国家安全风险。这一决定源于越来越多的证据表明，AMOC（它将暖水输送到北方并维持冰岛相对温和的气候）正因全球变暖而减缓。\n\n科学家们认为AMOC崩溃是“最可怕的潜在气候影响”之一。对于冰岛而言，AMOC的停止将意味着严重的区域降温、更频繁的暴风雨以及周围海冰的增加，这将对基础设施、交通以及渔业等重要产业造成毁灭性打击。约翰·帕尔·约翰逊部长称其为对国家气候、经济和安全的“生存威胁”。\n\n在最近的研究强调了对AMOC稳定性的“严重担忧”之后，冰岛国家安全委员会于9月正式做出了这一认定。这引发了高层、协调一致的政府应对措施，以了解并减轻这一威胁。虽然崩溃的确切时间尚不确定，但一些研究预测它可能发生在本世纪，专家们表示这不再是低可能性风险。\n\n科学家们赞扬冰岛的积极立场，敦促其他国家效仿，因为AMOC崩溃的全球影响将是灾难性的，包括海平面上升、季风紊乱以及欧洲范围内的严冬。冰岛的决定标志着一个重大转变，认识到这种剧烈的气候变化可能导致无法适应，使其成为“国家生存和安全的问题”。"
  },
  {
    "id": "46073033",
    "title": "Underrated reasons to be thankful V",
    "url": "https://dynomight.net/thanks-5/",
    "summary": "The article, \"Underrated reasons to be thankful V,\" presents a diverse list of often-overlooked blessings across biology, technology, society, and physics.\n\nReasons include the genuine love of dogs, the evolutionary success of sexual reproduction in fostering genetic variance for complex life, and the eventual potential to \"cure\" the common cold. Gratitude is extended to advancements in infectious disease control, with sanitation, vaccines, and emerging countermeasures effectively managing pathogens despite urbanization. Essential comforts like abundant clean water, modern dentistry, and even the simple utility of tongues are celebrated.\n\nThe unique properties of radioactive atoms, mostly self-limiting in their environmental impact, and the validated pursuit of curing major diseases, promising non-linear life expectancy gains, are noted. Biological marvels such as the peroxisome and the restorative power of sleep, offering a vital \"reset,\" are acknowledged.\n\nSocietal thankfulness covers the safety of air travel, the often more reliable optimism of financial markets, and the functional societal agreement to support parents. The historical rarity but growing prevalence of democracy and civil liberties offers hope. Abstract concepts, like individual preferences fostering happiness and the profound physics behind storing five-dimensional light fields on two-dimensional film (holography), are also reasons for appreciation. Even disposable plastic is recognized for its convenience and potential for carbon sequestration when properly managed. Finally, the fundamental blessing of living in three dimensions prevents bodily splitting when eating.",
    "chinese_title": "被低估的感恩理由 V",
    "chinese_summary": "文章《被低估的感恩理由 V》罗列了在生物学、技术、社会和物理学等领域中常被忽视的种种福分。\n\n理由包括狗的真挚爱意、有性生殖在促进复杂生命基因变异方面的演化成功，以及最终治愈普通感冒的潜力。文章对传染病控制方面的进展表示感谢，指出尽管城市化进程加快，但凭借卫生设施、疫苗和新兴对策，病原体仍得到了有效管理。充足的清洁水、现代牙科，乃至舌头的简单功用等基本便利也备受赞扬。\n\n放射性原子独特的、其环境影响大多是自我限制的特性，以及经证实旨在治愈重大疾病、有望带来非线性预期寿命增长的努力，都得到了提及。过氧化物酶等生物学奇迹，以及提供重要“重置”功能的睡眠的恢复力也受到了认可。\n\n社会层面的感恩涵盖了航空旅行的安全性、金融市场通常更为可靠的乐观情绪，以及社会支持父母的功能性共识。民主和公民自由在历史上罕见但日益普及，这带来了希望。一些抽象概念，例如个人偏好促进幸福，以及将五维光场存储在二维胶片上（全息术）背后的深奥物理学，也都是值得赞赏的理由。甚至一次性塑料，若管理得当，其便利性和碳固存潜力也得到了认可。最后，生活在三维空间中的基本福祉，避免了进食时身体分裂的情况。"
  },
  {
    "id": "46082825",
    "title": "Flight disruption warning as Airbus requests modifications to 6k planes",
    "url": "https://www.bbc.com/news/live/cvg4y6g74ert",
    "summary": "Airbus has issued a warning about flight disruptions as it mandates immediate software updates for over 6,000 planes, primarily its A320 model. The issue stems from the discovery that aircraft computers are vulnerable to interference from intense solar radiation, which can corrupt data controlling the plane's elevation.\n\nThis vulnerability came to light after a JetBlue aircraft experienced a \"sudden drop in altitude\" last October, an incident now attributed to solar radiation. The required modifications are causing significant flight cancellations, particularly impacting the United States during a major holiday weekend. American Airlines, Delta Air Lines, JetBlue, and United Airlines, four major A320 operators in the US, are among those affected. While global cancellations have been reported, disruption at UK airports has been relatively limited to date.",
    "chinese_title": "空客要求改装6000架飞机 航班面临中断预警",
    "chinese_summary": "空客已发布警告称，因强制要求超过6000架飞机（主要为空客A320机型）立即进行软件更新，航班可能中断。问题的根源在于发现飞机计算机易受强烈太阳辐射的干扰，这可能损坏控制飞机高度的数据。去年10月，一架捷蓝航空飞机经历“高度骤降”后，这一脆弱性才浮出水面，该事件现已被归因于太阳辐射。所需的修改导致大量航班取消，尤其是在一个主要的假日周末期间影响了美国。美国航空、达美航空、捷蓝航空和联合航空这四家美国主要的A320运营公司都在受影响之列。虽然全球各地都有航班取消的报告，但迄今为止，英国机场的航班中断相对有限。"
  },
  {
    "id": "46087737",
    "title": "It's Always the Process, Stupid",
    "url": "https://its.promp.td/its-always-the-process-stupid/",
    "summary": "The article asserts that Artificial Intelligence isn't a magic fix for business inefficiencies; instead, it merely accelerates existing processes, good or bad. There's no such thing as an \"AI strategy,\" only Business Process Optimization (BPO). AI, like past technological shifts, primarily makes tasks *faster*, not inherently smarter, and automating a flawed process only speeds up the generation of \"garbage.\"\n\nAI's unique capability is handling unstructured data (emails, PDFs), a domain previously managed by humans. However, processes relying on such data are often unstructured and undocumented themselves. For AI to be effective, these \"hidden\" workflows must first be brought into the light, designed, and structured by clearly defining triggers, transformations (what AI extracts), and structured outputs.\n\nWhile AI excels at rapid pattern-matching, human intelligence and governance remain crucial for true understanding and context. Businesses should prioritize mapping and optimizing their value chains, especially messy, human-centric processes. Only after establishing streamlined, logical processes should AI be applied to accelerate them, as \"it's always the process, stupid.\" The struggle with enterprise AI adoption partly stems from AI tools not being built with this BPO-first mindset.",
    "chinese_title": "笨蛋，永远是过程。",
    "chinese_summary": "文章指出，人工智能并非解决企业低效问题的“灵丹妙药”；相反，它只是加速了现有流程，无论好坏。不存在所谓的“AI战略”，只有业务流程优化（BPO）。人工智能，如同过去的科技变革一样，主要让任务变得*更快*，而非本质上更智能，自动化一个有缺陷的流程只会加速“垃圾”的产生。\n\n人工智能的独特能力在于处理非结构化数据（如电子邮件、PDF文件），这是过去由人类管理的领域。然而，依赖此类数据的流程本身往往是无结构且未被记录的。为了使人工智能有效，这些“隐藏”的工作流必须首先被揭示出来，并通过明确定义触发器、转换（AI提取什么）和结构化输出进行设计和构建。\n\n尽管人工智能擅长快速模式匹配，但人类智能和治理对于真正的理解和背景仍然至关重要。企业应优先绘制并优化其价值链，特别是那些混乱的、以人为中心的流程。只有在建立了精简、逻辑化的流程之后，才能应用人工智能来加速它们，因为“关键始终在于流程本身”。企业人工智能采纳的困境，部分源于AI工具在开发时并未秉持这种“业务流程优化优先”的理念。"
  },
  {
    "id": "46072786",
    "title": "DeepSeekMath-V2: Towards Self-Verifiable Mathematical Reasoning [pdf]",
    "url": "https://github.com/deepseek-ai/DeepSeek-Math-V2/blob/main/DeepSeekMath_V2.pdf",
    "summary": "The article introduces DeepSeekMath-V2, a project by DeepSeek AI focused on advancing mathematical reasoning capabilities in AI. Its defining feature, as indicated by \"Towards Self-Verifiable Mathematical Reasoning,\" is its ability to not only solve mathematical problems but also to autonomously verify the correctness of its own solutions. This aims to enhance the reliability and trustworthiness of AI-generated mathematical outputs, addressing a critical challenge in the field.\n\nThe details of this work are presented in a research paper (indicated by '[pdf]'). The project, hosted on GitHub under `deepseek-ai/DeepSeek-Math-V2`, is public and has attracted significant community interest, evidenced by 1k stars and 53 forks. This suggests it's a notable contribution towards developing more robust and reliable AI systems for complex mathematical tasks.",
    "chinese_title": "DeepSeekMath-V2: 迈向自验证数学推理 [pdf]",
    "chinese_summary": "本文介绍了DeepSeek AI的一个项目DeepSeekMath-V2，该项目专注于提升人工智能的数学推理能力。正如其名称“迈向自验证数学推理”所暗示的，它的显著特点在于它不仅能解决数学问题，还能自主验证其解决方案的正确性。这旨在提升人工智能生成的数学输出的可靠性和可信度，解决了该领域的一个关键挑战。\n\n这项工作的详细内容已在一篇研究论文中发表（标记为“[pdf]”）。该项目以 `deepseek-ai/DeepSeek-Math-V2` 的形式托管在GitHub上，是公开的，并吸引了社区的广泛关注，获得了1k星标和53个分支。这表明它在开发用于复杂数学任务的更强大、更可靠的人工智能系统方面做出了显著贡献。"
  },
  {
    "id": "46084535",
    "title": "Every mathematician has only a few tricks (2020)",
    "url": "https://mathoverflow.net/questions/363119/every-mathematician-has-only-a-few-tricks",
    "summary": "This article discusses Gian-Carlo Rota's assertion that \"Every mathematician has only a few tricks,\" prompting a community discussion on what these recurring techniques might be. While some users debated whether Rota's point referred to universal or highly personalized methods, several common \"tricks\" were identified.\n\nA frequently cited technique is **interchanging the order of summation or integration**, often seen as a powerful application of Fubini's theorem, or Gelfand's more generalized version of re-indexing. Another crucial strategy involves **modifying the problem**: either simplifying it to prove a more accessible version (attributed to Polya and Hilbert) or generalizing it by adding parameters to uncover deeper structures (as seen with Macdonald polynomials).\n\nOther highlighted tricks include:\n*   The fundamental use of **inequalities**, such as the triangle inequality.\n*   The versatility of **integration by parts**, noted for its profound impact in analysis.\n*   The **Pigeonhole Principle**, or its real-number equivalent (maximum is at least the average).\n*   The **probabilistic method**, championed by Erdős, involving \"trying a random object\" to prove existence.\n*   Utilizing the **Möbius $\\mu$-function** as a more elegant alternative to inclusion-exclusion.\n*   The principle that a **continuous, integer-valued function on a connected domain must be constant**.\n\nThe discussion suggests that while mathematicians possess vast knowledge, their most effective problem-solving approaches often stem from a concise, adaptable repertoire of core techniques.",
    "chinese_title": "每个数学家都只有那几招 (2020)",
    "chinese_summary": "Gian-Carlo Rota断言“每个数学家都只有少数几个技巧”，这引发了一场关于这些反复出现的技巧可能是什么的社区讨论。尽管一些用户争论Rota的观点指的是普遍适用的方法还是高度个性化的方法，仍有几个共同的“技巧”被识别出来。\n\n一个常被引用的技巧是**交换求和或积分的顺序**，这通常被视为Fubini定理或Gelfand更广义的重新索引版本的强大应用。另一个关键策略是**修改问题**：要么通过简化问题来证明一个更易于理解的版本（归因于Polya和Hilbert），要么通过添加参数来推广问题以揭示更深层的结构（例如Macdonald多项式）。\n\n其他被强调的技巧包括：\n*   **不等式**的基本应用，例如三角不等式。\n*   **分部积分法**的多功能性，以其在分析学中的深远影响而闻名。\n*   **抽屉原理**，或其实数等价形式（最大值至少等于平均值）。\n*   Erdős所倡导的**概率方法**，包括“尝试一个随机对象”来证明存在性。\n*   利用**莫比乌斯 $\\mu$ 函数**作为容斥原理的更优雅替代。\n*   在**连通域上的连续、取整数值的函数必定是常数**的原理。\n\n讨论表明，尽管数学家拥有渊博的知识，但他们最有效的解决问题方法往往源于一套简洁、适应性强的核心技巧。"
  },
  {
    "id": "46072988",
    "title": "LinkedIn is loud, and corporate is hell",
    "url": "https://ramones.dev/posts/linkedin-is-loud/",
    "summary": "The article \"LinkedIn is loud, and corporate is hell\" critiques LinkedIn as a \"performative hellscape\" and a microcosm of modern corporate inauthenticity. The author describes the platform as a place where individuals \"perform work\" rather than engage in it, filled with constant humblebrags, corporate jargon, thinly veiled ads, and a pervasive pressure to maintain an \"always-on\" professional persona.\n\nThe piece argues that LinkedIn exemplifies the superficiality and hypocrisy of contemporary corporate culture. It highlights instances of performative allyship, such as corporations adopting social justice causes without enacting substantial internal change, and the overall demand for employees to project an artificial image of passion and productivity. This environment, driven by \"personal branding\" and superficial networking, forces individuals into a constant state of performativity, leading to exhaustion and a feeling of being a \"corporate puppet.\"\n\nUltimately, the author expresses profound disillusionment with LinkedIn's inability to foster genuine connections or provide real value beyond a superficial job-hunting and networking experience that prioritizes outward performance over substantive professional engagement. It's a sharp critique of the exhausting and often meaningless nature of corporate performativity.",
    "chinese_title": "领英很喧嚣，职场是地狱",
    "chinese_summary": "文章《领英喧嚣，职场如狱》批判领英是一个“表演性地狱”，也是现代职场虚伪的缩影。作者将该平台描述为一个个人“表演工作”而非真正投入工作的场所，充斥着持续不断的凡尔赛式炫耀、职场黑话、遮掩不住的广告，以及一种无处不在的压力，要求人们保持“永远在线”的专业人设。\n\n该文认为，领英充分体现了当代职场文化的肤浅与虚伪。它突出强调了姿态性盟友关系的例子，比如企业采纳社会正义议题，却不进行实质性内部改革；以及普遍要求员工展现出虚假的激情和生产力形象。这种在“个人品牌”和肤浅社交驱动下的环境，迫使个人持续处于表演状态，导致筋疲力尽，并让人感觉自己像个“职场傀儡”。\n\n最终，作者对领英无法培养真诚的人际关系或提供超越肤浅求职与社交的真正价值表达了深刻的幻灭。它只优先考虑外在表现，而非实质性的专业投入。这是对职场表演性那种令人筋疲力尽、往往毫无意义的本质的尖锐批判。"
  },
  {
    "id": "46077038",
    "title": "Tech Titans Amass Multimillion-Dollar War Chests to Fight AI Regulation",
    "url": "https://www.wsj.com/tech/ai/tech-titans-amass-multimillion-dollar-war-chests-to-fight-ai-regulation-88c600e1",
    "summary": "Unable to access the article link.",
    "chinese_title": "科技巨头储备数百万美元“战争基金”对抗AI监管",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46079987",
    "title": "AI Adoption Rates Starting to Flatten Out",
    "url": "https://www.apolloacademy.com/ai-adoption-rates-starting-to-flatten-out/",
    "summary": "On November 28, 2025, Torsten Sløk, Apollo Chief Economist, reported that AI adoption rates are starting to flatten out across businesses of all sizes. This trend is based on data from the US Census Bureau and the Ramp AI Index.\n\nThe Ramp AI Index measures the adoption rate of artificial intelligence products and services among American businesses. It gathers data from over 40,000 U.S. businesses and billions of dollars in corporate spend through Ramp’s corporate card and bill pay platform. The reported data represents a six-survey moving average, with surveys conducted bi-weekly. This indicates a potential plateau in the rate at which companies are integrating AI technologies.",
    "chinese_title": "AI采纳率开始趋于平稳",
    "chinese_summary": "2025年11月28日，阿波罗首席经济学家托斯滕·斯洛克报告称，各种规模企业的人工智能采用率开始趋于平稳。这一趋势是基于美国人口普查局和Ramp AI指数的数据。\n\nRamp AI指数衡量美国企业对人工智能产品和服务的采用率。它通过Ramp的企业卡和账单支付平台，收集了来自超过40,000家美国企业的数据以及数十亿美元的企业支出信息。所报告的数据代表六次调查的移动平均值，这些调查是每两周进行一次的。这表明企业整合人工智能技术的速度可能达到了一个平台期。"
  },
  {
    "id": "46080161",
    "title": "Stellantis Is Spamming Owners' Screens with Pop-Up Ads for New Car Discounts",
    "url": "https://www.thedrive.com/news/stellantis-is-spamming-owners-screens-with-pop-up-ads-for-new-car-discounts",
    "summary": "Stellantis is drawing significant criticism for displaying pop-up ads promoting new car discounts directly on owners' in-car screens. The practice has been confirmed by a Jeep driver, Zerin Dube, and by Stellantis itself, sparking outrage online where users are labeling it \"obnoxious\" and \"late stage capitalism.\" Owners of Jeep, Ram, and Chrysler vehicles reported receiving these ads, with many vowing never to purchase from the brands again. This isn't the first instance, as Stellantis previously used similar pop-ups to advertise extended warranties, which were also met with frustration.\n\nStellantis defends the current $1,500 loyalty bonus offer, stating it's a way to \"stay in contact with owners at critical points\" and noting the system also delivers important recall and health alerts. They claim the marketing messages are designed to be minimally intrusive: appearing only on startup and while stationary, disappearing when the vehicle moves, after 15 seconds, or upon user dismissal. They only reappear if \"Remind Me Later\" is selected or ignored.\n\nDespite the backlash, the ads can be effective; Zerin Dube, who initially posted about the pop-up, ultimately purchased a new Jeep Wrangler with substantial discounts, including the $1,500 loyalty bonus. Stellantis confirmed that owners can permanently opt out of in-vehicle messaging by contacting their customer care line. The practice underscores the growing integration of advertising into connected car technology, especially as Stellantis aims to boost sales amid competition.",
    "chinese_title": "斯泰兰蒂斯用新车折扣弹窗广告刷爆车主屏幕。",
    "chinese_summary": "Stellantis因在车主车载屏幕上直接显示推广新车折扣的弹窗广告而受到大量批评。吉普车主Zerin Dube和Stellantis公司本身都证实了这一做法，在网上引发了众怒，用户称之为“令人厌恶”和“晚期资本主义”。吉普、Ram和克莱斯勒车车主报告收到了这些广告，许多人发誓再也不会购买这些品牌的汽车。这不是第一次发生此类事件，Stellantis此前曾使用类似的弹窗广告推广延长保修服务，同样引来了不满。\n\nStellantis为目前的1500美元忠诚奖金优惠辩护，称其是“在关键时刻与车主保持联系”的一种方式，并指出该系统还会发送重要的召回和健康警报。他们声称营销信息被设计成侵扰性最小：只在启动时和车辆静止时显示，当车辆移动、15秒后或用户解除时便会消失。它们只在选择“稍后提醒”或被忽略时才会再次出现。\n\n尽管遭到强烈反对，但这些广告可能有效；最初发帖抱怨弹窗广告的Zerin Dube最终购买了一辆享受大幅折扣的新款吉普牧马人，其中包括1500美元的忠诚奖金。Stellantis证实，车主可以通过联系其客户服务热线永久选择退出车载信息推送。这种做法凸显了广告与网联汽车技术日益融合的趋势，尤其是在Stellantis旨在竞争中提高销量之际。"
  },
  {
    "id": "46074362",
    "title": "How Charles M Schulz created Charlie Brown and Snoopy (2024)",
    "url": "https://www.bbc.com/culture/article/20241205-how-charles-m-schulz-created-charlie-brown-and-snoopy",
    "summary": "Charles M. Schulz, creator of the iconic Peanuts strip featuring Charlie Brown and Snoopy, drew every cartoon himself for 50 years until his retirement due to ill health in late 1999, shortly before his death in February 2000. Despite building a global billion-dollar empire, Schulz modestly described his work as addressing \"minor everyday problems\" like feelings of inadequacy, rather than grand societal issues. He stressed, however, that these seemingly small themes—love, hate, mistrust, fear, and insecurity—were profoundly important.\n\nPeanuts resonated globally, channeling universal feelings through the relatable \"eternal failure\" Charlie Brown. Umberto Eco noted its ability to charm both children and sophisticated adults. Schulz admitted his initial focus on children was commercial, as editors preferred them, and he found inspiration in the dynamics between dogs and children, providing a versatile \"repertory company\" for his ideas.\n\nA shy individual, Schulz studied art via correspondence, believing his background perfectly suited him for cartooning. He consistently produced strips by focusing intently on drawing \"something funny,\" often experiencing excitement when ideas flowed. Schulz was always confident Peanuts would be a success.\n\nHe announced his retirement due to cancer on December 14, 1999, with his final daily strip on January 3, 2000, and his last Sunday strip running the day after he died. Schulz's legacy includes a message of gratitude and, through Charlie Brown, the enduring lesson \"just to keep on trying,\" never giving up.",
    "chinese_title": "查尔斯·M·舒尔茨如何创作查理·布朗和史努比 (2024)",
    "chinese_summary": "查尔斯·M·舒尔茨，标志性漫画《花生漫画》（以查理·布朗和史努比为主角）的创作者，50年来亲自绘制了每一幅漫画，直到1999年末因病退休，不久后于2000年2月去世。尽管建立了一个全球数十亿美元的帝国，舒尔茨却谦逊地将自己的作品描述为处理“日常小问题”，例如能力不足感，而非宏大的社会议题。然而，他强调，这些看似渺小的主题——爱、恨、不信任、恐惧和不安全感——却具有深远的意义。\n\n《花生漫画》在全球引起共鸣，通过可产生共鸣的“永恒的失败者”查理·布朗，传达了普遍的情感。翁贝托·埃科指出它既能吸引儿童，也能征服阅历丰富的成年人。舒尔茨承认，他最初关注儿童是出于商业考量，因为编辑们更喜欢儿童题材，而且他从狗和孩子之间的互动中找到了灵感，这为他的想法提供了一个多功能的“剧团”。\n\n舒尔茨性格内向，通过函授学习艺术，认为自己的背景非常适合漫画创作。他始终专注于画“一些有趣的东西”，不断创作漫画，当灵感涌现时，他常常感到兴奋。舒尔茨始终坚信《花生漫画》会成功。\n\n1999年12月14日，他宣布因癌症退休，他创作的最后一篇日报漫画于2000年1月3日刊登，而他最后一篇周日漫画则在他去世后的第二天发布。舒尔茨的遗产包括一份感恩的信息，以及通过查理·布朗传达的“坚持不懈，永不放弃”的持久教训。"
  },
  {
    "id": "46074286",
    "title": "Bird flu viruses are resistant to fever, making them a major threat to humans",
    "url": "https://medicalxpress.com/news/2025-11-bird-flu-viruses-resistant-fever.html",
    "summary": "Unable to access the article link.",
    "chinese_title": "禽流感病毒耐热，使其对人类构成重大威胁。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46086681",
    "title": "Belgian Police exposed using botnets to manipulate EU data law impact assessment",
    "url": "https://old.reddit.com/r/europe/comments/1p9kxhm/belgian_federal_police_forgot_to_turn_their_vpn/",
    "summary": "The Reddit post from October 2013, titled \"Belgian Federal Police exposed using botnets to manipulate EU data law impact assessment,\" details accusations against the Belgian Federal Police (BFP). The BFP is alleged to have \"astroturfed\" an EU public consultation regarding data retention policies.\n\nAccording to the post, the BFP submitted multiple comments to the European Commission's impact assessment on data retention. These submissions, presented as views from various \"citizens,\" consistently advocated for mandatory data retention and opposed end-to-end encryption. The deception was reportedly uncovered when the IP addresses associated with these submissions were traced back to a VPN provider used by the Belgian Federal Police. The author claims the police \"forgot to turn their VPN off,\" effectively revealing their institutional origin despite attempts to disguise the source of the comments.\n\nThe incident is framed as an attempt by the Belgian state to manipulate public opinion and influence EU data protection legislation through deceptive means, akin to \"state-sponsored propaganda.\" The author uses terms like \"botnet\" to describe the coordinated, numerous submissions, implying a systematic effort to create false grassroots support for their position on data retention.",
    "chinese_title": "比利时警方被曝利用僵尸网络操纵欧盟数据法影响评估",
    "chinese_summary": "2013年10月的一篇Reddit帖子，标题为“比利时联邦警察被曝使用僵尸网络操纵欧盟数据法影响评估”，详细描述了对比利时联邦警察（BFP）的指控。BFP被指控在一次关于数据保留政策的欧盟公众咨询中搞“伪草根运动”。\n\n该帖子称，BFP向欧盟委员会关于数据保留的影响评估提交了多条评论。这些评论被包装成来自不同“公民”的意见，一致主张强制数据保留并反对端到端加密。据报道，当与这些评论相关的IP地址被追溯到比利时联邦警察使用的一家VPN服务商时，这一欺骗行为才被发现。作者声称，警方“忘记关闭他们的VPN”，尽管试图掩盖评论来源，但仍有效地暴露了其机构起源。\n\n该事件被定性为比利时国家通过欺骗性手段操纵公众舆论并影响欧盟数据保护立法的一次尝试，类似于“国家资助的宣传”。作者使用“僵尸网络”等词语来描述这些协调一致、数量众多的提交，暗示这是一种系统性的努力，旨在为其在数据保留问题上的立场制造虚假的基层支持。"
  },
  {
    "id": "46080143",
    "title": "True P2P Email on Top of Yggdrasil Network",
    "url": "https://github.com/JB-SelfCompany/Tyr",
    "summary": "Tyr is an Android application delivering true peer-to-peer (P2P) email by utilizing the Yggdrasil network. It challenges the traditional server-based email model, which is prone to surveillance, censorship, and metadata exposure. Tyr bypasses these issues by enabling direct device-to-device communication without requiring centralized mail servers, separate encryption layers (as Yggdrasil provides network-level encryption), or complex NAT traversal setups.\n\nThe app runs a complete SMTP/IMAP server directly on the Android device, making it compatible with standard email clients. It integrates seamlessly with decentralized messengers like DeltaChat and ArcaneChat, which are recommended for the best P2P messaging experience. Each Tyr installation generates a unique Ed25519 cryptographic key, forming a verifiable `<64-hex-characters>@yggmail` address, preventing identity spoofing.\n\nKey features include automatic configuration for chat apps, encrypted backups, sophisticated power management, and auto-start functionality. Security is built-in, leveraging the Android Keystore, Yggdrasil's network encryption, and local-only access for its mail ports. Tyr champions censorship circumvention, privacy by design (no metadata or server logs), and true decentralization, offering a resilient and private email solution.",
    "chinese_title": "Yggdrasil网络上的真P2P邮件",
    "chinese_summary": "Tyr是一款安卓应用，通过利用Yggdrasil网络提供真正的点对点（P2P）电子邮件服务。它挑战了传统的基于服务器的电子邮件模式，该模式容易遭受监视、审查和元数据泄露。Tyr通过实现设备间的直接通信来规避这些问题，而无需中心化邮件服务器、独立的加密层（因为Yggdrasil提供网络层加密）或复杂的NAT穿透设置。\n\n该应用直接在安卓设备上运行一个完整的SMTP/IMAP服务器，使其兼容标准电子邮件客户端。它与DeltaChat和ArcaneChat等去中心化即时通讯工具无缝集成，这些工具被推荐用于获得最佳P2P消息体验。每次Tyr安装都会生成一个唯一的Ed25519加密密钥，形成一个可验证的`<64-十六进制字符>@yggmail`地址，从而防止身份欺骗。\n\n主要功能包括聊天应用的自动配置、加密备份、精密的电源管理和自动启动功能。安全性内置其中，利用安卓密钥库、Yggdrasil的网络加密以及邮件端口的仅限本地访问。Tyr倡导规避审查、设计层面隐私（无元数据或服务器日志）和真正的去中心化，提供了一个弹性且私密的电子邮件解决方案。"
  },
  {
    "id": "46076642",
    "title": "SQLite as an Application File Format",
    "url": "https://sqlite.org/appfileformat.html",
    "summary": "The article \"SQLite As An Application File Format\" advocates for using SQLite database files to store application state, presenting them as a superior alternative to traditional application file formats. It first defines an \"application file format\" as one that stores multiple objects and their relationships (e.g., EPUB, DOC), distinguishing it from simpler \"file formats\" for single objects (e.g., JPEG).\n\nExisting application formats are categorized into:\n1.  **Fully Custom Formats:** Binary, opaque (e.g., PDF), requiring specialized tools.\n2.  **Pile-of-Files Formats:** Uses filesystem as key/value store (e.g., Git), accessible but inconvenient to move.\n3.  **Wrapped Pile-of-Files Formats:** Pile-of-files encapsulated in a single archive like ZIP (e.g., EPUB, ODT), a compromise between accessibility and single-file convenience.\n\nThe article proposes SQLite as a \"fourth category,\" offering compelling advantages:\n*   **Simplified Application Development:** Reduces code, leverages a robust, proven library.\n*   **Single-File Documents:** Preserves the \"document metaphor,\" easy to manage and share.\n*   **High-Level Query Language (SQL):** Simplifies data access, focusing on \"what\" information is needed.\n*   **Accessible Content:** Not an opaque blob; content is readable via common open-source tools, ensuring longevity.\n*   **Cross-Platform:** Portable across diverse systems and architectures.\n*   **Atomic Transactions:** Guarantees data integrity against crashes and power failures.\n*   **Incremental And Continuous Updates:** Only changed data is written, improving performance and preventing data loss.\n*   **Easily Extensible:** New features can be added by modifying the schema without breaking backward compatibility.\n*   **Performance:** Often faster than other formats, especially for application startup by selectively loading data.\n\nSQLite thus provides a versatile, structured, and reliable container for application data, surpassing the capabilities and conveniences of other approaches.",
    "chinese_title": "SQLite 作为应用程序文件格式",
    "chinese_summary": "文章《将 SQLite 用作应用程序文件格式》倡导使用 SQLite 数据库文件来存储应用程序状态，并将其视为传统应用程序文件格式的更优替代方案。文章首先将“应用程序文件格式”定义为存储多个对象及其关系（例如 EPUB、DOC）的格式，以区别于存储单个对象（例如 JPEG）的更简单的“文件格式”。\n\n现有应用程序文件格式分为：\n1.  **全定制格式：** 二进制、不透明（例如 PDF），需要专门工具。\n2.  **文件堆格式：** 使用文件系统作为键/值存储（例如 Git），可访问但移动不便。\n3.  **封装文件堆格式：** 将文件堆封装在单个归档文件（如 ZIP）中（例如 EPUB、ODT），是可访问性和单文件便利性之间的折衷。\n\n文章提出将 SQLite 作为“第四类”格式，提供以下引人注目的优势：\n*   **简化应用程序开发：** 减少代码量，利用健壮且经过验证的库。\n*   **单文件文档：** 保留“文档隐喻”，易于管理和共享。\n*   **高级查询语言 (SQL)：** 简化数据访问，侧重于“需要什么”信息。\n*   **可访问内容：** 不是不透明的二进制数据块；内容可通过常见的开源工具读取，确保长期可用性。\n*   **跨平台：** 跨不同系统和架构可移植。\n*   **原子事务：** 确保数据在崩溃和断电情况下的完整性。\n*   **增量和连续更新：** 仅写入更改的数据，提高性能并防止数据丢失。\n*   **易于扩展：** 可以通过修改模式添加新功能，而不会破坏向后兼容性。\n*   **性能：** 通常比其他格式更快，尤其是通过选择性加载数据来加速应用程序启动。\n\n因此，SQLite 为应用程序数据提供了一个多功能、结构化且可靠的容器，超越了其他方法的性能和便利性。"
  },
  {
    "id": "46077136",
    "title": "The Math of Why You Can't Focus at Work",
    "url": "https://justoffbyone.com/posts/math-of-why-you-cant-focus-at-work/",
    "summary": "The article, \"The Math of Why You Can't Focus at Work,\" presents a mathematical model to explain the pervasive decline in workplace focus, moving beyond anecdotal observations. It identifies three critical parameters that dictate daily productivity:\n\n1.  **λ (lambda):** The interruption rate (interruptions per hour), modeled as a Poisson process, indicating how often a worker's focus is broken.\n2.  **Δ (delta):** The recovery time (minutes) needed to regain concentration after each interruption, a period where true productivity is zero.\n3.  **θ (theta):** The focus threshold (minutes), the minimum uninterrupted block of time required for meaningful, deep work.\n\nThe interaction of these \"three knobs\" determines a day's \"capacity\" for real work, calculated by `C(θ) = Σ⌊di/θ⌋`. The floor function (`⌊x⌋`) in this formula reveals how fragmented work blocks, even if totaling significant time, drastically reduce actual productive output if they fall below the `θ` threshold.\n\nThe article visualizes typical \"lost days\" versus \"good days\" and simulates hundreds of workdays under varying conditions of λ, Δ, and θ to illustrate their impact on deep work blocks. It grounds this model in real-world research, citing studies that show alarmingly high interruption rates (e.g., every 2-3 minutes for heavy collaborators) and substantial recovery times (10-16 minutes) in modern jobs. The aim is to provide a quantifiable framework for understanding and addressing the challenge of maintaining focus.",
    "chinese_title": "你工作时无法专注的数学",
    "chinese_summary": "这篇题为《你为何无法在工作中专注的数学原理》的文章，提出了一个数学模型，旨在解释工作场所普遍存在的专注力下降现象，超越了轶事性的观察。它识别出决定日常生产力的三个关键参数：\n\n1.  **λ (lambda)：** 中断率（每小时中断次数），被建模为泊松过程，指示员工专注力被打断的频率。\n2.  **Δ (delta)：** 恢复时间（分钟），即每次中断后重新集中精力所需的时间，在此期间实际生产力为零。\n3.  **θ (theta)：** 专注阈值（分钟），即进行有意义的深度工作所需的最小不间断时间块。\n\n这“三个旋钮”的相互作用决定了一天进行实际工作的“容量”，计算公式为`C(θ) = Σ⌊di/θ⌋`。该公式中的向下取整函数（`⌊x⌋`）揭示了，即使零碎的工作时间块总计很长时间，如果它们低于`θ`阈值，仍会大幅降低实际生产力产出。\n\n文章通过可视化方式展示了典型的“浪费日”与“高效日”，并模拟了λ、Δ和θ在不同条件下的数百个工作日，以阐明它们对深度工作时间块的影响。该模型以现实世界的研究为基础，引用了显示现代工作中惊人高中断率（例如，对于高频合作者来说，每2-3分钟一次）和大量恢复时间（10-16分钟）的研究。其目的是提供一个可量化的框架，以理解并解决保持专注力的挑战。"
  },
  {
    "id": "46074111",
    "title": "Vsora Jotunn-8 5nm European inference chip",
    "url": "https://vsora.com/products/jotunn-8/",
    "summary": "The Vsora Jotunn-8 is a 5nm European inference chip touted as \"The Ultimate AI Chip\" and the \"World’s Most Efficient AI Inference Chip,\" aiming for groundbreaking efficiency (suggested by \"0 /tflops\"). Designed for modern data centers, it focuses on deploying trained AI models with blistering speed, minimal cost, and effortless scalability.\n\nKey features and benefits include:\n*   **Ultra-low Latency:** Critical for real-time applications like chatbots, fraud detection, and search.\n*   **Very High Throughput:** Essential for high-demand services such as recommendation engines and LLM APIs.\n*   **Cost-Efficient:** Significantly reduces cost per inference, vital for business viability at scale.\n*   **Power-Efficient:** Minimizes operational expenses and environmental impact.\n\nThe Jotunn-8 also emphasizes performance, memory, and flexibility, committing to sustainability. It claims to outperform the market, specifically mentioning Llama3 405B. A significant advantage is its architecture, which seamlessly integrates different AI model types—Reasoning Models, Generative AI (LLMs), and Agentic AI—providing near-theory performance for building more capable and reliable systems. This positions the Jotunn-8 as a new foundation for AI at scale, enabling maximum impact from AI investments with lower operational costs.",
    "chinese_title": "维索拉约顿-8 5纳米欧洲推理芯片",
    "chinese_summary": "Vsora Jotunn-8是一款5纳米欧洲推理芯片，被誉为“终极AI芯片”和“全球最高效AI推理芯片”，旨在实现突破性效率（以“0 /tflops”为佐证）。它专为现代数据中心设计，专注于以闪电般的速度、最低的成本和轻松的可扩展性部署训练好的AI模型。\n\n主要特性和优势包括：\n*   **超低延迟**：对聊天机器人、欺诈检测和搜索等实时应用至关重要。\n*   **超高吞吐量**：对推荐引擎和大型语言模型API等高需求服务必不可少。\n*   **高成本效益**：显著降低每次推理的成本，这对于规模化业务的生存能力至关重要。\n*   **高能效**：最大限度地降低运营开支和环境影响。\n\nJotunn-8还强调性能、内存和灵活性，并致力于可持续性。它声称性能超越市场同类产品，特别提到了Llama3 405B。一个显著优势是其架构能够无缝集成不同类型的AI模型——推理模型、生成式AI（大型语言模型）和智能体AI——为构建更强大、更可靠的系统提供接近理论的性能。这将Jotunn-8定位为规模化AI的新基石，使AI投资发挥最大效益，同时降低运营成本。"
  },
  {
    "id": "46086624",
    "title": "High air pollution could diminish exercise benefits by half – study",
    "url": "https://scienceclock.com/exercise-may-protect-less-when-air-pollution-is-high-study-finds/",
    "summary": "A new international study, co-led by University College London, analyzed health data from over 1.5 million adults across multiple countries, revealing that high air pollution significantly diminishes the health benefits of exercise.\n\nResearchers focused on fine particulate matter (PM2.5), which can cause inflammation and long-term damage in the body. While moderate to vigorous exercise for at least 2.5 hours weekly typically lowers the risk of death by 30%, this protective effect dropped to 12–15% in areas where the annual average PM2.5 exceeded 25 μg/m³. In more polluted regions (above 35 μg/m³, where 36% of the global population resides), the benefits weakened further, especially against cancer mortality.\n\nLead researcher Professor Po-Wen Ku highlighted that exercise remains beneficial even in polluted environments, but improved air quality could substantially enhance these gains. Co-author Professor Andrew Steptoe emphasized that toxic air blocks, but doesn't eliminate, exercise benefits, stressing the need to curb pollution for healthy aging.\n\nThe study, published in BMC Medicine, notes its data primarily comes from high-income countries, suggesting the impact could be more severe in low-income regions. Researchers advise checking air quality, choosing cleaner routes, or easing intensity on polluted days rather than discouraging outdoor exercise. The findings underscore that clean air and regular exercise are both critical for health, making pollution control essential for our well-being.",
    "chinese_title": "高空气污染可能使运动益处减半——研究",
    "chinese_summary": "一项由伦敦大学学院共同主导的最新国际研究，分析了来自多个国家超过150万成年人的健康数据，揭示了高空气污染显著削弱运动对健康的益处。\n\n研究人员关注细颗粒物（PM2.5），它可能在体内引起炎症和长期损害。虽然每周至少进行2.5小时的中等到剧烈运动通常可将死亡风险降低30%，但在年平均PM2.5超过25 μg/m³的地区，这种保护作用降至12–15%。在污染更严重的地区（PM2.5高于35 μg/m³，全球36%的人口居住在此类地区），这些益处进一步减弱，尤其是在降低癌症死亡率方面。\n\n首席研究员顾博文教授强调，即使在污染环境中，运动仍然有益，但改善空气质量可以显著增强这些益处。合著者安德鲁·斯蒂普托教授强调，有毒空气会阻碍但不会消除运动益处，并强调控制污染对健康老龄化的必要性。\n\n这项发表在《BMC医学》杂志上的研究指出，其数据主要来自高收入国家，这表明在低收入地区，影响可能更为严重。研究人员建议，与其劝阻户外运动，不如在污染日检查空气质量、选择更清洁的路线或降低运动强度。研究结果强调，清洁空气和定期运动对健康都至关重要，因此污染控制对我们的福祉至关重要。"
  },
  {
    "id": "46085585",
    "title": "Garfield's Proof of the Pythagorean Theorem",
    "url": "https://en.wikipedia.org/wiki/Garfield%27s_proof_of_the_Pythagorean_theorem",
    "summary": "James A. Garfield, the 20th U.S. President, is credited with an original proof of the Pythagorean theorem, which he published in 1876 while serving as a congressman. He holds the unique distinction of being the only U.S. President to contribute original mathematics. His proof, appearing in the New-England Journal of Education, is deemed \"very clever\" by historians and is recognized as the 231st proof in \"The Pythagorean Proposition,\" a compendium of 370 different proofs.\n\nGarfield's proof utilizes a trapezoid formed from three right-angled triangles. Starting with a right triangle ABC (sides a, b, hypotenuse c), he constructs a second congruent triangle BDE such that B is shared and AB is perpendicular to BD. Connecting points A and D creates a third triangle, ABD. These three triangles combine to form the trapezoid ACED.\n\nThe proof proceeds by calculating the area of this trapezoid in two ways. First, using the trapezoid area formula (height × average of parallel sides), the area is determined as 1/2 * (a + b) * (a + b), where CE = a+b is the height, and AC = a and DE = b are the parallel sides.\n\nSecond, the trapezoid's area is calculated as the sum of the areas of the three constituent triangles: triangle ACB (1/2 * ab), triangle BDE (1/2 * ab), and triangle ABD (1/2 * c * c, as it's an isosceles right triangle with legs c).\n\nEquating these two expressions for the area: 1/2 * (a + b)^2 = 1/2 * ab + 1/2 * c^2 + 1/2 * ab. Simplifying this equation yields a^2 + 2ab + b^2 = 2ab + c^2, which further simplifies to the Pythagorean theorem: a^2 + b^2 = c^2.",
    "chinese_title": "加菲尔德的勾股定理证明",
    "chinese_summary": "第20任美国总统詹姆斯·A·加菲尔德因其对勾股定理的原创证明而闻名，该证明于1876年他担任国会议员期间发表。他是唯一一位对原创数学做出贡献的美国总统，这一殊荣独一无二。他的证明发表在《新英格兰教育杂志》上，被历史学家誉为“非常巧妙”，并在收录了370种不同证明的《勾股定理命题》一书中被确认为第231个证明。\n\n加菲尔德的证明利用了一个由三个直角三角形构成的梯形。从一个直角三角形ABC（边长为a、b，斜边为c）开始，他构造了第二个全等三角形BDE，使B点共享，且AB垂直于BD。连接点A和点D形成第三个三角形ABD。这三个三角形组合起来形成了梯形ACED。\n\n该证明通过两种方式计算这个梯形的面积。首先，利用梯形面积公式（高 × 平行边平均值），面积被确定为 1/2 * (a + b) * (a + b)，其中CE = a+b 是高，AC = a 和 DE = b 是平行边。\n\n其次，梯形的面积被计算为三个组成三角形的面积之和：三角形ACB (1/2 * ab)，三角形BDE (1/2 * ab)，以及三角形ABD (1/2 * c * c，因为它是一个等腰直角三角形，两条直角边均为c)。\n\n将这两种面积表达式等同起来：1/2 * (a + b)^2 = 1/2 * ab + 1/2 * c^2 + 1/2 * ab。简化此方程得到 a^2 + 2ab + b^2 = 2ab + c^2，这进一步简化为勾股定理：a^2 + b^2 = c^2。"
  },
  {
    "id": "46083051",
    "title": "A first look at Django's new background tasks",
    "url": "https://roam.be/notes/2025/a-first-look-at-djangos-new-background-tasks/",
    "summary": "Django 6.0 introduces `django.tasks`, a built-in framework for background tasks. Its primary purpose is to provide a *common API* for task queue implementations, as it *does not include a worker mechanism* for task execution, requiring external infrastructure. Tasks are defined using the `@task` decorator and must be called via `.enqueue()`, preventing accidental in-process execution. The framework is minimalist, lacking built-in retries or backoffs, though custom logic can be implemented.\n\nThe article details building a custom database-backed task backend and a worker process, as Django 6.0 only provides `ImmediateBackend` (executes instantly) and `DummyBackend` (does nothing).\n\nThe custom backend uses `Task`, `Attempt`, and `Error` models to store task metadata, execution attempts, and exceptions. The `Task` model is refined with fields like `available_after` (for managing retries with backoff), `attempt_count`, and `worker_id` (for task claiming). The `DatabaseBackend` handles enqueueing tasks (creating `Task` records) and retrieving results. It supports configurable `max_attempts` and `backoff_factor` per queue.\n\nA custom `Worker` continuously polls for outstanding tasks. It uses an atomic transaction to `claim_first_available` tasks, ensuring uniqueness. The backend then `process_task` by executing the callable, recording the attempt, capturing any errors, and updating the task's status and `available_after` for subsequent retries. This setup demonstrates a complete, custom background task solution built atop `django.tasks`.",
    "chinese_title": "Django 新后台任务初探",
    "chinese_summary": "Django 6.0 引入了 `django.tasks`，一个内置的后台任务框架。其主要目的是为任务队列实现提供一个*通用API*，因为它*不包含用于任务执行的工作机制*，需要外部基础设施。任务使用 `@task` 装饰器定义，并且必须通过 `.enqueue()` 调用，以防止意外的进程内执行。该框架是极简主义的，缺少内置的重试或指数退避机制，但可以实现自定义逻辑。\n\n本文详细介绍了如何构建一个自定义的数据库支持的任务后端和一个工作进程，因为 Django 6.0 仅提供 `ImmediateBackend`（立即执行）和 `DummyBackend`（不执行任何操作）。\n\n自定义后端使用 `Task`、`Attempt` 和 `Error` 模型来存储任务元数据、执行尝试和异常。`Task` 模型通过 `available_after`（用于管理带退避的重试）、`attempt_count` 和 `worker_id`（用于任务认领）等字段进行了完善。`DatabaseBackend` 负责任务入队（创建 `Task` 记录）和结果检索。它支持每个队列可配置的 `max_attempts` 和 `backoff_factor`。\n\n一个自定义的 `Worker` 持续轮询待处理的任务。它使用原子事务来 `claim_first_available` 任务，确保唯一性。后端随后通过执行可调用对象、记录尝试、捕获任何错误，并更新任务状态和 `available_after` 以进行后续重试来 `process_task`。这种设置展示了一个基于 `django.tasks` 构建的完整自定义后台任务解决方案。"
  },
  {
    "id": "46079785",
    "title": "Don't tug on that, you never know what it might be attached to (2016)",
    "url": "https://blog.plover.com/2016/07/01/#tmpdir",
    "summary": "The author details a debugging adventure when `emacsclient` suddenly stopped working, reporting it \"can't find socket.\" The core problem was a mismatch: `emacsclient` was looking for the Unix-domain socket in `/mnt/tmp/emacs2017/server`, while Emacs was creating it in `/tmp/emacs2017/server`.\n\nInvestigation revealed the `TMPDIR` environment variable, set to `/mnt/tmp` by a system script, was the cause. `emacsclient` honored this setting, but Emacs *also* honored `TMPDIR` when started directly, leading to confusion. The discrepancy only occurred when Emacs was launched indirectly via a custom Perl script (`git-re-edit`).\n\nFurther isolation proved that Perl itself was stripping the `TMPDIR` environment variable from its process, a behavior not seen with other variables or on different systems. The article concludes by noting this isn't a bug, but a subtle security measure by the dynamic loader to prevent attacks where `TMPDIR` could be manipulated to trick privileged processes into writing to unintended locations.\n\nTwo workarounds were implemented: configuring Emacs to use a TCP socket, or explicitly setting an `EMACS_SERVER_SOCKET` environment variable and modifying the `also` script to pass the correct Unix-domain socket path to `emacsclient`.",
    "chinese_title": "别拽那个，谁知道它连着什么呢？(2016)",
    "chinese_summary": "作者详细描述了一次调试经历，当时 `emacsclient` 突然停止工作，并报告“找不到套接字”。核心问题是一个不匹配：`emacsclient` 在 `/mnt/tmp/emacs2017/server` 中查找 Unix 域套接字，而 Emacs 则在 `/tmp/emacs2017/server` 中创建它。\n\n调查显示，一个系统脚本将 `TMPDIR` 环境变量设置为 `/mnt/tmp` 是导致问题的原因。`emacsclient` 遵循此设置，但 Emacs 在直接启动时*也*遵循 `TMPDIR`，这导致了混淆。这种差异只在 Emacs 通过一个自定义 Perl 脚本（`git-re-edit`）间接启动时发生。\n\n进一步的排查证明 Perl 本身从其进程中剥离了 `TMPDIR` 环境变量，这种行为在其他变量或不同系统上并未出现。文章最后指出，这并非一个 bug，而是动态加载器采取的一种微妙的安全措施，旨在防止 `TMPDIR` 被操纵以诱骗特权进程写入非预期位置的攻击。\n\n实施了两种变通方案：配置 Emacs 使用 TCP 套接字，或者显式设置 `EMACS_SERVER_SOCKET` 环境变量并修改 `also` 脚本，以便将正确的 Unix 域套接字路径传递给 `emacsclient`。"
  },
  {
    "id": "46088236",
    "title": "Major AI conference flooded with peer reviews written by AI",
    "url": "https://www.nature.com/articles/d41586-025-03506-6",
    "summary": "A recent analysis by Pangram Labs has revealed a significant presence of AI-generated content in the peer review process for the International Conference on Learning Representations (ICLR) 2026. Concerns initially surfaced among academics, including Graham Neubig, who received \"very verbose\" and vague feedback with hallucinated citations, prompting him to seek tools to detect AI use.\n\nMax Spero's Pangram Labs subsequently scanned all 19,490 submitted studies and 75,800 peer reviews. Their findings were startling: approximately 21% of ICLR peer reviews were fully AI-generated, and over half contained signs of AI use. The analysis also identified 1% (199) of manuscripts as entirely AI-generated, with 9% containing more than 50% AI-generated text.\n\nThese results confirmed suspicions for many researchers, such as Desmond Elliott, whose paper received a low rating from a fully AI-generated review that misunderstood the content and cited incorrect numerical data, causing deep frustration. ICLR senior programme chair Bharath Hariharan noted this is the first time the conference has encountered such widespread AI use. In response, organizers plan to implement automated tools to enforce policies against AI use in submissions and reviews, aiming to restore trust in the assessment process.",
    "chinese_title": "大型人工智能会议充斥着由AI撰写的同行评审",
    "chinese_summary": "Pangram Labs公司最近的一项分析显示，2026年国际学习表征会议（ICLR）的同行评审过程中存在大量AI生成内容。最初，学术界人士（包括Graham Neubig在内）对此表示担忧，Graham Neubig曾收到“非常冗长”且模糊、带有虚构引用的反馈，这促使他寻求检测AI使用的工具。\n\nMax Spero旗下的Pangram Labs随后扫描了所有19,490份提交的研究论文和75,800份同行评审。他们的发现令人震惊：大约21%的ICLR同行评审完全由AI生成，超过一半的评审报告包含AI使用迹象。该分析还发现1%（199篇）的稿件完全由AI生成，另有9%的稿件包含超过50%的AI生成文本。\n\n这些结果证实了许多研究人员的怀疑，例如Desmond Elliott的论文就收到了一份完全由AI生成的评审报告的低分，该报告误解了内容并引用了错误的数值数据，这给他带来了极大的沮丧。ICLR高级项目主席Bharath Hariharan指出，这是该会议首次遇到如此大规模的AI使用情况。作为回应，组织者计划实施自动化工具，以强制执行投稿和评审中禁止使用AI的政策，旨在恢复对评估过程的信任。"
  },
  {
    "id": "46075305",
    "title": "China's BEV trucks and the end of diesel's dominance",
    "url": "https://cleantechnica.com/2025/11/26/chinas-bev-trucks-and-the-end-of-diesels-dominance/",
    "summary": "Chinese battery-electric (BEV) heavy trucks are rapidly emerging as a disruptive force in the global freight industry, offering significantly lower prices and purpose-built designs. Models with 400-600 kWh batteries are available in China for €58,000-€85,000. Although they require an estimated €20,000-€40,000 in upgrades for Western certifications and driver comfort, their landed price of €80,000-€120,000 for short-haul duty is substantially cheaper than Western BEVs, which often start near €250,000.\n\nThis cost advantage is critical, as most freight movements in Europe are short-haul (under 250 km), a segment where these affordable Chinese BEVs are an ideal fit. China's heavy truck market is already undergoing a dramatic shift: BEVs climbed from 13% of new sales in 2024 to 22% in early 2025, while diesel's share plummeted to near 50%. Conversely, hydrogen fuel cell trucks remain under 1% and are declining due to cost and operational challenges.\n\nWestern OEMs, many of whom initially adapted diesel frames for electrification, face intense pressure. Their legacy designs and cost structures struggle against China's volume-driven, purpose-built electric platforms. The article warns that the freight decarbonization transition is accelerating faster than expected, driven by the economic logic of cheaper BEVs. The challenge for Western operators and policymakers is to adapt to this new cost curve and integrate or respond to China's established electric truck ecosystem.",
    "chinese_title": "中国纯电动卡车和柴油主导地位的终结",
    "chinese_summary": "中国电动重卡（BEV）正迅速崛起，成为全球货运业的一股颠覆性力量，其价格显著更低，且采用专用设计。在中国，配备400-600千瓦时电池的车型售价为5.8万至8.5万欧元。尽管它们需要约2万至4万欧元的升级以符合西方认证和驾驶员舒适度要求，但其短途运输到岸价为8万至12万欧元，远低于通常起价约25万欧元的西方电动重卡。\n\n这种成本优势至关重要，因为欧洲的大部分货运（250公里以下）都是短途运输，而这些经济实惠的中国电动重卡非常适合这一细分市场。中国的重卡市场已发生剧变：电动重卡在新车销售中的占比从2024年的13%攀升至2025年初的22%，而柴油车的份额则暴跌至接近50%。相反，氢燃料电池卡车的占比仍低于1%，并因成本和运营挑战而呈下降趋势。\n\n西方原始设备制造商（OEM）面临巨大压力，其中许多企业最初只是将柴油车底盘改装用于电动化。他们的传统设计和成本结构难以与中国批量生产的专用电动平台竞争。文章警告称，在更便宜的电动重卡所带来的经济逻辑推动下，货运脱碳转型正以超出预期的速度加速。对西方运营商和政策制定者而言，挑战在于适应这种新的成本曲线，并整合或应对中国已建立的电动卡车生态系统。"
  },
  {
    "id": "46084122",
    "title": "A triangle whose interior angles sum to zero",
    "url": "https://www.johndcook.com/blog/2025/11/28/tricusp-triangle/",
    "summary": "The article contrasts triangle properties in spherical and hyperbolic geometries.\n\nIn **spherical geometry**, the sum of a triangle's interior angles is always greater than π (180°). The area of such a triangle on a sphere of radius 1 is its \"excess\" (E), defined as the angle sum minus π. An example is a triangle with three right angles.\n\nIn **hyperbolic geometry**, the sum of a triangle's interior angles is always less than π. In a space with curvature −1, the area is its \"defect\" (D), calculated as π minus the angle sum. Both geometries are locally Euclidean, meaning small triangles in either space have angle sums close to π.\n\nThe article then describes a unique hyperbolic triangle whose interior angles sum to zero. This \"improper\" triangle, formed by three hyperbolic lines (half-circles) intersecting at ideal points on the real axis, has a maximum possible area of π. Though its perimeter is infinite, its area is finite. The radii of the constituent semicircles do not alter its area. While strictly outside the hyperbolic plane, such a triangle can be approached arbitrarily closely within it.",
    "chinese_title": "内角和为零的三角形",
    "chinese_summary": "文章对比了球面几何和双曲几何中的三角形性质。\n\n在**球面几何**中，三角形的内角和总是大于π (180°)。在半径为1的球体上，这种三角形的面积是其“过量”(E)，定义为内角和减去π。一个例子是具有三个直角的三角形。\n\n在**双曲几何**中，三角形的内角和总是小于π。在曲率为-1的空间中，其面积是其“亏格”(D)，计算方法是π减去内角和。两种几何都是局部欧几里得的，这意味着在这两种空间中，小三角形的内角和都接近于π。\n\n文章随后描述了一个独特的双曲三角形，其内角和为零。这个“非正常”三角形，由三条双曲线（半圆）在实轴上的理想点相交形成，其最大可能面积为π。尽管其周长是无限的，但面积是有限的。构成该三角形的半圆半径不会改变其面积。虽然它严格来说位于双曲平面之外，但可以在双曲平面内任意接近它。"
  },
  {
    "id": "46082204",
    "title": "The original ABC language, Python's predecessor (1991)",
    "url": "https://github.com/gvanrossum/abc-unix",
    "summary": "This article details the ABC programming language, identified as Python's most direct predecessor. Guido van Rossum, Python's creator, worked on ABC from 1983-1986 and is listed among its authors.\n\nThe ABC source code, mostly from 1991, was obtained from cwi.nl (the abc-unix tarball) and also resides on Luciano Ramalho's GitHub, with hopes to unify the two versions. Building the language currently requires a 32-bit system, with future plans to update it for 64-bit compatibility.\n\nABC lacks an explicit open-source license, though it carries a copyright by Stichting Mathematisch Centrum (1988-2011). Guido van Rossum intends to negotiate for an MIT license with Steven Pemberton. Key authors include Eddy Boeve, Lambert Meertens, Steven Pemberton, and Guido van Rossum. References include \"The ABC Programmer's Handbook\" (1990) and articles by Steven Pemberton and Lambert Meertens exploring ABC's design and its origins.",
    "chinese_title": "最初的ABC语言，Python 的前身 (1991年)",
    "chinese_summary": "本文详细介绍了ABC编程语言，该语言被认为是Python最直接的前身。Python的创建者Guido van Rossum于1983年至1986年期间参与了ABC的开发工作，并被列为其作者之一。\n\nABC的源代码，大部分源于1991年，从cwi.nl（abc-unix tarball）获取，也存放在Luciano Ramalho的GitHub上，希望能统一这两个版本。目前编译该语言需要32位系统，未来计划将其更新以兼容64位系统。\n\nABC没有明确的开源许可证，但它带有Stichting Mathematisch Centrum（1988-2011）的版权。Guido van Rossum打算与Steven Pemberton协商获取MIT许可证。主要作者包括Eddy Boeve、Lambert Meertens、Steven Pemberton和Guido van Rossum。参考文献包括《The ABC Programmer's Handbook》（1990年）以及Steven Pemberton和Lambert Meertens探讨ABC设计及其起源的文章。"
  },
  {
    "id": "46080424",
    "title": "Apple and Intel Rumored to Partner on Mac Chips",
    "url": "https://www.macrumors.com/2025/11/28/intel-rumored-to-supply-new-mac-chip/",
    "summary": "Apple is rumored to rekindle its partnership with Intel, but in a new, limited capacity, according to supply chain analyst Ming-Chi Kuo. While all current Macs use Apple's custom-designed M-series chips, Intel is expected to begin manufacturing Apple's lowest-end M-series chips (potentially M6 or M7) as early as mid-2027.\n\nIntel would utilize its 18A process, a sub-2nm advanced node manufactured in North America, to produce these chips for future MacBook Air, iPad Air, and iPad Pro models. This differs significantly from their previous collaboration, as Intel would only be assisting with the manufacturing of Apple-designed Arm-based chips, rather than designing x86 chips.\n\nTSMC would continue to be the primary supplier for the majority of Apple's M-series chips. Kuo suggests this move would help Apple diversify its supply chain and align with \"Made in USA\" initiatives, referencing the Trump administration's preferences.\n\nApple began transitioning away from Intel processors in Macs in 2020, with its M-series chips offering industry-leading performance per watt. macOS Tahoe is noted as the final major release supporting Intel-based Macs.",
    "chinese_title": "苹果英特尔据传将合作Mac芯片",
    "chinese_summary": "供应链分析师郭明錤表示，据传苹果将与英特尔重燃合作，但合作模式将是全新的且有限的。尽管目前所有Mac都使用苹果定制设计的M系列芯片，但英特尔预计最早将于2027年中期开始生产苹果的最低端M系列芯片（可能是M6或M7）。\n\n英特尔将利用其18A工艺（一种在北美制造的、低于2纳米的先进节点），为未来的MacBook Air、iPad Air和iPad Pro型号生产这些芯片。这与他们之前的合作模式有显著不同，因为英特尔将只协助生产苹果设计的基于Arm架构的芯片，而非设计x86芯片。\n\n台积电仍将是苹果大部分M系列芯片的主要供应商。郭明錤认为，此举将有助于苹果分散其供应链，并与“美国制造”倡议保持一致，他提到了特朗普政府的偏好。\n\n苹果于2020年开始在Mac上逐步淘汰英特尔处理器，其M系列芯片提供了行业领先的每瓦性能。macOS Tahoe被认为是支持基于英特尔Mac的最后一个主要版本。"
  },
  {
    "id": "46079460",
    "title": "Swedish publishers file police report against Meta's Zuckerberg for fraud",
    "url": "https://www.sverigesradio.se/artikel/swedish-publishers-file-police-report-against-metas-zuckerberg-for-fraud",
    "summary": "A Swedish publisher's association has filed a police report against Meta founder Mark Zuckerberg. The report accuses Zuckerberg of fraud.",
    "chinese_title": "瑞典出版商对Meta扎克伯格报案，指控其欺诈。",
    "chinese_summary": "瑞典出版商协会已向警方报案，指控Meta创始人马克·扎克伯格犯有欺诈罪。"
  },
  {
    "id": "46078407",
    "title": "A trillion dollars (potentially) wasted on gen-AI",
    "url": "https://garymarcus.substack.com/p/a-trillion-dollars-is-a-terrible",
    "summary": "In his article \"A trillion dollars (potentially) wasted on gen-AI,\" Gary Marcus argues that the massive investments, possibly exceeding a trillion dollars, poured into generative AI over the past year and a half may largely be wasted due to fundamental limitations of current AI models.\n\nMarcus contends that while large language models (LLMs) are impressive in their ability to generate text and code, they lack true understanding, common sense, and the ability to reason reliably. He highlights several key issues:\n*   **Factuality and Hallucinations:** LLMs frequently \"hallucinate\" false information, making them unreliable for tasks requiring accuracy.\n*   **Brittle Reasoning:** They struggle with complex reasoning, often failing on basic logic or arithmetic that humans find trivial.\n*   **Lack of Causal Understanding:** Current models are pattern matchers, not causal reasoners, limiting their ability to truly understand the world or make informed decisions.\n*   **Cost and Scalability:** Training and running these models are incredibly expensive, and their continued scaling primarily yields more fluent language, not necessarily more intelligence or reliability.\n\nMarcus suggests that the industry is caught in a hype cycle, throwing vast sums at a technology that, in its current form, is a \"house of cards.\" He advocates for a shift in research focus towards building hybrid AI systems that integrate symbolic reasoning and causal understanding with neural networks to achieve more robust, reliable, and genuinely intelligent AI. Without this fundamental shift, he warns, much of the invested capital will yield diminishing returns, failing to deliver on the promise of truly transformative AI.",
    "chinese_title": "万亿美元或将浪费在生成式AI上",
    "chinese_summary": "在Gary Marcus的文章《一万亿美元（可能）浪费在生成式AI上》中，他认为在过去一年半中，投入到生成式AI领域的巨额投资，可能超过一万亿美元，但由于当前AI模型的基本局限性，这些投资可能大半付诸东流。\n\nMarcus指出，虽然大型语言模型（LLMs）在生成文本和代码方面表现出色，但它们缺乏真正的理解、常识和可靠的推理能力。他强调了几个关键问题：\n*   **事实性和幻觉：**LLMs经常“幻觉”出错误信息，使其在需要准确性的任务中不可靠。\n*   **脆弱的推理能力：**它们难以进行复杂的推理，在人类看来微不足道的基本逻辑或算术问题上常常出错。\n*   **缺乏因果理解：**当前模型是模式匹配器，而非因果推理器，这限制了它们真正理解世界或做出明智决策的能力。\n*   **成本和可扩展性：**训练和运行这些模型的成本极其高昂，而持续的规模扩展主要带来更流畅的语言，不一定带来更高的智能或可靠性。\n\nMarcus认为，该行业陷入了一个炒作周期，将巨额资金投入到一项在其当前形式下如同“纸牌屋”的技术中。他倡导研究重点的转变，转向构建混合AI系统，将符号推理和因果理解与神经网络相结合，以实现更强大、更可靠、真正智能的AI。他警告说，如果没有这种根本性的转变，大部分投资资本将产生递减回报，无法兑现真正变革性AI的承诺。"
  },
  {
    "id": "46079073",
    "title": "Language is primarily a tool for communication rather than thought (2024) [pdf]",
    "url": "https://gwern.net/doc/psychology/linguistics/2024-fedorenko.pdf",
    "summary": "The provided content is raw PDF binary data and cannot be directly read or summarized as text. Therefore, a summary of the article's internal points is not possible.\n\nHowever, based on the title, \"Language is primarily a tool for communication rather than thought (2024)\", the article would explore the fundamental purpose of language. It likely argues that language's main function is to facilitate interaction, information exchange, and social cohesion among individuals, emphasizing its external, communicative role. This perspective would contrast with the view that language is chiefly a medium for internal cognitive processes, reasoning, or the formation of thought. Published in 2024, it would offer a contemporary examination of this long-standing philosophical and linguistic debate.",
    "chinese_title": "语言主要是交流工具而非思想 (2024) [pdf]",
    "chinese_summary": "所提供的内容是原始的PDF二进制数据，无法直接读取或以文本形式进行总结。因此，无法对文章的内部要点进行概述。\n\n然而，根据标题“语言主要是一种交流工具而非思维工具 (2024)”，这篇文章将探讨语言的根本目的。它可能会论证，语言的主要功能是促进个体间的互动、信息交流和社会凝聚，强调其外部的、交际性的作用。这种观点将与认为语言主要是内部认知过程、推理或思想形成的媒介的看法形成对比。该文于2024年发表，将对这一长期存在的哲学和语言学辩论提供一次当代审视。"
  },
  {
    "id": "46082291",
    "title": "Electron vs. Tauri",
    "url": "https://www.dolthub.com/blog/2025-11-13-electron-vs-tauri/",
    "summary": "The Dolt Workbench, an open-source SQL workbench, was initially built with Electron, a popular framework for converting web apps to desktop applications, leveraging its Next.js frontend and GraphQL layer. However, Electron's drawbacks led the team to explore Tauri, a newer alternative for web-to-desktop.\n\nA key difference lies in Next.js support. Electron's integration with Next.js is challenging due to server-side features, relying on the now unmaintained Nextron project. Tauri, in contrast, offers simpler integration by leveraging Next.js's static-site generation.\n\nThe most significant distinction is the webview. Electron bundles a full Chromium browser engine, ensuring consistent UI but leading to considerable bloat (e.g., 150MB for simple apps). Tauri uses the system's native webview via the WRY library, making applications far more lightweight, with compatibility issues proving to be rare.\n\nFor the backend \"main\" process, Electron utilizes Node.js, appealing to web developers. Tauri, however, uses Rust. While less accessible initially, Tauri provides robust JavaScript APIs for interacting with the Rust layer, and its IPC abstraction is considered cleaner.\n\nElectron's bundled Node.js runtime also simplifies running Node.js sidecars, like the Workbench's GraphQL server. Tauri requires compiling such sidecars into binaries, though it offers guides for this common use case. Electron's full Node.js runtime also contributes to its larger app sizes compared to Tauri.\n\nDespite Tauri's advantages in reducing bloat and natural integration, a full migration is currently on hold. Limitations include Tauri's lack of support for Windows .appx and .msix bundles, and issues with macOS universal binary codesigning. These \"annoyances,\" rather than hard blockers, mean the team will revisit the migration once these issues are resolved or Electron's problems become more critical. Overall, Tauri is impressive for its lightweight nature and integration.",
    "chinese_title": "Electron 对比 Tauri",
    "chinese_summary": "Dolt Workbench是一个开源的SQL工作台，最初是使用Electron构建的。Electron是一个流行的框架，用于将Web应用转换为桌面应用，它利用了Next.js前端和GraphQL层。然而，Electron的缺点促使团队探索Tauri，一个更新的Web转桌面替代方案。\n\n一个关键区别在于对Next.js的支持。由于服务器端特性，Electron与Next.js的集成具有挑战性，它依赖于现在已不再维护的Nextron项目。相比之下，Tauri通过利用Next.js的静态站点生成功能，提供了更简单的集成。\n\n最显著的区别在于网页视图（webview）。Electron捆绑了完整的Chromium浏览器引擎，这确保了UI的一致性，但导致了相当大的臃肿（例如，简单应用就达到150MB）。Tauri通过WRY库使用系统的原生网页视图，使得应用程序轻量得多，兼容性问题也鲜少出现。\n\n对于后端“主”进程，Electron利用Node.js，这对Web开发者很有吸引力。然而，Tauri使用Rust。虽然初始上手难度较高，但Tauri提供了强大的JavaScript API，用于与Rust层交互，并且其IPC（进程间通信）抽象被认为更简洁。\n\nElectron捆绑的Node.js运行时也简化了运行Node.js“边车”（sidecar），例如Workbench的GraphQL服务器。Tauri则需要将这些边车编译成二进制文件，尽管它为此常见用例提供了指导。Electron完整的Node.js运行时也导致了它比Tauri更大的应用体积。\n\n尽管Tauri在减少臃肿和自然集成方面有优势，但全面迁移目前已暂停。限制包括Tauri不支持Windows .appx和.msix捆绑包，以及macOS通用二进制文件代码签名问题。这些是“烦恼”，而非硬性阻碍，意味着团队将在这些问题解决后，或者当Electron的问题变得更严重时，重新考虑迁移。总的来说，Tauri因其轻量级特性和集成能力而令人印象深刻。"
  },
  {
    "id": "46075628",
    "title": "Tiger Style: Coding philosophy (2024)",
    "url": "https://tigerstyle.dev/",
    "summary": "\"Tiger Style\" (Version 0.1-dev) is a coding philosophy inspired by TigerBeetle, focusing on **safety**, **performance**, and **developer experience** to build robust, efficient, and maintainable software through disciplined engineering.\n\n**Safety** is foundational, ensuring reliable code through predictable execution. Practices include simple, explicit control flow (e.g., short functions under 70 lines, fixed limits, centralized logic), precise memory/type handling (e.g., `u32`, static allocation, minimal variable scope), and rigorous error management (assertions, fail-fast, handling all errors, treating compiler warnings as errors, avoiding implicit defaults).\n\n**Performance** is addressed early, using 'napkin math' for estimations, batch operations, and optimizing resource use (Network > Disk > Memory > CPU). It stresses writing predictable code for efficient CPU caching and reducing over-reliance on compiler optimizations.\n\n**Developer Experience** aims for a maintainable and collaborative codebase. Key practices include clear, consistent naming (descriptive, full words, units/qualifiers), documenting rationale, logical code organization (simple interfaces, minimal variable scope, in-place object construction), and strict consistency (avoiding duplicates, passing large objects by reference, clean buffer allocation). It also emphasizes avoiding off-by-one errors, consistent formatting (indentation, line limits, clear blocks), and minimizing/standardizing external dependencies and tooling.\n\nAn **Addendum** highlights a \"zero technical debt\" policy, advocating for doing things right initially and proactive problem-solving to ensure sustainable progress and quality. 'Napkin math' is reinforced for early performance insights.",
    "chinese_title": "虎式：编程理念 (2024)",
    "chinese_summary": "\"虎式风格\" (版本 0.1-dev) 是一种受 TigerBeetle 启发的编程哲学，侧重于**安全性**、**性能**和**开发者体验**，旨在通过严谨的工程实践，构建健壮、高效且可维护的软件。\n\n**安全性**是基础，通过可预测的执行确保代码的可靠性。其实践包括简单、显式的控制流（例如，短函数（不超过70行）、固定限制、集中式逻辑）、精确的内存/类型处理（例如，`u32`、静态分配、最小变量作用域），以及严格的错误管理（断言、快速失败、处理所有错误、将编译器警告视为错误、避免隐式默认值）。\n\n**性能**应尽早解决，采用“餐巾纸计算”进行估算、批量操作，并优化资源使用（网络 > 磁盘 > 内存 > CPU）。它强调编写可预测的代码，以实现高效的CPU缓存，并减少对编译器优化的过度依赖。\n\n**开发者体验**旨在构建可维护且协作友好的代码库。主要实践包括清晰、一致的命名（描述性、完整单词、带单位/修饰符）、记录设计原理、逻辑化的代码组织（简单接口、最小变量作用域、原地对象构造），以及严格的一致性（避免重复、通过引用传递大对象、整洁的缓冲区分配）。它还强调避免“差一错误”、一致的格式（缩进、行限制、清晰的代码块），并最小化/标准化外部依赖和工具。\n\n一则**附录**强调了“零技术债”策略，主张一开始就把事情做好，并主动解决问题，以确保可持续的进展和质量。“餐巾纸计算”被再次强调，以提供早期性能洞察。"
  },
  {
    "id": "46073817",
    "title": "A programmer-friendly I/O abstraction over io_uring and kqueue (2022)",
    "url": "https://tigerbeetle.com/blog/2022-11-23-a-friendly-abstraction-over-iouring-and-kqueue/",
    "summary": "The article explores building a programmer-friendly I/O abstraction over high-performance asynchronous APIs like Linux's `io_uring` and macOS/FreeBSD's `kqueue`. It begins by noting the overhead of classical blocking and non-blocking I/O, where frequent system calls and context switches become bottlenecks as hardware speeds increase.\n\n`io_uring` and `kqueue` address this by allowing batching of I/O requests and providing completion events, reducing syscall overhead. `io_uring` uniquely allows the kernel to perform I/O directly with user-provided buffers, amortizing system call costs even further than `kqueue`'s readiness model.\n\nA direct implementation, like the provided `io_uring` TCP echo server, intertwines I/O and business logic, becoming unmanageable in large applications. The proposed solution is a \"central I/O dispatch\" abstraction. This layer unifies `io_uring` and `kqueue` by providing a high-level API to schedule I/O and attach callbacks, abstracting OS-specific differences and batching requests.\n\nIt constructs a traditional event loop using `flush` and `run_for_ns` functions, leveraging the kernel's `user_data` field to associate completion events with their respective callbacks. An internal overflow queue handles requests exceeding the kernel's batch size. This model resembles `libuv` (Node.js) and is the basis for TigerBeetle's I/O library (adopted by Bun). The article contrasts `io_uring`'s kernel-driven I/O with `kqueue`'s readiness model, which requires userland I/O calls. It briefly mentions Windows' `IOCP` and explores single-threaded event loops (beneficial for determinism, like in TigerBeetle) versus multi-threaded architectures for varied workloads. The authors suggest open-sourcing their Zig-based, cross-platform I/O library.",
    "chinese_title": "io_uring 和 kqueue 之上的程序员友好型 I/O 抽象 (2022)",
    "chinese_summary": "本文探讨了如何在Linux的`io_uring`和macOS/FreeBSD的`kqueue`等高性能异步API之上构建一个程序员友好的I/O抽象层。文章首先指出，在硬件速度不断提升的背景下，传统的阻塞和非阻塞I/O中频繁的系统调用和上下文切换成为瓶颈。\n\n`io_uring`和`kqueue`通过允许批量处理I/O请求并提供完成事件来解决这一问题，从而减少系统调用开销。`io_uring`的独特之处在于它允许内核直接使用用户提供的缓冲区执行I/O，相比`kqueue`的就绪模型，进一步分摊了系统调用成本。\n\n直接实现，例如所提供的`io_uring` TCP回显服务器，会将I/O和业务逻辑交织在一起，在大型应用程序中变得难以管理。提出的解决方案是一个“中央I/O调度”抽象。该层通过提供高级API来调度I/O并附加回调函数，抽象化操作系统特定的差异并批量处理请求，从而统一了`io_uring`和`kqueue`。\n\n它使用`flush`和`run_for_ns`函数构建了一个传统的事件循环，利用内核的`user_data`字段将完成事件与其各自的回调函数关联起来。一个内部溢出队列处理超出内核批处理大小的请求。该模型类似于`libuv` (Node.js)，并且是TigerBeetle的I/O库（被Bun采用）的基础。文章对比了`io_uring`的内核驱动I/O与`kqueue`的就绪模型，后者需要用户态I/O调用。它简要提到了Windows的`IOCP`，并探讨了单线程事件循环（有利于确定性，如TigerBeetle中）与多线程架构在不同工作负载下的应用。作者建议开源他们基于Zig的跨平台I/O库。"
  },
  {
    "id": "46081704",
    "title": "Effective harnesses for long-running agents",
    "url": "https://www.anthropic.com/engineering/effective-harnesses-for-long-running-agents",
    "summary": "Long-running AI agents face a core challenge in maintaining consistent progress across discrete context windows due to memory limitations. This leads to agents attempting too much at once, leaving half-finished work, prematurely declaring tasks complete, and insufficient testing.\n\nAnthropic’s solution for the Claude Agent SDK involves a two-fold harness: an **Initializer Agent** and a **Coding Agent**. The Initializer Agent sets up the initial environment, creating a detailed `feature_list.json` file that outlines all requirements (initially marked \"failing\") to prevent \"one-shot\" attempts and premature completion. It also establishes an `init.sh` script for server management and an initial Git commit.\n\nThe **Coding Agent** then makes incremental progress, focusing on one feature per session. Critical to its success is leaving clear artifacts: committing code to Git with descriptive messages and maintaining a `claude-progress.txt` file. This allows subsequent agents to quickly understand the project state. Robust, end-to-end testing is enforced by prompting agents to use browser automation tools (like Puppeteer) to verify features as a human user would.\n\nEach coding session begins with steps to \"get its bearings\"—reading Git logs, progress files, and the feature list, and running basic end-to-end tests via `init.sh` to ensure a stable environment before implementing new features. This structured approach ensures a clean, verifiable codebase, enabling consistent, incremental progress. Future work aims to explore multi-agent architectures and generalize these findings to other domains beyond web development.",
    "chinese_title": "长期运行智能体的高效框架",
    "chinese_summary": "长期运行的AI智能体由于内存限制，在跨离散上下文窗口保持持续进展方面面临一个核心挑战。这导致智能体一次性尝试过多，留下半成品工作，过早宣布任务完成，以及测试不足。\n\nAnthropic为Claude Agent SDK提供的解决方案包含一个双重机制：一个**初始化智能体**和一个**编码智能体**。初始化智能体负责设置初始环境，创建一个详细的`feature_list.json`文件，该文件概述了所有需求（初始标记为“失败”），以防止“一蹴而就”的尝试和过早完成。它还建立了一个用于服务器管理的`init.sh`脚本和一个初始Git提交。\n\n**编码智能体**随后进行增量式进展，每次会话集中精力于一个特性。对其成功至关重要的是留下清晰的工件：将代码提交到Git并附带描述性消息，并维护一个`claude-progress.txt`文件。这使得后续智能体能够快速了解项目状态。通过提示智能体使用浏览器自动化工具（例如Puppeteer）以像人类用户一样验证功能，从而强制执行强大的端到端测试。\n\n每次编码会话都从“定位”步骤开始——阅读Git日志、进度文件和特性列表，并通过`init.sh`运行基本的端到端测试，以确保在实现新特性之前有一个稳定的环境。这种结构化方法确保了代码库的整洁和可验证性，从而实现持续、增量的进展。未来的工作旨在探索多智能体架构，并将这些发现推广到网络开发之外的其他领域。"
  },
  {
    "id": "46073279",
    "title": "FileZilla Pro \"Perpetual License\" – A Warning to All Users",
    "url": "https://github.com/x011/FileZilla-Pro-Download",
    "summary": "This article serves as a stark warning regarding FileZilla Pro's \"perpetual license.\" The author, who purchased a lifetime license for a specific version, was unable to reinstall the software after an operating system reinstallation.\n\nFileZilla Pro support acknowledged the author's legal right to use their purchased version but outright refused to provide the installer, citing \"security reasons\" for not offering older versions. The author contends that this denial effectively renders the \"perpetual license\" worthless, making it impossible to access the legally owned software without purchasing a new license, likely under their current subscription model. This means users lose access if they reinstall their OS or lose the original installer.\n\nThe author highlights FileZilla's awareness that customers legally own these old versions, yet they deliberately withhold the necessary installers. Potential buyers are warned that they risk being denied the ability to reinstall a product they legally own.\n\nThe article also clarifies that FileZilla is not affiliated with Mozilla, a common misconception. The author believes FileZilla's refusal is driven by financial motives rather than security concerns, pointing to support's immediate offer of a discount on a newer version as evidence.",
    "chinese_title": "FileZilla Pro “永久许可证” – 致所有用户的警告",
    "chinese_summary": "本文旨在对FileZilla Pro的“永久许可”发出严厉警告。作者曾为特定版本购买终身许可，但在重装操作系统后无法重新安装该软件。\n\nFileZilla Pro支持部门承认作者有权合法使用其购买的版本，但明确拒绝提供安装程序，理由是出于“安全原因”不提供旧版本。作者认为，这种拒绝实际上使“永久许可”变得毫无价值，导致用户必须购买新许可（很可能是在其当前的订阅模式下）才能访问其合法拥有的软件。这意味着如果用户重装操作系统或丢失原始安装程序，他们就会失去访问权限。\n\n作者强调，FileZilla清楚客户合法拥有这些旧版本，然而他们却故意不提供必要的安装程序。潜在买家应注意，他们面临着无法重新安装其合法拥有产品的风险。\n\n文章还澄清，FileZilla与Mozilla没有关联，这是一个常见的误解。作者认为FileZilla的拒绝是出于经济动机而非安全考虑，并指出支持部门立即提供新版本折扣作为证据。"
  },
  {
    "id": "46082296",
    "title": "Airbus A320 Fly by wire corrupted by radiation in flight",
    "url": "https://viewfromthewing.com/airbus-a320s-could-be-temporarily-grounded-worldwide-for-software-update-after-faulty-jetblue-computer-triggered-sudden-uncommanded-descent/",
    "summary": "Aviation watchdog JonNYC initially reported a potential worldwide grounding or mandatory software update for Airbus A320 family aircraft, a claim later confirmed by Airbus. This development stems from a JetBlue A320 flight on October 30th, which \"unexpectedly pitched downward without pilot input\" en route from Cancun to Newark, resulting in 10-15 passenger hospitalizations and a diversion to Tampa.\n\nThe National Transportation Safety Board (NTSB) identified a malfunction in the Thales ELAC 2 computer, responsible for interpreting pilot commands for flight control, as the likely cause, occurring during an ELAC switch change. Crucially, the aircraft's redundant ELAC system, designed to seamlessly take over if one unit fails, did not function as intended.\n\nJonNYC confirmed the solution as a mandatory software update for the ELAC units, estimated to take a few hours per aircraft. Airbus later issued an Alert Operators Transmission (AOT), stating that \"intense solar radiation may corrupt data critical to the functioning of flight controls.\" They are urging operators to implement \"immediate precautionary action\" via software and/or hardware protection, acknowledging that these measures will cause \"operational disruptions.\"\n\nAffecting approximately 10,000 A320-family aircraft globally, this issue follows previous FAA directives in 2018 regarding ELAC unit upgrades due to angle of attack concerns. While flight cancellations are anticipated, they are expected to be staggered to minimize passenger disruption. Specific details on timing are yet to be released.",
    "chinese_title": "空客 A320 飞行中电传操纵系统受辐射损坏",
    "chinese_summary": "航空博主JonNYC最初报道称空客A320系列飞机可能在全球范围内停飞或强制进行软件更新，这一说法后来得到空客证实。这一进展源于10月30日一架捷蓝航空A320航班，该航班在从坎昆飞往纽瓦克的途中“在没有飞行员输入的情况下意外俯冲”，导致10-15名乘客住院，并被迫改道飞往坦帕。\n\n美国国家运输安全委员会（NTSB）将泰雷兹ELAC 2计算机的故障认定为可能原因，该计算机负责解释飞行员的指令以控制飞行，故障发生在ELAC开关转换期间。至关重要的是，飞机冗余的ELAC系统，本应在一个单元失效时无缝接管，但并未按预期运行。\n\nJonNYC证实解决方案是为ELAC单元进行强制性软件更新，预计每架飞机需要几个小时。空客随后发布了“运营商警示通告”（AOT），指出“强烈的太阳辐射可能会损坏对飞行控制功能至关重要的数据”。他们敦促运营商通过软件和/或硬件保护实施“立即预防措施”，并承认这些措施将导致“运营中断”。\n\n这个问题影响全球约10,000架A320系列飞机，此前美国联邦航空管理局（FAA）曾于2018年就迎角问题发布了关于ELAC单元升级的指令。尽管预计会有航班取消，但这些取消预计将错峰进行，以最大程度地减少对乘客的影响。具体的时间细节尚未公布。"
  },
  {
    "id": "46075616",
    "title": "Beads – A memory upgrade for your coding agent",
    "url": "https://github.com/steveyegge/beads",
    "summary": "Beads (bd) is a lightweight, graph-based issue tracker designed to provide a \"memory upgrade\" for AI coding agents, addressing their amnesia and enhancing their ability to handle long-horizon, complex tasks. Agents use Beads to file, manage, and link issues, ensuring proper task sequencing and preventing lost work or disorganized plans.\n\nA key update in v0.20.1 introduces hash-based IDs (e.g., bd-a1b2) instead of sequential numbers. This eliminates merge conflicts and collision issues, enabling reliable multi-worker, multi-branch, and multi-agent workflows crucial for collaborative development.\n\nBeads operates as a unique distributed database, leveraging Git as its backend. Issue data is stored in Git-versioned JSONL files (`.beads/beads.jsonl`), while each machine maintains a fast, local SQLite cache. This design allows agents across different machines to query and update a seemingly shared database without requiring a central server or complex configuration.\n\nHumans initiate Beads with `bd init` and instruct their agents to use the tool, but agents primarily manage the issue tracking process. Features include dependency tracking (four types), automatic ready work detection, agent-friendly JSON output, a full audit trail, and \"memory decay\" for old issues. A \"stealth mode\" allows individual developers to use Beads privately without modifying the main repository. Though in active development (alpha status), Beads aims to provide agents with unprecedented long-term planning capabilities and improved project auditability.",
    "chinese_title": "珠子 — 你的编程智能体的记忆升级",
    "chinese_summary": "Beads (bd) 是一种轻量级、基于图的问题追踪器，旨在为AI编程代理提供“记忆升级”，解决它们的健忘症，并增强它们处理长期、复杂任务的能力。代理使用Beads来提交、管理和链接问题，确保任务的正确排序，并防止工作丢失或计划混乱。\n\nv0.20.1版本中的一个关键更新是引入了基于哈希的ID（例如bd-a1b2）来取代顺序数字。这消除了合并冲突和碰撞问题，实现了可靠的多工作者、多分支和多代理工作流，这对协作开发至关重要。\n\nBeads作为一个独特的分布式数据库运行，利用Git作为其后端。问题数据存储在Git版本化的JSONL文件（`.beads/beads.jsonl`）中，而每台机器都维护一个快速的本地SQLite缓存。这种设计允许不同机器上的代理查询和更新一个看似共享的数据库，而无需中央服务器或复杂的配置。\n\n人类使用`bd init`初始化Beads并指示其代理使用该工具，但代理主要管理问题追踪过程。其功能包括依赖追踪（四种类型）、自动就绪工作检测、代理友好的JSON输出、完整的审计追踪以及针对旧问题的“记忆衰减”。“隐身模式”允许个体开发者私下使用Beads，而无需修改主仓库。尽管Beads正处于积极开发阶段（alpha状态），但它旨在为代理提供前所未有的长期规划能力和改进的项目可审计性。"
  },
  {
    "id": "46085344",
    "title": "The 'S&P 493' reveals a different U.S. economy",
    "url": "https://www.msn.com/en-us/money/markets/the-s-p-493-reveals-a-very-different-us-economy/ar-AA1R1VUJ",
    "summary": "I apologize, but I cannot provide a summary of the article titled \"The 'S&P 493' reveals a different U.S. economy\" from MSN. The content of the article was not provided in your request.\n\nTo summarize an article effectively, I need access to its full text to understand its main points, key arguments, data, and conclusions.\n\nIf you can provide the full text of the article, I would be happy to summarize it for you within your specified word limit.\n\nHowever, based solely on the title, it strongly suggests an analysis differentiating the performance and health of the broader U.S. economy (represented by 493 companies) from the outsized influence of a few major companies (the remaining 7 in the S&P 500). Such an article would likely explore themes like market concentration, the distribution of economic growth, the performance of smaller or more traditional sectors, and perhaps implications for investors or policymakers.",
    "chinese_title": "‘标普493’揭示不同的美国经济",
    "chinese_summary": "抱歉，我无法为您总结MSN上题为“‘标普493’揭示了不一样的美国经济”的文章。您没有提供该文章的内容。\n\n为了有效地总结一篇文章，我需要获取其全文，以理解其主要观点、关键论证、数据和结论。\n\n如果您能提供文章的全文，我将很乐意在您指定的字数限制内为您总结。\n\n然而，仅凭标题来看，它强烈暗示了一项分析，旨在区分更广泛的美国经济（由493家公司代表）的表现和健康状况与少数几家大公司（标普500指数中剩余的7家）的巨大影响力之间的差异。这样的文章可能会探讨诸如市场集中度、经济增长的分布、中小型或更传统行业的表现，以及对投资者或政策制定者可能产生的影响等主题。"
  },
  {
    "id": "46087596",
    "title": "DNS LOC Record (2014)",
    "url": "https://blog.cloudflare.com/the-weird-and-wonderful-world-of-dns-loc-records/",
    "summary": "CloudFlare, leveraging its custom Go-based DNS server RRDNS, discovered a bug related to the obscure DNS LOC (location) record type. Despite handling millions of DNS records, only 743 were LOCs, yet one customer reported theirs wasn't being served.\n\nInvestigation revealed RRDNS had the infrastructure to receive and respond with LOC data, but a crucial component was missing: the code to parse the human-readable textual LOC record format (e.g., \"33 40 31 N 106 28 29 W 10m\") into its internal binary, \"on-the-wire\" format.\n\nBoth formats are detailed in RFC 1876 (1996). The textual format specifies latitude, longitude, altitude, and optional size/precision, with defaults for omitted values. The binary format is a fixed 16-byte structure. Latitude, longitude, and altitude are 32-bit unsigned integers representing thousandths of a second of arc or centimeters from a base altitude. Uniquely, the 8-bit size and precision values use a \"base and power of ten\" encoding (e.g., 0x15 = 1e5), allowing a vast range of values from 1cm to 90,000km to be expressed compactly and readably in hex.\n\nThe author implemented a parser for the textual LOC record, fixing the bug. RRDNS now correctly serves LOC records, ensuring all specified location data is properly propagated across the DNS system.",
    "chinese_title": "DNS LOC 记录 (2014)",
    "chinese_summary": "CloudFlare 利用其定制的基于 Go 语言的 DNS 服务器 RRDNS，发现了一个与鲜为人知的 DNS LOC（位置）记录类型相关的错误。尽管处理着数百万条 DNS 记录，其中只有 743 条是 LOC 记录，但有一位客户报告说他们的 LOC 记录未能被正确解析。\n\n调查显示，RRDNS 具备接收和响应 LOC 数据的基础设施，但缺少一个关键组件：将人类可读的文本 LOC 记录格式（例如，“33 40 31 N 106 28 29 W 10m”）解析成其内部二进制“线上传输”格式的代码。\n\n这两种格式都在 RFC 1876 (1996) 中有详细说明。文本格式规定了纬度、经度、高度以及可选的大小/精度，对省略的值有默认设定。二进制格式是一个固定的 16 字节结构。纬度、经度、高度是 32 位无符号整数，表示弧秒的千分之一或从基准高度算起的厘米数。独特之处在于，8 位的尺寸和精度值采用“底数和十的幂”编码（例如，0x15 = 1e5），使得从 1 厘米到 90,000 公里的广泛值范围能够以紧凑且易读的十六进制形式表示。\n\n作者为文本 LOC 记录实现了一个解析器，从而修复了这个错误。RRDNS 现在能够正确解析 LOC 记录，确保所有指定的地理位置数据在 DNS 系统中正确传播。"
  },
  {
    "id": "46080579",
    "title": "C++ Web Server on my custom hobby OS",
    "url": "https://oshub.org/projects/retros-32/posts/getting-a-webserver-running",
    "summary": "joexbayer successfully achieved a major milestone: a C++ web server running on their custom hobby operating system, RetrOS-32. After a hiatus, extensive debugging fixed critical issues, including a broken terminal buffer and an E1000 network driver bug, finally getting the basic TCP stack fully functional. Performance was subsequently improved by handling bursts of packets and correctly processing browser-generated RST packets.\n\nThe web server's architecture consists of several custom-built components. An HTTP Engine, adapted from the author's `c-web-modules` project, handles request parsing. This is integrated into a Web Engine that provides modern C++ routing capabilities, allowing paths and methods to be mapped to lambda function handlers. A FileRepository was then added to serve static HTML files with caching.\n\nThe system's stack flows from the Browser to the userspace Web Server (incorporating WebEngine, HTTPEngine, and FileRepository), which relies on the kernel's robust network stack (TCP/UDP, IP, ARP, DHCP, DNS, and E1000 Ethernet driver). Future plans for the project include implementing graceful server shutdown and developing a web browser within the OS. The project emphasizes a from-scratch implementation using C++.",
    "chinese_title": "我的自制操作系统上的C++ Web服务器",
    "chinese_summary": "joexbayer成功实现了一个重要里程碑：在其自定义的业余操作系统RetrOS-32上运行了一个C++ Web服务器。经过一段时间的沉寂，广泛的调试修复了关键问题，包括损坏的终端缓冲区和E1000网卡驱动程序错误，最终使基本的TCP协议栈完全正常工作。随后，通过处理突发数据包和正确处理浏览器生成的RST数据包，性能得到了提升。\n\n该Web服务器的架构由几个自定义构建的组件组成。一个HTTP引擎，改编自作者的`c-web-modules`项目，负责处理请求解析。它被集成到一个Web引擎中，该引擎提供了现代C++路由功能，允许将路径和方法映射到lambda函数处理程序。随后添加了一个文件仓库（FileRepository）来提供带缓存的静态HTML文件。\n\n系统的堆栈从浏览器流向用户空间的Web服务器（包含WebEngine、HTTPEngine和FileRepository），该服务器依赖于内核健壮的网络协议栈（TCP/UDP、IP、ARP、DHCP、DNS和E1000以太网驱动程序）。该项目未来的计划包括实现优雅的服务器关闭和在操作系统内部开发一个Web浏览器。该项目强调使用C++从头开始实现。"
  },
  {
    "id": "46080218",
    "title": "Lobsters Interview",
    "url": "https://susam.net/my-lobsters-interview.html",
    "summary": "Susam Pal's \"Lobsters Interview\" offers a comprehensive look into his computing philosophy, tools, and interests. Edited and rearranged by Alex from the Lobsters community, the discussion highlights Pal's deep engagement with technology and mathematics.\n\nPal is an extensive user of Common Lisp for personal projects and Emacs Lisp for automating tasks, alongside Python, Go, Rust, and single-file HTML/JavaScript tools. His computing journey began with Logo as a child, leading to the discovery of Lisp in 2007 (CLISP, now SBCL) and subsequently Emacs via SLIME. Mathematics has been a lifelong passion, with number theory, for example, being sparked by studying the RSA cryptosystem.\n\nHe defines \"computing for fun\" as exploration, asking \"what happens if,\" and sharing the outcomes, evident in projects like `devil-mode` or small games. His diverse interests are often interconnected; tools like MathB, TeXMe, and Muboard evolved from a desire to share mathematical notes. Beyond these, he explores IRC clients, ray tracing, and recreational programming.\n\nFor Pal, \"computing\" broadly encompasses programming, using, understanding systems (even building a CPU), and delving into the abstract mathematical foundations, viewing computer science as discrete mathematics in action. He prioritizes the problem domain over specific tools, selecting the most appropriate language or framework for a given task. His rate of creating new Emacs functions has naturally decreased, attributing this to a stable, satisfactory setup and less time for constant tinkering.",
    "chinese_title": "龙虾采访",
    "chinese_summary": "Susam Pal的《Lobsters访谈》全面深入地探讨了他的计算哲学、工具和兴趣。这篇访谈由Lobsters社区的Alex编辑和重新整理，凸显了Pal对技术和数学的深度投入。\n\nPal广泛使用Common Lisp进行个人项目，并使用Emacs Lisp自动化任务，同时还涉猎Python、Go、Rust以及单文件HTML/JavaScript工具。他的计算之旅始于童年时期的Logo语言，2007年发现了Lisp（当时是CLISP，现在是SBCL），之后通过SLIME接触到Emacs。数学是他一生的热情，例如，他对数论的兴趣便是由研究RSA密码系统所激发的。\n\n他将“娱乐性计算”定义为探索、提问“会发生什么”，并分享结果，这在他的`devil-mode`或小型游戏等项目中显而易见。他多样的兴趣往往相互关联；MathB、TeXMe和Muboard等工具都是源于分享数学笔记的愿望而演变出来的。除此之外，他还探索IRC客户端、光线追踪和趣味编程。\n\n对Pal而言，“计算”广义上包括编程、使用、理解系统（甚至构建CPU），以及深入研究抽象的数学基础，他将计算机科学视为离散数学的实际应用。他优先考虑问题领域而非特定工具，为特定任务选择最合适的语言或框架。他创建新Emacs功能的频率自然有所下降，他将此归因于拥有一个稳定且令人满意的设置，以及较少的时间进行持续的修修补补。"
  },
  {
    "id": "46077106",
    "title": "A Repository with 44 Years of Unix Evolution",
    "url": "https://www.spinellis.gr/pubs/conf/2015-MSR-Unix-History/html/Spi15c.html",
    "summary": "Diomidis Spinellis has created a comprehensive Git repository documenting 44 years of Unix operating system evolution, from its 1972 inception as a 5,000-line kernel to a 26 million-line system in 2015. Hosted on GitHub, this 1GB repository contains 659,000 commits and 2,306 merges, identifying 850 contributors from Bell Labs, Berkeley, and the FreeBSD Project.\n\nThe repository was synthesized using custom software, integrating 24 historical snapshots (Research Unix, BSD, 386BSD), two legacy version control systems (CSRG SCCS, FreeBSD 1 CVS), and the modern FreeBSD Git repository. Primary research was extensively used to attribute authorship and establish merge relationships between these diverse sources.\n\nA key innovation is the meticulous preservation of commit history across snapshots, enabling `git blame` to trace code provenance accurately through the entire 44-year period. This allows researchers to identify the origin of code lines, revealing that modern FreeBSD versions still contain significant portions from earlier releases like BSD 4.3 and even 7th Edition Unix from 1979.\n\nThis unique dataset serves as an invaluable resource for empirical research in software engineering, information systems, and software archaeology, providing unprecedented insight into the evolution of one of the most influential operating systems.",
    "chinese_title": "44年Unix演进存储库",
    "chinese_summary": "迪奥米迪斯·斯皮内利斯（Diomidis Spinellis）创建了一个综合性的Git存储库，记录了Unix操作系统44年的演进历程，从其1972年作为一个拥有5,000行代码的内核诞生，到2015年发展成为一个拥有2,600万行代码的系统。该存储库托管于GitHub上，容量为1GB，包含了659,000次提交和2,306次合并，并识别出850位来自贝尔实验室、伯克利和FreeBSD项目的贡献者。\n\n该存储库是利用定制软件合成的，整合了24个历史快照（包括Research Unix、BSD、386BSD）、两个旧版版本控制系统（CSRG SCCS、FreeBSD 1 CVS）以及现代的FreeBSD Git存储库。大量的原始研究被用于归属作者身份，并建立这些不同来源之间的合并关系。\n\n一项关键创新在于精心保留了跨快照的提交历史，使得`git blame`工具能够准确追溯贯穿整个44年的代码来源。这使得研究人员能够识别代码行的起源，揭示出现代的FreeBSD版本仍然包含相当一部分代码，这些代码来自早期的版本，如BSD 4.3，甚至追溯到1979年的第七版Unix。\n\n这一独特的数据集为软件工程、信息系统和软件考古学领域的实证研究提供了宝贵的资源，为理解这一最具影响力的操作系统之一的演进提供了前所未有的深入见解。"
  },
  {
    "id": "46077885",
    "title": "Switzerland: Data Protection Officers Impose Broad Cloud Ban for Authorities",
    "url": "https://www.heise.de/en/news/Switzerland-Data-Protection-Officers-Impose-Broad-Cloud-Ban-for-Authorities-11093477.html",
    "summary": "Swiss data protection officers (DPOs) have issued a sweeping recommendation advising federal, cantonal, and communal authorities to halt the use of cloud services from providers based in countries deemed to have \"insufficient data protection.\" This significant directive primarily targets US-based cloud providers, driven by profound concerns over potential data access by foreign intelligence services, such as through the US CLOUD Act, even when data is physically stored in Switzerland.\n\nThe Federal Data Protection and Information Commissioner (FDPIC), alongside cantonal and communal DPOs, emphasizes that Swiss authorities, as data controllers, remain solely responsible for the protection of personal data. They assert that there is currently no sufficient legal basis to guarantee data protection when public bodies utilize such cloud services. This broad recommendation expands on prior warnings, including the FDPIC's 2021 stance on Microsoft 365.\n\nThe ban impacts a wide array of public services, from schools and healthcare to critical infrastructure. Authorities are urged to review their current cloud usage, cease onboarding new services from non-compliant providers, and migrate existing data to secure alternatives. The DPOs advocate for the adoption of local, European, or Swiss cloud solutions that fully comply with Swiss data protection laws, promoting digital sovereignty. Affected public entities are expected to implement these changes and complete their data migration by the end of 2025.",
    "chinese_title": "瑞士：数据保护官员对当局实施全面的云服务禁令",
    "chinese_summary": "瑞士数据保护官（DPOs）发布了一项全面建议，建议联邦、州和市镇当局停止使用来自被认为“数据保护不足”国家的服务提供商的云服务。这项重要指令主要针对美国的云服务提供商，其驱动因素是对外国情报机构可能获取数据的深切担忧，例如通过美国《云法案》，即使数据实际存储在瑞士。\n\n联邦数据保护和信息专员（FDPIC）联同州和市镇的数据保护官强调，瑞士当局作为数据控制者，对个人数据的保护负有全权责任。他们声称，目前没有充分的法律依据来保证公共机构在使用此类云服务时的数据保护。这项广泛建议扩展了此前的警告，包括FDPIC在2021年对Microsoft 365的立场。\n\n这项禁令影响了广泛的公共服务，从学校、医疗保健到关键基础设施。当局被敦促审查其当前的云服务使用情况，停止从不合规提供商处引入新服务，并将现有数据迁移到安全的替代方案。数据保护官们倡导采用完全符合瑞士数据保护法律的本地、欧洲或瑞士云解决方案，以促进数字主权。受影响的公共实体预计将在2025年底前实施这些更改并完成数据迁移。"
  },
  {
    "id": "46087549",
    "title": "Hachi: An Image Search Engine",
    "url": "https://eagledot.xyz/hachi.md.html",
    "summary": "Hachi is an ambitious project for a fully self-hosted, end-to-end image search engine, with future plans to support video, text, and audio. It aims to solve the challenge of searching across an individual's growing and distributed personal data, critiquing existing search engines for their unidirectional information flow, poor handling of partial queries, and privacy-invasive features.\n\nThe project is designed to offer a user-centric interface, enabling recursive query refinement by exposing multiple data attributes. Its core philosophies include minimalism (minimal external dependencies), hackability (easy modification using Python/Nim), and experimentation (fusing deterministic metadata with semantic ML attributes). Hachi prioritizes speed and avoids data duplication, instead employing a meta-data indexing engine (written in Nim) coupled with vector-search capabilities for semantic queries.\n\nCurrently focused on images, Hachi implements robust face recognition, generating embeddings for nearest neighbor searches. The Nim-based meta-index is a single-threaded, column-oriented database. Future goals include improving string querying, adding SIMD optimizations, dynamic schema updates, and achieving distributed queries across clusters of low-power devices, all while maintaining its principled, performant approach.",
    "chinese_title": "Hachi: 图片搜索引擎",
    "chinese_summary": "Hachi 是一个雄心勃勃的项目，旨在构建一个完全自托管、端到端的图像搜索引擎，未来计划支持视频、文本和音频。它旨在解决个人不断增长且分布式的个人数据搜索难题，并批判现有搜索引擎的单向信息流、对部分查询处理不佳以及侵犯隐私的特性。\n\n该项目旨在提供一个以用户为中心的界面，通过公开多个数据属性来实现递归式查询优化。其核心理念包括极简主义（最少的外部依赖）、可修改性（易于使用 Python/Nim 进行修改）和实验性（融合确定性元数据与语义机器学习属性）。Hachi 优先考虑速度并避免数据重复，而是采用一个元数据索引引擎（用 Nim 编写），并结合向量搜索能力来实现语义查询。\n\n目前 Hachi 专注于图像，实现了强大的面部识别功能，生成嵌入向量用于最近邻搜索。基于 Nim 的元索引是一个单线程、面向列的数据库。未来的目标包括改进字符串查询、添加 SIMD 优化、动态模式更新以及在低功耗设备集群上实现分布式查询，同时保持其原则性、高性能的方法。"
  },
  {
    "id": "46080769",
    "title": "JSON Schema Demystified: Dialects, Vocabularies and Metaschemas",
    "url": "https://www.iankduncan.com/engineering/2025-11-24-json-schema-demystified/",
    "summary": "JSON Schema describes the shape and constraints of JSON data. At its core, a **schema** is a JSON document that defines rules for other JSON documents, using keywords like \"type\" and \"properties\".\n\nThe structure of these schemas is itself described by a **metaschema**. A metaschema is effectively a \"schema of schemas,\" defining what keywords are allowed, their values, and how they function. It ensures your schemas are well-formed and provides the formal specification for tools. The relationship is data validated by schema, and schema validated by metaschema.\n\nAs JSON Schema evolved, different versions emerged. A **dialect** is a specific version or \"flavor\" of JSON Schema (e.g., Draft 2020-12), identified by a URI in the `$schema` keyword. Each dialect has its own defining metaschema and set of behaviors.\n\nStarting with Draft 2019-09, JSON Schema introduced **vocabularies**. A vocabulary is a named, modular collection of related keywords (e.g., core, validation, applicator, metadata). Instead of monolithic metaschemas, dialects are composed of various vocabularies. This modularity enables powerful extensibility: developers can define their own vocabularies with custom keywords (like in OpenAPI or for domain-specific annotations), which can be explicitly declared and understood by compliant tools.\n\nIn summary, your data is validated by your schema. Your schema adheres to a dialect, which is defined by a metaschema, and uses keywords organized into vocabularies. This system allows for clarity, evolution, and powerful extensibility.",
    "chinese_title": "JSON Schema 揭秘：方言、词汇与元模式",
    "chinese_summary": "JSON Schema描述了JSON数据的结构和约束。其核心是，**schema**（模式）是一个JSON文档，它使用“type”和“properties”等关键字为其他JSON文档定义规则。\n\n这些schema的结构本身由一个**metaschema**（元模式）描述。metaschema实际上是“schema的schema”，它定义了允许使用哪些关键字、它们的取值以及它们如何起作用。它确保你的schema格式良好，并为工具提供正式规范。这种关系是：数据由schema验证，而schema由metaschema验证。\n\n随着JSON Schema的演进，出现了不同的版本。**dialect**（方言）是JSON Schema的一个特定版本或“风味”（例如，Draft 2020-12），通过`$schema`关键字中的URI进行标识。每个方言都有其自己的定义metaschema和一套行为。\n\n从Draft 2019-09开始，JSON Schema引入了**vocabularies**（词汇表）。vocabulary是相关关键字的命名、模块化集合（例如，核心、验证、应用器、元数据）。方言不再由单一的metaschema构成，而是由各种vocabulary组合而成。这种模块化实现了强大的可扩展性：开发人员可以定义自己的vocabulary，包含自定义关键字（例如在OpenAPI中或用于领域特定的注解），这些关键字可以被兼容工具明确声明和理解。\n\n总而言之，你的数据由你的schema验证。你的schema遵循一个方言，该方言由metaschema定义，并使用组织成vocabulary的关键字。这个系统实现了清晰性、演进性和强大的可扩展性。"
  },
  {
    "id": "46075746",
    "title": "How to use Linux vsock for fast VM communication",
    "url": "https://popovicu.com/posts/how-to-use-linux-vsock-for-fast-vm-communication/",
    "summary": "This article demonstrates how to use Linux `vsock` for efficient communication between a VM and its host, bypassing traditional TCP/IP networking. `vsock` provides a socket-like API but uses a specialized addressing scheme based on Context IDs (CID) and port numbers, designed specifically for virtual environments.\n\nThe author illustrates this by implementing a gRPC service for integer addition. The server runs inside a QEMU-booted Debian VM, while the client runs on the host machine. The project is built using Bazel, generating statically linked C++ binaries for both client and server.\n\nKey to the setup is the `vsock` address format: `vsock:CID:PORT`. For the experiment, the VM server listens on `vsock:3:9999`, where `3` is the guest VM's Context ID. The host client then connects to this same `vsock:3:9999` to send RPC requests.\n\nThe QEMU VM is configured with `-device vhost-vsock-pci,guest-cid=3`, which exposes `vsock` networking hardware to the guest with the specified CID. After booting the VM with the server binary as its `init` process, the host client successfully invokes the addition RPC, confirming direct communication.\n\nThis method enables structured RPCs in isolated VM environments, supporting diverse operating systems and gRPC's multi-language capabilities. The primary benefit is increased efficiency due to the elimination of network virtualization overhead.",
    "chinese_title": "如何使用 Linux vsock 实现虚拟机快速通信",
    "chinese_summary": "本文演示了如何使用 Linux `vsock` 在虚拟机 (VM) 及其宿主机之间实现高效通信，绕过传统的 TCP/IP 网络。`vsock` 提供了一个类似套接字的 API，但它采用了一种基于上下文 ID (CID) 和端口号的专门寻址方案，专为虚拟环境设计。\n\n作者通过实现一个用于整数加法的 gRPC 服务来阐释这一点。服务器运行在通过 QEMU 启动的 Debian 虚拟机内，而客户端则运行在宿主机上。该项目使用 Bazel 构建，为客户端和服务器生成了静态链接的 C++ 二进制文件。\n\n设置的关键是 `vsock` 地址格式：`vsock:CID:PORT`。在实验中，虚拟机服务器监听 `vsock:3:9999`，其中 `3` 是访客虚拟机的上下文 ID。宿主机客户端随后连接到相同的 `vsock:3:9999` 以发送 RPC 请求。\n\nQEMU 虚拟机配置了 `-device vhost-vsock-pci,guest-cid=3`，这会将带有指定 CID 的 `vsock` 网络硬件暴露给访客。在将服务器二进制文件作为 `init` 进程启动虚拟机后，宿主机客户端成功调用了加法 RPC，证实了直接通信。\n\n这种方法使得在隔离的虚拟机环境中实现结构化 RPC 成为可能，支持多种操作系统和 gRPC 的多语言能力。主要优点是由于消除了网络虚拟化开销而提高了效率。"
  },
  {
    "id": "46087022",
    "title": "The CRDT Dictionary: A Field Guide to Conflict-Free Replicated Data Types",
    "url": "https://www.iankduncan.com/engineering/2025-11-27-crdt-dictionary/",
    "summary": "The article serves as a field guide to Conflict-free Replicated Data Types (CRDTs), prompted by the author's renewed curiosity about their application in distributed systems. CRDTs offer a solution for handling concurrent writes without coordination or data loss, crucial for systems like the former Riak database or offline-first applications, unlike consensus-based approaches (Paxos/Raft) which can block on partitions, or Last-Write-Wins which can lose data.\n\nThe core \"trick\" of CRDTs is that their merge operations are commutative, associative, and idempotent, ensuring deterministic convergence across replicas regardless of the order or number of times states are merged. This concept is often linked to lattices, where data states form a partial order and updates only move \"upward.\"\n\nCRDTs are broadly categorized into state-based (CvRDTs), which send full states, and operation-based (CmRDTs), which send operations. The guide focuses on state-based examples:\n*   **G-Counter:** An increment-only counter where each replica tracks its own count, merged by taking the `max` of each component. Cannot decrement.\n*   **PN-Counter:** Extends G-Counter with separate G-Counters for positive and negative increments, allowing both operations.\n*   **G-Set:** An add-only set, merged using set `union`. Cannot remove elements.\n*   **2P-Set:** A Two-Phase Set comprising 'added' and 'removed' G-Sets. Allows removal but prevents re-addition of once-removed elements.\n*   **LWW-Element-Set:** Uses timestamps to determine the \"last write\" for both additions and removals, allowing elements to be re-added if their add timestamp is newer than their remove timestamp.\n\nThese examples illustrate how CRDTs are designed to guarantee eventual consistency and data integrity without complex distributed coordination.",
    "chinese_title": "CRDT 词典：无冲突复制数据类型实战指南",
    "chinese_summary": "本文作为无冲突复制数据类型（CRDTs）的实战指南，源于作者对CRDTs在分布式系统应用中重新燃起的好奇心。CRDTs提供了一种在没有协调或数据丢失的情况下处理并发写入的解决方案，这对于前Riak数据库或离线优先应用等系统至关重要，它不同于基于共识的方法（Paxos/Raft）可能在分区时阻塞，也不同于最后写入胜出（Last-Write-Wins）可能导致数据丢失。\n\nCRDTs的核心“诀窍”在于其合并操作是可交换的、结合的、幂等的，这确保了无论状态合并的顺序或次数如何，副本之间都能确定性地收敛。这个概念通常与格（lattices）相关联，其中数据状态形成偏序，并且更新只“向上”移动。\n\nCRDTs大致分为基于状态的（CvRDTs，发送完整状态）和基于操作的（CmRDTs，发送操作）。本指南侧重于基于状态的示例：\n*   **G-Counter：** 一种只增计数器，每个副本跟踪自己的计数，通过取每个组件的最大值进行合并。无法递减。\n*   **PN-Counter：** 在G-Counter的基础上扩展，为正增量和负增量分别使用独立的G-Counter，从而允许两种操作。\n*   **G-Set：** 一种只增集合，使用集合“并集”进行合并。无法移除元素。\n*   **2P-Set：** 一种两阶段集合，由“已添加”和“已移除”两个G-Set组成。允许移除，但防止重新添加已移除的元素。\n*   **LWW-Element-Set：** 使用时间戳来确定添加和移除的“最后写入”，如果元素的添加时间戳比移除时间戳新，则允许重新添加该元素。\n\n这些示例说明了CRDTs是如何设计来保证最终一致性和数据完整性，而无需复杂的分布式协调。"
  },
  {
    "id": "46075178",
    "title": "The VPN panic is only getting started",
    "url": "https://www.theverge.com/tech/827435/uk-vpn-restrictions-ban-online-safety-act",
    "summary": "The UK's Online Safety Act (OSA), which introduced stringent online age checks in July 2025 to restrict access to \"harmful materials,\" has been significantly undermined by the widespread use of VPNs. These virtual private networks allow users to bypass age verification by spoofing their IP addresses, leading to massive spikes in VPN sign-ups among UK residents.\n\nAuthorities are increasingly concerned, with Children’s Commissioner Rachel de Souza calling VPNs a \"loophole that needs closing\" and advocating for age-gating the software. While the government insists there are \"no current plans to ban\" VPNs due to their legitimate uses for businesses, journalists, and privacy, a minister stated \"nothing is off the table.\" Ofcom, the UK's media regulator, is reportedly \"monitoring VPN use.\"\n\nA full ban on VPNs is considered technically challenging and politically unlikely. Requiring websites to block VPN traffic is also problematic, as it would force sites to either abandon the UK market or block all VPN users. The most probable outcome is age-restricting VPN services themselves, extending the OSA's scope.\n\nExperts warn that such restrictions could push users towards riskier, less reputable free VPNs or direct file-sharing, creating new privacy and security vulnerabilities. This \"VPN panic\" isn't exclusive to the UK; similar debates and proposed restrictions are emerging globally in places like Australia, the EU, and various US states, as more countries implement online age limits and VPNs remain an effective workaround.",
    "chinese_title": "VPN恐慌才刚刚开始",
    "chinese_summary": "英国的《网络安全法》（OSA）原计划于2025年7月引入严格的在线年龄验证，以限制用户访问“有害内容”，但该法案正因VPN（虚拟私人网络）的广泛使用而受到严重破坏。这些VPN允许用户通过伪造IP地址绕过年龄验证，导致英国居民的VPN注册量大幅飙升。\n\n当局对此日益担忧，儿童事务专员雷切尔·德·苏扎将VPN称为“需要堵塞的漏洞”，并主张对该软件进行年龄门槛限制。尽管政府坚称鉴于VPN对企业、记者和个人隐私的合法用途，目前“没有计划禁止”VPN，但一位部长表示“一切皆有可能”。据报道，英国媒体监管机构Ofcom正在“监测VPN的使用情况”。\n\n全面禁止VPN被认为技术上极具挑战性，政治上也可能性不大。要求网站屏蔽VPN流量同样存在问题，因为这将迫使网站要么放弃英国市场，要么屏蔽所有VPN用户。最可能的结果是对VPN服务本身进行年龄限制，从而扩大《网络安全法》的适用范围。\n\n专家警告称，此类限制可能将用户推向风险更高、信誉较差的免费VPN或直接文件共享，从而产生新的隐私和安全漏洞。这种“VPN恐慌”并非英国独有；随着越来越多的国家实施在线年龄限制而VPN仍是有效的规避方法，类似的讨论和拟议限制正在全球范围内出现，例如澳大利亚、欧盟和美国各州。"
  },
  {
    "id": "46081443",
    "title": "Show HN: Pulse 2.0 – Live co-listening rooms where anyone can be a DJ",
    "url": "https://473999.net/pulse",
    "summary": "Pulse 2.0 is a new platform introduced via a \"Show HN\" announcement, designed to create live, interactive co-listening rooms. Its primary feature empowers users to act as DJs, curating and broadcasting music in real-time to others. This move democratizes the DJ experience, allowing anyone to host a room and share their musical taste, fostering a dynamic and communal audio environment. Pulse 2.0 aims to facilitate shared discovery and connection among music enthusiasts, evolving beyond static playlists into live, engaging soundscapes where users are both listeners and active participants.",
    "chinese_title": "HN发布：Pulse 2.0 – 实时共听房间，人人都能当DJ",
    "chinese_summary": "Pulse 2.0是一个通过“Show HN”公告推出的新平台，旨在创建实时、互动式的共同聆听房间。其主要功能是赋能用户充当DJ，实时为他人策划并广播音乐。此举使DJ体验民主化，允许任何人主持房间并分享他们的音乐品味，从而营造一个动态且具有社区感的音频环境。Pulse 2.0旨在促进音乐爱好者之间的共同发现和联系，超越静态播放列表，演变为用户既是听众又是积极参与者的实时、引人入胜的声景。"
  },
  {
    "id": "46087616",
    "title": "Datacenters in space are a terrible, horrible, no good idea",
    "url": "https://taranis.ie/datacenters-in-space-are-a-terrible-horrible-no-good-idea/",
    "summary": "A former NASA and Google Cloud engineer strongly argues that datacenters in space, particularly for AI workloads using GPUs and TPUs, are a terrible idea due to fundamental incompatibilities with the space environment.\n\n**Power:** Abundant space power is a misconception. The ISS's immense 2500 sqm solar array generates 200kW, sufficient for only about 200 NVIDIA H200 GPUs. Powering a datacenter with 100,000 GPUs would necessitate 500 ISS-sized satellites, with each supporting the equivalent of merely three ground-based server racks. Nuclear RTGs are too low-power (50-150W) to run a single GPU.\n\n**Thermal Regulation:** Space is not easily cooled. The vacuum prevents convection, requiring heat to be dissipated via massive radiators. The ISS’s active thermal system manages 16kW (for ~16 H200 GPUs) using a 42.5 sqm radiator. Scaling to 200kW would require a colossal 531 sqm radiator, dwarfing the satellite's size for minimal capacity.\n\n**Radiation Tolerance:** Space radiation causes single-event upsets (bit flips), destructive single-event latch-ups, and long-term performance degradation. Modern GPUs/TPUs, with their small, dense transistors and large die areas, are highly susceptible. Effective shielding is impractical due to mass limitations. Radiation-hardened space processors offer performance equivalent to 20-year-old technology, incomparable to current AI hardware.\n\n**Communications:** Reliable space-to-ground data links are typically limited to ~1Gbps, a significant bottleneck compared to the 100Gbps+ interconnects found in Earth datacenters.\n\nIn conclusion, the author states that space datacenters would be extremely difficult, disproportionately costly, offer mediocre performance, and are a \"catastrophically bad idea.\"",
    "chinese_title": "太空数据中心是个馊主意。",
    "chinese_summary": "一位前NASA和谷歌云工程师强烈指出，太空数据中心，尤其是用于处理使用GPU和TPU的AI工作负载的数据中心，是一个极其糟糕的主意，因为它们与太空环境存在根本性的不兼容。\n\n**供电：** 太空电力充足是一个误解。国际空间站 (ISS) 巨大的2500平方米太阳能电池阵列能产生200千瓦 (kW) 的电力，仅够约200块NVIDIA H200 GPU使用。为一个拥有10万块GPU的数据中心供电，将需要500颗国际空间站大小的卫星，而每颗卫星仅能支持相当于三个地面服务器机架的设备。核放射性同位素热电发电机 (RTG) 功率过低 (50-150瓦)，甚至无法运行一块GPU。\n\n**热量管理：** 太空环境不易散热。真空阻止了对流，热量必须通过巨大的散热器散发。国际空间站的活动式热管理系统使用一个42.5平方米的散热器，处理16千瓦 (用于约16块H200 GPU) 的热量。将热处理能力扩展到200千瓦，将需要一个巨大的531平方米的散热器，如此巨大的散热器会使卫星本身相形见绌，而其所能提供的容量却微乎其微。\n\n**抗辐射能力：** 太空辐射会导致单粒子翻转 (位翻转)、破坏性的单粒子锁定以及长期的性能下降。现代GPU/TPU由于其微小、密集的晶体管和大的芯片面积，极易受到影响。由于质量限制，有效的屏蔽是不切实际的。经过抗辐射加固的太空处理器提供的性能仅相当于20年前的技术，与当前的AI硬件不可同日而语。\n\n**通信：** 可靠的星地数据链路通常限制在1Gbps左右，与地面数据中心100Gbps以上的互连带宽相比，这是一个显著的瓶颈。\n\n总之，作者指出太空数据中心将极其困难、成本极其高昂、性能平庸，并且是一个“灾难性糟糕的主意”。"
  },
  {
    "id": "46086410",
    "title": "I Know We're in an AI Bubble Because Nobody Wants Me",
    "url": "https://petewarden.com/2025/11/29/i-know-were-in-an-ai-bubble-because-nobody-wants-me-%f0%9f%98%ad/",
    "summary": "Pete Warden, a deep learning veteran since 2012 and advocate for efficiency, argues that the current AI boom is an unsustainable bubble due to irrational resource allocation. He observes hundreds of billions invested in AI hardware (GPUs, data centers), yet a distinct lack of investment in ML infrastructure engineers and software optimization, contrasting with his own startup's struggle for funding despite focusing on efficiency.\n\nWarden finds this economically irrational. Companies spending billions monthly on often underutilized GPUs (below 50%) should, from a rational perspective, invest hundreds of millions in software optimization to drastically cut costs, improve performance, and lessen environmental impact. He highlights that motivated engineers can outperform standard libraries and that much inference could run on cheaper CPUs.\n\nHe attributes this imbalance to \"signaling benefits.\" Startups like OpenAI use massive GPU purchases as a \"moat\" to project dominance and attract investment. Investors find it easier and safer to back these large hardware plays, while major tech companies gain more positive press and share price boosts from hardware announcements than from efficiency hires. Hardware projects are also perceived as simpler to manage than complex software optimization.\n\nWarden likens this to the dot-com bubble's reliance on expensive Sun workstations, which Google disrupted with cheap PCs and open-source software. He predicts a similar future for AI, where chatbot startups will leverage affordable PCs and open-source CPU models, emphasizing the unsustainability of the current hardware-first approach.",
    "chinese_title": "我知道AI是泡沫，因为没人要我。",
    "chinese_summary": "佩特·沃登，一位自2012年以来便是深度学习领域的资深人士和效率倡导者，认为当前的人工智能热潮是一个因资源分配不合理而不可持续的泡沫。他观察到数百亿资金投入到AI硬件（GPU、数据中心）中，但在机器学习基础设施工程师和软件优化方面的投资却明显不足，这与他自己的创业公司尽管专注于效率却难以获得资金的情况形成了对比。\n\n沃登认为这在经济上是不理性的。公司每月花费数十亿购买通常利用率不足（低于50%）的GPU，从理性的角度来看，应该投资数亿进行软件优化，以大幅削减成本、提高性能并减少对环境的影响。他强调，有动力的工程师可以超越标准库的性能，而且许多推理任务可以在更便宜的CPU上运行。\n\n他将这种不平衡归因于“信号效应”。像OpenAI这样的初创公司将大规模购买GPU作为“护城河”，以展示其主导地位并吸引投资。投资者发现支持这些大型硬件投资更容易、更安全，而大型科技公司从硬件发布中获得的积极新闻和股价提振，比从雇佣效率优化人员中获得的更多。硬件项目也被认为比复杂的软件优化更容易管理。\n\n沃登将这比作互联网泡沫时期对昂贵的Sun工作站的依赖，谷歌当时通过廉价PC和开源软件打破了这种局面。他预测人工智能领域也将出现类似的情况，届时，聊天机器人初创公司将利用价格实惠的PC和开源CPU模型，强调当前硬件优先方法的不可持续性。"
  },
  {
    "id": "46081357",
    "title": "How wealth dies",
    "url": "https://surplusenergyeconomics.wordpress.com/2025/11/02/314-how-wealth-dies/",
    "summary": "The article \"How Wealth Dies\" highlights a critical disequilibrium: financial wealth aggregates are relentlessly increasing while the \"real\" material economy is contracting. This apparent paradox is explained by the fact that monetary interventions aimed at stemming material decline ironically inflate financially measured wealth, and most of this wealth is \"notional,\" incapable of conversion into material value.\n\nThe real economy is driven by energy converting natural resources into goods and services, a process hindered by rising Energy Costs of Energy (ECoE) and resource depletion. Consequently, material prosperity has barely grown in decades, projecting a significant decline and making the \"cost of living crisis\" a permanent trend. Money itself has no intrinsic worth; it's merely an \"exercisable claim\" on finite material goods. Governments can create endless money, but not endless resources.\n\nThe massive growth in notional wealth, particularly since the 1970s, has been fueled by central bank interventions (e.g., the \"Fed Put\" after the 1987 crash and 2008 crisis). This \"back-stopping\" has created moral hazard, encouraging excessive risk-taking by investors expecting bailouts.\n\nThe core problem is that all reported wealth aggregates are fundamentally \"bogus\" and unmonetizable. Their \"value\" is derived from marginal transaction prices, falsely implying that entire markets or asset classes could be sold at their stated worth. The system is set to \"die rich\" with record paper wealth, but this wealth will prove meaningless as the monetary system collapses under the weight of its unfulfilled material claims.",
    "chinese_title": "财富如何消亡",
    "chinese_summary": "文章《财富如何消亡》强调了一个关键的失衡：金融财富总量持续增长，而“实体”物质经济却在萎缩。这种明显的悖论解释为，旨在阻止物质经济衰退的货币干预措施，反而讽刺地推高了以金融方式衡量的财富，而这些财富中的大部分是“名义上的”，无法转化为物质价值。\n\n实体经济是由能源将自然资源转化为商品和服务所驱动的，但这一过程受到不断上升的能源获取成本（ECoE）和资源枯竭的阻碍。因此，几十年来物质繁荣几乎没有增长，预计将出现显著下降，使“生活成本危机”成为永久性趋势。货币本身没有内在价值；它仅仅是对有限物质商品的“可执行债权”。政府可以创造无限的货币，但不能创造无限的资源。\n\n名义财富的大规模增长，特别是自20世纪70年代以来，一直由央行干预措施推动（例如1987年股灾和2008年危机后的“美联储看跌期权”）。这种“兜底”行为制造了道德风险，鼓励投资者预期获得救助，从而进行过度冒险。\n\n核心问题在于，所有报告的财富总量从根本上都是“虚假的”且无法变现的。它们的“价值”来源于边际交易价格，错误地暗示整个市场或资产类别可以按其标示的价值出售。该系统注定会“死于富有”，拥有创纪录的账面财富，但随着货币体系在其未能兑现的物质债权重压下崩溃，这些财富将变得毫无意义。"
  },
  {
    "id": "46088998",
    "title": "We're learning more about what Vitamin D does to our bodies",
    "url": "https://www.technologyreview.com/2025/11/21/1128206/vitamin-d-bodies-bone-health-immune/",
    "summary": "The article explores the widespread deficiency of vitamin D, often called the \"sunshine vitamin,\" particularly in regions like the UK during winter. While its primary established role is in bone health—aiding calcium absorption and preventing rickets—recent research is uncovering its potential influence on other bodily systems.\n\nScientists are investigating links between vitamin D levels and immune function, heart health (including blood pressure and cardiovascular events), mental well-being, pregnancy outcomes, and even cancer survival rates. However, the evidence for supplementation benefits in these newer areas is largely mixed and often inconclusive; for example, while low vitamin D has been linked to common colds, supplements haven't consistently proven to prevent acute respiratory infections.\n\nResearch is complicated by the fact that most vitamin D comes from sunlight exposure, with limited dietary sources. There's no universal agreement on \"ideal\" blood levels, and individual responses to UV rays vary significantly (e.g., due to melanin). Despite these complexities, there is global consensus on vitamin D supplementation for infants to prevent rickets. The UK government advises adults to take a 10-microgram supplement during autumn and winter. The current emphasis remains on preventing vitamin D deficiency (blood levels below 30 nanomoles per liter) as we await more definitive insights into its full effects.",
    "chinese_title": "我们正在了解更多维生素D对人体的影响。",
    "chinese_summary": "本文探讨了维生素D（常被称为“阳光维生素”）普遍缺乏的问题，尤其是在冬季的英国等地区。尽管其主要已确立的作用在于骨骼健康——帮助钙吸收并预防佝偻病——近期研究正在揭示它对其他身体系统的潜在影响。\n\n科学家们正在调查维生素D水平与免疫功能、心脏健康（包括血压和心血管事件）、心理健康、妊娠结局，甚至癌症存活率之间的联系。然而，在这些新领域中，关于补充剂益处的证据大多混杂且常常尚无定论；例如，虽然低维生素D水平与普通感冒有关，但补充剂尚未被持续证明能预防急性呼吸道感染。\n\n研究的复杂性在于，大部分维生素D来自阳光照射，而膳食来源有限。关于“理想”的血液水平没有普遍共识，个人对紫外线的反应差异很大（例如，由于黑色素）。尽管存在这些复杂性，全球在婴儿补充维生素D以预防佝偻病方面达成了共识。英国政府建议成年人在秋冬季服用10微克的补充剂。目前的重点仍然是预防维生素D缺乏症（血液水平低于每升30纳摩尔），同时我们正等待对其全面影响有更明确的认识。"
  },
  {
    "id": "46080597",
    "title": "Anti-patterns while working with LLMs",
    "url": "https://instavm.io/blog/llm-anti-patterns",
    "summary": "This article identifies five anti-patterns to avoid when working with LLMs, based on 15 months of experience.\n\n1.  **Redundant Context:** Avoid sending the same information repeatedly within a session. Context is a valuable resource; only provide new or significantly changed information, rather than duplicated data like nearly identical screenshots, to conserve resources and improve efficiency.\n\n2.  **Misassigned Tasks:** Don't ask LLMs to perform tasks they're not optimized for. For instance, direct, precise counting or complex image generation with specific text constraints can be difficult. Instead, leverage their strengths, such as generating code for accurate counting or merging pre-existing visual elements for image tasks, where they often excel.\n\n3.  **Context Overload:** LLMs perform optimally when their context window isn't nearly full. In long sessions pushing token limits (e.g., 128k tokens), LLMs can \"drown,\" forgetting crucial details or producing inaccurate information as they unpredictably compress or discard data. Be aware of this accuracy decline.\n\n4.  **Obscure Topics:** LLMs struggle with niche subjects or topics developed after their training cutoff dates due to insufficient training data. For such areas, anticipate lower accuracy and plan alternative verification methods.\n\n5.  **Blind Trust:** Avoid being a \"vibe-coder\" who loses sight of the LLM's output. It's crucial to review generated code and responses thoroughly to catch subtle errors or security vulnerabilities, such as inadvertently exposing sensitive user data, to prevent potential risks.",
    "chinese_title": "使用大模型时的反模式",
    "chinese_summary": "本文基于15个月的经验，总结了使用LLM时应避免的五种反模式。\n\n1.  **冗余上下文：** 避免在同一会话中重复发送相同信息。上下文是一种宝贵的资源；只提供新的或显著改变的信息，而不是重复的数据（例如几乎相同的截图），以节省资源并提高效率。\n\n2.  **任务分配不当：** 不要让LLM执行它们不擅长的任务。例如，直接、精确的计数或带有特定文本约束的复杂图像生成可能很困难。相反，应利用它们的优势，例如生成用于精确计数的代码，或在图像任务中合并预先存在的视觉元素，这些是它们通常擅长的。\n\n3.  **上下文过载：** LLM在上下文窗口未接近满载时表现最佳。在接近token限制（例如128k token）的长时间会话中，LLM可能会“淹没”，它们会不可预测地压缩或丢弃数据，从而忘记关键细节或产生不准确的信息。请注意这种准确性下降。\n\n4.  **冷门主题：** 由于训练数据不足，LLM难以处理小众主题或其训练截止日期之后出现的话题。对于这些领域，请预期较低的准确性并规划其他验证方法。\n\n5.  **盲目信任：** 避免成为一个“凭感觉行事”的开发者，忽视LLM的输出。彻底审查生成的代码和响应至关重要，以发现细微错误或安全漏洞（例如无意中暴露敏感用户数据），从而防止潜在风险。"
  },
  {
    "id": "46077964",
    "title": "A Tale of Four Fuzzers",
    "url": "https://tigerbeetle.com/blog/2025-11-28-tale-of-four-fuzzers/",
    "summary": "TigerBeetle recently overhauled its replication routing algorithm (Adaptive Replication Routing, ARR) to handle varying network topologies, which became a case study for practical generative testing. The article emphasizes that effective fuzzing requires not just one, but multiple, diverse fuzzers, and critically, a design philosophy centered on *minimal interfaces*.\n\nReplication is fundamental for data durability. Initial approaches like broadcast (bandwidth-intensive) and static ring topologies (vulnerable to network changes, 'cold code' bugs) proved insufficient. ARR addresses this by keeping the primary in the middle of a dynamic ring, allowing redundancy (messages are still replicated even if one is dropped) and enabling the cluster to dynamically reorder replicas based on real-time latency measurements (Grace Hopper style), rather than relying on potentially misleading models.\n\nTo fuzz ARR effectively, whole-system simulation (VOPR) was deemed insufficient for deep layers and specific assertions. The general principle for subsystem fuzzing is to abstract connections behind minimal interfaces. The article argues that this interface minimization should happen at the architectural \"sketching\" phase, not after implementation.\n\nThe `Routing` component's interface exemplifies this: it passes simple integers (`u64` for `Instant`, `u8` for replica IDs), and maintains a private copy of the `view` number, intentionally simplifying dependencies for fuzzing efficiency, despite occasionally bending \"best practices.\" The first fuzzer introduced leverages this by testing the serialization and deserialization of routes as a property-based test, ensuring data integrity across encoding.",
    "chinese_title": "四模糊器记",
    "chinese_summary": "TigerBeetle 最近重构了其复制路由算法（自适应复制路由，ARR），以应对不断变化的网络拓扑，这成为了一个实用生成测试的案例研究。文章强调，有效的模糊测试不仅需要一个，而是多个、多样化的模糊测试器，尤其关键的是，一种以“最小化接口”为核心的设计理念。\n\n复制对于数据持久性至关重要。最初的方法，如广播（带宽密集型）和静态环形拓扑（易受网络变化和“冷代码”错误影响），都被证明不足。ARR 通过将主节点置于动态环的中间来解决这个问题，允许冗余（即使一个消息丢失，消息也仍会被复制），并使集群能够根据实时延迟测量（格蕾丝·霍珀风格）动态地重新排序副本，而不是依赖可能产生误导的模型。\n\n为了有效地对 ARR 进行模糊测试，全系统模拟（VOPR）被认为不足以用于深层和特定断言。子系统模糊测试的普遍原则是将连接抽象到最小化接口之后。文章指出，这种接口最小化应该发生在架构的“草图”阶段，而不是在实现之后。\n\n`Routing` 组件的接口是这方面的例证：它传递简单的整数（`Instant` 用 `u64`，副本 ID 用 `u8`），并维护 `view` 号的私有副本，这有意简化了依赖，以提高模糊测试效率，尽管偶尔会偏离“最佳实践”。引入的第一个模糊测试器利用这一点，通过将路由的序列化和反序列化作为基于属性的测试进行测试，从而确保编码过程中的数据完整性。"
  },
  {
    "id": "46077404",
    "title": "Google denies 'misleading' reports of Gmail using your emails to train AI",
    "url": "https://www.theverge.com/news/826902/gmail-ai-training-data-opt-out",
    "summary": "Google is refuting viral social media posts and articles that falsely claim Gmail uses users' emails and attachments to train AI models like Gemini, and that opting out of \"smart features\" is necessary to prevent this.\n\nGoogle spokesperson Jenny Thomson stated that these reports are \"misleading,\" emphasizing that Google has not changed anyone's settings, Gmail's smart features have existed for years, and the company \"do[es] not use your Gmail content for training our Gemini AI model.\"\n\nThe viral claims suggest users need to disable \"smart features\" like spell checking to avoid AI training. While Google denies using email content for AI training, the article notes that users might still want to check their \"smart feature\" settings. This is because one Verge staffer found they had been re-opted into these features, despite previously opting out. In January, Google updated its settings to allow independent control over smart features for Google Workspace and other Google products (like Maps and Wallet).\n\nEnabling smart features in Workspace allows Google to use \"Workspace content and activity to personalize your experience across Workspace\" for things like spell checking, order tracking, and adding flights to calendars, but Google clarifies this does not involve using email content for AI training.",
    "chinese_title": "谷歌否认Gmail用你的邮件训练AI的‘误导性’报道",
    "chinese_summary": "Google 正在驳斥社交媒体上疯传的帖子和文章，这些帖子和文章错误地声称 Gmail 使用用户的电子邮件和附件来训练 Gemini 等人工智能模型，并且必须选择退出“智能功能”才能阻止这种情况发生。\n\nGoogle 发言人珍妮·汤姆森（Jenny Thomson）表示，这些报道是“误导性的”，她强调 Google 并未更改任何人的设置，Gmail 的智能功能已存在多年，并且该公司“不会使用您的 Gmail 内容来训练我们的 Gemini AI 模型。”\n\n疯传的说法建议用户需要禁用拼写检查等“智能功能”以避免 AI 训练。尽管 Google 否认使用电子邮件内容进行 AI 训练，但文章指出用户可能仍需检查其“智能功能”设置。这是因为一位 Verge 工作人员发现他们之前选择退出后又被重新加入了这些功能。今年一月，Google 更新了其设置，允许用户独立控制 Google Workspace 和其他 Google 产品（如地图和钱包）的智能功能。\n\n在 Workspace 中启用智能功能，Google 可以使用“Workspace 内容和活动来个性化您在 Workspace 中的体验”，例如拼写检查、订单跟踪以及将航班添加到日历，但 Google 澄清这不涉及使用电子邮件内容进行 AI 训练。"
  },
  {
    "id": "46076150",
    "title": "GrapheneOS Moving Out of France",
    "url": "https://xcancel.com/GrapheneOS/status/1993035936800584103",
    "summary": "GrapheneOS is moving all active servers out of France, discontinuing its relationship with OVH due to concerns over French law enforcement's stance on encryption and privacy. The organization states France \"isn't a safe country for open source privacy projects\" and accuses French authorities of expecting backdoors in encryption and device access, running a misinformation campaign, and making direct threats.\n\nAs part of the migration, GrapheneOS is rotating TLS, Let's Encrypt, and potentially DNSSEC keys. Backups remain encrypted on OVH for now. Critical services like email, Matrix, discussion forums, Mastodon, and attestation, currently hosted on five OVH servers in Canada, will move to Netcup root servers or similar providers short-term, with a long-term plan for colocated servers in Toronto.\n\nUpdate mirrors are currently on sponsored servers in the US (ReliableSite) and temporarily in London (Tempest), with more planned. Their anycast DNS networks (ns1 on Vultr, ns2 on BuyVM) support BGP, and main website/OS connection servers are moving to a mix of Vultr and BuyVM locations.\n\nGrapheneOS emphasizes its robust security measures, including cryptographic signature verification and downgrade protection for its App Store and System Updater, leveraging Android's package manager, update_engine, and verified boot. They stress that bypassing secure element-based brute force protection, as French law enforcement allegedly desires, is technically impossible.\n\nThe move is disrupting development, including experimental Pixel 10 support. GrapheneOS reports escalating libel, harassment, and chat room raids against their team. Despite the server relocation, GrapheneOS confirms its services, including connectivity checks, network time, and updates, will remain fully available to users in France from servers in other countries like Germany and Switzerland. They also express concerns about operating in Denmark and the UK due to similar legal pressures on encryption.",
    "chinese_title": "GrapheneOS 退出法国",
    "chinese_summary": "GrapheneOS 正在将所有活跃服务器迁出法国，并中止与 OVH 的合作关系，原因是担忧法国执法部门在加密和隐私问题上的立场。该组织指出，法国“对开源隐私项目来说不是一个安全的国家”，并指责法国当局期望加密和设备访问中存在后门、散布虚假信息以及进行直接威胁。\n\n作为迁移的一部分，GrapheneOS 正在轮换 TLS、Let's Encrypt 和潜在的 DNSSEC 密钥。目前，备份仍加密存储在 OVH 上。目前托管在加拿大五个 OVH 服务器上的关键服务，如电子邮件、Matrix、讨论论坛、Mastodon 和证明服务，短期内将迁移到 Netcup 根服务器或类似提供商，长期计划是在多伦多建立托管服务器。\n\n更新镜像目前位于美国的赞助服务器 (ReliableSite) 和伦敦的临时服务器 (Tempest) 上，未来计划增加更多。他们的任播 DNS 网络（ns1 位于 Vultr，ns2 位于 BuyVM）支持 BGP，主网站/操作系统连接服务器正迁移到 Vultr 和 BuyVM 的混合地点。\n\nGrapheneOS 强调其强大的安全措施，包括为其应用商店和系统更新程序提供加密签名验证和降级保护，这得益于 Android 的包管理器、update_engine 和验证启动。他们强调，绕过基于安全元件的暴力破解保护（据称法国执法部门希望如此）在技术上是不可能的。\n\n此次迁移正在扰乱开发工作，包括实验性的 Pixel 10 支持。GrapheneOS 报告称，针对其团队的诽谤、骚扰和聊天室突袭事件正在加剧。尽管服务器进行了搬迁，GrapheneOS 仍确认其服务，包括连接性检查、网络时间以及更新，将通过德国和瑞士等其他国家的服务器，完全面向法国用户开放。他们还对在丹麦和英国的运营表示担忧，因为这些国家在加密方面存在类似的法律压力。"
  },
  {
    "id": "46085276",
    "title": "The Great Downzoning",
    "url": "https://worksinprogress.co/issue/the-great-downzoning/",
    "summary": "The article introduces \"the Great Downzoning,\" a profound shift from 1890-1940 where Western cities abandoned highly permissive building regulations (e.g., no height limits) for restrictive zoning. This process, the author argues, is the main cause of contemporary housing shortages, with severe consequences for health, families, environment, and economic growth, potentially reducing US GDP by 25%.\n\nContrary to assumptions that anti-density ideologies were the sole driver, the author posits that the Downzoning was primarily interest-driven. It successfully raised property values in existing suburbs by preventing \"undesirable\" development but faced resistance where it reduced land values, such as in greenfield areas.\n\nHistorically, early suburbs were often unplanned and mixed-use. From the 18th century, planned, lower-density suburbs emerged, initially using private \"covenants\" (a \"Proto-Downzoning\") to impose restrictions on density, use, and even minimum prices to protect neighborhood character and value. However, these covenants proved ineffective due to legal ambiguities, inability to adapt to changing conditions (like inflation), and high enforcement costs. These limitations paved the way for public, state-led downzoning.\n\nToday, while downzoning still benefits some property owners, in major cities, the housing shortages it created now *reduce* property values, fostering new coalitions of interests that may finally undo the \"Great Downzoning.\"",
    "chinese_title": "大降容",
    "chinese_summary": "这篇文章介绍了“大降级分区”，这是1890-1940年间西方城市从高度宽松的建筑法规（例如，没有高度限制）转变为限制性分区的一次深刻转变。作者认为，这一过程是当代住房短缺的主要原因，对健康、家庭、环境和经济增长造成严重后果，可能使美国GDP减少25%。\n\n与认为反密度意识形态是唯一驱动因素的假设相反，作者提出，降级分区主要是受利益驱动的。它通过阻止“不受欢迎的”开发，成功提升了现有郊区的房产价值，但在降低土地价值的地方（例如在绿地地区）则面临阻力。\n\n历史上，早期郊区通常是未经规划的，且用途混合的。从18世纪起，有规划的、低密度的郊区开始出现，最初采用私人“契约”（一种“原始降级分区”）以对密度、用途甚至最低价格施加限制，从而保护社区特色和价值。然而，这些契约因法律模糊性、无法适应不断变化的条件（如通货膨胀）以及高昂的执行成本而失效。这些局限性为公共的、由政府主导的降级分区铺平了道路。\n\n如今，尽管降级分区仍使一些业主受益，但在大城市，它造成的住房短缺现在反而*降低*了房产价值，这促成了新的利益联盟的形成，这些联盟最终可能逆转“大降级分区”的局面。"
  },
  {
    "id": "46084937",
    "title": "Neato vacuum robots to stop working",
    "url": "https://support.neatorobotics.com/support/solutions/articles/204000073686-announcement-6th-oct-2025",
    "summary": "Neato Robotics announced on October 6, 2025, that it is phasing out its cloud services. This decision comes after Neato Robotics, a company within the Vorwerk Group, ceased operations in 2023.\n\nInitially, Vorwerk had committed to providing five years of cloud services to ensure customers could continue using their robots smoothly, upholding a prior promise. However, due to significant advancements in cybersecurity standards, compliance obligations, and regulatory frameworks since 2023, the existing cloud infrastructure can no longer be reliably maintained or updated to meet current quality and sustainability expectations. Updating it would not be technically meaningful.\n\nWhile cloud services are being phased out, several important aspects remain unchanged:\n*   Manufacturer warranty commitments are still valid.\n*   Neato robots will continue to function manually; pressing the button once will launch a full house cleaning run.\n*   Online support and practical assistance are available at neatorobotics.com.\n\nThis decision exclusively affects Neato Robotics products, with other Vorwerk products and services remaining unaffected. Vorwerk emphasizes that this was not a decision of convenience, but rather a necessary step to protect user privacy, data, and safety in a fundamentally shifted technological and regulatory environment.",
    "chinese_title": "俐拓扫地机器人将停止工作",
    "chinese_summary": "诺拓机器人于2025年10月6日宣布，将逐步停止其云服务。此决定是在作为福维克集团旗下公司的诺拓机器人已于2023年停止运营之后做出的。\n\n最初，福维克曾承诺提供五年云服务，以确保客户能够继续顺畅使用他们的机器人，履行此前的承诺。然而，由于自2023年以来网络安全标准、合规义务和监管框架的重大进展，现有的云基础设施已无法可靠地维护或更新以满足当前的质量和可持续性期望。从技术角度来看，对其进行更新已无任何意义。\n\n尽管云服务将被逐步终止，但以下几个重要方面保持不变：\n*   制造商的保修承诺仍然有效。\n*   诺拓机器人将继续支持手动操作；按下按钮一次即可启动全屋清扫。\n*   在neatorobotics.com网站上仍可获得在线支持和实用帮助。\n\n此决定仅影响诺拓机器人产品，福维克集团的其他产品和服务不受影响。福维克强调，这不是一项出于便利的决定，而是在技术和监管环境发生根本性变化的情况下，为保护用户隐私、数据和安全所必需的步骤。"
  },
  {
    "id": "46086863",
    "title": "DMT-induced shifts in criticality correlate with self-dissolution",
    "url": "https://www.jneurosci.org/content/early/2025/10/24/JNEUROSCI.0344-25.2025",
    "summary": "This study investigates the effects of the psychedelic substance DMT on the criticality of human brain oscillations and its correlation with subjective experience, particularly self-dissolution. Near-critical brain dynamics are essential for healthy function.\n\nThe research found that DMT shifts brain oscillation dynamics *away from criticality* in alpha and adjacent frequency bands, moving them towards *subcritical regimes*. This shift leads to *increased entropy* but a *reduction in complexity* of brain activity. Crucially, these observed criticality shifts in the alpha and theta bands directly correlated with the reported intensity of self-dissolution, a hallmark psychedelic experience.\n\nIn essence, DMT transforms normally dominant alpha oscillations into a quieter, subcritical state. These findings offer significant implications for understanding the neurological mechanisms of psychedelics and the basis of altered states of consciousness in the human brain.",
    "chinese_title": "DMT诱导的临界性转变与自我瓦解相关联。",
    "chinese_summary": "本研究探讨了迷幻物质DMT对人脑振荡临界性的影响及其与主观体验（尤其是自我消解）的相关性。近临界脑动力学对健康功能至关重要。\n\n研究发现，DMT使α波及邻近频段的脑振荡动力学偏离临界状态，转向亚临界状态。这种转变导致脑活动熵增加但复杂性降低。至关重要的是，在α波和θ波频段观察到的这些临界性转变与所报告的自我消解强度（一种标志性的迷幻体验）直接相关。\n\n本质上，DMT将通常占主导地位的α波振荡转化为一种更安静、亚临界的状态。这些发现对理解迷幻物质的神经学机制以及人脑中意识改变状态的基础具有重要意义。"
  },
  {
    "id": "46075219",
    "title": "Shor's algorithm: the one quantum algo that ends RSA/ECC tomorrow",
    "url": "https://blog.ellipticc.com/posts/what-is-shors-algorithm-and-why-its-the-single-biggest-threat-to-classical-cryptography/",
    "summary": "Shor's algorithm is a quantum algorithm capable of efficiently finding the prime factors of large numbers, a task that is computationally intractable for classical computers. This capability poses the single biggest threat to modern public-key cryptography, particularly the RSA and ECC algorithms.\n\nRSA relies on the difficulty of factoring large numbers, while ECC relies on the difficulty of solving the discrete logarithm problem – both of which Shor's algorithm can efficiently break. If a sufficiently powerful quantum computer were built, Shor's algorithm could decrypt virtually all internet communication, financial transactions, and secure data protected by these cryptographic schemes.\n\nThe algorithm leverages quantum mechanics, specifically superposition and entanglement, to explore many possibilities simultaneously and find the period of a function related to the number being factored. This allows it to vastly outperform classical factoring algorithms.\n\nWhile practical, fault-tolerant quantum computers are still some years away, the threat is significant enough to warrant immediate action. Experts anticipate a \"harvest now, decrypt later\" scenario where encrypted data is collected today, to be decrypted once powerful quantum computers become available. This has spurred the development of \"post-quantum cryptography\" (PQC) – new cryptographic algorithms designed to be resistant to attacks from quantum computers, with standardization efforts underway by NIST. The article emphasizes the urgency for organizations to prepare for this quantum threat by transitioning to PQC.",
    "chinese_title": "秀尔算法：明日终结RSA/ECC的唯一量子算法",
    "chinese_summary": "Shor算法是一种量子算法，能够高效地找到大数的质因数，这对于经典计算机来说是计算上不可行的任务。这种能力对现代公钥密码学构成了最大的威胁，尤其是对RSA和ECC算法。\n\nRSA依赖于大数分解的困难性，而ECC依赖于解决离散对数问题的困难性——这两种难题Shor算法都能高效破解。如果建造出足够强大的量子计算机，Shor算法几乎能够解密所有受这些密码方案保护的互联网通信、金融交易和安全数据。\n\n该算法利用量子力学，特别是叠加和纠缠特性，同时探索多种可能性，并找到与被分解数相关的函数的周期。这使得它能够远远优于经典的分解算法。\n\n尽管实用、容错的量子计算机仍需数年才能问世，但这一威胁已经足够重大，值得立即采取行动。专家们预计会出现“先收集，后解密”的情景，即今天收集加密数据，待强大的量子计算机可用时再进行解密。这推动了“后量子密码学”（PQC）的发展——这是一类旨在抵抗量子计算机攻击的新密码算法，NIST正在进行标准化工作。文章强调了组织机构通过过渡到PQC来准备应对这一量子威胁的紧迫性。"
  },
  {
    "id": "46088379",
    "title": "Testing Shows Automotive Glassbreakers Can't Break Modern Automotive Glass",
    "url": "https://www.core77.com/posts/138925/Testing-Shows-Automotive-Glassbreakers-Cant-Break-Modern-Automotive-Glass",
    "summary": "The article \"Testing Shows Automotive Glassbreakers Can't Break Modern Automotive Glass\" argues that common car escape tools, particularly window breakers, are largely ineffective against modern vehicles. The burgeoning \"car escape tool market\" is fueled by fear-based marketing around rare scenarios like car fires or submersion, and statistically insignificant events like seatbelt jamming.\n\nThe critical flaw in these tools is that they are designed to break tempered glass, which most cars *used* to have for side windows. However, modern safety regulations (FMVSS 226, 2013) have prompted most automakers—including nearly all major brands—to switch to laminated glass for side windows. Laminated glass, already used in windshields, is significantly tougher and designed to prevent occupant ejection.\n\nAn AAA research report tested six common glassbreakers, none of which could break laminated glass, with two failing even against tempered glass. While seatbelt cutters are genuinely useful for first responders to extricate unconscious victims, the window-breaking function of these tools is now largely obsolete for modern cars, making them only potentially useful for classic vehicles.",
    "chinese_title": "测试显示汽车破窗器无法击碎现代汽车玻璃",
    "chinese_summary": "文章《测试表明汽车破窗器无法打破现代汽车玻璃》指出，常见的汽车逃生工具，特别是破窗器，对现代汽车基本无效。蓬勃发展的“汽车逃生工具市场”主要由基于恐惧的营销推动，这些营销围绕着汽车起火或沉没等罕见场景，以及安全带卡死等统计上微不足道的事件。\n\n这些工具的关键缺陷在于，它们被设计用来打破钢化玻璃，而大多数汽车侧窗*过去*常使用钢化玻璃。然而，现代安全法规（FMVSS 226，2013）已促使大多数汽车制造商——包括几乎所有主要品牌——将侧窗玻璃改为夹层玻璃。夹层玻璃，已经在挡风玻璃中使用，明显更坚韧，旨在防止乘员被甩出车外。\n\n一份AAA研究报告测试了六种常见的破窗器，结果发现没有一个能打破夹层玻璃，其中两个甚至连钢化玻璃都无法打破。尽管安全带切割器对于急救人员解救昏迷的受害者确实有用，但这些工具的破窗功能对现代汽车而言已基本过时，使其仅对老爷车可能有用。"
  },
  {
    "id": "46083375",
    "title": "Fabric Project",
    "url": "https://github.com/Fabric-Project/Fabric",
    "summary": "Fabric is a creative coding and rapid prototyping environment designed for interactive visuals, image/video processing, and 3D content authoring. Inspired by Apple's Quartz Composer, it features an intuitive visual node-based interface, providing SDKs for content loading and custom node creation via plugins.\n\nIt serves as a tool for creative coders requiring minimal programming, pro users creating reusable documents embeddable in third-party applications, and developers building high-fidelity visuals using its underlying Satin engine. Fabric enables creation of interactive 3D graphics, image effects, audio-reactive scenes, and video analysis pipelines.\n\nKey capabilities include Physically Based Rendering (PBR), a scene graph, lighting/shadows, real-time shader editing, GPU compute, Image Based Lighting, 3D model loading, and ML-based segmentation. It integrates the Satin 3D engine (by @Reza Ali) and a Metal port of the Lygia shader library (by @Patricio Gonzalez Vivo).\n\nCurrently in early alpha and \"heavily under construction,\" Fabric requires macOS 14+ and Xcode 15+. Developers are guided with architecture documents, tutorials, and samples. Fabric is purpose-built for the Apple platform using Metal, Swift, and SwiftUI, with no plans for cross-platform compatibility. Its creator, Anton Marini, is actively building a community, seeking contributors who value its unique approach compared to other node-based tools.",
    "chinese_title": "织物项目",
    "chinese_summary": "Fabric是一个创意编程和快速原型开发环境，专为交互式视觉效果、图像/视频处理和3D内容创作而设计。它受Apple的Quartz Composer启发，具有直观的视觉节点式界面，并提供用于内容加载和通过插件创建自定义节点的SDK。\n\n它是一个工具，适用于需要少量编程的创意程序员、创建可嵌入第三方应用程序的可复用文档的专业用户，以及使用其底层Satin引擎构建高保真视觉效果的开发者。Fabric支持创建交互式3D图形、图像效果、音频响应场景和视频分析管道。\n\n主要功能包括物理渲染（PBR）、场景图、光照/阴影、实时着色器编辑、GPU计算、基于图像的光照、3D模型加载和基于机器学习的分割。它集成了Satin 3D引擎（由@Reza Ali开发）和Lygia着色器库的Metal移植版本（由@Patricio Gonzalez Vivo开发）。\n\n目前处于早期alpha阶段，且“正在大规模开发中”，Fabric需要macOS 14及更高版本和Xcode 15及更高版本。为开发者提供了架构文档、教程和示例以作指导。Fabric是专为Apple平台使用Metal、Swift和SwiftUI而构建的，暂无跨平台兼容性计划。其创建者Anton Marini正在积极建立社区，寻求重视其相较于其他节点式工具独特方法的贡献者。"
  },
  {
    "id": "46077650",
    "title": "Cats became our companions way later than you think",
    "url": "https://www.bbc.co.uk/news/articles/cq8dvdp9gn7o",
    "summary": "New scientific evidence suggests cats became human companions much later and in a different place than previously thought. Contrary to the belief that domestication began 10,000 years ago in the Levant, a study of DNA from ancient cat bones indicates that the bond with humans started only 3,500 to 4,000 years ago in northern Africa, likely Egypt. All modern domestic cats are descended from the African wildcat.\n\nThis revised timeline aligns with ancient Egyptian reverence for cats. Valued as pest controllers and ship companions, cats then spread globally, reaching Europe around 2,000 years ago with the Romans and subsequently moving east into China via the Silk Road.\n\nAdding a twist, scientists discovered that a different species, the leopard cat, coexisted commensally with people in China for around 3,500 years, pre-dating the arrival of domestic cats. These leopard cats benefited from human settlements as natural rodent controllers but were never domesticated, remaining wild across Asia. Notably, they have recently been crossed with domestic cats to create the Bengal breed. The research challenges established timelines for cat domestication.",
    "chinese_title": "猫远比你想象的要晚才成为我们的伙伴。",
    "chinese_summary": "新科学证据表明，猫成为人类伙伴的时间比之前认为的晚得多，地点也不同。与“驯化始于10000年前的黎凡特地区”这一观点相反，一项对古代猫骨骼DNA的研究指出，猫与人类的联系仅在3500至4000年前的北非，很可能是埃及开始。所有现代家猫都源自非洲野猫。\n\n这一修正后的时间线与古埃及人对猫的崇敬相符。猫因被视为害虫防治者和船只伴侣而受到重视，随后在全球传播开来，约2000年前随罗马人抵达欧洲，随后经丝绸之路东传至中国。\n\n一个意想不到的发现是，科学家们发现，另一种物种——豹猫，在中国与人类共生了约3500年，比家猫的到来还要早。这些豹猫作为天然的啮齿动物捕食者，从人类定居点中受益，但它们从未被驯化，在亚洲各地仍保持野性。值得注意的是，它们最近与家猫杂交，培育出了孟加拉猫。这项研究挑战了既定的猫驯化时间线。"
  },
  {
    "id": "46077445",
    "title": "Africa's forests have switched from absorbing to emitting carbon",
    "url": "https://phys.org/news/2025-11-africa-forests-absorbing-emitting-carbon.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Africa's forests have switched from absorbing to emitting carbon",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46088241",
    "title": "Copenhagenize Index 2025: The Global Ranking of Bicycle-Friendly Cities",
    "url": "https://copenhagenizeindex.eu/",
    "summary": "生成摘要时出错",
    "chinese_title": "Copenhagenize Index 2025: The Global Ranking of Bicycle-Friendly Cities",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46082855",
    "title": "Jedi Blue",
    "url": "https://en.wikipedia.org/wiki/Jedi_Blue",
    "summary": "生成摘要时出错",
    "chinese_title": "Jedi Blue",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46087029",
    "title": "Chainalysis Successful Deanonymization Attack on Monero",
    "url": "https://darkwebinformer.com/chainalysis-successful-deanonymization-attack-on-monero-2/",
    "summary": "生成摘要时出错",
    "chinese_title": "Chainalysis Successful Deanonymization Attack on Monero",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46080737",
    "title": "Show HN: An LLM-Powered Tool to Catch PCB Schematic Mistakes",
    "url": "https://netlist.io/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: An LLM-Powered Tool to Catch PCB Schematic Mistakes",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46075462",
    "title": "Migrating to Positron, a next-generation data science IDE for Python and R",
    "url": "https://posit.co/blog/positron-migration-guides",
    "summary": "生成摘要时出错",
    "chinese_title": "Migrating to Positron, a next-generation data science IDE for Python and R",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46085593",
    "title": "KDE going all-in on a Wayland future",
    "url": "https://blogs.kde.org/2025/11/26/going-all-in-on-a-wayland-future/",
    "summary": "生成摘要时出错",
    "chinese_title": "KDE going all-in on a Wayland future",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46078566",
    "title": "Writing Builds Resilience in Everyday Challenges by Changing Your Brain",
    "url": "https://scienceclock.com/writing-builds-resilience-in-everyday-challenges-by-changing-your-brain/",
    "summary": "生成摘要时出错",
    "chinese_title": "Writing Builds Resilience in Everyday Challenges by Changing Your Brain",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46078046",
    "title": "OpenAI won't make money by 2030 and needs another $207B, HSBC estimates",
    "url": "https://fortune.com/2025/11/26/is-openai-profitable-forecast-data-center-200-billion-shortfall-hsbc/",
    "summary": "生成摘要时出错",
    "chinese_title": "OpenAI won't make money by 2030 and needs another $207B, HSBC estimates",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46087333",
    "title": "Users brutually reject Microsoft's \"Copilot for work\" in Edge and Windows 11",
    "url": "https://www.windowslatest.com/2025/11/28/you-heard-wrong-users-brutually-reject-microsofts-copilot-for-work-in-edge-and-windows-11/",
    "summary": "生成摘要时出错",
    "chinese_title": "Users brutually reject Microsoft's \"Copilot for work\" in Edge and Windows 11",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46074183",
    "title": "ML-KEM Mythbusting",
    "url": "https://keymaterial.net/2025/11/27/ml-kem-mythbusting/",
    "summary": "生成摘要时出错",
    "chinese_title": "ML-KEM Mythbusting",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46086920",
    "title": "Show HN: I built Magiclip – an all-in-one AI studio",
    "url": "https://magiclip.io/",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: I built Magiclip – an all-in-one AI studio",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46083137",
    "title": "How to Short the Bubbliest Firms",
    "url": "https://www.economist.com/finance-and-economics/2025/11/26/how-to-short-the-bubbliest-firms",
    "summary": "生成摘要时出错",
    "chinese_title": "How to Short the Bubbliest Firms",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46080972",
    "title": "Rock Paper Scissors Solitaire",
    "url": "https://klezlab.it/rock-paper-scissors-solitaire.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Rock Paper Scissors Solitaire",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46079067",
    "title": "Louvre to hike ticket prices for most non-EU tourists by 45%",
    "url": "https://www.bbc.com/news/articles/clyd4llgrego",
    "summary": "生成摘要时出错",
    "chinese_title": "Louvre to hike ticket prices for most non-EU tourists by 45%",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46080835",
    "title": "Codex, Opus, Gemini Try to Build Counter Strike",
    "url": "https://www.instantdb.com/essays/agents_building_counterstrike",
    "summary": "生成摘要时出错",
    "chinese_title": "Codex, Opus, Gemini Try to Build Counter Strike",
    "chinese_summary": "生成摘要时出错"
  }
]