[
  {
    "id": "46025942",
    "title": "Fran Sans – font inspired by San Francisco light rail displays",
    "url": "https://emilysneddon.com/fran-sans-essay",
    "summary": "Fran Sans is a new display font by Emily Sneddon, inspired by the distinctive LCD panel destination displays on San Francisco’s Muni Breda Light Rail Vehicles. Sneddon was drawn to their mechanical yet personal character, formed by geometric modules on a 3x5 grid, embodying a unique blend of utility and charm found throughout SF.\n\nHer research included a visit to the SFMTA Electronics Shop, where technician Armando Lumbad demonstrated how train operators use three-digit codes to activate destinations. She discovered the signs were designed by Trans-Lite, Inc. in 1999 by engineer Gary Wallberg. Wallberg designed them for \"sufficiency\" with fixed segments, creating imperfect yet charming letterforms that omitted less-used characters like Q and X.\n\nThis engineering-driven simplicity inspired Sneddon to create Fran Sans. Working with Dave Foster, she translated the modular design into a digital font, developing uppercase letters, numerals, and core punctuation across three styles: Solid, Tile, and Panel. While some glyphs don't perfectly fit the 3x5 logic, Sneddon preserved the original's \"unorthodox moments,\" like thick diagonals in N/zero and thin ones in Z/7, which she feels define its character.\n\nFurther inspiration came from Bell Shakespeare's versatile Hotspur font and modular typography examples from the Letterform Archive.\n\nSignificantly, these inspiring Breda displays are being phased out by the end of 2025, replaced by modern LED units. Sneddon hopes Fran Sans will foster appreciation for the imperfections that give character to our cities and lives, valuing charm over mere efficiency.",
    "chinese_title": "Fran Sans – 灵感源自旧金山轻轨显示屏的字体",
    "chinese_summary": "Fran Sans 是一款由 Emily Sneddon 设计的新型显示字体，其灵感来源于旧金山 Muni Breda 轻轨列车上独特的 LCD 面板目的地显示器。Sneddon 被它们机械化却又富有个性的特点所吸引，这些特点由 3x5 网格上的几何模块构成，体现了旧金山随处可见的实用性与魅力的独特融合。\n\n她的研究包括参观旧金山交通局（SFMTA）电子维修店，技术员 Armando Lumbad 在那里演示了列车操作员如何使用三位数字代码来激活目的地显示。她发现这些显示器是 Trans-Lite, Inc. 公司在 1999 年由工程师 Gary Wallberg 设计的。Wallberg 在设计时注重“足够性”，采用了固定分段，由此创造出虽不完美但充满魅力的字母形式，并省略了 Q 和 X 等不常用字符。\n\n这种工程驱动的简洁性启发了 Sneddon 创造 Fran Sans。她与 Dave Foster 合作，将模块化设计转化为数字字体，开发了三种样式（Solid、Tile 和 Panel）的大写字母、数字和核心标点符号。虽然有些字形并非完美符合 3x5 逻辑，Sneddon 仍保留了原设计的“非正统之处”，例如 N/零中粗斜线和 Z/7 中细斜线，她认为这些特点定义了其独特的字符。\n\n进一步的灵感来源于 Bell Shakespeare 多功能的 Hotspur 字体和 Letterform Archive 的模块化排版范例。\n\n值得注意的是，这些富有启发性的 Breda 显示器将在 2025 年底前逐步淘汰，取而代之的是现代 LED 设备。Sneddon 希望 Fran Sans 能培养人们对赋予我们城市和生活特色的“不完美”的欣赏，并倡导重视魅力而非仅仅追求效率。"
  },
  {
    "id": "46021825",
    "title": "After my dad died, we found the love letters",
    "url": "https://www.jenn.site/after-my-dad-died-we-found-the-love-letters/",
    "summary": "After her father's death, the narrator and her family discovered love letters revealing his secret life. Her parents had an arranged, unhappy marriage, and her father was often absent, fulfilling obligations without apparent joy. The narrator felt a distant connection, believing he was a sensitive man trapped by societal expectations, deprived of happiness.\n\nHowever, the narrator soon met Edward, her father's lover. Edward shared their three-year relationship story, describing a deep love that led him to move to Canada for her father. They planned to marry, with the father intending to divorce and live openly with Edward. Photos revealed a beaming, joyful man entirely unlike the \"grim, sad man\" the narrator knew.\n\nThe narrator learned her father had been closeted for nearly forty years, having known he was gay since university. This recontextualized her own coming out to him years prior, where he had offered unexpected support, encouraging her to find happiness regardless of societal norms. Edward's profound grief was evident when he visited to say goodbye to the father's ashes, creating a personal shrine and weeping more deeply than the biological family.\n\nWhile acknowledging her father's \"cowardice\" in using his wife as a shield from scrutiny, the narrator also understood the immense joy he finally found in his last three years. Her mother, however, expressed bitterness, feeling both their lives had been wasted. The story offers a poignant reflection on hidden identities, sacrifice, and the bittersweet discovery of a parent's true, unfulfilled self.",
    "chinese_title": "我爸爸去世后，我们发现了情书。",
    "chinese_summary": "父亲去世后，叙述者和家人发现了一些情书，揭示了他秘密的一生。她的父母是包办婚姻，并不幸福。父亲经常不在家，履行职责却显得毫无乐趣。叙述者与他有着疏远的联系，认为他是一个敏感的人，被社会期望所困，无法获得幸福。\n\n然而，叙述者很快见到了爱德华，她父亲的爱人。爱德华分享了他们三年的恋情故事，描述了一段深厚的爱，促使他为了她父亲搬到加拿大。他们计划结婚，父亲打算离婚并与爱德华公开生活。照片显示了一个笑容灿烂、充满喜悦的男人，与叙述者所认识的“阴沉悲伤的男人”判若两人。\n\n叙述者得知父亲隐瞒性向近四十年，从大学时期就知道自己是同性恋。这重新诠释了多年前她向他出柜的经历，当时他出人意料地给予支持，鼓励她无论社会规范如何都要追求幸福。爱德华的深切悲痛显而易见，他来告别父亲的骨灰时，布置了一个私人祭坛，哭得比父亲的亲生家人还要悲伤。\n\n叙述者承认父亲将妻子作为抵挡审视的“怯懦”行为，但也理解他在生命的最后三年里终于获得的巨大喜悦。然而，她的母亲表达了怨恨，觉得他们两人的生命都被浪费了。这个故事对隐藏的身份、牺牲以及苦乐参半地发现父母真实而未曾实现自我的过程，进行了深刻的反映。"
  },
  {
    "id": "46019817",
    "title": "Meta buried 'causal' evidence of social media harm, US court filings allege",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/meta-buried-causal-evidence-social-media-harm-us-court-filings-allege-2025-11-23/",
    "summary": "Unable to access the article link.",
    "chinese_title": "美国法院文件指控Meta掩盖了社交媒体危害的“因果”证据。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46032539",
    "title": "Shai-Hulud Returns: Over 300 NPM Packages Infected",
    "url": "https://helixguard.ai/blog/malicious-sha1hulud-2025-11-24",
    "summary": "Open source security researchers at HelixGuard have unveiled a significant supply chain attack, dubbed \"Shai-Hulud,\" which has compromised over 300 packages within the npm registry. This widespread infection poses a severe threat to developers and projects relying on these compromised dependencies.\n\nThe \"Shai-Hulud\" campaign appears to leverage malicious code injection to potentially steal sensitive information, inject further malware, or establish backdoors on infected systems. Such an extensive compromise of open-source components highlights the critical vulnerabilities inherent in software supply chains.\n\nHelixGuard's investigation underscores the urgent need for developers to audit their project dependencies, exercise caution when installing new packages, and implement robust security practices to mitigate risks. The research emphasizes the continuous vigilance required to protect against sophisticated attacks targeting the foundational elements of modern software development.",
    "chinese_title": "厄拉科斯巨虫卷土重来：超300个NPM包被感染",
    "chinese_summary": "HelixGuard的开源安全研究人员揭露了一次重大的供应链攻击，该攻击被命名为“Shai-Hulud”，已感染了npm注册表中300多个软件包。这种广泛的感染对依赖这些受感染依赖项的开发者和项目构成了严重威胁。\n\n“Shai-Hulud”行动似乎利用恶意代码注入，旨在窃取敏感信息、注入更多恶意软件或在受感染系统上建立后门。这种对开源组件的大规模破坏凸显了软件供应链中固有的关键漏洞。\n\nHelixGuard的调查强调，开发者迫切需要审计其项目依赖项，在安装新软件包时保持谨慎，并实施强大的安全实践以降低风险。该研究强调，需要持续保持警惕，以防范针对现代软件开发基础元素的复杂攻击。"
  },
  {
    "id": "46019685",
    "title": "A monopoly ISP refuses to fix upstream infrastructure",
    "url": "https://sacbear.com/xfinity-wont-fix-internet/",
    "summary": "A Sacramento resident, publishing as \"The Sacramento Bear,\" details a long-standing issue with their Xfinity internet service, characterized by consistent, predictable outages since June 2024. The monopoly ISP has reportedly refused to fix or investigate the problem.\n\nThe user experiences 6-7 outages daily, each lasting precisely 125 seconds. Over 17 months, this has amounted to over 3,300 incidents and more than 117 hours of cumulative downtime. Crucially, a neighbor experiences identical outages at the same times, indicating a widespread infrastructure problem rather than an individual equipment fault.\n\nExtensive documentation supports these claims:\n*   **Uptime Monitoring (OPNSense dpinger logs):** Shows a precise 123-127 second duration for each outage. Minute marker clustering at :29 and :44, along with peak times at noon, 3 AM, and late night, strongly suggest automated, cron-based scheduling is triggering these disruptions.\n*   **Modem DOCSIS Logs:** Reveal critical errors such as \"UCD invalid or channel unusable\" and \"SYNC Timing Synchronization failure,\" pinpointing upstream cable infrastructure issues as the root cause.\n\nDespite this compelling evidence of a scheduled, network-level failure, Xfinity has allegedly failed to escalate the issue or initiate a proper investigation.",
    "chinese_title": "垄断互联网服务提供商拒绝修复上游基础设施",
    "chinese_summary": "一位萨克拉门托居民，以“萨克拉门托之熊”的笔名发表文章，详细描述了其Xfinity互联网服务长期存在的问题，该问题自2024年6月以来表现为持续且可预测的网络中断。据报道，这家垄断性的互联网服务提供商拒绝修复或调查此问题。\n\n该用户每天经历6-7次网络中断，每次中断精确持续125秒。在过去的17个月里，这已累计超过3300次事件和超过117小时的累计停机时间。至关重要的是，一位邻居也在同一时间经历着相同的网络中断，这表明问题出在普遍的基础设施上，而非个别设备故障。\n\n大量证据支持这些说法：\n*   **在线时间监控（OPNSense dpinger日志）：** 显示每次中断的精确持续时间为123-127秒。分钟标记集中在:29和:44，加上中午、凌晨3点和深夜的峰值时间，强烈表明这些中断是由基于cron的自动化调度触发的。\n*   **调制解调器DOCSIS日志：** 揭示了“UCD无效或信道不可用”和“SYNC时序同步失败”等关键错误，指出上游电缆基础设施问题是根本原因。\n\n尽管有这些关于有计划的网络层面故障的有力证据，Xfinity据称未能升级该问题或启动适当的调查。"
  },
  {
    "id": "46036217",
    "title": "France threatens GrapheneOS with arrests / server seizure for refusing backdoors",
    "url": "https://mamot.fr/@LaQuadrature/115581775965025042",
    "summary": "The provided content is a Mastodon post from La Quadrature du Net, a French digital rights advocacy group.\n\nThe post states: \"Deux articles du Parisien hier, suivis aujourd'hui…\" (Two articles from Le Parisien yesterday, followed today…). This indicates an ongoing news development, possibly related to digital rights or government actions, that La Quadrature du Net is monitoring and discussing.\n\nHowever, the provided snippet **does not contain any information** about GrapheneOS, threats of arrests, server seizures, or refusing backdoors. The rest of the text is a technical note about enabling JavaScript to use the Mastodon web application or suggesting native apps.\n\nTherefore, based solely on the provided text, it is not possible to confirm or elaborate on the specific allegations against GrapheneOS mentioned in the title. The content only points to recent coverage in Le Parisien and a continuing discussion by La Quadrature du Net.",
    "chinese_title": "法国威胁GrapheneOS，若拒绝提供后门，将逮捕其人员或查封其服务器。",
    "chinese_summary": "所提供的内容是法国数字权利倡导组织 La Quadrature du Net 的一条 Mastodon 帖子。\n\n该帖子写道：“Deux articles du Parisien hier, suivis aujourd'hui…”（《巴黎人报》昨天有两篇文章，今天接着……）。这表明正在发生的新闻进展，可能与数字权利或政府行动有关，并且 La Quadrature du Net 正在对此进行监测和讨论。\n\n然而，所提供的片段**不包含任何关于** GrapheneOS、逮捕威胁、服务器查封或拒绝后门的信息。文本的其余部分是一段技术说明，内容关于启用 JavaScript 以使用 Mastodon 网络应用程序或建议使用原生应用程序。\n\n因此，仅凭所提供的文本，无法证实或详细阐述标题中提及的针对 GrapheneOS 的具体指控。该内容仅指出《巴黎人报》的近期报道以及 La Quadrature du Net 的持续讨论。"
  },
  {
    "id": "46028422",
    "title": "X's new country-of-origin feature reveals many 'US' accounts to be foreign-run",
    "url": "https://www.hindustantimes.com/world-news/us-news/xs-new-country-of-origin-feature-shakes-maga-and-democrat-circles-as-many-us-accounts-revealed-to-be-foreignrun-101763857104296.html",
    "summary": "X, formerly Twitter, has rolled out a new country-of-origin feature that displays an account's operating location, causing a stir among both MAGA and Democrat online communities. This feature, found by clicking the 'Joined' tab on a profile, reveals that many accounts presenting as US-based and influencing American political discourse are actually foreign-run.\n\nExamples include several prominent MAGA-aligned accounts: 'MAGA NATION' (392k followers) is based in Eastern Europe, 'Dark Maga' (15k followers) in Thailand, 'MAGA Scope' (51k followers) in Nigeria, and 'America First' (67k followers) in Bangladesh.\n\nThe trend isn't exclusive to one political side. An account named 'Ron Smith,' identifying as a \"Proud Democrat\" and \"Professional MAGA hunter\" (52k followers), operates from Kenya. 'Republicans against Trump' (978k followers), an anti-Donald Trump page, was reportedly based in Austria, though it now shows a US location, with X noting VPNs can obscure true origins. Another account, 'Mariana Times' (78k followers), posting pro-Israel content, was found to be in India.\n\nThe revelations have drawn strong reactions from US figures. Congresswoman Anna Paulina Luna highlighted \"foreign grifters\" pushing infighting, while Alexis Wilkins stated that the \"enemy is outside of the house,\" aiming to destabilize the United States. The feature has ignited widespread online debate about foreign influence and the authenticity of political narratives.",
    "chinese_title": "X的新账号来源地功能揭示许多“美国”账号实为境外运营。",
    "chinese_summary": "X，前身为推特，推出了一项新的“原籍国”功能，可显示账号的运营地点，在MAGA和民主党在线社群中都引起了轰动。该功能通过点击个人资料上的“加入时间”标签即可找到，它揭示了许多自称总部设在美国并影响美国政治话语权的账号，实际上是由外国人运营的。\n\n例如，几个著名的与MAGA结盟的账号：拥有39.2万粉丝的“MAGA NATION”位于东欧；拥有1.5万粉丝的“Dark Maga”在泰国；拥有5.1万粉丝的“MAGA Scope”在尼日利亚；拥有6.7万粉丝的“America First”在孟加拉国。\n\n这种趋势并非局限于某一政治阵营。一个名为“Ron Smith”的账号，自称是“自豪的民主党人”和“专业的MAGA猎手”（5.2万粉丝），则是在肯尼亚运营。拥有97.8万粉丝的反唐纳德·特朗普页面“Republicans against Trump”，据称最初位于奥地利，尽管现在显示美国所在地，但X指出VPN可以模糊真实来源。另一个发布亲以色列内容的账号“Mariana Times”（7.8万粉丝），被发现位于印度。\n\n这些披露引起了美国各界人士的强烈反响。国会议员安娜·保利娜·卢娜强调“外国骗子”正在煽动内斗，而亚历克西斯·威尔金斯则表示“敌人就在门外”，旨在破坏美国的稳定。这一功能引发了关于外国影响力及政治叙事真实性的广泛网络辩论。"
  },
  {
    "id": "46027833",
    "title": "Iowa City made its buses free. Traffic cleared, and so did the air",
    "url": "https://www.nytimes.com/2025/11/18/climate/iowa-city-free-buses.html",
    "summary": "Unable to access the article link.",
    "chinese_title": "艾奥瓦城公交免费了。交通顺畅了，空气也清新了。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46025721",
    "title": "Native Secure Enclave backed SSH keys on macOS",
    "url": "https://gist.github.com/arianvp/5f59f1783e3eaf1a2d4cd8e952bb4acf",
    "summary": "The article highlights a newly discovered native capability in macOS for generating and using Secure Enclave-backed SSH keys, effectively replacing third-party tools. This is achieved via `/usr/lib/ssh-keychain.dylib`, which now functions as a `SecurityKeyProvider`—a mechanism typically used for FIDO2 devices.\n\nKey generation involves the `sc_auth` command. For a biometric-protected, non-exportable key, one runs `sc_auth create-ctk-identity -l ssh -k p-256-ne -t bio`. Keys can be listed or deleted using `sc_auth list-ctk-identities` and `sc_auth delete-ctk-identity`, respectively.\n\nWhen using SSH, the \"private\" key generated is merely a reference to the Secure Enclave credential. This reference can be \"downloaded\" using `ssh-keygen -w /usr/lib/ssh-keychain.dylib -K -N \"\"`. For authentication, the `ssh` command needs to specify `SecurityKeyProvider=/usr/lib/ssh-keychain.dylib`. While a PIN prompt might appear, an empty string is acceptable if biometrics are used.\n\nAlternatively, keys can be directly added to `ssh-agent` with `ssh-add -K -S /usr/lib/ssh-keychain.dylib`. To simplify usage, setting `export SSH_SK_PROVIDER=/usr/lib/ssh-keychain.dylib` in your shell profile will make the provider default for `ssh`, `ssh-add`, and `ssh-keygen`.\n\nThe article also describes an \"exportable\" key variant (`-k p-256`), where the private key is encrypted by the Secure Enclave for backup purposes. While less secure than non-exportable keys, these can be exported via `sc_auth export-ctk-identity` and imported on other devices.",
    "chinese_title": "macOS 原生安全隔区支持的 SSH 密钥",
    "chinese_summary": "文章介绍了macOS中一项新发现的原生功能，用于生成和使用由安全隔区（Secure Enclave）支持的SSH密钥，有效取代了第三方工具。这一功能通过`/usr/lib/ssh-keychain.dylib`实现，该文件现在充当一个`SecurityKeyProvider`——这是一种通常用于FIDO2设备的机制。\n\n密钥生成涉及`sc_auth`命令。要生成受生物识别保护的不可导出密钥，可运行命令`sc_auth create-ctk-identity -l ssh -k p-256-ne -t bio`。可以使用`sc_auth list-ctk-identities`列出密钥，使用`sc_auth delete-ctk-identity`删除密钥。\n\n使用SSH时，生成的“私钥”仅是对安全隔区凭证的一个引用。可以使用`ssh-keygen -w /usr/lib/ssh-keychain.dylib -K -N \"\"`“下载”此引用。为了进行身份验证，`ssh`命令需要指定`SecurityKeyProvider=/usr/lib/ssh-keychain.dylib`。虽然可能会出现PIN码提示，但如果使用生物识别技术，输入空字符串即可。\n\n此外，密钥也可以直接通过`ssh-add -K -S /usr/lib/ssh-keychain.dylib`添加到`ssh-agent`中。为了简化使用，在您的shell配置文件中设置`export SSH_SK_PROVIDER=/usr/lib/ssh-keychain.dylib`，将使该提供程序成为`ssh`、`ssh-add`和`ssh-keygen`的默认提供程序。\n\n文章还描述了一种“可导出”的密钥变体（使用`-k p-256`参数），其中私钥由安全隔区加密以用于备份。虽然不如不可导出密钥安全，但可以通过`sc_auth export-ctk-identity`导出并在其他设备上导入。"
  },
  {
    "id": "46017175",
    "title": "Show HN: Forty.News – Daily news, but on a 40-year delay",
    "url": "https://forty.news",
    "summary": "Forty.News is an innovative online news service that distinguishes itself by delivering daily news with a significant 40-year delay. Introduced as a \"Show HN\" project, the platform offers users a unique historical perspective: instead of current events from today, it presents headlines and stories that originally broke exactly four decades ago.\n\nThe core concept is to provide a daily dose of \"news\" from the past, allowing readers to engage with historical events as if they were unfolding in the present. This approach offers a fascinating lens through which to observe the evolution of global affairs, technology, culture, and societal concerns over time. By presenting history as contemporary news, Forty.News encourages reflection on how past developments have shaped the present and provides a distinct way to analyze long-term trends and the enduring nature of certain issues. It aims to offer a fresh perspective on the continuous cycle of news and the passage of time.",
    "chinese_title": "Forty.News – 每日新闻，却有四十年滞后",
    "chinese_summary": "Forty.News 是一个创新的在线新闻服务，其独特之处在于它以长达40年的延迟发布每日新闻。该平台作为一个“Show HN”项目推出，为用户提供独特的历史视角：它不提供当天的时事，而是呈现四十年前发生的头条新闻和故事。\n\n其核心理念是每天提供一份来自过去的“新闻”，让读者能够像亲身经历当前事件一样地参与历史事件。这种方法提供了一个引人入胜的视角，通过它我们可以观察全球事务、科技、文化和社会关注点随时间的演变。通过将历史呈现为当代新闻，Forty.News 鼓励人们反思过去的发展如何塑造了现在，并提供了一种独特的方式来分析长期趋势和某些问题的持久性。它旨在就新闻的持续循环和时间的流逝提供一个全新的视角。"
  },
  {
    "id": "46024184",
    "title": "Court filings allege Meta downplayed risks to children and misled the public",
    "url": "https://time.com/7336204/meta-lawsuit-files-child-safety/",
    "summary": "A newly unsealed court filing in a major lawsuit against social media companies alleges Meta knowingly downplayed risks to children and misled the public and Congress. The brief, part of a multidistrict litigation involving over 1,800 plaintiffs, claims Meta prioritized growth over user safety, leading to significant harm for young users.\n\nKey allegations against Meta include:\n*   **Tolerance for Sex Trafficking:** Instagram's former head of safety testified the platform had a \"17x\" strike policy for sex trafficking accounts (16 violations before suspension) and no simple way to report child sexual abuse material (CSAM). Meta disputes this, stating it removes such accounts immediately.\n*   **Concealed Harmful Research:** Meta allegedly hid internal studies showing its platforms exacerbated teen anxiety and depression, then told Congress it couldn't determine such correlations.\n*   **Resisted Safety Features:** Despite internal recommendations to make teen accounts private by default to prevent adult strangers from contacting minors, executives reportedly delayed implementation for years, fearing a reduction in user engagement. This led to billions of \"inappropriate interactions with children.\" Meta only rolled out default privacy for all teen accounts in 2024.\n*   **Aggressive Targeting of Young Users:** Meta allegedly aggressively pursued young users, including those under 13, despite federal law and its own policies, to maintain growth.\n\nMeta \"strongly disagrees\" with the allegations, calling them \"cherry-picked\" and \"misinformed.\" The company states it has made \"real changes to protect teens,\" citing features like Instagram Teen Accounts, which offer built-in protections. However, plaintiffs argue these safety changes were resisted for years.",
    "chinese_title": "法院文件指控Meta淡化对儿童的风险并误导公众。",
    "chinese_summary": "针对社交媒体公司的重大诉讼中，一份最新公开的法庭文件指控Meta公司明知故犯地淡化对儿童的风险，并误导了公众和国会。这份文件是涉及1800多名原告的多区诉讼的一部分，声称Meta将增长置于用户安全之上，导致年轻用户受到严重伤害。\n\n对Meta的主要指控包括：\n*   **容忍性贩卖：** Instagram前安全主管作证称，该平台对性贩卖账户实行“17次”打击政策（即需16次违规后才会被暂停），并且没有简便的方法举报儿童性虐待材料（CSAM）。Meta对此提出异议，称其会立即删除此类账户。\n*   **隐瞒有害研究：** 据称Meta隐瞒了内部研究，这些研究表明其平台加剧了青少年的焦虑和抑郁，随后却告知国会无法确定这种关联。\n*   **抵制安全功能：** 尽管内部建议将青少年账户默认设置为私密，以防止成年陌生人联系未成年人，但据报道，高管们却拖延了数年才实施，担心用户参与度下降。这导致了数十亿次“与儿童的不当互动”。Meta直到2024年才为所有青少年账户推出了默认隐私设置。\n*   **积极吸引年轻用户：** 据称Meta为了维持增长，积极吸引年轻用户，包括13岁以下的用户，尽管这违反了联邦法律和其自身政策。\n\nMeta“强烈不同意”这些指控，称其是“断章取义”和“信息不实”的。该公司表示已“为保护青少年做出了真正的改变”，并列举了Instagram青少年账户等提供内置保护的功能。然而，原告们则认为这些安全改进曾被抵制多年。"
  },
  {
    "id": "46023013",
    "title": "Shaders: How to draw high fidelity graphics with just x and y coordinates",
    "url": "https://www.makingsoftware.com/chapters/shaders",
    "summary": "The article \"Shaders: How to draw high fidelity graphics with just x and y coordinates\" explains that shaders are small, powerful programs run on the GPU, fundamental to rendering high-fidelity graphics. Historically, CPUs rendered graphics slowly, pixel by pixel. Modern GPUs, however, excel at parallel processing, enabling simultaneous operations on vast amounts of data—perfect for graphics.\n\nShaders fit into a graphics pipeline, primarily consisting of two types. The **vertex shader** processes individual vertices, transforming their 3D coordinates into 2D screen positions. After the GPU's rasterizer determines which pixels form the geometry, the **fragment (or pixel) shader** takes over.\n\nThe fragment shader is crucial for calculating the final color of each pixel. This is where complex visual effects—such as lighting, textures, shadows, and reflections—are applied, transforming simple geometry into richly detailed imagery. Shaders accept various inputs: per-vertex attributes (like position and color), uniform data (constants for a draw call, like camera matrices), and textures.\n\nWritten in languages like GLSL (OpenGL Shading Language), shaders grant developers and artists precise control over how objects look. They leverage the GPU's immense parallel processing power to convert basic geometry and mathematical rules into the breathtaking, real-time visual fidelity characteristic of modern graphics.",
    "chinese_title": "着色器：如何仅用X和Y坐标绘制高保真图形",
    "chinese_summary": "文章《着色器：如何仅用x和y坐标绘制高保真图形》解释道，着色器是在GPU上运行的小巧而强大的程序，是渲染高保真图形的基础。历史上，CPU以逐像素的方式缓慢渲染图形。然而，现代GPU擅长并行处理，能够同时对大量数据进行操作——这非常适合图形处理。\n\n着色器融入图形渲染管线中，主要包含两种类型。**顶点着色器**处理单个顶点，将其3D坐标转换为2D屏幕位置。在GPU的栅格化器确定哪些像素构成几何图形后，**片段（或像素）着色器**接管后续处理。\n\n片段着色器对于计算每个像素的最终颜色至关重要。正是在这里，应用了复杂的视觉效果——如光照、纹理、阴影和反射——将简单的几何图形转化为细节丰富的图像。着色器接受各种输入：逐顶点属性（如位置和颜色）、统一数据（每次绘制调用中的常量，如相机矩阵）以及纹理。\n\n着色器用GLSL（OpenGL着色语言）等语言编写，赋予开发者和艺术家对物体外观的精确控制。它们利用GPU强大的并行处理能力，将基本的几何图形和数学规则转换为现代图形所特有的令人惊叹的实时视觉保真度。"
  },
  {
    "id": "46027216",
    "title": "µcad: New open source programming language that can generate 2D sketches and 3D",
    "url": "https://microcad.xyz/",
    "summary": "µcad (Microcad) is a new open-source programming language designed to generate 2D sketches and 3D objects. Though still in its early developmental stages, it is becoming increasingly stable with weekly additions. The project's website serves as a blog to provide updates on its latest advancements. Recent highlights include the Alpha Release 0.2.14, a multi-part Spirograph creation, and live coding videos demonstrating the generation of Lego Bricks and Gears.",
    "chinese_title": "µcad: 新开源编程语言，可生成二维草图和三维模型",
    "chinese_summary": "µcad (Microcad) 是一种旨在生成2D草图和3D对象的新型开源编程语言。尽管仍处于早期开发阶段，但随着每周的更新，它正变得越来越稳定。该项目的网站兼作博客，发布其最新进展。最近的亮点包括Alpha版本0.2.14、一个多部件万花尺创作，以及演示乐高积木和齿轮生成的实时编码视频。"
  },
  {
    "id": "46024773",
    "title": "Calculus for Mathematicians, Computer Scientists, and Physicists [pdf]",
    "url": "https://mathcs.holycross.edu/~ahwang/print/calc.pdf",
    "summary": "This PDF content reveals the detailed table of contents for a textbook titled \"Calculus for Mathematicians, Computer Scientists, and Physicists.\" The book provides a comprehensive and rigorous treatment of calculus, starting with foundational mathematical principles.\n\nEarly chapters establish a strong base, covering \"The Language of Mathematics\" (sets, logic), \"Numbers\" (natural, integers, rational, real, complex), \"Functions\" (definitions, classes, operations), and an in-depth exploration of \"Limits and Continuity.\" The text then transitions to the core concepts of calculus, including the fundamental ideas of \"Rates of Change\" and \"Total Change,\" \"Integration\" (partitions, properties, improper integrals), and \"Differentiation\" (derivatives, local behavior, higher derivatives).\n\nSubsequent chapters delve into crucial theorems such as \"The Mean Value Theorem\" and \"The Fundamental Theorems\" that link integration and differentiation. Advanced topics cover \"Sequences of Functions\" (convergence, series, power series), detailed discussions of \"Log and Exp\" functions, \"The Trigonometric Functions,\" and methods of \"Taylor Approximation.\" The book concludes with \"Elementary Functions,\" offering a short course in complex analysis and elementary antidifferentiation, followed by a postscript, bibliography, and index. The structure indicates a methodical progression from elementary building blocks to advanced calculus topics and applications relevant to its diverse target audience.",
    "chinese_title": "数学家、计算机科学家和物理学家的微积分 [pdf]",
    "chinese_summary": "本PDF文档展示了一本名为《面向数学家、计算机科学家和物理学家的微积分》的教材的详细目录。该书从基础数学原理开始，对微积分进行了全面而严谨的论述。\n\n早期章节奠定了坚实的基础，涵盖了“数学语言”（集合、逻辑）、“数”（自然数、整数、有理数、实数、复数）、“函数”（定义、分类、运算），并深入探讨了“极限与连续性”。随后，教材转入微积分的核心概念，包括“变化率”和“总变化量”、“积分”（分割、性质、反常积分）、以及“微分”（导数、局部行为、高阶导数）等基本思想。\n\n随后的章节深入探讨了诸如“中值定理”以及联结积分与微分的“基本定理”等关键定理。高级主题涵盖了“函数序列”（收敛性、级数、幂级数）、对“对数与指数函数”的详细讨论、“三角函数”以及“泰勒近似”方法。该书以“初等函数”作结，提供了复分析和初等不定积分的简要课程，之后是附言、参考文献和索引。这种结构表明了从基本构建模块到高级微积分主题以及与其多样化目标受众相关的应用的循序渐进的进展。"
  },
  {
    "id": "46035533",
    "title": "Shai Hulud launches second supply-chain attack",
    "url": "https://www.aikido.dev/blog/shai-hulud-strikes-again-hitting-zapier-ensdomains",
    "summary": "The \"Shai Hulud\" npm worm has launched its \"Second Coming\" supply-chain attack on November 24, 2025, just weeks before npm's December 9 deadline for revoking classic tokens. This follows earlier attack waves in August and September.\n\nNamed after the giant sandworms from Dune, Shai Hulud is a self-replicating worm that infects developer environments. Its primary functions include searching for exposed secrets like API keys and tokens using TruffleHog, publishing them to public GitHub repositories, and propagating itself by pushing new copies to npm.\n\nThe \"Second Coming\" variant introduces several key differences: it installs and uses Bun to execute its malicious payload (`bun_environment.js`), creates randomly named GitHub repositories for stolen data, targets up to 100 npm packages (compared to 20 previously), and if GitHub or npm authentication fails, it wipes the user's Home directory.\n\nThis attack has compromised 492 npm packages, affecting major entities like Zapier, ENS, AsyncAPI, PostHog, and Postman. These packages collectively account for 132 million monthly downloads. The malware has already exposed secrets from 26,300 GitHub repositories. Analysis also indicates community spread, with some compromised packages containing only the initial staging code (`setup_bun.js`) but not the full worm.",
    "chinese_title": "沙虫发起第二次供应链攻击",
    "chinese_summary": "“沙丘蠕虫”（Shai Hulud）npm蠕虫已于2025年11月24日发起其“第二次降临”供应链攻击，这距离npm于12月9日撤销经典令牌的截止日期仅剩数周。此前，该蠕虫已在8月和9月发动过攻击。\n\nShai Hulud以《沙丘》中的巨型沙虫命名，是一种自我复制的蠕虫，专门感染开发环境。其主要功能包括：使用TruffleHog搜索API密钥和令牌等暴露的秘密信息；将这些信息发布到公共GitHub存储库；并通过将新副本推送到npm来传播自身。\n\n“第二次降临”变体引入了几个关键差异：它安装并使用Bun来执行其恶意负载（`bun_environment.js`）；为被盗数据创建随机命名的GitHub存储库；目标npm包数量增加到100个（之前为20个）；以及如果GitHub或npm认证失败，它会擦除用户的Home目录。\n\n此次攻击已导致492个npm包被入侵，影响了Zapier、ENS、AsyncAPI、PostHog和Postman等主要实体。这些包每月总下载量达1.32亿次。该恶意软件已从26,300个GitHub存储库中暴露了秘密信息。分析还表明存在社区传播，一些受感染的包仅包含初始阶段代码（`setup_bun.js`），而非完整的蠕虫。"
  },
  {
    "id": "46023460",
    "title": "Racket v9.0",
    "url": "https://blog.racket-lang.org/2025/11/racket-v9-0.html",
    "summary": "Racket v9.0 was released on November 22, 2025, announced by Stephen De Gabrielle and John Clements. This major update's headline feature is the introduction of Parallel Threads, significantly enhancing Racket's concurrency model beyond its existing green threads, futures, and places.\n\nNew features include creating parallel threads with the `#:pool` argument and recording thread results using `#:keep 'results` for retrieval with `thread-wait`. A `black-box` wrapper is added to prevent compiler optimizations, aiding benchmark accuracy. The `decompile-linklet` function can now map linklets to s-expressions. For BC Racket, `processor-count` will consistently return the parallel count.\n\nOther enhancements include the distribution of \"natipkg\" packages for AArch64, improved Check Syntax tracking of deeply nested identifiers, and the addition of Weibull distributions to the math library. The release also incorporates many other repairs and documentation improvements.\n\nThe Racket team extends gratitude to numerous contributors, highlighting its community-developed open-source nature and inviting new contributors. Feedback and discussion are welcomed on Discourse and Discord, and users are encouraged to help promote the release. Racket 9.0 is available for download at `https://download.racket-lang.org/`, with full details on the Racket blog.",
    "chinese_title": "Racket 9.0",
    "chinese_summary": "Racket v9.0 已于 2025 年 11 月 22 日发布，由 Stephen De Gabrielle 和 John Clements 宣布。此次重大更新的亮点功能是引入了“并行线程”（Parallel Threads），显著增强了 Racket 的并发模型，超越了其现有的绿色线程（green threads）、期物（futures）和场所（places）。\n\n新功能包括使用 `#pool` 参数创建并行线程，以及使用 `#keep 'results` 记录线程结果，以便通过 `thread-wait` 进行检索。新增了一个 `black-box` 包装器，用于阻止编译器优化，从而提高基准测试的准确性。`decompile-linklet` 函数现在可以将 linklets 映射到 s-expressions。对于 BC Racket，`processor-count` 将始终返回并行计数。\n\n其他增强功能包括为 AArch64 分发 \"natipkg\" 包，改进了 Check Syntax 对深度嵌套标识符的跟踪，并在数学库中添加了威布尔分布（Weibull distributions）。此次发布还包含了许多其他修复和文档改进。\n\nRacket 团队向众多贡献者表示感谢，强调了其社区开发开源的本质，并邀请新的贡献者加入。欢迎在 Discourse 和 Discord 上提供反馈和进行讨论，并鼓励用户帮助推广此次发布。Racket 9.0 可在 `https://download.racket-lang.org/` 下载，完整详情请查阅 Racket 博客。"
  },
  {
    "id": "46029932",
    "title": "RuBee",
    "url": "https://computer.rip/2025-11-22-RuBee.html",
    "summary": "RuBee is a specialized personal area networking protocol developed by Visible Assets Inc. (VAI), founded by John K. Stevens to address cold chain logistics challenges for temperature-sensitive medical samples. Unlike conventional RFID or Bluetooth, RuBee utilizes active, battery-powered tags operating at a low frequency (131 kHz) and communicating via near-field magnetic coupling.\n\nThis unique technical path offers distinct advantages: a range of up to 30 meters and, critically, strong resistance to shielding by metal or water—common problems that plague UHF RFID in scenarios like metallic containers, damp goods, or items carried on a person.\n\nWhile initially intended for healthcare, RuBee found its most compelling application in tracking \"high-value goods,\" particularly firearms and explosives. Its ability to be embedded directly into weapons and read reliably through metal cases or when carried close to the body is invaluable for security. Active, microcontroller-equipped tags can even log data like shot counts for maintenance, though VAI carefully markets this due to political sensitivities surrounding \"smart guns.\"\n\nRuBee has gained military approval for direct attachment to ordnance (\"zero separation distance\") and is notably adopted by highly regulated institutional security forces, such as those at Department of Energy (DoE) and nuclear facilities. These well-funded entities leverage RuBee for its unparalleled reliability in stringent asset visibility and accountability applications where traditional wireless technologies fall short.",
    "chinese_title": "儒比",
    "chinese_summary": "RuBee是由约翰·K·史蒂文斯创立的Visible Assets Inc. (VAI) 开发的一种专用个人区域网络协议，旨在解决对温度敏感的医疗样本的冷链物流挑战。与传统的RFID或蓝牙不同，RuBee使用有源、电池供电的标签，在低频（131 kHz）下运行，并通过近场磁耦合进行通信。\n\n这种独特的技术路径具有显著优势：其作用范围可达30米，更重要的是，它对金属或水的屏蔽有很强的抵抗力——这些是超高频RFID在金属容器、潮湿货物或随身携带物品等场景中常遇到的问题。\n\n尽管最初是为医疗保健设计的，但RuBee在其最具说服力的应用中找到了定位，即追踪“高价值商品”，特别是枪支和爆炸物。它能够直接嵌入武器中，并能可靠地穿透金属外壳或在贴身携带时被读取，这对安全来说是无价的。有源、配备微控制器的标签甚至可以记录射击次数等数据以进行维护，尽管VAI因围绕“智能枪支”的政治敏感性而对此进行了谨慎的市场推广。\n\nRuBee已获得军方批准，可直接附着于弹药（“零分离距离”），并被高度管制的机构安保部队广泛采用，例如美国能源部（DoE）和核设施的安保人员。这些资金充足的实体利用RuBee在严格的资产可见性和可追溯性应用中无与伦比的可靠性，而传统无线技术在这些方面往往力不从心。"
  },
  {
    "id": "46017972",
    "title": "Terence Tao: At the Erdos problem website, AI assistance now becoming routine",
    "url": "https://mathstodon.xyz/@tao/115591487350860999",
    "summary": "The article highlights an observation by renowned mathematician Terence Tao, who stated on Mathstodon that \"AI assistance\" is \"now becoming routine\" at the Erdos problem website. This indicates a significant and growing integration of artificial intelligence in tackling mathematical problems, particularly those associated with the prolific mathematician Paul Erdos. The additional text in Chinese provides technical instructions for using the Mastodon web application, requiring JavaScript, and is unrelated to Tao's core message about AI's role in mathematics.",
    "chinese_title": "陶哲轩：在埃尔德什问题网站上，AI辅助现在已成为常态。",
    "chinese_summary": "该文章指出，著名数学家陶哲轩在Mathstodon上表示，在Erdos问题网站上，“AI辅助”现已“成为常态”。这表明人工智能在解决数学问题方面，尤其是与多产数学家保罗·埃尔德什相关的那些问题上，正日益显著且广泛地融入。而附带的中文文本则提供了使用Mastodon网络应用程序的技术说明，要求使用JavaScript，并且与陶哲轩关于人工智能在数学中作用的核心信息无关。"
  },
  {
    "id": "46026579",
    "title": "1M Downloads of Zorin OS 18",
    "url": "https://blog.zorin.com/2025/11/18/test-the-upgrade-from-zorin-os-17-to-18-and-celebrating-1-million-downloads-of-zorin-os-18/",
    "summary": "On November 18, 2025, Zorin OS announced two significant developments. Zorin OS 18 has surpassed 1 million downloads in just over a month, breaking all previous records. The release garnered widespread positive feedback from tech reviewers, including ExplainingComputers, ZDNET, XDA Developers, and PC World, who highlighted its polish, user-friendliness for Windows migrants, and overall improvements. Notably, over 78% of these downloads came from Windows users, aligning with Zorin's mission to provide a viable alternative to incumbent PC operating systems. The team expressed gratitude to its growing community.\n\nConcurrently, Zorin OS launched an early testing phase for direct upgrades from Zorin OS 17 to 18. This upgrade path is currently available for Zorin OS 17 Core, Education, and Pro users, enabling them to update their systems without reinstallation, preserving files, apps, and settings. The testing aims to gather feedback and fix bugs before a full stable release in the coming weeks. Users are advised against using this path on production machines due to potential instability and are strongly recommended to back up their data. The process involves installing updates, entering a specific command in the Terminal, and following a guide. The stable upgrade will eventually be accessible to all Zorin OS 17 users via the \"Upgrade Zorin OS\" app.",
    "chinese_title": "Zorin OS 18 下载量突破 100万",
    "chinese_summary": "2025年11月18日，Zorin OS宣布了两项重要进展。Zorin OS 18在发布一个多月后下载量突破100万，打破了所有历史记录。该版本获得了科技评论员的广泛好评，其中包括ExplainingComputers、ZDNET、XDA Developers和PC World，他们都强调了其精良的品质、对Windows迁移用户的友好性以及全面的改进。值得注意的是，超过78%的下载量来自Windows用户，这与Zorin提供现有PC操作系统可行替代方案的使命不谋而合。团队向其日益壮大的社区表达了感谢。\n\n与此同时，Zorin OS启动了从Zorin OS 17直接升级到18的早期测试阶段。该升级路径目前适用于Zorin OS 17 Core、Education和Pro用户，使他们无需重新安装即可更新系统，同时保留文件、应用程序和设置。此测试旨在收集反馈并在未来几周内发布完整稳定版之前修复错误。鉴于可能存在不稳定性，建议用户不要在生产机器上使用此路径，并强烈建议备份数据。该过程涉及安装更新、在终端中输入特定命令以及遵循指南。最终，所有Zorin OS 17用户都将可以通过“升级Zorin OS”应用程序访问稳定版升级。"
  },
  {
    "id": "46033151",
    "title": "NSA and IETF, part 3: Dodging the issues at hand",
    "url": "https://blog.cr.yp.to/20251123-dodging.html",
    "summary": "The cr.yp.to blog post \"NSA and IETF, part 3\" alleges corruption and procedural abuses within the IETF concerning post-quantum cryptography (PQ) standardization. The author criticizes IETF management for \"non-consensually ramming\" an NSA-driven \"non-hybrid\" PQ document through its process, likening it to standardizing cars without seatbelts while a safer ECC+PQ hybrid is also available.\n\nThe central conflict arose from an April 2025 \"adoption\" call for the NSA-driven document. Despite receiving 7 unequivocal oppositions against 20 supports, the working group chairs declared \"consensus.\" An IETF \"security area director\" initially supported this with inflated response numbers. The author filed a complaint, but it was repeatedly stonewalled with excuses from the Area Directors.\n\nAn escalation to the Internet Engineering Steering Group (IESG) in August 2025 also faced delays. Crucially, on November 1, 2025, the IESG quietly shifted the standard, instructing the Area Director to evaluate \"rough consensus\" instead of \"consensus.\" The AD quickly concluded that \"rough consensus\" was met.\n\nThe author highlights this as \"dodging the issues,\" arguing that the shift from \"consensus\" (a legal requirement for standards bodies) to \"rough consensus\" undermines due process. Furthermore, the AD's response failed to address the original complaint points directly, define the terms used, or reconcile conflicting statements about participation numbers, suggesting a pre-arranged attempt to legitimize a contested decision.",
    "chinese_title": "NSA和IETF，之三：避重就轻",
    "chinese_summary": "cr.yp.to 博客文章《NSA 和 IETF，第 3 部分》指控 IETF 在后量子密码学 (PQ) 标准化过程中存在腐败和程序滥用。作者批评 IETF 管理层“未经协商强行通过”一份由美国国家安全局 (NSA) 推动的“非混合型”PQ 文档，并将其比作在更安全的 ECC+PQ 混合方案也可用时，却标准化不带安全带的汽车。\n\n核心冲突源于 2025 年 4 月对这份由 NSA 推动的文档发起的“采纳”呼吁。尽管有 7 票明确反对，20 票支持，工作组主席仍宣布达成“共识”。一名 IETF“安全领域总监”最初通过夸大响应数字来支持这一决定。作者提交了投诉，但却遭到领域总监们以各种借口反复阻挠。\n\n2025 年 8 月向互联网工程指导小组 (IESG) 提出的升级请求也遭遇延误。关键是，2025 年 11 月 1 日，IESG 悄然改变了标准，指示领域总监评估“大致共识”而非“共识”。该领域总监迅速得出结论，认为“大致共识”已达成。\n\n作者强调这是一种“回避问题”的行为，认为从“共识”（标准制定机构的法律要求）转向“大致共识”损害了正当程序。此外，该领域总监的回应未能直接解决原始投诉要点、定义所用术语或调和关于参与人数的相互矛盾的说法，这表明这可能是一次预先安排好的尝试，旨在使一个有争议的决定合法化。"
  },
  {
    "id": "46029929",
    "title": "Japan's gamble to turn island of Hokkaido into global chip hub",
    "url": "https://www.bbc.com/news/articles/c8676qpxgnqo",
    "summary": "Japan is undertaking a high-stakes gamble, investing billions to transform its agricultural and tourism island of Hokkaido into a global hub for advanced semiconductors, dubbed \"Hokkaido Valley.\" This ambitious push seeks to revive Japan's chip-making industry, which has seen its global market share plummet from over 50% to just 10% since the 1980s.\n\nAt the core of this strategy is Rapidus, a new government-backed company supported by major corporations like Toyota and Sony. Rapidus has received $12 billion to build a cutting-edge \"fab\" in Chitose, Hokkaido, chosen for its infrastructure and lower earthquake risk. Partnering with IBM, Rapidus has already successfully produced a 2nm chip prototype and aims to mass-produce these ultra-thin chips by 2027, intending to differentiate itself by delivering custom chips faster than competitors.\n\nHowever, significant challenges exist. Critics point to a substantial financing gap (Rapidus needs an estimated $31.8 billion more) and the company's lack of experience in advanced chip manufacturing. Securing customers in a market dominated by TSMC and Samsung will also be difficult. Japan further grapples with a severe shortage of semiconductor engineers (an estimated 40,000 needed) and broader demographic issues affecting its national budget.\n\nDespite these hurdles, Japan's government has committed over $27 billion to the chip industry since 2020, attracting global players. TSMC is expanding in Kyushu, Micron in Hiroshima, and Samsung is building an R&D facility in Yokohama, contributing to a burgeoning \"global ecosystem.\" This massive investment is driven by surging AI demand, the need for reliable domestic supply chains, and national security concerns, representing Japan's critical bid to regain its technological prowess.",
    "chinese_title": "日本豪赌：将北海道打造成全球芯片中心",
    "chinese_summary": "日本正在进行一场豪赌，投入数十亿美元，旨在将其农业和旅游岛屿北海道打造成为全球先进半导体中心，被誉为“北海道谷”。这项雄心勃勃的举措旨在重振日本的芯片制造业，自20世纪80年代以来，该产业的全球市场份额已从50%以上骤降至仅10%。\n\n这一战略的核心是Rapidus，一家由丰田、索尼等大公司支持的新型政府背景公司。Rapidus已获得120亿美元，用于在北海道千岁市建设一座尖端晶圆厂，该地因其基础设施和较低的地震风险而被选中。Rapidus与IBM合作，已成功生产出2纳米芯片原型，目标是在2027年前量产这些超薄芯片，旨在通过比竞争对手更快地交付定制芯片来脱颖而出。\n\n然而，挑战重重。批评者指出存在巨大的资金缺口（Rapidus估计还需要318亿美元）以及公司在先进芯片制造领域缺乏经验。在由台积电和三星主导的市场中，争取客户也将十分困难。日本还面临半导体工程师严重短缺的困境（估计需要4万人），以及影响其国家预算的更广泛的人口问题。\n\n尽管存在这些障碍，自2020年以来，日本政府已向芯片产业投入超过270亿美元，吸引了全球参与者。台积电正在九州扩张，美光在广岛，三星正在横滨建设研发设施，共同构成一个蓬勃发展的“全球生态系统”。这一大规模投资是由飙升的人工智能需求、对可靠的国内供应链的需求以及国家安全考量所推动的，代表着日本重获其技术实力的关键努力。"
  },
  {
    "id": "46018292",
    "title": "Kids who own smartphones before age 13 have worse mental health outcomes: Study",
    "url": "https://abcnews.go.com/GMA/Family/kids-smartphones-age-13-worse-mental-health-outcomes/story?id=123961082",
    "summary": "A new study indicates that children, especially girls, who own smartphones before age 13 are likely to experience worse mental health outcomes as young adults. The research, which analyzed self-reported data from over 100,000 young adults (18-24), found that earlier smartphone ownership correlated with increased mental health symptoms, with outcomes deteriorating for every year of smartphone use before age 13.\n\nKey findings include lower self-image and self-worth in both boys and girls. Girls reported reduced emotional resilience and confidence, while boys felt less calm, stable, and empathetic. Alarmingly, 48% of young women who acquired smartphones by 5-6 years old reported severe suicidal thoughts, compared to 28% of those who received them at 13 or older. For young men, these figures were 31% and 20%, respectively.\n\nStudy authors linked these issues primarily to social media usage, alongside factors such as cyberbullying, poor sleep, and family relationship problems. Experts, including study author Tara Thiagarajan and social psychologist Jonathan Haidt, advocate for restricting smartphone and social media access for children until at least age 13 or even high school. They also recommend promoting digital literacy education, corporate accountability, and parents engaging in open discussions about online interactions. The American Academy of Pediatrics further advises families to follow its \"5 C's of media use\" to guide responsible digital habits.",
    "chinese_title": "研究：未满13岁拥有智能手机的孩子心理健康状况更差",
    "chinese_summary": "一项新研究表明，在13岁之前拥有智能手机的儿童，尤其是女孩，在成年后更容易出现更糟糕的心理健康问题。该研究分析了10万多名年轻人（18-24岁）的自我报告数据，发现更早拥有智能手机与心理健康症状增加相关，13岁之前每早一年使用智能手机，心理健康状况就会进一步恶化。\n\n主要发现包括男孩和女孩的自我形象和自我价值感均较低。女孩报告称情绪韧性和自信心下降，而男孩则感到更不平静、不稳定且缺乏同理心。令人震惊的是，5-6岁就获得智能手机的年轻女性中，有48%报告曾有过严重的自杀念头，而13岁或更晚获得智能手机的女性中，这一比例为28%。对于年轻男性，这些数字分别为31%和20%。\n\n研究作者主要将这些问题归因于社交媒体使用，以及网络欺凌、睡眠不足和家庭关系问题等因素。专家，包括研究作者塔拉·蒂亚加拉詹（Tara Thiagarajan）和社会心理学家乔纳森·海特（Jonathan Haidt），倡导限制儿童使用智能手机和社交媒体，至少到13岁，甚至到高中阶段。他们还建议推广数字素养教育，提高企业责任，以及家长就线上互动进行开放式讨论。美国儿科学会进一步建议家庭遵循其“媒体使用5 C原则”，以指导负责任的数字习惯。"
  },
  {
    "id": "46018380",
    "title": "WorldGen – Text to Immersive 3D Worlds",
    "url": "https://www.meta.com/en-gb/blog/worldgen-3d-world-generation-reality-labs-generative-ai-research/",
    "summary": "WorldGen is a generative AI research project from Meta's Reality Labs that aims to create immersive 3D worlds from simple text prompts. Its primary goal is to overcome the significant time and resource constraints associated with traditional 3D content creation, which often requires large teams of artists and engineers.\n\nThe system allows users to describe a desired environment, such as \"a medieval village square with a fountain and market stalls,\" and WorldGen will generate a comprehensive 3D scene. This process involves not only creating the geometric structure of the world but also applying appropriate textures, lighting, and placing relevant objects. It leverages advanced generative AI models, including large language models (LLMs) to interpret user prompts and neural networks to synthesize the 3D assets and environments.\n\nWorldGen focuses on generating vast, explorable worlds with a high degree of detail and realism, making them suitable for virtual reality (VR) and augmented reality (AR) applications. Users can also iterate on their creations, refining elements and collaborating within the generated environments. This research represents a significant step towards democratizing 3D content creation, potentially accelerating the development of the metaverse and enabling creators to build rich, immersive experiences much faster and more efficiently.",
    "chinese_title": "WorldGen – 文本生成沉浸式3D世界",
    "chinese_summary": "WorldGen是Meta Reality Labs的一个生成式人工智能研究项目，旨在通过简单的文本提示创建沉浸式3D世界。其主要目标是克服与传统3D内容创作相关的巨大时间与资源限制，传统创作通常需要庞大的艺术家和工程师团队。\n\n该系统允许用户描述一个期望的环境，例如“一个带有喷泉和市场摊位的中古村庄广场”，WorldGen将生成一个全面的3D场景。这个过程不仅涉及创建世界的几何结构，还包括应用适当的纹理、照明和放置相关对象。它利用先进的生成式人工智能模型，包括大型语言模型（LLMs）来解释用户提示，以及神经网络来合成3D资产和环境。\n\nWorldGen专注于生成具有高度细节和真实感的广阔可探索世界，使其适用于虚拟现实（VR）和增强现实（AR）应用。用户还可以对他们的创作进行迭代，在生成的环境中精炼元素并进行协作。这项研究代表了3D内容创作民主化的重要一步，有可能加速元宇宙的发展，并使创作者能够更快、更高效地构建丰富、沉浸式的体验。"
  },
  {
    "id": "46025196",
    "title": "Are consumers just tech debt to Microsoft?",
    "url": "https://birchtree.me/blog/are-consumers-just-tech-debt-to-microsoft/",
    "summary": "The author posits that Windows consumer market share is on the cusp of a significant shift, driven by three converging factors.\n\nFirstly, Microsoft increasingly neglects its consumer base, prioritizing AI, web services, and enterprise clients. The company shows little enthusiasm for consumer Windows, with its only notable recent addition, Copilot, proving unpopular, and Windows 11 changes largely ill-received. This suggests a diminishing focus on the average consumer.\n\nSecondly, a rumored affordable MacBook, expected in 2026, could significantly impact the market. Positioned at price points competitive with many Windows PCs and backed by Apple's consumer-centric approach, it could attract a broader audience.\n\nThirdly, the gaming community, which largely uses Windows out of necessity rather than passion, presents an opportunity for alternative operating systems. Valve's forthcoming Steam Machine in early 2026, building on the Steam Deck's success, promises to run Windows games effectively on Linux. If a well-optimized Linux distribution for gaming emerges, a substantial number of PC gamers may happily transition away from Windows.\n\nWhile acknowledging market inertia, the author believes these factors could collectively \"move the needle\" in consumer computing.",
    "chinese_title": "消费者对微软来说只是技术债务吗？",
    "chinese_summary": "作者认为，Windows消费者市场份额正处于重大转变的边缘，这受到三个汇合因素的驱动。\n\n首先，微软日益忽视其消费者基础，转而优先发展人工智能、网络服务和企业客户。该公司对消费者版Windows兴趣寥寥，其近期唯一值得注意的新增功能Copilot反响不佳，Windows 11的改动也大都不受待见。这表明微软对普通消费者的关注度正在下降。\n\n其次，传闻中将于2026年推出的一款平价MacBook可能会对市场产生重大影响。其定价与许多Windows电脑具有竞争力，并得益于苹果以消费者为中心的方法，它可能会吸引更广泛的受众。\n\n第三，游戏社区使用Windows主要是出于必要而非热情，这为替代操作系统提供了机会。Valve将于2026年初推出Steam Machine，该产品建立在Steam Deck的成功基础之上，有望在Linux上有效运行Windows游戏。如果出现一个针对游戏进行良好优化的Linux发行版，大量PC游戏玩家可能会乐意从Windows转向其他系统。\n\n尽管作者承认市场存在惯性，但他认为这些因素综合起来，可能会在消费者计算领域“改变局面”。"
  },
  {
    "id": "46024644",
    "title": "73% of AI startups are just prompt engineering",
    "url": "https://pub.towardsai.net/i-reverse-engineered-200-ai-startups-73-are-lying-a8610acab0d3",
    "summary": "An analysis by the author, who reverse-engineered 200 \"AI\" startups from prominent incubators like Y Combinator, reveals a significant discrepancy between perceived and actual AI innovation. The study found that a staggering 73% of these companies are essentially \"AI-Wrappers\" – businesses that primarily provide a user interface and some prompt engineering around existing large language models (LLMs) like OpenAI's GPT.\n\nThe author categorizes AI startups into three groups:\n1.  **Foundational AI (1%):** Companies developing new LLMs or generative models, requiring immense resources (e.g., OpenAI).\n2.  **AI-First (26%):** Startups building genuinely innovative products where AI is a core, proprietary component, potentially involving fine-tuning or complex algorithmic integration (e.g., Midjourney).\n3.  **AI-Wrapper (73%):** These companies offer little more than an API call to an existing LLM, adding a thin layer of business logic and a UI. Their core \"technology\" is largely prompt engineering, making them highly replicable and vulnerable to commoditization by underlying model providers.\n\nThe article cautions against the hype surrounding such wrapper businesses, suggesting they are often overvalued and lack sustainable competitive advantages. Investors and job seekers are advised to look beyond the \"AI\" label and assess whether a company offers true, defensible AI innovation or merely a temporary wrapper around readily available foundational models. The long-term viability of these wrapper startups is questioned, as the capabilities they offer could easily be integrated or provided directly by the LLM creators.",
    "chinese_title": "73% 的 AI 初创公司只是提示工程",
    "chinese_summary": "作者对来自Y Combinator等知名孵化器的200家“AI”初创公司进行逆向工程分析后发现，人们对AI创新的认知与实际情况之间存在显著差异。研究表明，高达73%的此类公司本质上是“AI封装层”（AI-Wrappers）——它们主要是围绕现有的大型语言模型（LLM），如OpenAI的GPT，提供用户界面和一些提示工程。\n\n作者将AI初创公司分为三类：\n1.  **基础AI (1%):** 开发新的大型语言模型或生成式模型的公司，需要巨额资源（例如OpenAI）。\n2.  **AI优先 (26%):** 那些将AI作为核心专有组件，构建真正创新产品的初创公司，可能涉及微调或复杂的算法集成（例如Midjourney）。\n3.  **AI封装层 (73%):** 这些公司提供的功能仅仅是对现有LLM进行API调用，并增加一层薄薄的业务逻辑和用户界面。其核心“技术”主要是提示工程，这使得它们极易被复制，并且容易受到底层模型提供商的商品化竞争威胁。\n\n文章警示人们警惕围绕此类封装层业务的炒作，指出它们往往被高估，缺乏可持续的竞争优势。建议投资者和求职者不要只看“AI”标签，而要评估一家公司是提供了真正、可防御的AI创新，还是仅仅在现成的基础模型上搭建了一个临时封装层。这些封装层初创公司的长期生存能力受到质疑，因为它们提供的功能很容易被LLM开发者直接整合或提供。"
  },
  {
    "id": "46035574",
    "title": "X Just Accidentally Exposed a Covert Influence Network Targeting Americans",
    "url": "https://weaponizedspaces.substack.com/p/x-just-accidentally-exposed-a-vast",
    "summary": "X's recommendation algorithm inadvertently exposed a vast, covert influence network targeting Americans, as detailed by Alex Karp of weaponizedspaces.substack.com. The platform's \"Who to Follow\" feature began suggesting dozens of strikingly similar accounts, many featuring AI-generated female profile pictures and generic anti-establishment bios.\n\nThese accounts, often created between 2019 and 2022, formed a highly coordinated network boasting hundreds of thousands of followers. Their primary function was to amplify specific geopolitical narratives: pro-Palestinian, anti-Israel, anti-Ukrainian, and generally pro-Russian or anti-Western foreign policy stances. The network engaged in coordinated liking, retweeting, and replying to manipulate public discourse and create an illusion of widespread support for these views.\n\nThe sophistication and scale of the operation suggest a state-backed effort, potentially linked to nations like Russia, China, or Iran, aiming to sow discord and shift public opinion in the West. The exposure ironically highlights the ongoing challenges of combating foreign influence operations on social media, even as platforms like X claim to be improving security measures.",
    "chinese_title": "X 刚刚不慎揭露了一个针对美国人的隐秘影响力网络。",
    "chinese_summary": "据weaponizedspaces.substack.com的Alex Karp详细披露，X的推荐算法无意中暴露了一个庞大、秘密的针对美国人的影响力网络。该平台的“推荐关注”功能开始推荐几十个惊人相似的账户，其中许多使用AI生成的女性头像和通用的反建制简介。\n\n这些账户通常创建于2019年至2022年之间，形成了一个高度协调的网络，拥有数十万粉丝。它们的主要功能是放大特定的地缘政治叙事：亲巴勒斯坦、反以色列、反乌克兰，以及普遍亲俄罗斯或反西方外交政策立场。该网络进行协调一致的点赞、转发和回复，旨在操纵公众舆论，并制造这些观点获得广泛支持的假象。\n\n该行动的复杂性和规模表明这是一项国家支持的努力，可能与俄罗斯、中国或伊朗等国家有关，旨在在西方播种不和，并改变公众舆论。这次曝光讽刺地突显了打击社交媒体上外国影响力行动的持续挑战，即使像X这样的平台声称正在改进安全措施。"
  },
  {
    "id": "46017782",
    "title": "Markdown is holding you back",
    "url": "https://newsletter.bphogan.com/archive/issue-45-markdown-is-holding-you-back/",
    "summary": "The article \"Markdown is Holding You Back\" argues that while Markdown is popular and easy to use, its lack of semantic structure poses significant limitations for large-scale technical documentation. Markdown's \"implicit typing\" offers flexibility but no schema or consistency guarantees, leading to issues with machine readability for search engines and AI, and making content reuse or syndication difficult due to inconsistent \"flavors\" and brittle custom extensions like MDX.\n\nThe author advocates for semantic markup, which describes the *meaning* of content, not just its appearance. This is vital for reliable content transformation (e.g., to HTML, PDF) and robust machine consumption. Alternatives offering better structure include:\n\n1.  **reStructuredText:** A plain-text markup with directives, roles, and structural semantics, foundational for Sphinx.\n2.  **AsciiDoc:** Human-readable and semantically expressive, supporting attributes, conditional content, and specific technical documentation elements.\n3.  **DocBook (XML):** An XML-based model designed for technical publishing, providing rich, hierarchical semantic tags for industrial-grade transformations and validation.\n4.  **DITA (XML):** An open, topic-based XML standard for content writing, management, and publishing, emphasizing reuse, specialization, and modular design.\n\nWhile XML formats might appear verbose, the article contends that custom semantic layers built on Markdown often incur similar complexity without the benefits of standardization and portability. The recommendation is to use Markdown for quick, short-lived documents, reStructuredText or AsciiDoc for structured developer documentation sites, and DocBook or DITA for large enterprise documentation requiring extensive reuse and multi-channel publishing. The core advice is to begin with the richest format possible and then export to simpler formats like Markdown, as adding context back is harder than stripping it out.",
    "chinese_title": "Markdown正在阻碍你",
    "chinese_summary": "文章《Markdown正在阻碍你》指出，尽管Markdown流行且易于使用，但其缺乏语义结构对大规模技术文档构成了重大限制。Markdown的“隐式类型”提供了灵活性，但没有模式或一致性保证，这导致了搜索引擎和AI的机器可读性问题，并且由于不一致的“方言”和MDX等脆弱的自定义扩展，使得内容复用或联合发布变得困难。\n\n作者提倡语义化标记，它描述的是内容的*意义*，而不仅仅是其外观。这对于可靠的内容转换（例如，转换为HTML、PDF）和强大的机器消费至关重要。提供更好结构的替代方案包括：\n\n1.  **reStructuredText：** 一种纯文本标记语言，具有指令、角色和结构化语义，是Sphinx的基础。\n2.  **AsciiDoc：** 人类可读且语义表达力强，支持属性、条件内容和特定的技术文档元素。\n3.  **DocBook (XML)：** 一种基于XML的模型，专为技术出版设计，提供丰富、层次化的语义标签，用于工业级的转换和验证。\n4.  **DITA (XML)：** 一种开放的、基于主题的XML标准，用于内容编写、管理和出版，强调复用、专业化和模块化设计。\n\n文章认为，尽管XML格式可能显得冗长，但基于Markdown构建的自定义语义层通常会带来类似的复杂性，却无法获得标准化和可移植性的优势。建议Markdown用于快速、短期文档，reStructuredText或AsciiDoc用于结构化的开发者文档网站，而DocBook或DITA用于需要大量复用和多渠道发布的大型企业文档。核心建议是从尽可能最丰富的格式开始，然后导出为Markdown等更简单的格式，因为重新添加上下文比去除上下文更困难。"
  },
  {
    "id": "46020151",
    "title": "GCC SC approves inclusion of Algol 68 Front End",
    "url": "https://gcc.gnu.org/pipermail/gcc/2025-November/247020.html",
    "summary": "The GCC Steering Committee has approved the inclusion of the Algol 68 Front End into the GCC trunk, albeit with an experimental designation and specific stipulations.\n\nThe conditions for its inclusion are:\n1.  Algol 68 will not be built by default alongside all other languages.\n2.  It will not be part of the official GCC release criteria.\n3.  Other GCC developers are permitted to decline working on issues related to the Algol 68 Front End.\n4.  The Front End will be removed if it becomes unmaintained or \"bit rots.\"\n\nTo facilitate its development, Jose E. Marchesi has been appointed as the Algol 68 front end maintainer. The committee also invited Algol 68 developers to propose concrete changes that would make it easier to maintain front ends in branches outside of the main trunk. The announcement was made by David Edelsohn.",
    "chinese_title": "GCC 指委会批准纳入 Algol 68 前端",
    "chinese_summary": "GCC 指导委员会已批准将 Algol 68 前端纳入 GCC 主干，但附带实验性指定和具体规定。\n\n其纳入的条件如下：\n1.  Algol 68 不会与其他所有语言一同默认构建。\n2.  它不会是 GCC 官方发布标准的一部分。\n3.  其他 GCC 开发者可以拒绝处理与 Algol 68 前端相关的问题。\n4.  如果该前端无人维护或“位腐烂”，它将被移除。\n\n为促进其开发，Jose E. Marchesi 已被任命为 Algol 68 前端维护者。委员会还邀请 Algol 68 开发者提出具体的变更，以使得在主干之外的分支中维护前端更为容易。此公告由 David Edelsohn 发布。"
  },
  {
    "id": "46029908",
    "title": "The Cloudflare outage might be a good thing",
    "url": "https://gist.github.com/jbreckmckye/32587f2907e473dd06d68b0362fb0048",
    "summary": "The recent Cloudflare outage, though caused by a mundane configuration error, is presented as a beneficial warning. The author argues that it exposes the critical flaw of the internet's increasing centralization and society's dangerous assumption that digital services are always available.\n\nBeyond impacting \"trivial\" services like social media, the outage affected essential daily activities, such as accessing air pumps at garages, illustrating a lack of resilience in modern infrastructure where digital failures can halt basic functions. Ironically, the internet was designed for decentralization as a resilient communication network. However, economic factors and challenges like bots have driven services towards concentrated \"citadels\" like AWS and CDNs like Cloudflare, creating single points of failure.\n\nThe article contends that such outages are a \"good thing\" because they act as crucial alerts. They should compel governments, businesses, and banks to build redundancy and resilience into their systems, providing reliable alternatives, ideally offline, when digital infrastructure fails. This situation is paralleled with how COVID-19 forced global supply chains to move from lean efficiency to diversification and slack.\n\nUltimately, the author warns that society is drifting towards an unsustainable dependency on a digital infrastructure controlled by a few key players. Future outages, bugs, or cyberattacks could expose this fragility more catastrophically. The message is clear: embrace outages as lessons, and prioritize building redundancy.",
    "chinese_title": "Cloudflare 故障或许是件好事",
    "chinese_summary": "最近的Cloudflare宕机，尽管是由一个寻常的配置错误引起的，但被视为一个有益的警示。作者认为，它暴露了互联网日益中心化的严重缺陷，以及社会对数字服务始终可用的危险假设。\n\n除了影响社交媒体等看似微不足道的服务，这次宕机还影响了基本日常活动，例如在汽车修理厂使用充气泵，揭示了现代基础设施缺乏弹性，数字故障可能使基本功能停摆。讽刺的是，互联网最初被设计为去中心化的弹性通信网络。然而，经济因素和机器人程序等挑战，已将服务推向AWS等集中式“堡垒”和Cloudflare等CDN，从而制造了单点故障。\n\n文章认为，此类宕机是“好事”，因为它们充当了关键警报。它们应促使政府、企业和银行在其系统中构建冗余和弹性，在数字基础设施失效时，提供可靠的替代方案，最好是离线方案。这种情况与新冠疫情如何迫使全球供应链从精益高效转向多元化和冗余的情况类似。\n\n最终，作者警告说，社会正在走向对少数关键参与者控制的数字基础设施的不可持续的依赖。未来的宕机、错误或网络攻击可能会更灾难性地暴露这种脆弱性。信息很明确：将宕机视为教训，并优先构建冗余。"
  },
  {
    "id": "46020543",
    "title": "Unusual circuits in the Intel 386's standard cell logic",
    "url": "https://www.righto.com/2025/11/unusual-386-standard-cell-circuits.html",
    "summary": "The Intel 386, a complex 1985 processor, adopted standard cell logic—an automated layout technique—to meet design deadlines. This method, where software places standardized circuits like inverters and gates, proved successful. However, a study of the 386's standard cell circuitry revealed several unexpected designs: large multiplexers, a non-standardly placed transistor, and \"inverters\" that functioned differently.\n\nThe chip's register control logic, complicated by x86 architecture nuances, utilized surprisingly large multiplexers built from CMOS switches rather than logic gates. These switches, sometimes augmented with inverters for amplification, select one of many inputs to handle about 17 cases for three 7-bit register control signals. These multiplexer circuits constitute a substantial portion of the standard cell area.\n\nA unique discovery was a single PMOS transistor found oddly situated between standard cell columns. The author hypothesizes this \"misplaced\" transistor was a manual bug fix, inserted to avoid the costly and time-consuming process of regenerating the entire layout on mainframe computers.\n\nMost intriguingly, some cells physically identical to inverters were not inverters. Initially confusing due to their apparent clobbering of multiplexer outputs and shorted inputs, further investigation revealed these \"fake inverters\" were actually independent NMOS and PMOS transistors. This allowed separate control, enabling them to pull an output high, low, or leave it floating, effectively serving as additional cases for a multiplexer rather than a simple inversion. Subtle physical differences, like a disconnected gate and separate input connections, differentiated them from true inverters. These findings showcase the practical ingenuity used in the 386's development.",
    "chinese_title": "Intel 386 标准单元逻辑中的异常电路",
    "chinese_summary": "Intel 386，一款复杂的1985年处理器，采用了标准单元逻辑——一种自动化布局技术——以满足设计期限。这种由软件放置标准化电路（如反相器和门）的方法被证明是成功的。然而，对386的标准单元电路进行研究后，发现了几个意想不到的设计：大型多路复用器、一个非标准放置的晶体管，以及功能不同的“反相器”。\n\n该芯片的寄存器控制逻辑因x86架构的细微差别而复杂，它出人意料地使用了由CMOS开关而非逻辑门构建的大型多路复用器。这些开关，有时辅以反相器进行放大，用于从多个输入中选择一个，以处理三个7位寄存器控制信号的约17种情况。这些多路复用器电路构成了标准单元区域的很大一部分。\n\n一个独特的发现是，在标准单元列之间发现了一个位置异常的PMOS晶体管。作者推测这个“错位”的晶体管是手动修复的一个缺陷，插入它是为了避免在大型机上重新生成整个布局所带来的昂贵且耗时的过程。\n\n最引人入胜的是，一些物理上与反相器相同的单元却并非反相器。最初，由于它们显然会破坏多路复用器输出并短路输入，这令人困惑；但进一步调查显示，这些“假反相器”实际上是独立的NMOS和PMOS晶体管。这允许独立控制，使它们能够将输出拉高、拉低或使其浮空，有效地作为多路复用器的额外情况，而非简单的反相。细微的物理差异，例如未连接的栅极和独立的输入连接，将它们与真正的反相器区分开来。这些发现展示了386开发过程中所采用的实用独创性。"
  },
  {
    "id": "46026939",
    "title": "\"Good engineering management\" is a fad",
    "url": "https://lethain.com/good-eng-mgmt-is-a-fad/",
    "summary": "The article posits that \"good engineering management\" is a transient concept, evolving as a \"fad\" driven by shifting business realities, not by inherent moral improvements. It illustrates this through historical shifts: from the late 2000s, where managers navigated organizational impedance (e.g., Yahoo), to the 2010s hypergrowth era emphasizing attracting and retaining engineers (where managers stopped coding), to the current 2020s focus on hands-on keyboard leadership in flattened organizations (post-ZIRP, AI-driven). Each era reframed prior \"ideal\" managers as outdated, often cloaking business necessities in moral tales about empowering engineers or combating bureaucracy.\n\nTo remain effective across these fads, the author proposes developing eight foundational engineering management skills, grouped into two clusters:\n*   **Core Skills (essential for all roles):** Execution, Team, Ownership, and Alignment.\n*   **Growth Skills (determining career progression):** Taste, Clarity, Navigating Ambiguity, and Working Across Timescales.\n\nWhile some skills may shift between \"core\" and \"growth\" depending on the industry fad, a broad base in all is crucial to avoid being deemed ineffective. The article also provides self-assessment questions for these skills.\n\nFinally, it emphasizes the importance of personal career management: staying energized by balancing ideal work with personally motivating activities, and making deliberate trade-offs across dimensions like pace, people, prestige, profit, and learning, to sustain a long and engaged career.",
    "chinese_title": "\"良好的工程管理\" 是一阵风",
    "chinese_summary": "文章认为，“好的工程管理”是一个转瞬即逝的概念，它随着商业现实的变化而演变，是一种“时尚潮流”，而非内在道德的提升。文章通过历史变迁对此进行阐述：从2000年代末管理者应对组织阻力（例如雅虎），到2010年代超高速增长时代强调吸引和留住工程师（管理者停止编写代码），再到当前2020年代在扁平化组织中（零利率政策后、人工智能驱动）注重亲身实践的领导力。每个时代都将之前的“理想”管理者重新定义为过时，并常常将商业必需品包装成赋能工程师或对抗官僚主义的道德故事。\n\n为了在这些潮流中保持有效性，作者提出了八项基础工程管理技能，分为两组：\n*   **核心技能（所有角色必备）：** 执行力、团队协作、主人翁精神和统一性。\n*   **成长技能（决定职业发展）：** 品味、清晰度、驾驭不确定性和跨时间尺度工作。\n\n尽管某些技能可能会根据行业潮流在“核心”和“成长”之间转换，但全面掌握所有技能对于避免被视为无效至关重要。文章还为这些技能提供了自我评估问题。\n\n最后，文章强调了个人职业管理的重要性：通过平衡理想工作与个人激励活动来保持活力，并在速度、人际关系、声望、利润和学习等维度上做出深思熟虑的权衡，以维持长期且投入的职业生涯。"
  },
  {
    "id": "46024541",
    "title": "We stopped roadmap work for a week and fixed bugs",
    "url": "https://lalitm.com/fixits-are-good-for-the-soul/",
    "summary": "The article introduces \"fixits,\" a quarterly event where a ~45-engineer organization halts regular roadmap work for a week to fix small bugs and boost developer productivity. Rules are simple: no bug should exceed two days, focusing on minor end-user issues or dev-facing improvements. A gamified system with points, a leaderboard, and t-shirt prizes fosters enthusiasm and competition.\n\nThe latest fixit yielded 189 bug fixes by 40 participants, with individuals closing a median of four bugs. Highlights included a four-year-old feature request implemented in a day, a 25-line GitHub Action significantly improving CI workflow, and an SDK integration simplified in an hour, often aided by AI.\n\nFixits offer substantial benefits: they enhance product craftsmanship and attention to detail, turning good products into great ones. For individuals, they provide the satisfying \"doing\" work often missed in senior roles, offering quick wins and a sense of accomplishment. For the team, they boost morale, foster strong collective energy, and create a vibrant, collaborative atmosphere.\n\nSuccessful fixits rely on key factors: year-round bug tagging, pre-sizing, and prioritizing bugs to ensure a productive start. A strict two-day limit prevents scope creep and maintains momentum. A critical mass of participants (around 40 in their case) amplifies the collective energy. Gamification, with coarse points and varied recognition (crucially, not linked to performance reviews), keeps it engaging. AI tools also assist in quick context switching and prototyping.\n\nWhile critics argue fixits admit to ignoring bugs or waste roadmap time, the author counters that they explicitly address underweighted \"papercut\" issues and significantly enhance product polish and long-term productivity. The concept is adaptable for smaller teams or shorter durations. Ultimately, fixits are valued for the deeply satisfying feeling of fixing things, aligning with an ethos of software craftsmanship.",
    "chinese_title": "我们停止了路线图工作一周，并修复了漏洞。",
    "chinese_summary": "这篇文章介绍了“集中修复周（fixits）”：一项每季度举行一次的活动，在一个拥有约45名工程师的组织中，团队会暂停为期一周的常规路线图工作，以修复小bug并提升开发者的生产力。规则很简单：每个bug的修复时间不应超过两天，主要关注次要的终端用户问题或面向开发者的改进。通过一个包含积分、排行榜和T恤奖品的游戏化系统，活动激发了参与者的热情和竞争。\n\n最近一次集中修复周，40名参与者共修复了189个bug，人均修复了中位数4个bug。亮点包括在一个工作日内实现了一个长达四年的功能请求，一个仅25行代码的GitHub Action显著提升了CI（持续集成）工作流程，以及一个SDK集成在一小时内被简化，这常常得益于AI的帮助。\n\n集中修复周带来了显著的好处：它们提升了产品工艺和对细节的关注，将优秀的产品打磨成卓越的产品。对个人而言，它们提供了资深职位中常被忽视的、令人满足的“动手实践”工作，带来快速的成功和成就感。对团队而言，它们能提振士气，培养强大的集体能量，并营造充满活力、协作的氛围。\n\n成功的集中修复周依赖于关键因素：全年持续进行bug标记、预估规模和优先级排序，以确保高效的启动。严格的两天时间限制能防止范围蔓延并保持势头。足够多的参与者（在他们的情况中大约40人）能够增强集体能量。游戏化机制，包括粗略的积分和多样化的认可（关键是，不与绩效评估挂钩），保持了活动的吸引力。AI工具也有助于快速的上下文切换和原型开发。\n\n尽管批评者认为集中修复周承认了对bug的忽视或浪费了路线图时间，但作者反驳说，这些活动明确解决了那些被低估的“小痛点”问题，显著提升了产品的完善度和长期生产力。这一理念也适用于更小的团队或更短的周期。归根结底，集中修复周之所以受到重视，是因为修复问题的深层满足感，这与软件工艺的精髓不谋而合。"
  },
  {
    "id": "46021179",
    "title": "Google Revisits JPEG XL in Chromium After Earlier Removal",
    "url": "https://windowsreport.com/google-revisits-jpeg-xl-in-chromium-after-earlier-removal/",
    "summary": "Google is reversing its 2020 decision to remove JPEG XL support from Chrome. Three years after citing insufficient interest, a Chrome team representative confirmed that work has restarted to integrate the advanced image format into Chromium, with intentions to ship it in Chrome once maintenance and launch requirements are met.\n\nThis change is driven by JPEG XL's adoption by other platforms like Safari and Windows 11 (via an image extension), its confirmation for use in PDF documents, and sustained demand from developers and users. Google's priority is a secure and long-term supported integration.\n\nA developer has already submitted new, \"feature complete\" code that reintroduces JPEG XL to Chromium, notably including animation support, which previous implementations lacked. While the code passes most automated tests, it's currently under review and not yet available to users.\n\nJPEG XL aims to replace traditional JPEGs by reducing file sizes without compromising visual quality, thereby potentially speeding up web page loading and reducing data usage. Although development has resumed, Google has not provided a timeline for when users can expect JPEG XL support in Chrome.",
    "chinese_title": "谷歌重新审视 Chromium 中的 JPEG XL，此前曾移除",
    "chinese_summary": "谷歌正在撤销其在2020年做出的从Chrome浏览器中移除对JPEG XL支持的决定。三年前，谷歌曾以兴趣不足为由移除此支持，而现在一位Chrome团队代表证实，将这种先进图像格式整合到Chromium的工作已重新启动，并计划一旦满足维护和发布要求，就将其集成到Chrome浏览器中。\n\n这一变化是受到多方面因素驱动的：JPEG XL已被Safari和Windows 11（通过图像扩展）等其他平台采用；其在PDF文档中的使用也已得到确认；以及开发者和用户的持续需求。谷歌的首要任务是实现安全且长期支持的集成。\n\n一位开发者已提交了新的“功能完整”代码，将JPEG XL重新引入Chromium，其中值得注意的是包含了动画支持，这是之前的实现所不具备的。尽管该代码通过了大多数自动化测试，但目前仍在审查中，尚未向用户开放。\n\nJPEG XL旨在通过在不牺牲视觉质量的前提下减小文件大小来取代传统的JPEG格式，从而有可能加快网页加载速度并减少数据使用量。尽管开发工作已恢复，但谷歌尚未提供用户何时能在Chrome中获得JPEG XL支持的具体时间表。"
  },
  {
    "id": "46020502",
    "title": "MCP Apps: Extending servers with interactive user interfaces",
    "url": "http://blog.modelcontextprotocol.io/posts/2025-11-21-mcp-apps/",
    "summary": "The Model Context Protocol (MCP) is proposing the MCP Apps Extension (SEP-1865) to standardize interactive user interfaces within MCP servers. This initiative addresses a major community request to move beyond text and structured data, which currently creates friction for visual information display and complex user input, burdening client developers and risking ecosystem fragmentation.\n\nBuilding on the success of MCP-UI and OpenAI Apps SDK, the extension introduces a standardized pattern for declaring UI resources (e.g., `ui://charts/bar-chart`), linking them to tools via metadata, and enabling bidirectional communication using the existing MCP JSON-RPC over `postMessage`.\n\nKey design decisions prioritize security and interoperability: initial support is for HTML content rendered in sandboxed iframes with restricted permissions, pre-declared templates for host review, auditable messages, and user consent for UI-initiated tool calls. The extension is optional and backward-compatible, requiring servers to provide text-only fallbacks.\n\nAuthored by maintainers from OpenAI, Anthropic, and MCP-UI creators, this proposal aims to establish a robust foundation for \"agentic app runtime,\" fostering novel interactions between AI models, users, and applications. The community is invited to review the specification and contribute to its development.",
    "chinese_title": "MCP应用：以交互式用户界面扩展服务器",
    "chinese_summary": "模型上下文协议 (MCP) 正在提议MCP应用扩展 (SEP-1865)，旨在标准化MCP服务器内部的交互式用户界面。这项倡议回应了社区一项主要请求，即超越文本和结构化数据，因为当前这些限制给视觉信息展示和复杂用户输入造成了阻碍，加重了客户端开发者的负担，并存在生态系统碎片化的风险。\n\n借鉴MCP-UI和OpenAI应用SDK的成功经验，该扩展引入了一种标准化模式，用于声明UI资源（例如，`ui://charts/bar-chart`），通过元数据将它们与工具关联，并支持利用现有的基于`postMessage`的MCP JSON-RPC进行双向通信。\n\n关键设计决策优先考虑安全性和互操作性：初步支持在沙盒iframe中渲染的、权限受限的HTML内容；用于宿主审核的预声明模板；可审计的消息；以及用户对UI发起的工具调用的同意。该扩展是可选且向后兼容的，要求服务器提供纯文本回退方案。\n\n由OpenAI、Anthropic和MCP-UI的维护者共同撰写，这项提案旨在为“智能体应用运行时”建立一个坚实的基础，促进AI模型、用户和应用之间的新颖交互。邀请社区审查该规范并为其发展做出贡献。"
  },
  {
    "id": "46019636",
    "title": "NTSB report: Decryption of images from the Titan submersible camera [pdf] (2024)",
    "url": "https://data.ntsb.gov/Docket/Document/docBLOB?ID=18741602&FileExtension=pdf&FileName=Underwater%20Camera%20-%20Specialist%27s%20Factual%20Report-Rel.pdf",
    "summary": "The provided content is a raw Portable Document Format (PDF) file, which contains binary data and cannot be directly read or summarized. Therefore, a summary of the *article* content is not possible without proper decryption and rendering of the PDF.\n\nHowever, based solely on the provided **title**:\n\n\"NTSB report: Decryption of images from the Titan submersible camera (2024)\"\n\nThis indicates an official report released in 2024 by the National Transportation Safety Board (NTSB). The report focuses on the process and findings related to the decryption of images recovered from the camera of the Titan submersible. The title suggests the document details technical aspects of data recovery and analysis concerning the submersible's visual records.",
    "chinese_title": "NTSB报告：泰坦号潜水器摄像头图像解密 (PDF) (2024)",
    "chinese_summary": "所提供的内容是一个原始的便携式文档格式（PDF）文件，它包含二进制数据，无法直接阅读或总结。因此，在未对PDF进行适当解密和渲染的情况下，无法总结*文章*内容。\n\n然而，仅根据所提供的**标题**：\n\n“NTSB 报告：泰坦号潜水器摄像机图像解密 (2024)”\n\n这表明这是美国国家运输安全委员会（NTSB）于2024年发布的一份官方报告。该报告重点介绍了从泰坦号潜水器摄像机中恢复的图像解密过程及相关发现。标题表明该文件详细说明了与潜水器视觉记录相关的数据恢复和分析的技术方面。"
  },
  {
    "id": "46035977",
    "title": "France threatens GrapheneOS with arrests / server seizure for refusing backdoors",
    "url": "https://mamot.fr/@LaQuadrature/115581775965025042",
    "summary": "The provided content is a fragment of a Mastodon post from \"La Quadrature du Net.\" It states, in French, \"Two articles from Le Parisien yesterday, followed today...\" and ends with a technical message about needing JavaScript for the Mastodon web app.\n\nCrucially, the provided text **does not contain any information** about France threatening GrapheneOS with arrests or server seizures for refusing backdoors. The content is limited to referencing previous and current articles from Le Parisien by La Quadrature du Net, without specifying their subject matter or connecting them to the dramatic claims made in the title. Therefore, based solely on the provided text, the title's claims cannot be confirmed or summarized.",
    "chinese_title": "法国威胁GrapheneOS：因拒绝后门，将面临逮捕/服务器查封",
    "chinese_summary": "这段提供的内容是来自“La Quadrature du Net”的一个Mastodon帖子片段。它用法文写道：“《巴黎人报》昨天的两篇文章，今天接着……”并以一条关于Mastodon网页应用需要JavaScript的技术消息结束。\n\n关键是，这段提供的文本**不包含任何信息**关于法国威胁GrapheneOS，如果它拒绝提供后门就将面临逮捕或服务器扣押。内容仅限于“La Quadrature du Net”提及《巴黎人报》之前和现在的文章，但没有说明其主题，也没有将其与标题中那些戏剧性的主张联系起来。因此，仅根据这段提供的文本，标题中的主张无法得到证实或总结。"
  },
  {
    "id": "46029889",
    "title": "Show HN: Stun LLMs with thousands of invisible Unicode characters",
    "url": "https://gibberifier.com",
    "summary": "The \"Gibberifier\" is a tool designed to obfuscate text for AI models by inserting invisible zero-width Unicode characters between each character of an input text. While the text remains perfectly readable and unchanged for humans, it becomes significantly longer and incomprehensible to AI.\n\nThe main goal is to prevent AI plagiarism, waste AI tokens, and obfuscate content from LLM scrapers. It's recommended for crucial parts of text, up to 500 characters, to maintain Google Docs compatibility and maximize AI disruption.\n\nTests show it effectively \"stuns\" various AI models:\n*   **ChatGPT, Gemini, and Perplexity AI** respond with confusion, ignore the characters, or produce garbled output.\n*   **Claude, Meta AI, and Grok** often crash, error out, or are completely bewildered, unable to process the obfuscated text.\n\nEven a small amount of \"gibberified\" text can block AI systems like Flint AI from grading. The tool is available on GitHub.",
    "chinese_title": "HN展示：用数千个隐形Unicode字符震惊LLM",
    "chinese_summary": "“Gibberifier”是一种工具，它通过在输入文本的每个字符之间插入不可见的零宽度Unicode字符，旨在混淆AI模型的文本。尽管文本对人类来说仍然完全可读且未改变，但对AI而言，它会变得明显更长且难以理解。\n\n其主要目标是防止AI抄袭，浪费AI令牌，并混淆来自LLM爬虫的内容。建议将其用于文本的关键部分，最多500个字符，以保持Google文档兼容性并最大限度地扰乱AI。\n\n实验表明，它能有效“震慑”各种AI模型：\n*   **ChatGPT、Gemini和Perplexity AI** 会表现出困惑，忽略这些字符，或者生成乱码输出。\n*   **Claude、Meta AI和Grok** 经常崩溃、出错，或者完全不知所措，无法处理混淆后的文本。\n\n即使少量经过“混淆化”处理的文本也能阻止Flint AI等AI系统进行评分。该工具可在GitHub上获取。"
  },
  {
    "id": "46017910",
    "title": "The Mozilla Cycle, Part III: Mozilla Dies in Ignominy",
    "url": "https://taggart-tech.com/mozilla-cycle-pt3/",
    "summary": "The author launches a scathing critique of Mozilla's latest strategic direction, arguing that the organization is actively eroding decades of goodwill and prioritizing its survival over its stated mission. The primary trigger for this condemnation is the introduction of \"AI Window\" in Firefox, which forces generative AI interaction by default, despite overwhelming negative community feedback.\n\nThe article dissects Mozilla's new strategic plan, which pivots heavily towards generative AI. Mozilla posits AI as a transformative technology, aiming to develop \"open source\" alternatives to big tech offerings and diversify revenue away from its declining search deals. Ambitious goals include all Mozilla organizations having a flagship AI product by 2028, significant non-search revenue growth, and community expansion.\n\nThe author systematically dismantles these claims, questioning the actual transformative power and trustworthiness of generative AI, and highlighting the inherent contradictions of \"open source AI\" given the copyrighted and often scraped training data for large language models. The financial and community growth targets are deemed delusional, particularly in light of user backlash and a risky investment strategy in a volatile AI market.\n\nUltimately, the author concludes that Mozilla's AI pivot is a desperate, flawed attempt at survival, based on unsound hypotheses and a betrayal of its core audience and principles, leading to its ignominious demise.",
    "chinese_title": "谋智周期，第三部：谋智蒙羞陨落",
    "chinese_summary": "作者对Mozilla最新的战略方向发起严厉批判，认为该组织正在主动侵蚀数十年来积累的商誉，并将自身生存置于其既定使命之上。此次谴责的主要导火索是Firefox中引入了“AI窗口”，该功能在社区绝大多数负面反馈的情况下，仍默认强制生成式AI交互。\n\n文章剖析了Mozilla的新战略计划，该计划严重偏向生成式AI。Mozilla将AI定位为一项变革性技术，旨在开发大型科技公司产品的“开源”替代方案，并使其收入来源摆脱日益下滑的搜索交易。其宏伟目标包括：到2028年，所有Mozilla组织都拥有一款旗舰AI产品；非搜索收入显著增长；以及社区规模的扩大。\n\n作者系统性地驳斥了这些主张，质疑生成式AI的实际变革能力和可信度，并指出考虑到大型语言模型所使用的训练数据通常受版权保护且常是抓取的，“开源AI”存在固有的矛盾。鉴于用户的强烈反对以及在波动性AI市场中采取的冒险投资策略，其财务和社区增长目标被认为是痴心妄想。\n\n最终，作者总结道，Mozilla的AI转型是一次绝望且存在缺陷的求生尝试，它基于不健全的假设，背叛了其核心受众和原则，最终将导致其可耻的灭亡。"
  },
  {
    "id": "46029772",
    "title": "We stopped roadmap work for a week and fixed bugs",
    "url": "https://lalitm.com/fixits-are-good-for-the-soul/",
    "summary": "\"Fixit weeks\" are a quarterly initiative where an organization of roughly 45 software engineers halts all regular roadmap and design work for a week. The goal is to collectively fix small bugs and improve developer productivity, focusing on issues that typically don't make it onto priority lists. Key rules include a strict two-day limit per bug and a focus on minor end-user issues or internal efficiency improvements.\n\nThe initiative employs a points system, a leaderboard, and rewards to foster friendly competition and team spirit. A recent fixit saw 189 bugs fixed by 40 participants, with a median of 4 bugs closed per person. Examples include implementing a long-standing feature request in a day, improving CI workflows, and integrating SDKs.\n\nFixits offer significant benefits:\n1.  **Product:** They enhance product craftsmanship, attention to detail, and overall quality by addressing small annoyances that users subconsciously notice.\n2.  **Individual:** Engineers regain the satisfying \"early-career\" feeling of immediate impact by directly seeing, fixing, and shipping improvements.\n3.  **Team:** Morale soars through shared effort, live updates, and friendly competition, fostering a strong collective energy.\n\nSuccessful fixits rely on preparation (pre-tagging and sizing bugs), a strict two-day fix limit to prevent scope creep, and a critical mass of participants. Gamification is effective when points are coarse, breadth of contribution is celebrated, and scores are explicitly detached from performance reviews. AI tools have also proven beneficial in reducing context-switching and accelerating fixes.\n\nDespite criticisms about pausing roadmap work or admitting bug neglect, the author argues fixits are vital. They explicitly address \"papercut\" issues that would otherwise languish, noticeably improve product polish, offer compounding productivity benefits, and provide engineers with immense satisfaction, making them \"good for the soul.\" Smaller teams can adapt the concept to shorter periods like \"fixit Fridays.\"",
    "chinese_title": "我们暂停路线图工作一周，并修复了漏洞。",
    "chinese_summary": "“修复周”是一项季度性举措，在此期间，一个约45名软件工程师组成的组织会暂停所有常规的路线图和设计工作一周。目标是集体修复小错误并提高开发者生产力，重点解决那些通常不会进入优先级列表的问题。关键规则包括每个错误修复不得超过两天，以及专注于次要的终端用户问题或内部效率提升。\n\n这项举措采用积分系统、排行榜和奖励机制，以培养友好的竞争和团队精神。最近的一次修复周活动中，40名参与者修复了189个错误，平均每人修复了4个错误。例子包括一天内实现一个长期存在的特性请求、改进CI工作流程以及集成SDK。\n\n修复周带来显著益处：\n1.  **产品方面：** 它们通过解决用户潜意识中会注意到的细微痛点，提升产品工艺、细节关注度和整体质量。\n2.  **个人方面：** 工程师通过亲眼看到、修复并交付改进，重拾入职初期那种立竿见影的满足感。\n3.  **团队方面：** 通过共同努力、实时更新和友好竞争，士气大振，培养了强大的集体凝聚力。\n\n成功的修复周依赖于充分准备（预先标记和评估错误）、严格的两天修复期限以防止范围蔓延，以及足够多的参与者。当积分粒度粗糙、贡献的广度受到鼓励且得分明确与绩效评估脱钩时，游戏化是有效的。人工智能工具也被证明有助于减少上下文切换和加速修复。\n\n尽管有人批评修复周会暂停路线图工作或承认疏于处理错误，作者认为修复周至关重要。它们明确解决了那些原本会被搁置的“小而烦”问题，显著提升产品精致度，提供复合式的生产力收益，并为工程师带来极大的满足感，可谓是“有益于心灵”。小型团队可以将其概念调整为更短的周期，例如“修复周五”。"
  },
  {
    "id": "46024032",
    "title": "Editing Code in Emacs",
    "url": "https://redpenguin101.github.io/html/posts/2025_11_23_emacs_for_code_editing.html",
    "summary": "This article outlines an Emacs setup optimized for efficient code editing, emphasizing muscle memory and minimizing keystrokes by staying on the home row. Key principles include eschewing the mouse and arrow keys, and adopting modal editing, where a \"command\" mode prioritizes navigation and manipulation over typing, which is done in \"insert\" mode.\n\nThe author uses a custom, lightweight modal system, advocating for modal editing generally (e.g., Evil, Meow). Emacs conventions are largely preserved, especially in insert mode. Leader keys (e.g., `v` for file/buffer, `k` for kill, `s` for search, `vp` for project) group related commands. Transitions are `i` to insert, `C-j` to command, with variants like `A` (insert at line end) and `d` (down list).\n\nFor vertical movement, relative line numbers and `global-hl-line-mode` are recommended. Commands like `n`/`p` (next/previous line), `r`/`t` (half-page scroll), `l`/`L` (recenter/move cursor), and `.`/`,` (defun start/end) are highlighted, often with numeric prefixes.\n\nHorizontal movement emphasizes larger syntactic units. `global-subword-mode` is recommended. `f`/`b` move by word. Moving by S-Expressions (`j`/`h` to jump over/back, `d`/`u` to jump into/out of blocks) is highly preferred over word-based movement for programming.\n\nSearching (`C-s`/`C-r`) is considered the best way to navigate significant distances. `occur` (`so`) is detailed for finding all instances of a term, with options for navigation and in-buffer editing. Registers and the mark provide temporary bookmarks for jumping to and from locations. Find and replace uses `sq` (query-replace) and `vpq` for project-wide operations. The article concludes by ranking cut/copy/paste (killing) as second in importance to movement.",
    "chinese_title": "Emacs 代码编辑",
    "chinese_summary": "这篇文章概述了一种为高效代码编辑而优化的 Emacs 配置方案，强调通过保持手指在主键盘区来培养肌肉记忆并最大程度地减少按键。核心原则包括避免使用鼠标和方向键，以及采用模态编辑：其中“命令”模式优先用于导航和操作，而打字则在“插入”模式下进行。\n\n作者使用了一个自定义的轻量级模态系统，并普遍倡导模态编辑（例如 Evil、Meow）。Emacs 的约定大部分得以保留，尤其是在插入模式下。前导键（例如 `v` 用于文件/缓冲区，`k` 用于剪切，`s` 用于搜索，`vp` 用于项目）将相关命令分组。模式切换通过 `i` 进入插入模式，`C-j` 进入命令模式，并有诸如 `A`（在行尾插入）和 `d`（向下列表）等变体。\n\n对于垂直移动，推荐使用相对行号和 `global-hl-line-mode`。强调了诸如 `n`/`p`（上/下一行）、`r`/`t`（半页滚动）、`l`/`L`（居中/移动光标）以及 `.`/`,`（函数定义起点/终点）等命令，它们通常带有数字前缀。\n\n水平移动则强调更大的语法单元。推荐使用 `global-subword-mode`。`f`/`b` 用于按单词移动。在编程中，按 S-表达式移动（`j`/`h` 用于跳过/跳回，`d`/`u` 用于跳入/跳出块）远比基于单词的移动更受青睐。\n\n搜索（`C-s`/`C-r`）被认为是远距离导航的最佳方式。文章详细介绍了 `occur` (`so`)，用于查找某个术语的所有实例，并提供导航和缓冲区内编辑的选项。寄存器和标记提供了临时书签，用于在不同位置之间跳转。查找和替换使用 `sq` (query-replace) 和 `vpq` 进行项目范围的操作。文章最后指出，剪切/复制/粘贴（killing）的重要性仅次于移动。"
  },
  {
    "id": "46022704",
    "title": "Silicon Valley startups: being evil, again and again",
    "url": "https://notesfrombelow.org/article/silicon-valley-startups-doing-evil-again-and-again",
    "summary": "Ian Wright argues that Silicon Valley startups, despite their progressive image and stated mission to \"change the world for the better\" and \"don't be evil,\" are fundamentally unethical and institutionalize theft on a global scale. He contends that SV's facade of innovation and humane workplaces masks severe local social inequalities, including poverty, homelessness, and the exploitation of \"hidden workers.\" Furthermore, the technologies produced contribute to global surveillance, manipulation, and military applications, impacts often ignored by the Valley's elite.\n\nWright identifies the root problem in the inherent structure of the capitalist firm. He describes startups as \"mini dictatorships\" where owners (venture capitalists and founders) control all aspects, from wages to profits. While owners contribute initial capital, deserving repayment and a risk premium, they demand more: ownership of the firm (equity capital).\n\nAccording to Wright, workers are the true creators of value and profit. Once the initial investment and associated risks are fully compensated, owners holding equity continue to appropriate profits *in perpetuity* without contributing further labor or capital. This \"something for nothing\" appropriation of worker-generated profits, facilitated by equity capital, is what Wright labels \"economic exploitation\" and a violation of a fair \"principle of exchange.\" He concludes that this systemic theft, baked into the organizational structure of Silicon Valley firms, makes the region a cause of dystopia rather than a pathway to utopia.",
    "chinese_title": "硅谷初创公司：屡屡作恶",
    "chinese_summary": "伊恩·赖特认为，硅谷初创企业尽管形象进步，并声称使命是“让世界变得更美好”和“不作恶”，但其本质上是不道德的，并在全球范围内将盗窃制度化。他声称，硅谷创新和人道工作场所的表象掩盖了严重的当地社会不平等，包括贫困、无家可归以及对“隐形工人”的剥削。此外，其生产的技术助长了全球监控、操纵和军事应用，而这些影响往往被硅谷精英所忽视。\n\n赖特将根本问题归结于资本主义企业的内在结构。他将初创企业描述为“迷你独裁政权”，所有者（风险投资家和创始人）控制着从工资到利润的所有方面。虽然所有者贡献了初始资本，理应获得偿还和风险溢价，但他们要求的更多：企业的股权（股本）。\n\n根据赖特的说法，工人是价值和利润的真正创造者。一旦初始投资及相关风险得到充分补偿，持有股权的所有者就会继续“永久性地”攫取利润，而无需再贡献劳动或资本。这种由股本促成的、对工人创造利润的“不劳而获”的攫取，被赖特称为“经济剥削”，并违反了公平的“交换原则”。他总结道，这种根植于硅谷企业组织结构中的系统性盗窃，使得该地区成为反乌托邦的根源，而非通往乌托邦的途径。"
  },
  {
    "id": "46033330",
    "title": "Chrome Jpegxl Issue Reopened",
    "url": "https://issues.chromium.org/issues/40168998",
    "summary": "The provided \"article\" consists solely of the title \"Chrome Jpegxl Issue Reopened\" and the content word \"Chromium.\"\n\nBased on this extremely limited information, the summary is as follows:\n\nThis entry indicates that a previously addressed or discussed issue related to the Jpegxl image format within the Chromium project (which underpins Google Chrome) has resurfaced or been brought back to attention. No further details are provided regarding the nature of the original issue, why it has been reopened, or its current status. The core information conveyed is the re-emergence of a Jpegxl-related concern within Chromium.",
    "chinese_title": "Chrome JPEGXL 议题重开",
    "chinese_summary": "所提供的“文章”仅包含标题“Chrome Jpegxl 问题重开”以及内容词“Chromium”。\n\n基于这些极其有限的信息，总结如下：\n\n此条目表明，在 Chromium 项目（Google Chrome 的基础）中，一个先前已处理或讨论过的与 Jpegxl 图像格式相关的问题已重新浮出水面或再次引起关注。没有提供关于原始问题性质、重开原因或其当前状态的进一步细节。传达的核心信息是 Chromium 中与 Jpegxl 相关的问题再次出现。"
  },
  {
    "id": "46027709",
    "title": "Several core problems with Rust",
    "url": "https://bykozy.me/blog/rust-is-a-disappointment/",
    "summary": "The author, while acknowledging C++'s numerous flaws like undefined behavior and implicit complexities, argues that Rust, despite its popularity, suffers from several fundamental issues.\n\nFirstly, **Rust's compilation is notoriously slow**, an inherent design choice driven by its generics, monomorphization, and rigorous borrow checker, making it slower than C++. This design also contributes to Rust's **high complexity**, forcing developers to grapple with low-level ownership and borrowing concepts (e.g., `Arc<Mutex<Box<T>>>`) even for high-level logic, hindering productivity and clarity.\n\nSecondly, the author questions Rust's **absolute focus on memory safety**, arguing that for many applications, occasional malfunction is preferable to a crash, citing embedded systems and a Cloudflare outage. They contend Rust achieves memory safety at the cost of reliability and developer sanity, and isn't 100% safe regardless.\n\nLastly, Rust's memory model is **subpar for mutable shared state** (e.g., GUI, databases, operating systems). Using safe concurrency primitives like `Arc<Mutex>` introduces performance penalties due to cache issues, while `unsafe` blocks undermine memory safety. This means Rust loses its core advantages for heavy mutable state applications; successful Rust projects typically rely on shared read-only state and one-way data flow.\n\nIn summary, the author concludes Rust is a \"mediocre\" language. While viable for specific non-interactive use cases with immutable data flows, its inherent slowness, complexity, and limitations with mutable state prevent it from being the universal solution it's often touted as, failing to meaningfully improve upon C++ for many real-world problems.",
    "chinese_title": "Rust 的几个核心问题",
    "chinese_summary": "作者承认C++存在诸多缺陷，例如未定义行为和隐式复杂性，但认为Rust尽管流行，却存在几个根本性问题。\n\n首先，**Rust的编译速度众所周知的慢**，这是其泛型、单态化和严格的借用检查器等固有设计选择所致，使其比C++更慢。这种设计也导致了Rust的**高复杂性**，迫使开发者即使在处理高级逻辑时，也需应对底层的所有权和借用概念（例如`Arc<Mutex<Box<T>>>`），阻碍了生产力和代码清晰度。\n\n其次，作者质疑Rust**对内存安全的绝对专注**，认为对许多应用而言，偶发性故障总比崩溃要好，并举例嵌入式系统和一次Cloudflare中断事故。他们主张Rust以可靠性和开发者心智负担为代价实现了内存安全，并且无论如何也不是100%安全的。\n\n最后，Rust的内存模型**对于可变共享状态表现不佳**（例如GUI、数据库、操作系统）。使用`Arc<Mutex>`等安全并发原语会因缓存问题而带来性能损失，而`unsafe`块则会破坏内存安全性。这意味着Rust在处理大量可变状态的应用时失去了其核心优势；成功的Rust项目通常依赖于共享只读状态和单向数据流。\n\n总之，作者认为Rust是一种“平庸”的语言。尽管它适用于特定的非交互式、具有不可变数据流的用例，但其固有的缓慢、复杂性以及对可变状态的限制，使其无法成为人们常宣传的通用解决方案，未能在许多实际问题上对C++做出有意义的改进。"
  },
  {
    "id": "46029534",
    "title": "Ego, empathy, and humility at work",
    "url": "https://matthogg.fyi/a-unified-theory-of-ego-empathy-and-humility-at-work/",
    "summary": "This article argues that empathy and humility are not just virtues but practical workplace skills crucial for career advancement and effective work, especially for developers and technical leaders. The ego, while enabling self-reflection, primarily drives constant self-justification, often subtly manifesting in technical environments through jargon, gatekeeping, or common self-serving statements. These \"ego leaks\" hinder collaboration and problem-solving.\n\nTo counteract this, the author defines empathy as the ability to gather new information by understanding others' thoughts and feelings, and humility as the capacity to allow this information to change one's behavior by resisting competitive reflexes. These are presented as essential tools for problem-solving, not weaknesses, embodying a \"be curious, not judgmental\" mindset, exemplified by Ted Lasso.\n\nPracticing empathy and humility, though challenging, builds trust and respect among colleagues, leading to more empowered teams and effective group work. It's a deliberate choice to prioritize solutions over self-justification, recognizing that every situation is \"bigger than you.\" The article concludes by encouraging readers to watch their ego and leverage empathy and humility in pursuit of information to solve problems collaboratively.",
    "chinese_title": "自我、同理心与谦逊在职场",
    "chinese_summary": "本文认为，同理心和谦逊不仅是美德，更是实用的职场技能，对于职业发展和有效工作至关重要，特别是对开发人员和技术领导者而言。自我（ego）虽然能促成自我反思，但主要驱动着持续的自我辩护，这常常在技术环境中通过行话、把持信息或常见的自利言论隐秘地表现出来。这些“自我泄露”会阻碍协作和问题解决。\n\n为此，作者将同理心定义为通过理解他人的思想和感受来获取新信息的能力，将谦逊定义为通过抵制竞争性反应，从而让这些信息改变自身行为的能力。这些被视为解决问题的必备工具，而非弱点，体现了“保持好奇，不妄加评判”的心态，正如泰德·拉索所展现的那样。\n\n践行同理心和谦逊，尽管充满挑战，却能在同事间建立信任和尊重，从而造就更赋能的团队和更有效的小组工作。这是一种有意识的选择，即优先考虑解决方案而非自我辩护，并认识到每个情境都“比你个人更重要”。文章最后鼓励读者审视自我，并利用同理心和谦逊来获取信息，从而协作解决问题。"
  },
  {
    "id": "46037637",
    "title": "Claude Opus 4.5",
    "url": "https://www.anthropic.com/news/claude-opus-4-5",
    "summary": "Anthropic released Claude Opus 4.5 on November 24, 2025, positioning it as their most intelligent and efficient model yet, excelling in coding, agents, computer use, deep research, and everyday tasks. It is immediately available on apps, API, and major cloud platforms, with a new pricing structure of $5/$25 per million tokens, significantly increasing accessibility.\n\nOpus 4.5 demonstrates state-of-the-art performance in software engineering, outperforming human candidates on challenging technical exams and leading across various coding benchmarks like SWE-bench Multilingual and Aider Polyglot. Testers and early customers consistently praise its ability to handle ambiguity, reason through tradeoffs, fix complex bugs, and execute long-horizon autonomous tasks with fewer tokens. It shows remarkable creative problem-solving, often surpassing benchmark expectations.\n\nBeyond coding, the model features enhanced vision, reasoning, and mathematics skills. Safety-wise, Opus 4.5 is highlighted as Anthropic's most robustly aligned model, with substantial improvements against prompt injection attacks.\n\nThe Claude Developer Platform now includes an \"effort\" parameter, allowing users to balance time and cost with desired capability. It also features advanced context management and memory for multi-agent systems. Product updates include an enhanced Claude Code with \"Plan Mode\" and a desktop app, continuous conversations in the Claude app, and expanded access to Claude for Chrome and Excel. Usage limits for premium users have also been increased.",
    "chinese_title": "克劳德 奥普斯 4.5",
    "chinese_summary": "Anthropic 于2025年11月24日发布了 Claude Opus 4.5，将其定位为迄今为止最智能、最高效的模型，在编码、智能体、计算机使用、深度研究和日常任务方面表现卓越。该模型已立即在应用程序、API 和主要云平台上线，并采用每百万 token 5美元/25美元的新定价结构，显著提升了可及性。\n\nOpus 4.5 在软件工程领域展现出最先进的性能，在具有挑战性的技术考试中超越人类考生，并在 SWE-bench Multilingual 和 Aider Polyglot 等各种编码基准测试中处于领先地位。测试人员和早期客户一致称赞其处理歧义、权衡推理、修复复杂错误以及以更少 token 执行长周期自主任务的能力。它展现出卓越的创造性解决问题的能力，经常超出基准预期。\n\n除了编码，该模型还具备增强的视觉、推理和数学能力。在安全性方面，Opus 4.5 被强调为 Anthropic 最稳健对齐的模型，在抵御提示注入攻击方面有显著改进。\n\nClaude 开发者平台现在包含一个“努力”参数，允许用户在时间、成本与所需能力之间取得平衡。它还具备高级上下文管理和多智能体系统内存功能。产品更新包括：增强版 Claude Code，带有“计划模式”和桌面应用程序；Claude 应用程序中的持续对话功能；以及对 Claude for Chrome 和 Excel 的扩展访问。高级用户的用量限制也已增加。"
  },
  {
    "id": "46024584",
    "title": "Mount Proton Drive on Linux using rclone and systemd",
    "url": "https://github.com/dadtronics/protondrive-linux",
    "summary": "This guide outlines how to automatically mount Proton Drive on Linux using rclone and systemd, tested on Arch Linux.\n\nThe process involves four main steps:\n1.  **Install Dependencies:** Install `fuse3` (e.g., `sudo pacman -S fuse3`) and rclone (version 1.64.0 or newer), preferably using the precompiled binary.\n2.  **Configure Proton Drive Remote:** Run `rclone config`, create a new remote named `proton` of type `protondrive`, and log in via your browser when prompted.\n3.  **Run Setup Script:** Execute the `setup-proton-mount.sh` script (provided in the full guide). This script creates the `~/ProtonDrive` mount point, generates a `systemd --user` service (`rclone-proton.mount.service`), configures FUSE for `user_allow_other` mounts, and adds your user to the `fuse` group if necessary.\n4.  **Reboot/Relog:** Log out and back in, or reboot, for `fuse` group changes to apply.\n\nThe setup enables Proton Drive to be mounted at login, uses `rclone` with `--vfs-cache-mode writes`, and includes background logging. You can verify the mount with `ls ~/ProtonDrive` and check the service status with `systemctl --user status rclone-proton.mount.service`. Troubleshooting uses `journalctl --user -u rclone-proton.mount.service`. Uninstallation involves disabling and removing the systemd service.",
    "chinese_title": "用 rclone 和 systemd 在 Linux 上挂载 Proton Drive",
    "chinese_summary": "本指南介绍了如何在Linux上使用rclone和systemd自动挂载Proton Drive，已在Arch Linux上测试。\n\n该过程主要包括四个步骤：\n1.  **安装依赖：** 安装 `fuse3` (例如 `sudo pacman -S fuse3`) 和 rclone (1.64.0或更高版本)，最好使用预编译二进制文件。\n2.  **配置Proton Drive远程：** 运行 `rclone config`，创建一个名为 `proton`、类型为 `protondrive` 的新远程，并在提示时通过浏览器登录。\n3.  **运行安装脚本：** 执行 `setup-proton-mount.sh` 脚本（完整指南中提供）。此脚本会创建 `~/ProtonDrive` 挂载点，生成一个 `systemd --user` 服务 (`rclone-proton.mount.service`)，为 `user_allow_other` 挂载配置 FUSE，并在必要时将您的用户添加到 `fuse` 组。\n4.  **重启/重新登录：** 注销并重新登录，或重启，以使 `fuse` 组的更改生效。\n\n此设置使Proton Drive能够在登录时挂载，使用带 `--vfs-cache-mode writes` 选项的 `rclone`，并包含后台日志记录。您可以通过 `ls ~/ProtonDrive` 验证挂载，并使用 `systemctl --user status rclone-proton.mount.service` 检查服务状态。故障排除可使用 `journalctl --user -u rclone-proton.mount.service`。卸载涉及禁用和移除systemd服务。"
  },
  {
    "id": "46028721",
    "title": "Doge 'doesn't exist' with eight months left on its charter",
    "url": "https://www.reuters.com/world/us/doge-doesnt-exist-with-eight-months-left-its-charter-2025-11-23/",
    "summary": "Unable to access the article link.",
    "chinese_title": "Doge “已不存在”，其特许状尚余八个月有效期。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46030613",
    "title": "Lambda Calculus – Animated Beta Reduction of Lambda Diagrams",
    "url": "https://cruzgodar.com/applets/lambda-calculus",
    "summary": "The provided \"article\" content, titled \"Lambda Calculus – Animated Beta Reduction of Lambda Diagrams,\" does not actually discuss the subject matter. Instead, the entire text consists of a technical message stating: \"JavaScript is required to use this site and many others. Consider enabling it.\"\n\nConsequently, no information, main points, or key details regarding Lambda Calculus, animated beta reduction, or lambda diagrams can be extracted or summarized from the given content. The text serves as a functional prompt about website requirements rather than an educational piece on the topic.",
    "chinese_title": "λ演算 —— Lambda图的β归约动画演示",
    "chinese_summary": "所提供的标题为“Lambda演算——Lambda图的动画化Beta归约”的“文章”内容，实际上并未讨论其主题。相反，整个文本只包含一条技术消息，内容是：“使用本网站及许多其他网站需要JavaScript。请考虑启用它。”因此，无法从给定内容中提取或总结出任何关于Lambda演算、动画化beta归约或Lambda图的信息、要点或关键细节。该文本的作用是一个关于网站要求的实用提示，而非一篇关于该主题的教育性文章。"
  },
  {
    "id": "46019760",
    "title": "Germany to classify date rape drugs as weapons to ensure justice for survivors",
    "url": "https://www.theguardian.com/society/2025/nov/21/germany-to-classify-date-drugs-as-weapons-in-attempt-to-ensure-justice-for-survivors",
    "summary": "Germany plans to classify date rape drugs as weapons to enable significantly stricter prosecutions and ensure justice for survivors of sexual assault and domestic violence. Interior Minister Alexander Dobrindt announced this measure, emphasizing it will create a basis for harsher penalties against those who use these drugs in crimes, aiming to enhance women's safety.\n\nThis initiative comes amid concerning statistics: nearly 54,000 women and girls were victims of sexual offences in Germany in 2024, a 2.1% increase, with 36% experiencing rape or sexual assault. Domestic violence also reached a record high of almost 266,000 victims in 2023, a 3.8% rise, although many cases go unreported. Holger Münch, head of the federal criminal police office, highlighted the need to encourage more victims to report crimes. Approximately 1,200 women and girls were victims of homicide or attempted homicide in 2024.\n\nBeyond reclassifying date rape drugs, Germany is implementing other measures to combat violence against women. A parliamentary bill for a mandatory minimum five-year prison sentence for using date rape drugs in sexual assaults was recently postponed. The government has also approved a draft law for electronic ankle monitors to track domestic violence perpetrators, with victims able to receive warning devices. Additionally, funding is secured for a national app allowing domestic abuse victims to secretly document incidents for court evidence. These efforts aim to improve victim protection, support, and reporting rates.",
    "chinese_title": "德国将迷奸药列为武器，为幸存者伸张正义",
    "chinese_summary": "德国计划将迷奸药归类为武器，以便能够进行更严厉的起诉，并确保性侵犯和家庭暴力受害者的正义。内政部长亚历山大·多布林特宣布了这项措施，强调这将为对那些在犯罪中使用这些药物的人处以更严厉的惩罚奠定基础，旨在提高女性安全。\n\n这一举措是在令人担忧的统计数据背景下提出的：2024年，德国近5.4万名妇女和女孩成为性犯罪受害者，增长2.1%，其中36%遭受了强奸或性侵犯。2023年，家庭暴力受害者人数也达到近26.6万人的历史新高，增长3.8%，尽管许多案件未被举报。联邦刑事警察局局长霍尔格·明奇强调需要鼓励更多受害者报案。2024年，约有1200名妇女和女孩成为凶杀案或谋杀未遂案的受害者。\n\n除了重新将迷奸药归类外，德国还在实施其他措施以打击针对女性的暴力。一项针对在性侵犯中使用迷奸药的强制性最低五年监禁的议会法案最近被推迟。政府还批准了一项关于电子脚踝监控器以追踪家庭暴力施暴者的法律草案，受害者将能够收到警报装置。此外，一项国家应用程序的资金已获保障，该程序允许家庭虐待受害者秘密记录事件以作为法庭证据。这些努力旨在改善受害者保护、支持和报案率。"
  },
  {
    "id": "46020096",
    "title": "An Economy of AI Agents",
    "url": "https://arxiv.org/abs/2509.01063",
    "summary": "This arXiv paper, \"An Economy of AI Agents,\" submitted on September 1, 2025, by Gillian K. Hadfield and Andrew Koh, explores the anticipated economic impact of advanced AI agents. The authors foresee a coming decade where artificially intelligent agents, capable of planning and executing complex, long-term tasks with minimal human oversight, will be widely deployed across the economy.\n\nThe chapter surveys recent developments and highlights critical open questions for economists. These include understanding how these AI agents will interact with humans and each other, their influence on the structure and functioning of markets and organizations, and the necessary institutional frameworks to ensure well-functioning markets in this evolving landscape. The paper touches upon General Economics, Artificial Intelligence, and Multiagent Systems.",
    "chinese_title": "AI智能体经济",
    "chinese_summary": "这篇由Gillian K. Hadfield和Andrew Koh于2025年9月1日提交的arXiv论文《AI智能体经济学》，探讨了先进AI智能体的预期经济影响。作者们预见到在未来十年中，能够以最少的人工监督规划和执行复杂的长期任务的AI智能体，将在经济领域得到广泛部署。\n\n该章节综述了近期发展，并强调了经济学家面临的关键开放性问题。这些问题包括了解这些AI智能体将如何与人类以及彼此互动，它们对市场和组织结构与运作的影响，以及在这一不断演变的格局中，确保市场良好运行所需的制度框架。该论文涉及一般经济学、人工智能和多智能体系统。"
  },
  {
    "id": "46027962",
    "title": "Show HN: I wrote a minimal memory allocator in C",
    "url": "https://github.com/t9nzin/memory",
    "summary": "This article introduces a minimal memory allocator written in C, designed for POSIX-compliant systems like Linux and macOS (not Windows). The allocator utilizes `sbrk()` for smaller memory requests and `mmap()` for larger ones. It incorporates optimizations such as block splitting to reduce fragmentation and coalescing to merge adjacent free blocks.\n\nKey limitations include its lack of thread safety, meaning concurrent calls will cause undefined behavior, and the absence of defragmentation or compaction features. While `sbrk()` is noted as deprecated on macOS, it remains functional.\n\nTo build and use the project, users need GCC and Make. Commands like `make` (to build all), `make tests`, and `make bench` are provided. For integrating the library into custom code, a static library can be built with `make lib`, and then linked to a C program.\n\nThe project structure is straightforward, with a `Makefile`, `README.md`, `examples`, `include` (for `allocator.h`), `src` (for `allocator.c`), and a `tests` directory containing basic, edge case, and benchmark tests. The project is open source under the MIT License, welcomes contributions, and was authored by @t9nzin. An accompanying blog post details the implementation, and the author credits Dan Luu's malloc tutorial as a significant reference.",
    "chinese_title": "HN展示：我用C语言写了一个极简内存分配器",
    "chinese_summary": "本文介绍了一个用C语言编写的极简内存分配器，专为Linux和macOS等POSIX兼容系统设计（不包括Windows）。该分配器对小内存请求使用`sbrk()`，对大内存请求使用`mmap()`。它整合了块分割以减少碎片和合并相邻空闲块等优化。\n\n主要限制包括其缺乏线程安全性，这意味着并发调用将导致未定义行为，以及没有碎片整理或内存压缩功能。尽管`sbrk()`在macOS上已被标记为废弃，但它仍然可用。\n\n要构建和使用该项目，用户需要GCC和Make。项目提供了`make`（构建所有）、`make tests`和`make bench`等命令。要将该库集成到自定义代码中，可以使用`make lib`构建静态库，然后将其链接到C程序。\n\n项目结构简单明了，包括`Makefile`、`README.md`、`examples`、`include`（包含`allocator.h`）、`src`（包含`allocator.c`）以及一个包含基本、边缘情况和基准测试的`tests`目录。该项目在MIT许可下开源，欢迎贡献，由@t9nzin撰写。随附的博客文章详细介绍了实现，作者将Dan Luu的malloc教程列为重要的参考资料。"
  },
  {
    "id": "46018158",
    "title": "A Reverse Engineer's Anatomy of the macOS Boot Chain and Security Architecture",
    "url": "https://stack.int.mov/a-reverse-engineers-anatomy-of-the-macos-boot-chain-security-architecture/",
    "summary": "This article dissects the macOS boot chain and security architecture on Apple Silicon, emphasizing its hardware-rooted trust. The process begins with the immutable, mask-programmed Boot ROM (SecureROM), which executes at the highest privilege (Reset Vector) to establish the initial system state. After its execution, the Boot ROM becomes un-dumpable.\n\nCentral to decryption is the hardware-fused Group ID (GID) Key, a 256-bit AES key unique to chip classes. The Boot ROM uses this GID key to unwrap a Keybag (KBAG) containing per-image AES keys, which then decrypt the Low-Level Bootloader (LLB). The GID key remains confined to hardware, preventing offline decryption of production firmware. Integrity is ensured by the Public Key Accelerator (PKA), which validates firmware signatures against an embedded Apple Root CA, utilizing glitch-resistant logic.\n\nThe \"Chip Production / Firmware Mode\" (CPFM) fuse dictates chip behavior. Production devices (CPFM 0x3) enforce full security, disable debug interfaces, and use specific GID keys. Development-fused devices (CPFM 0x0/0x1) offer relaxed security, JTAG access, custom firmware support, and distinct GID keys.\n\nBeyond standard Armv8-A, Apple extends the ISA with proprietary features like Pointer Authentication (PAC). PAC cryptographically signs pointers (code, data, generic) using five dedicated hardware keys (APIA/B, APDA/B, APGA), making memory corruption exploits that alter pointers detectable as the CPU generates a non-valid address.",
    "chinese_title": "逆向工程师剖析 macOS 启动链与安全架构",
    "chinese_summary": "本文剖析了Apple Silicon芯片上的macOS启动链和安全架构，强调其根植于硬件的信任机制。该过程始于不可变、掩膜编程的引导ROM（SecureROM），它以最高权限（重置向量）执行，以建立初始系统状态。执行后，该引导ROM变得不可转储。\n\n解密的核心是硬件熔断的组ID (GID) 密钥，这是一个256位AES密钥，特定于芯片类别。引导ROM使用此GID密钥解包包含每个镜像AES密钥的密钥包（KBAG），然后这些密钥用于解密低级引导加载程序（LLB）。GID密钥仅限于硬件，从而阻止了生产固件的离线解密。完整性由公钥加速器（PKA）确保，它利用抗毛刺逻辑验证固件签名，对照内嵌的苹果根CA。\n\n“芯片生产/固件模式”(CPFM) 熔丝决定了芯片的行为。生产设备（CPFM 0x3）强制实行全面安全，禁用调试接口，并使用特定的GID密钥。开发熔断设备（CPFM 0x0/0x1）提供宽松的安全设置、JTAG访问、自定义固件支持以及不同的GID密钥。\n\n除了标准的Armv8-A，苹果还通过指针认证（PAC）等专有功能扩展了ISA。PAC使用五个专用硬件密钥（APIA/B、APDA/B、APGA）对指针（代码、数据、通用）进行加密签名，使得更改指针的内存损坏攻击可被检测，因为CPU会生成一个无效地址。"
  },
  {
    "id": "46034652",
    "title": "Booking.com cancels $4K hotel reservation, offers same rooms again for $17K",
    "url": "https://www.cbc.ca/news/gopublic/go-public-booking-com-hotel-rates-9.6985480",
    "summary": "An Ontario woman, Erika Mann, had her confirmed $4,300 Booking.com reservation for a four-room unit at Montreal's Holland Hotel for the 2026 Formula One Grand Prix cancelled. Weeks after booking, she was told by both the hotel and Booking.com that the original price was a \"mistake\" due to a \"synchronization error\" and was subsequently offered the identical accommodations for over $17,000.\n\nMann, who had booked early and documented everything, refused to cancel or pay the new exorbitant rate. Booking.com then unilaterally cancelled her reservation. Digital rights lawyer David Fewer criticized the situation, citing weak consumer protection laws and automated pricing systems that often shift risk and costs to travellers, especially during \"event pricing.\" He argued that this was not an \"obvious error\" that should invalidate a confirmed booking and called for stronger consumer protection statutes.\n\nAfter nearly two months of Mann's unsuccessful attempts to resolve the issue, Go Public (CBC News) intervened. Booking.com, while initially defending the cancellation based on a \"genuine rate mistake\" policy, acknowledged that communication fell short. Following Go Public's inquiry, Booking.com reversed its decision, agreeing to honour Mann's original $4,300 booking and cover the significant price difference. Mann expressed relief but emphasized that media intervention shouldn't be necessary to resolve such issues. Experts advise travellers to take screenshots, confirm rates directly with hotels, and use credit cards with strong dispute policies for protection.",
    "chinese_title": "缤客取消4千美元酒店预订，再以1.7万美元提供原房",
    "chinese_summary": "安大略省女子埃里卡·曼（Erika Mann）通过Booking.com预订的、价值4,300美元的蒙特利尔荷兰酒店（Holland Hotel）四居室单元，原计划用于2026年F1大奖赛，但该预订已被取消。预订数周后，酒店和Booking.com都告知她，由于“同步错误”，原始价格是一个“错误”，随后向她提供了相同的住宿，但价格却超过17,000美元。\n\n曼女士提前预订并记录了所有相关信息，她拒绝取消预订或支付新的天价费用。Booking.com随后单方面取消了她的预订。数字权利律师大卫·费维尔（David Fewer）批评了这种情况，指出消费者保护法薄弱，以及自动化定价系统在“活动定价”期间往往将风险和成本转嫁给旅客。他认为这并非足以使已确认预订失效的“明显错误”，并呼吁制定更强的消费者保护法规。\n\n曼女士近两个月来尝试解决问题无果后，Go Public（加拿大广播公司新闻栏目）介入了此事。Booking.com最初辩称取消预订是基于“真实价格错误”政策，但承认沟通不足。在Go Public进行调查后，Booking.com撤销了其决定，同意履行曼女士最初4,300美元的预订，并承担巨大的差价。曼女士表示欣慰，但强调解决此类问题不应依赖媒体介入。专家建议旅客截图，直接与酒店确认价格，并使用具有强大争议处理政策的信用卡来保护自己。"
  },
  {
    "id": "46025933",
    "title": "Apple to focus on 'quality and underlying performance' with iOS 27 next year",
    "url": "https://9to5mac.com/2025/11/23/apple-focusing-on-software-quality-improvements-ios-27-next-year-report/",
    "summary": "Apple is reportedly shifting its focus for iOS 27 (and other major software platforms like macOS 27) towards \"quality and underlying performance\" rather than new features, according to Bloomberg's Mark Gurman. This move comes after user complaints about software quality following a dramatic \"Liquid Glass\" design overhaul and numerous feature releases in recent years.\n\nThe update is described as a \"Snow Leopard-style update,\" where engineering teams will prioritize eliminating bugs, cutting bloat, and boosting overall performance. The goal is to lay the groundwork for future hardware like foldable iPhones. While not entirely feature-free, iOS 27 will still introduce new AI capabilities to keep Apple competitive, including a rumored AI health agent (potentially with an Apple Health+ subscription) and an AI-powered web search feature. These will follow AI-infused Siri in iOS 26.4, expected to use a custom, private version of Google Gemini.\n\nOther anticipated enhancements for iOS 27 include improvements for enterprise users, tailored features for emerging markets, and design tweaks for the Liquid Glass interface. Many Apple enthusiasts have long desired an update focused purely on refining the software, making iOS 27 a potentially welcome change towards stability and polish.",
    "chinese_title": "苹果明年iOS 27将聚焦“质量与底层性能”。",
    "chinese_summary": "据彭博社的马克·古尔曼报道，苹果据称正在将iOS 27（以及macOS 27等其他主要软件平台）的重心从新功能转向“质量和底层性能”。此举是在近年经历剧烈的“液态玻璃”设计大改版和发布众多新功能后，用户对软件质量抱怨不断的情况下做出的。\n\n这次更新被描述为一次“雪豹”式的更新，工程团队将优先消除漏洞、精简冗余并提升整体性能。目标是为可折叠iPhone等未来硬件奠定基础。尽管并非完全没有新功能，iOS 27仍将引入新的AI功能以保持苹果的竞争力，其中包括传闻中的AI健康助手（可能与Apple Health+订阅服务捆绑）和一项AI驱动的网络搜索功能。这些功能将紧随iOS 26.4中融入AI的Siri之后推出，而iOS 26.4的Siri预计将使用定制的私有版Google Gemini。\n\niOS 27的其他预期增强功能包括针对企业用户的改进、为新兴市场量身定制的功能以及对“液态玻璃”界面的设计调整。许多苹果爱好者长期以来一直渴望一次纯粹专注于软件优化的更新，因此，iOS 27可能成为一个受欢迎的转变，迈向稳定性和完善性。"
  },
  {
    "id": "46022279",
    "title": "Signal knows who you're talking to (2023)",
    "url": "https://sanesecurityguy.com/articles/signal-knows-who-youre-talking-to/",
    "summary": "The article argues that Signal, despite its end-to-end encryption, fails to provide true anonymity and knows who is talking to whom. While message content is encrypted, Signal uses phone numbers as IDs and logs IP addresses. The author initially heard about \"Sealed Sender,\" a feature claiming one-way anonymity (Signal knows the recipient but not the sender).\n\nHowever, the author explains that Sealed Sender is \"useless\" for two-way communication. Even with one-way anonymity, Signal can infer communication patterns over time by observing consistent message flow between specific IP addresses and phone numbers. Crucially, Sealed Sender does not hide the sender's IP address. Signal sees the sender's IP, and even if masked by a VPN/Tor, consistent communication from that IP to a specific phone number allows identification. When a recipient replies, their IP and the sender's phone number are revealed, immediately linking the two.\n\nFurthermore, Signal's mandatory \"delivery receipts,\" which cannot be turned off, automatically create a two-way communication for every message, effectively nullifying any anonymity Sealed Sender might offer. The author questions why Signal requires phone numbers, deeming them unnecessary global identifiers for an internet-based service.\n\nAs alternatives, the article suggests Proton Mail/Tuta for text, Jitsi for voice, or Matrix/Element with caveats. The most promising, though still developing, is SimpleX, an open-source platform that requires no global identifiers, uses proxies for anonymity, and supports Tor, aiming to truly prevent the service from knowing who communicates.",
    "chinese_title": "Signal 知道你在和谁说话 (2023)",
    "chinese_summary": "文章指出，Signal 尽管有端到端加密，但未能提供真正的匿名性，并且知道谁在与谁通话。虽然消息内容经过加密，但 Signal 使用电话号码作为身份标识，并记录 IP 地址。作者最初听说了“密封发件人”（Sealed Sender），一项声称提供单向匿名性（Signal 知道收件人但不知道发件人）的功能。\n\n然而，作者解释说，“密封发件人”对于双向通信是“无用的”。即使有单向匿名性，Signal 也能通过观察特定 IP 地址和电话号码之间持续的消息流，推断出长期的通信模式。至关重要的是，“密封发件人”不隐藏发件人的 IP 地址。Signal 能看到发件人的 IP，即使通过 VPN/Tor 进行了掩盖，但如果该 IP 地址与特定电话号码之间存在持续通信，Signal 仍能识别出用户。当收件人回复时，他们的 IP 和发件人的电话号码都会被揭示，从而立即将两者关联起来。\n\n此外，Signal 强制性的“送达回执”无法关闭，这会自动为每条消息创建双向通信，从而实际上抵消了“密封发件人”可能提供的任何匿名性。作者质疑 Signal 为何要求使用电话号码，认为对于一项基于互联网的服务而言，电话号码是不必要的全球性身份标识。\n\n文章推荐的替代方案包括用于文本的 Proton Mail/Tuta，用于语音的 Jitsi，或带有注意事项的 Matrix/Element。最有前景的（尽管仍在开发中）是 SimpleX，一个无需全球身份标识、使用代理实现匿名性并支持 Tor 的开源平台，旨在真正阻止服务方知晓谁在进行通信。"
  },
  {
    "id": "46024894",
    "title": "Dark Mode Sucks",
    "url": "https://www.tomechangosubanana.com/2025/dark-mode-sucks/",
    "summary": "The article \"Dark Mode Sucks\" criticizes the modern internet's \"fetish\" with dark mode and the exaggerated rhetoric used by its proponents. The author dismisses common phrases like \"blasts my eyeballs\" or \"light of a thousand suns\" as over-the-top.\n\nThe central argument is that if \"normal mode\" (light mode) causes discomfort, the problem isn't with light mode itself, but with poor ambient lighting in the user's environment. The author asserts that inadequate ambient lighting is detrimental to eyesight, and dark mode will not mitigate this damage. Instead, the author suggests that users should fix their lighting conditions rather than advocating for dark mode, which is implied to be an \"eyesight-damaging practice.\"",
    "chinese_title": "暗黑模式真烂",
    "chinese_summary": "文章《深色模式糟透了》批评了现代互联网对深色模式的“痴迷”，以及其支持者所使用的夸张言辞。作者认为“亮瞎我的眼睛”或“千阳之光”等常见短语过于夸张。\n\n该文章的核心论点是，如果“正常模式”（即浅色模式）引起不适，问题不在于浅色模式本身，而在于用户环境中的环境光线不佳。作者断言，环境光线不足对视力有害，而深色模式并不能减轻这种损害。相反，作者建议用户应改善他们的照明条件，而非倡导深色模式——后者被暗示为一种“损害视力的做法”。"
  },
  {
    "id": "46018165",
    "title": "Show HN: Build the habit of writing meaningful commit messages",
    "url": "https://github.com/arpxspace/smartcommit",
    "summary": "Smartcommit is an intelligent, AI-powered CLI tool designed to help developers effortlessly write meaningful, semantic Conventional Commits messages. It analyzes staged Git changes, then uses interactive questions to understand the \"why\" and intent behind the code, generating structured commit messages.\n\nKey features include AI-powered analysis of `git diff`, a responsive Terminal User Interface (TUI), and support for multiple AI providers like OpenAI (GPT-4o) and local Ollama (Llama 3.1). Smartcommit strictly enforces the Conventional Commits specification (e.g., feat, fix, chore).\n\nInstallation requires Go (1.21+) and Git, done via `go install` or building from source. Users can alias `git ci` to use smartcommit instead of the default `git commit`. The workflow involves staging changes, running `smartcommit`, configuring an AI provider (first run), answering context questions, and then reviewing/editing the AI-generated message before confirming. A manual mode is also available. Configuration is stored locally, and an `OPENAI_API_KEY` environment variable can simplify setup. The project is open-source under the MIT License and welcomes contributions.",
    "chinese_title": "展示 HN: 养成撰写有意义提交信息的习惯",
    "chinese_summary": "Smartcommit是一个智能的、AI驱动的CLI工具，旨在帮助开发者轻松编写有意义的、语义化的Conventional Commits消息。它分析暂存的Git更改，然后通过交互式问题理解代码背后的“原因”和意图，从而生成结构化的提交消息。\n\n主要功能包括对`git diff`进行AI驱动的分析、响应式终端用户界面（TUI），以及支持多种AI提供商，如OpenAI（GPT-4o）和本地Ollama（Llama 3.1）。Smartcommit严格执行Conventional Commits规范（例如：feat, fix, chore）。\n\n安装需要Go (1.21+) 和 Git，可以通过`go install`或从源代码构建完成。用户可以将`git ci`别名为smartcommit，以替代默认的`git commit`。工作流程包括暂存更改、运行`smartcommit`、配置AI提供商（首次运行）、回答上下文问题，然后审查/编辑AI生成的消息再进行确认。也提供手动模式。配置本地存储，`OPENAI_API_KEY`环境变量可以简化设置。该项目采用MIT许可证开源，并欢迎贡献。"
  },
  {
    "id": "46033435",
    "title": "Bureau of Meteorology's new boss asked to examine $96M bill for website redesign",
    "url": "https://www.abc.net.au/news/2025-11-23/bureau-of-meteorology-new-website-cost-blowout-to-96-million/106042202",
    "summary": "The Bureau of Meteorology (BOM) is facing renewed scrutiny after revealing its new website cost $96.5 million, a significant increase from the $4.1 million it originally claimed. This revelation comes as the website, launched a month prior, was met with widespread public complaints about its usability and functionality.\n\nUsers found the site difficult to navigate, and farmers were particularly critical of changes to the radar map that obscured place names and made vital rainfall data inaccessible. The website also failed to allow specific GPS coordinate searches, raising concerns about safety due to missing localized data like river heights.\n\nFollowing public outcry and government intervention, the BOM reverted to the old radar map and implemented other fixes. The agency justified the $96.5 million cost, which included $4.1 million for redesign, $79.8 million for the build, and $12.6 million for launch and security testing, stating a \"complete rebuild\" was essential for modern security, usability, and accessibility.\n\nFederal Environment Minister Murray Watt has tasked the BOM's new CEO, Stuart Minchin, to prioritize investigating the cost overruns and fixing the website's functionality. Minister Watt expressed his unhappiness with the BOM's handling of the transition. Nationals leader David Littleproud criticized the expenditure as an \"unbelievable\" waste and a \"Labor disaster,\" accusing the BOM of \"hiding the true cost\" and initially \"lying\" about the figures, highlighting the potential safety risks posed by the flawed site.",
    "chinese_title": "气象局新任局长受命审查9600万美元网站改版费用",
    "chinese_summary": "澳大利亚气象局 (BOM) 在披露其新网站耗资9650万澳元后，正面临着新的审查，这一数字远高于其最初声称的410万澳元。这项披露正值该网站在一个月前上线后，因其可用性和功能性问题而遭到公众广泛抱怨。\n\n用户发现该网站难以操作，农民尤其批评雷达图的改动遮挡了地名，并导致重要的降雨数据无法获取。该网站也未能支持特定GPS坐标搜索，因缺少河流水位等本地化数据而引发了对安全的担忧。\n\n在公众强烈抗议和政府干预后，气象局恢复了旧版雷达图并实施了其他修复。该机构解释说，这9650万澳元的费用，其中包括410万澳元用于重新设计，7980万澳元用于建设，以及1260万澳元用于发布和安全测试，声称“彻底重建”对于现代安全性、可用性和无障碍性至关重要。\n\n联邦环境部长穆雷·瓦特已责成气象局新任首席执行官斯图尔特·明钦，优先调查成本超支问题并修复网站功能。瓦特部长对气象局在过渡期间的处理方式表示不满。国家党领袖戴维·利特尔普劳德批评这项开支是“令人难以置信”的浪费和一场“工党灾难”，指责气象局“隐瞒真实成本”并最初“谎报”数据，同时强调了该有缺陷的网站可能带来的安全风险。"
  },
  {
    "id": "46027947",
    "title": "A desktop app for isolated, parallel agentic development",
    "url": "https://github.com/coder/mux",
    "summary": "Mux, the \"coding agent multiplexer,\" is a desktop application enabling parallel agentic development. It allows developers to manage multiple AI agents concurrently for various use cases: maintaining contextual continuity across tasks like code-review, refactoring, and new feature development; leveraging powerful but slow models like GPT-5-Pro in the background; A/B testing different agentic approaches; and exploring tangents without disrupting core work.\n\nKey features include isolated workspaces, which can be local Git worktrees or remote SSH clones, with a central view of Git divergence. Mux supports a wide array of LLMs (e.g., GPT-5-Pro, Sonnet, Grok, Opus), integrating with Ollama for local models and OpenRouter for broader access. A VS Code Extension allows seamless entry into mux workspaces. The application provides a rich UI with keybinds for agent management, supporting complex outputs like Mermaid diagrams and LaTeX. Its custom agent loop is inspired by Claude Code, offering Plan/Exec mode, vim inputs, and opportunistic compaction.\n\nCurrently in a preview state, mux is actively used by its developers despite potential bugs. It's available as pre-built binaries for macOS and Linux. The UI features integrated code-review, agent status reporting, Git divergence tracking, cost/token consumption monitoring, and project secrets. Mux is licensed under the GNU Affero General Public License v3.",
    "chinese_title": "用于隔离、并行智能体开发的桌面应用",
    "chinese_summary": "Mux，一个名为“编码代理复用器”的桌面应用程序，旨在实现并行代理开发。它允许开发者同时管理多个AI代理，以支持多种应用场景：在代码审查、重构和新功能开发等任务中保持上下文连贯性；在后台利用GPT-5-Pro等功能强大但运行缓慢的模型；对不同的代理方法进行A/B测试；并探索旁支任务而不干扰核心工作。\n\n核心功能包括隔离的工作区，这些工作区可以是本地Git工作树或远程SSH克隆，并提供Git分歧的集中视图。Mux支持广泛的大型语言模型（例如GPT-5-Pro、Sonnet、Grok、Opus），通过Ollama集成本地模型，并通过OpenRouter实现更广泛的访问。一个VS Code扩展允许用户无缝进入mux工作区。该应用程序提供了一个功能丰富的用户界面，配有代理管理快捷键，并支持Mermaid图和LaTeX等复杂输出。其自定义代理循环受Claude Code启发，提供计划/执行模式、vim输入和机会性压缩功能。\n\nMux目前处于预览阶段，尽管可能存在潜在错误，但其开发者仍在积极使用。它提供macOS和Linux的预构建二进制文件。用户界面集成了代码审查、代理状态报告、Git分歧跟踪、成本/令牌消耗监控以及项目密钥管理功能。Mux采用GNU Affero通用公共许可证v3进行授权。"
  },
  {
    "id": "46025477",
    "title": "SVG.js v3.2",
    "url": "https://svgjs.dev/docs/3.2/",
    "summary": "SVG.js v3.2 is a lightweight, dependency-free JavaScript library designed for efficiently manipulating and animating SVG graphics. It aims for a minimal footprint while offering comprehensive coverage of the SVG specification.\n\nKey benefits include its high performance, consistently outperforming competitors, and its clean, concise syntax. This significantly reduces the amount of code needed compared to vanilla JavaScript, streamlining SVG creation and manipulation.\n\nThe library boasts extensive animation capabilities for properties like size, position, transformations, and color. Its modular design facilitates easy extensions and a range of plugins. Other features include a unified API for shape manipulation, event binding, full support for opacity masks, clipping paths, animated text paths, element groups, and dynamic gradients/patterns.\n\nSVG.js is fully documented and released under the MIT License, with a changelog available for tracking updates.",
    "chinese_title": "SVG.js 3.2 版",
    "chinese_summary": "SVG.js v3.2 是一个轻量级、无依赖的JavaScript库，旨在高效地操作和动画化SVG图形。它以最小的体积为目标，同时全面覆盖SVG规范。\n\n主要优点包括其高性能，持续超越竞争对手，以及其简洁明了的语法。与原生JavaScript相比，这显著减少了所需的代码量，简化了SVG的创建和操作。\n\n该库拥有广泛的动画功能，可用于尺寸、位置、变换和颜色等属性。其模块化设计便于轻松扩展和各种插件。其他功能包括用于形状操作的统一API、事件绑定、对不透明度蒙版、剪切路径、动画文本路径、元素组以及动态渐变/模式的全面支持。\n\nSVG.js拥有完整的文档，并以MIT许可证发布，提供更新日志以追踪更新。"
  },
  {
    "id": "46031025",
    "title": "Git 3.0 will use main as the default branch",
    "url": "https://thoughtbot.com/blog/git-3-0-will-use-main-as-the-default-branch",
    "summary": "Git 3.0 will standardize the default branch name for new repositories to 'main', eliminating the need for developers to configure it manually. This significant change, explicitly noted in the patch notes for the recently released Git 2.52, signals a shift away from 'master' as the initial branch.\n\nThe move follows an announcement by the Software Freedom Conservancy in June 2020 regarding Git's eventual update to its default branch name. GitHub subsequently adopted 'main' as its default for new repositories starting October 1, 2020.\n\nWhile a definitive release date for Git 3.0 is not yet set, current estimates project its launch around the end of 2026.\n\nBeyond the default branch name change, Git 3.0 is planned to introduce several other notable improvements. These include enhancing security by upgrading the default hash function from SHA-1 to SHA-256, improving performance and better supporting macOS and Windows through a new default storage format, and more formally integrating Rust into Git’s build process.",
    "chinese_title": "Git 3.0 将使用 main 作为默认分支",
    "chinese_summary": "Git 3.0 将把新仓库的默认分支名标准化为 'main'，从而省去开发者手动配置的麻烦。这一重大变化在最新发布的 Git 2.52 补丁说明中明确提及，标志着初始分支将不再使用 'master'。\n\n此举是继软件自由保护协会（Software Freedom Conservancy）于 2020 年 6 月宣布 Git 最终将更新其默认分支名之后。随后，GitHub 也于 2020 年 10 月 1 日起，将 'main' 作为新仓库的默认分支。\n\n尽管 Git 3.0 的确切发布日期尚未确定，但目前的估计是它将在 2026 年底左右推出。\n\n除了默认分支名变更之外，Git 3.0 还计划引入其他几项显著改进。其中包括通过将默认哈希函数从 SHA-1 升级到 SHA-256 来增强安全性；通过新的默认存储格式提高性能并更好地支持 macOS 和 Windows；以及更正式地将 Rust 集成到 Git 的构建过程中。"
  },
  {
    "id": "46032513",
    "title": "General principles for the use of AI at CERN",
    "url": "https://home.web.cern.ch/news/official-news/knowledge-sharing/general-principles-use-ai-cern",
    "summary": "CERN has released its \"General principles for the use of AI at CERN,\" effective November 13, 2025, following the approval of a CERN-wide AI strategy. These technology-neutral guidelines are designed to promote the responsible and ethical use, development, and deployment of artificial intelligence across all CERN activities. This encompasses AI applications in scientific and technical research, such as data analysis, simulation, and accelerator optimization, as well as productivity and administrative uses like document drafting, translation, and workflow automation.\n\nThe principles apply to all CERN personnel and anyone utilizing its computing facilities. Key principles mandate:\n*   **Transparency and Explainability:** Documenting and communicating AI's use and contribution.\n*   **Responsibility and Accountability:** Ultimate human responsibility for AI's impact and outputs.\n*   **Lawfulness and Conduct:** Adherence to legal frameworks, internal regulations, and third-party rights.\n*   **Fairness, Non-discrimination, and \"Do No Harm\":** Promoting inclusiveness and preventing bias or harm.\n*   **Security and Safety:** Protecting AI from cyber threats and ensuring safe, confidential, and available operations.\n*   **Sustainability:** Assessing AI use to mitigate environmental and social risks.\n*   **Human Oversight:** Maintaining human control, critical assessment, and validation of AI functions and outputs.\n*   **Data Privacy:** Respecting privacy and personal data protection.\n*   **Non-military Purposes:** Strictly limiting AI use to non-military applications.\n\nThis comprehensive framework ensures the ethical and effective integration of AI into CERN's diverse operations.",
    "chinese_title": "欧洲核子研究中心人工智能使用总则",
    "chinese_summary": "欧洲核子研究组织（CERN）在其全组织人工智能战略获批后，发布了《欧洲核子研究组织人工智能使用总则》，该总则将于2025年11月13日生效。这些技术中立的指导原则旨在促进人工智能在欧洲核子研究组织所有活动中负责任和道德地使用、开发和部署。这包括人工智能在科学和技术研究中的应用，如数据分析、模拟和加速器优化，以及在提高生产力和行政管理方面的应用，如文档起草、翻译和工作流自动化。\n\n这些原则适用于欧洲核子研究组织的所有人员以及任何使用其计算设施的人。主要原则规定：\n*   **透明度和可解释性：** 记录和传达人工智能的使用及其贡献。\n*   **责任和问责制：** 人工智能的影响和输出最终由人类负责。\n*   **合法性和行为：** 遵守法律框架、内部规章制度和第三方权利。\n*   **公平、非歧视和“不作恶”：** 促进包容性，防止偏见或损害。\n*   **安全保障：** 保护人工智能免受网络威胁，并确保安全、保密和可用的操作。\n*   **可持续性：** 评估人工智能的使用，以减轻环境和社会风险。\n*   **人工监督：** 对人工智能功能和输出保持人工控制、批判性评估和验证。\n*   **数据隐私：** 尊重隐私和个人数据保护。\n*   **非军事目的：** 严格限制人工智能用于非军事应用。\n\n这一全面的框架确保了人工智能能够以道德和有效的方式融入欧洲核子研究组织多样化的运作中。"
  },
  {
    "id": "46030414",
    "title": "Build desktop applications using Go and Web Technologies",
    "url": "https://github.com/wailsapp/wails",
    "summary": "Wails is an open-source framework enabling the creation of cross-platform desktop applications by combining Go for the backend with standard web technologies for the frontend. Departing from traditional web servers, Wails wraps both Go code and a web frontend into a single, lightweight binary.\n\nKey features include using standard Go, compatibility with any frontend framework, seamless calling of Go methods from JavaScript, auto-generated TypeScript definitions, native UI elements like dialogs and menus, dark/light mode support, and modern window effects. It offers a powerful CLI tool for project creation and building, and provides a unified eventing system.\n\nA significant differentiator is its use of **native rendering engines** rather than an embedded browser, positioning it as a lightweight alternative to Electron. Wails targets Go programmers who wish to bundle a rich HTML/JS/CSS frontend with their applications without the need for a separate server or external browser. The project's roadmap and installation instructions are available on its official website.",
    "chinese_title": "使用 Go 和 Web 技术构建桌面应用",
    "chinese_summary": "Wails是一个开源框架，它通过结合Go语言作为后端和标准Web技术作为前端，实现了跨平台桌面应用的创建。Wails不同于传统的Web服务器，它将Go代码和Web前端封装成一个单一的、轻量级的二进制文件。\n\n主要特性包括使用标准Go语言、兼容任何前端框架、从JavaScript无缝调用Go方法、自动生成TypeScript定义、原生UI元素（如对话框和菜单）、深色/浅色模式支持以及现代窗口效果。它提供了一个强大的CLI工具用于项目创建和构建，并提供了一个统一的事件系统。\n\n一个显著的特点是它使用**原生渲染引擎**而非嵌入式浏览器，这使其成为Electron的轻量级替代方案。Wails的目标用户是Go程序员，他们希望将丰富的HTML/JS/CSS前端与应用程序捆绑在一起，而无需独立的服务器或外部浏览器。该项目的路线图和安装说明可在其官方网站上找到。"
  },
  {
    "id": "46020596",
    "title": "A cryptography research body held an election and they can't decrypt the results",
    "url": "https://www.nytimes.com/2025/11/21/world/cryptography-group-lost-election-results.html",
    "summary": "Unable to access the article link.",
    "chinese_title": "一个密码学研究机构举行了一次选举，结果他们却无法解密。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46027722",
    "title": "Particle Life",
    "url": "https://sandbox-science.com/particle-life",
    "summary": "\"Particle Life\" outlines the comprehensive settings and options for a highly customizable simulation. Users can configure fundamental aspects like CPU usage and toggle between 2D and 3D modes.\n\nKey simulation parameters include \"Forces,\" defined by minimum and maximum radii for various particle types, and \"World Settings\" that control particle number, color, depth limits, and wall behaviors (Rectangle, Circle, None, Repel, Wrap). Screen scaling and world dimensions are also adjustable.\n\n\"Physics Settings\" allow fine-tuning of repel force, force factor, and friction. A \"Randomizer\" provides options for minimum and maximum radii. \"Graphics Settings\" cover visual elements like particle shape (Circle) and size, with specific 3D settings for depth, opacity, and particle visibility.\n\nThe interface includes \"Debug Tools\" like \"Show Cells\" and \"Follow,\" alongside settings for \"Cell Group Size\" and \"Cell Size Factor.\" Performance metrics (FPS, Cells, Process) are displayed. Interactive \"Brush Settings\" offer controls for radius, intensity, and attract/repulse forces in 2D. The system also supports saving configurations and taking screenshots.",
    "chinese_title": "粒子生命",
    "chinese_summary": "《粒子生命》概述了一个高度可定制模拟的全面设置和选项。用户可以配置CPU使用率等基本方面，并在2D和3D模式之间切换。\n\n关键模拟参数包括“力”，其由各种粒子类型的最小和最大半径定义；以及“世界设置”，用于控制粒子数量、颜色、深度限制和墙体行为（矩形、圆形、无、排斥、环绕）。屏幕缩放和世界尺寸也可调节。\n\n“物理设置”允许微调排斥力、力因子和摩擦力。“随机器”提供最小和最大半径的选项。“图形设置”涵盖粒子形状（圆形）和大小等视觉元素，并有针对深度、不透明度和粒子可见性的特定3D设置。\n\n界面包括“调试工具”，如“显示单元格”和“跟随”，以及“单元格组大小”和“单元格大小因子”的设置。性能指标（帧率、单元格、进程）也会显示。交互式“画笔设置”提供2D模式下半径、强度和吸引/排斥力的控制。该系统还支持保存配置和截取屏幕截图。"
  },
  {
    "id": "46034142",
    "title": "Fast Lua runtime written in Rust",
    "url": "https://astra.arkforge.net/",
    "summary": "Astra is a blazingly-fast Lua runtime built with Rust, designed to offer unmatched performance, fault-tolerance, and ease-of-use for Lua servers. It leverages Rust's zero-cost abstractions and an async, multi-threaded runtime for incredible speed, ensuring seamless Lua integration for high-performance scripting.\n\nThe project boasts a modular, fault-tolerant, and extensible architecture, allowing it to scale with application needs. Ease of use is a key feature, as Astra comes as a single, \"batteries included\" binary, and can also function as a standard Lua runtime.\n\nThe provided Lua code example demonstrates Astra's integrated HTTP server capabilities. It illustrates creating a server instance, registering GET routes, handling request bodies, setting response headers and status codes, and returning various data types including strings and JSON. The example also shows how local Lua variables can be used within route handlers to create dynamic content, such as an incrementing counter. Developers can quickly get started and explore the project on GitHub.",
    "chinese_title": "Rust 实现的快速 Lua 运行时",
    "chinese_summary": "Astra是一个用Rust构建的极速Lua运行时，旨在为Lua服务器提供无与伦比的性能、容错性和易用性。它利用Rust的零成本抽象以及异步、多线程运行时来实现惊人的速度，确保Lua在高性能脚本中的无缝集成。\n\n该项目拥有模块化、容错且可扩展的架构，使其能够根据应用需求进行扩展。易用性是其一大特点，Astra以一个“开箱即用”的独立二进制文件形式提供，并且可以作为标准的Lua运行时使用。\n\n提供的Lua代码示例展示了Astra集成的HTTP服务器功能。它演示了如何创建服务器实例、注册GET路由、处理请求体、设置响应头和状态码，以及返回包括字符串和JSON在内的各种数据类型。该示例还展示了如何在路由处理程序中使用局部Lua变量来创建动态内容，例如一个递增计数器。开发者可以快速上手并在GitHub上探索该项目。"
  },
  {
    "id": "46018664",
    "title": "Windows ARM64 Internals: Deconstructing Pointer Authentication",
    "url": "https://www.preludesecurity.com/blog/windows-arm64-internals-deconstructing-pointer-authentication",
    "summary": "Pointer Authentication Code (PAC) is an anti-exploit feature on ARMv8.3-A/v9.0-A architectures that signs pointers using a cryptographic signature stored in unused bits of 64-bit addresses, validated at runtime via special CPU instructions. Windows ARM64 utilizes PAC for \"instruction pointers,\" primarily signing return addresses in both user-mode and kernel-mode.\n\nPAC enablement on Windows begins at `ntoskrnl.exe`'s `KiSystemStartup`. The bootloader (`winload.efi`) provides initial support information and a kernel pointer signing key, generated by `SymCryptRngAesGenerate`. Windows currently uses ARM's \"key B,\" a 128-bit value loaded into the `APIBKeyLo_EL1` and `APIBKeyHi_EL1` system registers (EL1 denotes kernel-mode privilege). Although these registers are shared, user-mode (EL0) cannot directly access them. HVCI protects critical PAC variables, making them read-only.\n\nSystem-wide PAC capabilities are determined by `KiDetectPointerAuthSupport` and fully enabled during system initialization based on a feature flag (`Feature_Pointer_Auth_User__private_featureState`) and registry overrides. Supported and enabled PAC features can be queried via `NtQuerySystemInformation` (`SystemPointerAuthInformation`).\n\nFor user-mode, PAC is unconditionally enabled on a per-process basis during process creation (`PspAllocateProcess`). Each user-mode process receives its own randomly generated signing key (if not inherited), distinct from the global kernel key. The active signing key in the system registers is dynamically updated during user-to-kernel and kernel-to-user transitions (e.g., `KiSystemServiceExit`). Despite SDK options to enable/disable user-mode PAC, it is always active on Windows, with no documented means to disable it or audit violations.",
    "chinese_title": "Windows ARM64 内部原理：解构指针认证",
    "chinese_summary": "指针认证码（PAC）是ARMv8.3-A/v9.0-A架构上的一种反漏洞利用功能，它通过将加密签名存储在64位地址的未使用位中来对指针进行签名，并在运行时通过特殊的CPU指令进行验证。Windows ARM64利用PAC用于“指令指针”，主要是在用户模式和内核模式下对返回地址进行签名。\n\nWindows上PAC的启用始于`ntoskrnl.exe`的`KiSystemStartup`。引导加载程序（`winload.efi`）提供初始支持信息和一个由`SymCryptRngAesGenerate`生成的内核指针签名密钥。Windows目前使用ARM的“密钥B”，这是一个128位的值，加载到`APIBKeyLo_EL1`和`APIBKeyHi_EL1`系统寄存器中（EL1表示内核模式权限）。尽管这些寄存器是共享的，但用户模式（EL0）无法直接访问它们。HVCI保护关键的PAC变量，使其只读。\n\n全系统PAC功能由`KiDetectPointerAuthSupport`确定，并在系统初始化期间根据功能标志（`Feature_Pointer_Auth_User__private_featureState`）和注册表覆盖设置完全启用。可以通过`NtQuerySystemInformation`（`SystemPointerAuthInformation`）查询支持和已启用的PAC功能。\n\n对于用户模式，PAC在进程创建（`PspAllocateProcess`）期间是按进程无条件启用的。每个用户模式进程（如果未继承）都会收到自己随机生成的签名密钥，该密钥与全局内核密钥不同。系统寄存器中的活动签名密钥在用户到内核以及内核到用户的转换期间（例如`KiSystemServiceExit`）动态更新。尽管SDK提供了启用/禁用用户模式PAC的选项，但它在Windows上始终处于活动状态，并且没有文档化的方法可以禁用它或审计违规行为。"
  },
  {
    "id": "46028627",
    "title": "ISPs more likely to throttle netizens who connect through CG-NAT: Cloudflare",
    "url": "https://www.theregister.com/2025/11/03/cloudflare_cgnat_bias_research/",
    "summary": "Cloudflare research reveals that internet users connecting through Carrier-Grade Network Address Translation (CG-NAT) are significantly more prone to throttling or blocking by ISPs and security systems. CG-NAT allows hundreds or thousands of devices to share a single IPv4 address, a necessity due to IPv4 scarcity, particularly in regions like Africa and Asia that received smaller initial allocations.\n\nThe issue arises because traditional IP-based security measures assume a one-to-one user-to-IP relationship. If one user behind a CG-NAT engages in malicious activity, the entire shared IP can be flagged for blocklisting or rate-limiting, inadvertently penalizing many innocent users.\n\nCloudflare's study found that despite CG-NAT IPs having bot scores indicating *more* human traffic, they are subjected to rate-limiting three times more often than non-CG-NAT IPs. Researchers Vasilis Giotsas and Marwan Fayed conclude this introduces an \"unseen source of bias on the Internet,\" disproportionately affecting users in developing regions and impacting digital equity and user experience.\n\nThey stress the need for accurate CG-NAT IP detection to minimize these collateral effects and ensure fair application of security measures. The article also highlights that a global transition to IPv6, which CG-NAT was initially intended to bridge, remains the ultimate solution.",
    "chinese_title": "Cloudflare：运营商更有可能对通过CG-NAT连接的网民限速",
    "chinese_summary": "Cloudflare 研究显示，通过运营商级网络地址转换 (CG-NAT) 连接的互联网用户更容易被互联网服务提供商 (ISP) 和安全系统限速或屏蔽。由于 IPv4 地址稀缺，CG-NAT 允许数百甚至数千台设备共享一个 IPv4 地址，这尤其在非洲和亚洲等初始分配较少的地区是必然选择。\n\n问题在于传统的基于 IP 的安全措施假定用户与 IP 之间存在一对一的关系。如果 CG-NAT 后的一名用户从事恶意活动，整个共享 IP 可能会被标记为黑名单或限速，无意中惩罚了许多无辜的用户。\n\nCloudflare 的研究发现，尽管 CG-NAT IP 的机器人评分显示其承载了*更多*的人类流量，但它们被限速的频率是非 CG-NAT IP 的三倍。研究人员 Vasilis Giotsas 和 Marwan Fayed 总结认为，这引入了“互联网上一种看不见的偏见来源”，不成比例地影响了发展中地区的用户，并影响了数字公平性和用户体验。\n\n他们强调需要准确检测 CG-NAT IP，以最大程度地减少这些附带影响并确保安全措施的公平应用。文章还指出，全球向 IPv6 的过渡（CG-NAT 最初旨在作为过渡方案）仍然是最终解决方案。"
  },
  {
    "id": "46019714",
    "title": "A year without caffeine (2013)",
    "url": "https://bryanalexander.org/personal/a-year-without-caffeine/",
    "summary": "In \"A year without caffeine\" (2013), Bryan Alexander recounts his decision and experience of giving up caffeine for an entire year. Driven by a desire for self-control and curiosity about his dependency, Alexander initiated his caffeine-free year on January 1st, 2013.\n\nThe initial phase was challenging, marked by withdrawal symptoms like headaches, lethargy, and a general lack of alertness, which persisted for several weeks. He noted a significant dip in his morning energy and the ability to \"power through\" tasks that caffeine previously enabled.\n\nAs the year progressed, he observed several changes. His sleep quality improved, becoming deeper and more consistent. He also developed new routines and coping mechanisms to manage energy levels, such as taking short walks or adjusting his work schedule. While he still missed the stimulating effects and the social ritual of coffee at times, he found that his body adapted, and he no longer experienced the dramatic energy crashes associated with caffeine.\n\nBy the end of the year, Alexander concluded that while caffeine offers immediate benefits, living without it brought a sense of liberation from dependency and a more stable, albeit lower, baseline energy level. He decided to reintroduce caffeine selectively and in moderation, demonstrating that the experiment provided valuable insights into his habits and physiology.",
    "chinese_title": "无咖啡因的一年 (2013)",
    "chinese_summary": "在《戒咖啡一年》(2013年) 中，布莱恩·亚历山大讲述了他决定并实践了一整年不摄入咖啡因的经历。出于对自我控制的渴望以及对自己咖啡因依赖性的好奇，亚历山大于2013年1月1日开始了为期一年的无咖啡因生活。\n\n最初的阶段充满挑战，表现为戒断症状，如头痛、嗜睡和普遍的注意力不集中，这些症状持续了数周。他注意到早晨的精力显著下降，以及过去咖啡因能帮助他“奋力完成”任务的能力也随之减弱。\n\n随着这一年的进行，他观察到了一些变化。他的睡眠质量得到改善，变得更深沉、更规律。他还形成了新的作息习惯和应对机制来管理精力水平，例如短途散步或调整工作时间。尽管有时他仍然怀念咖啡的提神效果和社交仪式感，但他发现自己的身体已经适应，并且不再经历与咖啡因相关的剧烈能量崩溃。\n\n到年底，亚历山大总结道，尽管咖啡因能提供即时的好处，但没有咖啡因的生活带给了他一种摆脱依赖的自由感，以及一个更稳定、尽管较低的基线能量水平。他决定有选择地、适度地重新引入咖啡因，这表明这项实验为他的习惯和生理状况提供了宝贵的见解。"
  },
  {
    "id": "46024062",
    "title": "UK minister ducks cost questions on nationwide digital ID scheme",
    "url": "https://www.theregister.com/2025/11/21/uk_digital_id_costs_uncertain/",
    "summary": "UK Minister for Digital Government and Data, Ian Murray, has declined to specify the cost of the government's proposed nationwide digital ID scheme to a House of Commons select committee. Murray stated that the budget is \"to be determined\" after public consultation concludes, as it depends on the final system design and various use cases.\n\nThe scheme, announced by Prime Minister Keir Starmer in September, aims to provide all legal residents with a digital identity by August 2029. Initially intended for proving eligibility to work, it's also touted to offer benefits for accessing key services. The plan involves storing digital IDs on smartphones, building on existing digital wallet initiatives, with technical delivery managed by the Government Digital Service (GDS) within DSIT.\n\nWhile initial costs will come from DSIT, Murray expects other government departments to contribute as their use cases develop. Conservative MP Kit Malthouse questioned departments' willingness to fund the scheme if it means diverting money from their own core priorities. Murray emphasized that the digital ID is a \"prime ministerial priority.\"\n\nAdditionally, Murray confirmed that the government would not appoint a new Chief Digital Officer, integrating the role's responsibilities into the Permanent Secretary's position for a cross-government approach, a move questioned by committee chair Chi Onwurah regarding necessary digital transformation experience. He also noted a delay in the AI roadmap due to a change in technology minister.",
    "chinese_title": "英国大臣避谈全国数字身份计划的成本问题",
    "chinese_summary": "英国数字政府和数据部长伊恩·默里拒绝向英国下议院的一个专门委员会透露政府提议的全国数字身份识别计划的具体成本。默里表示，在公众咨询结束后，预算“有待确定”，因为它取决于最终的系统设计和各种用例。\n\n该计划由首相基尔·斯塔默于九月宣布，旨在到2029年8月为所有合法居民提供数字身份。该计划最初旨在用于证明工作资格，也被宣传为在获取关键服务方面提供便利。该计划包括将数字身份存储在智能手机上，基于现有的数字钱包举措，技术交付由科学、创新和技术部（DSIT）内的政府数字服务（GDS）负责管理。\n\n虽然初始成本将由DSIT承担，但默里预计，随着其他政府部门的用例发展，它们也将作出贡献。保守党议员基特·马尔豪斯质疑，如果这意味着从其核心优先事项中挪用资金，各部门是否愿意资助该计划。默里强调，数字身份是“首相的优先事项”。\n\n此外，默里证实政府不会任命新的首席数字官，而是将该职责整合到常务秘书的职位中，以实现跨政府的协调方式。这一举动遭到委员会主席奇·奥恩乌拉的质疑，她认为这可能缺乏必要的数字化转型经验。他还指出，由于技术部长更换，人工智能路线图的发布被推迟。"
  },
  {
    "id": "46030360",
    "title": "Insurers retreat from AI cover as risk of multibillion-dollar claims mounts",
    "url": "https://www.ft.com/content/abfe9741-f438-4ed6-a673-075ec177dc62",
    "summary": "The provided text is not the article content itself, but rather a paywall and subscription information from the Financial Times. It outlines various digital and print subscription plans, their features, and pricing.\n\nTherefore, the only information available about the article's subject comes from its title: \"Insurers retreat from AI cover as risk of multibillion-dollar claims mounts.\" This title indicates that insurance companies are withdrawing from offering coverage for Artificial Intelligence-related risks because they perceive a high potential for extremely large claims, possibly reaching billions of dollars. The actual details and reasons behind this retreat, as well as specific examples or analyses, are not provided in the given text.",
    "chinese_title": "保险公司退出AI保险，因数十亿美元索赔风险攀升",
    "chinese_summary": "提供的文本并非文章内容本身，而是来自《金融时报》的付费墙和订阅信息。它概述了各种数字和印刷版订阅方案、其特点和定价。\n\n因此，关于文章主题的唯一可用信息来自其标题：《随着数十亿美元索赔风险的增加，保险公司撤出人工智能保险》。这个标题表明，保险公司正在退出提供人工智能相关风险的保险，因为他们认为存在巨额索赔的巨大潜力，可能达到数十亿美元。然而，此次退出背后的实际细节和原因，以及具体的例子或分析，在所提供的文本中均未提及。"
  },
  {
    "id": "46019168",
    "title": "How to Spot a Counterfeit Lithium-Ion Battery",
    "url": "https://spectrum.ieee.org/counterfeit-lithium-ion-batteries",
    "summary": "This article from EnergyNews, authored by Andrew Moseman, highlights the critical issue of counterfeit lithium-ion batteries infiltrating the market. Titled \"How to Spot a Counterfeit Lithium-Ion Battery,\" it warns that these \"fire-prone fakes\" pose a significant danger. The problem is increasingly prevalent, particularly affecting cylindrical lithium-ion batteries commonly used in small, inexpensive devices. The full article, dated November 22, 2025, aims to provide readers with the necessary information to identify these dangerous counterfeits.",
    "chinese_title": "如何识别假冒锂离子电池",
    "chinese_summary": "能源新闻网站（EnergyNews）上安德鲁·莫斯曼（Andrew Moseman）撰写的一篇文章，重点强调了假冒锂离子电池涌入市场的严重问题。这篇题为《如何识别假冒锂离子电池》的文章警告称，这些“易燃假冒品”构成重大危险。这个问题日益普遍，尤其影响到小型廉价设备中常用的圆柱形锂离子电池。这篇发布于2025年11月22日的完整文章，旨在为读者提供识别这些危险假冒品所需的信息。"
  },
  {
    "id": "46034145",
    "title": "Show HN: Cynthia – Reliably play MIDI music files – MIT / Portable / Windows",
    "url": "https://www.blaizenterprises.com/cynthia.html",
    "summary": "Cynthia is an MIT-licensed, portable desktop application for Windows (and Wine for Linux/Mac) designed for reliable MIDI music playback. It supports `.mid`, `.midi`, and `.rmi` files in formats 0 and 1, playing them from local folders or `.m3u` playlists with capacity for thousands of entries.\n\nUsers can adjust playback speed (10% to 1000%), volume (up to 200%), and output device on-the-fly. A prominent progress bar allows for easy time jumping, complemented by rewind/fast forward options and various play modes like \"Repeat One,\" \"Repeat All,\" and \"Random.\"\n\nThe application provides rich real-time visual feedback through dedicated panels for Tracks, Channels, Notes, and a customizable Piano keyboard viewer, alongside a scrolling lyrics viewer. An integrated mixer allows fine-tuning of individual channel volumes.\n\nCynthia supports up to 10 simultaneous MIDI playback devices, offering per-device controls for time shifting (to compensate for lag) and volume. It features a custom-built, stable playback engine and automatically resyncs to OS MIDI device changes. Additional features include drag-and-drop file support, Xbox controller integration, automatic compact mode for small screens, and extensive GUI customization. It includes 25 sample MIDI files ready to play.",
    "chinese_title": "HN展示：Cynthia – 可靠播放MIDI音乐文件 – MIT / 便携 / Windows",
    "chinese_summary": "Cynthia是一款MIT许可的便携式桌面应用程序，适用于Windows（以及Linux/Mac上的Wine），旨在提供可靠的MIDI音乐播放。它支持0和1格式的.mid、.midi和.rmi文件，可从本地文件夹或可容纳数千个条目的.m3u播放列表中播放。\n\n用户可以即时调整播放速度（10%至1000%）、音量（最高200%）和输出设备。显眼的进度条便于时间跳转，辅以快退/快进选项以及“单曲循环”、“全部循环”和“随机播放”等多种播放模式。\n\n该应用程序通过专门的轨道、通道、音符面板以及一个可自定义的钢琴键盘查看器提供丰富的实时视觉反馈，此外还有一个滚动歌词查看器。集成混音器允许对单个通道音量进行微调。\n\nCynthia最多支持10个同步MIDI播放设备，并为每个设备提供时间偏移（用于补偿延迟）和音量控制。它采用自定义构建的稳定播放引擎，并能自动与操作系统MIDI设备更改同步。其他功能包括拖放文件支持、Xbox控制器集成、针对小屏幕的自动紧凑模式以及广泛的GUI自定义。它包含25个可供播放的MIDI示例文件。"
  },
  {
    "id": "46024983",
    "title": "'Suddenly exposed' DOGE employees fear prosecution after Musk abandoned them",
    "url": "https://www.rawstory.com/doge-employees/",
    "summary": "A report by Tom Boggioni on November 22, 2025, indicates that employees associated with DOGE are expressing significant fear and concern. These employees reportedly feel \"suddenly exposed\" and are now apprehensive about potential prosecution. This precarious situation is attributed to Elon Musk, who is said to have abandoned them, leaving them vulnerable.",
    "chinese_title": "《突然曝光》：马斯克抛弃后，狗狗币员工担心被起诉",
    "chinese_summary": "汤姆·博吉奥尼在2025年11月22日发布的一份报告指出，与DOGE相关的员工正在表达极度的恐惧和担忧。据报道，这些员工感到自己“突然暴露”，现在对潜在的起诉感到忧虑。这种岌岌可危的处境归咎于埃隆·马斯克，据说他已抛弃了他们，使他们陷入了脆弱的境地。"
  },
  {
    "id": "46024023",
    "title": "Gnome is better macOS than macOS",
    "url": "https://andreyor.st/posts/2025-11-23-gnome-is-better-macos-than-macos/",
    "summary": "The author, a long-time Linux user primarily of GNOME, acquired a MacBook Pro due to the current laptop market, dissatisfaction with Windows' bloat and forced updates, and macOS's superior capabilities for media production (audio/video) compared to Linux.\n\nDespite macOS's strengths in its target domain, the author finds it \"counter-intuitive\" and \"user-unfriendly\" compared to GNOME. Key criticisms include:\n\n1.  **Virtual Desktops:** GNOME offers faster, gesture-driven switching and automatically creates new desktops as needed, offering unlimited spaces. macOS's switching feels capped in speed, and new desktops must be added manually.\n2.  **Maximize/Fullscreen:** macOS's fullscreen function moves applications to a dedicated, far-right virtual desktop, disrupting workflow. The author prefers GNOME's extension that places fullscreen apps next to the current desktop, or the ability to prevent constant rearrangement.\n3.  **Mission Control:** macOS's Mission Control is deemed far less functional than GNOME's Overview. While macOS allows rearranging windows and desktops, GNOME's Overview integrates window closing, dock tweaking, searching, and application launching, offering \"a lot of control.\"\n4.  **The Dock:** The author prefers GNOME's design where the dock is only visible in Overview, saving vertical screen space and avoiding accidental activation, unlike macOS's constantly visible dock.\n\nUltimately, the author, acknowledging their bias, concludes that GNOME provides a better and more logical user experience than macOS in many aspects, even for someone adopting Apple hardware.",
    "chinese_title": "Gnome 是比 macOS 更好的 macOS",
    "chinese_summary": "作者是一位长期使用Linux（主要是GNOME）的用户，鉴于当前笔记本电脑市场现状、对Windows系统臃肿和强制更新的不满，以及macOS在媒体制作（音频/视频）方面相对于Linux的卓越能力，购置了一台MacBook Pro。\n\n尽管macOS在其目标领域表现出色，但作者认为与GNOME相比，macOS“反直觉”且“不友好”。主要批评点包括：\n\n1.  **虚拟桌面：** GNOME提供更快、手势驱动的切换，并能根据需要自动创建新桌面，提供无限空间。macOS的切换速度感觉受到限制，且必须手动添加新桌面。\n2.  **最大化/全屏：** macOS的全屏功能会将应用程序移动到一个专用、最右侧的虚拟桌面，打断工作流程。作者更喜欢GNOME的扩展，该扩展能将全屏应用放置在当前桌面旁边，或者能够阻止持续的重新排列。\n3.  **调度中心（Mission Control）：** macOS的“调度中心”被认为远不如GNOME的“概览”（Overview）实用。尽管macOS允许重新排列窗口和桌面，但GNOME的“概览”则集成了窗口关闭、调整Dock、搜索和启动应用程序等功能，提供了“大量控制”。\n4.  **Dock栏：** 作者更喜欢GNOME的设计，即Dock只在“概览”中可见，这样可以节省垂直屏幕空间并避免意外激活，这与macOS始终可见的Dock不同。\n\n最终，作者承认其偏见，总结认为，即使对于一个转向使用苹果硬件的人来说，GNOME在许多方面也提供了比macOS更好、更符合逻辑的用户体验。"
  },
  {
    "id": "46018229",
    "title": "Show HN: I built a wizard to turn ideas into AI coding agent-ready specs",
    "url": "https://vibescaffold.dev/",
    "summary": "This Show HN announcement introduces an AI-powered spec generator designed to transform initial ideas into detailed, AI coding agent-ready specifications. Aiming to eliminate vague prompt iterations, this \"wizard\" generates comprehensive technical specifications, architecture diagrams, and agent directives from a single structured conversation.\n\nThe tool produces various outputs, including a high-level `ONE_PAGER.md`, a detailed `DEV_SPEC.md`, a `PROMPT_PLAN.md` for breaking down complexity into LLM-testable prompt chains, and `AGENTS.md` for autonomous coding agent directives.\n\nIts capabilities include product definition (converting abstract ideas into MVP requirements and user stories), tech architecture (drafting schema designs, API routes, and security protocols), development plan creation, and agent directives generation. The platform shows active usage with over 2,200 users, 1,300+ chats, and 70+ complete specs created.",
    "chinese_title": "HN展示：我开发了一个向导，能将想法转化为AI编程代理就绪的规范",
    "chinese_summary": "这篇Show HN公告介绍了一款AI驱动的规范生成器，旨在将初步想法转化为详细的、可供AI编码代理使用的规范。为了消除模糊的提示词迭代，这款“向导”工具通过一次结构化对话即可生成全面的技术规范、架构图和代理指令。\n\n该工具可生成多种输出，包括一份高层级的`ONE_PAGER.md`、一份详细的`DEV_SPEC.md`、一份用于将复杂性分解为可供LLM测试的提示链的`PROMPT_PLAN.md`，以及一份用于自主编码代理指令的`AGENTS.md`。\n\n其功能包括产品定义（将抽象想法转化为MVP需求和用户故事）、技术架构（起草模式设计、API路由和安全协议）、开发计划创建和代理指令生成。该平台活跃度很高，拥有超过2,200名用户，1,300多次聊天，并已创建了70多个完整的规范。"
  },
  {
    "id": "46019205",
    "title": "TSA to charge $18 fee for travelers without Real ID or passport",
    "url": "https://www.washingtonpost.com/travel/2025/11/21/tsa-security-fee-wrong-id/",
    "summary": "The Transportation Security Administration (TSA) is implementing an $18 fee for domestic travelers who do not present a Real ID-compliant driver's license, state ID, or a valid U.S. passport at airport security checkpoints. This new charge is expected to begin in late 2025 or early 2026, as discussed in the article published around November 21, 2025.\n\nThis fee specifically targets individuals who, despite Real ID enforcement for domestic air travel commencing in May 2025, continue to travel with non-compliant identification. These passengers currently undergo enhanced screening, which requires additional time and resources from TSA staff. The $18 surcharge is intended to cover these increased operational costs and to incentivize travelers to obtain the necessary compliant identification.\n\nPassengers presenting acceptable forms of ID, such as a Real ID, a passport, a military ID, or a permanent resident card, will not incur this fee. The TSA's objective is to reduce security line delays, improve the efficiency of screening processes, and offset the expenses associated with processing non-compliant travelers. The fee will be collected at the security checkpoint, and refusal to pay or adequately prove identity through other means could result in denied boarding.",
    "chinese_title": "美国运输安全管理局将对未持有Real ID或护照的旅客征收18美元费用。",
    "chinese_summary": "美国运输安全管理局（TSA）将对那些在机场安检口无法出示符合Real ID标准的驾照、州身份证或有效美国护照的国内旅客征收18美元费用。这项新费用预计将于2025年末或2026年初开始实施，正如2025年11月21日左右发表的文章中所讨论的那样。\n\n这项费用专门针对那些尽管Real ID在国内航空旅行中的强制执行已于2025年5月开始，但仍继续使用不符合要求的身份证明旅行的个人。这些旅客目前需接受加强安检，这需要TSA工作人员投入额外的时间和资源。这18美元的附加费旨在弥补这些增加的运营成本，并鼓励旅客获取必要的符合要求的身份证明。\n\n出示可接受身份证明（如Real ID、护照、军人身份证或永久居民卡）的旅客将无需支付此费用。TSA的目标是减少安检排队延误，提高安检流程效率，并抵消处理不符合要求旅客所产生的费用。该费用将在安检口收取，如果拒绝支付或无法通过其他方式充分证明身份，可能会导致被拒绝登机。"
  },
  {
    "id": "46029649",
    "title": "Passing the Torch – My Last Root DNSSEC KSK Ceremony as Crypto Officer 4",
    "url": "https://technotes.seastrom.com/2025/11/23/passing-the-torch.html",
    "summary": "The article \"Passing the Torch – My Last Root DNSSEC KSK Ceremony as Crypto Officer 4\" recounts the evolution of the Internet's Domain Name System (DNS) and the author's long-standing role in its security. DNS emerged in the early 1980s as a distributed solution, replacing centrally managed \"hosts files\" for a rapidly expanding network. Initially lacking robust security due to its collegial, restricted access environment, the need for better protection became evident by the 1990s, leading to the development of DNSSEC.\n\nReal impetus for DNSSEC deployment arose after Dan Kaminsky's 2008 discovery of a critical DNS cache poisoning flaw. Within two years, the DNS root was cryptographically signed. To foster trust and transparency in this process, ICANN established a rigorous framework: utilizing geographically diverse, highly secure Key Management Facilities (KMFs), offline Hardware Security Modules (HSMs) requiring a quorum of Crypto Officers (COs) for activation, and highly scripted, auditable, and live-streamed ceremonies.\n\nThe author, Crypto Officer 4 for KMF-East, details their 15-year tenure, having been among the original volunteers at the first root signing ceremony in 2010 and the last original KMF-East CO. They witnessed significant milestones, including staff's agile adaptation to new HSMs.\n\nOn November 13th, 2025, the author passed the torch to Lodrina Cherne. The decision to step down, while not prompted by scandal, was multifaceted: exceeding the initial 5-year commitment, advocating for greater diversity among Trusted Community Representatives (TCRs) beyond the \"DNS-old-boy-network,\" and navigating delays caused by COVID-19, a key shareholder's death, and HSM transitions, followed by an extended period to ensure continuity. The author expresses satisfaction that DNSSEC is now widely validated by major resolvers, acknowledging their proud contribution to the system's security and integrity.",
    "chinese_title": "薪火相传 – 我作为4号密码官的最后一次根DNSSEC KSK仪式",
    "chinese_summary": "薪火相传——我作为第4号加密官的最后一次根DNSSEC KSK仪式\n\n题为“薪火相传——我作为第4号加密官的最后一次根DNSSEC KSK仪式”的文章，讲述了互联网域名系统（DNS）的演变以及作者在其安全性方面长期扮演的角色。DNS在20世纪80年代初作为一个分布式解决方案出现，取代了为迅速扩展的网络集中管理的“主机文件”。最初由于其协作性、受限访问的环境而缺乏强大的安全性，到了20世纪90年代，对更好保护的需求变得显而易见，从而促成了DNSSEC的开发。\n\n丹·卡明斯基（Dan Kaminsky）于2008年发现了一个关键的DNS缓存投毒漏洞后，DNSSEC部署的真正动力随之产生。两年之内，DNS根区通过加密方式进行了签名。为了在此过程中培养信任和透明度，ICANN建立了一个严格的框架：利用地理位置分散、高度安全的密钥管理设施（KMFs），离线硬件安全模块（HSMs），需要达到法定人数的加密官（COs）才能激活，以及高度规范化、可审计和现场直播的仪式。\n\n作者，作为KMF-East的第4号加密官，详细介绍了他们长达15年的任期。他们是2010年首次根签名仪式上的首批志愿者之一，也是KMF-East最后一位原始加密官。他们见证了重要的里程碑，包括工作人员对新HSM的敏捷适应。\n\n2025年11月13日，作者将火炬传给了Lodrina Cherne。尽管并非因丑闻而辞职，但这一决定是多方面的：超出了最初5年的承诺；倡导在可信社区代表（TCRs）中实现超越“DNS老男孩网络”的更大多样性；以及应对由COVID-19、一位关键股东的去世和HSM过渡所造成的延误，之后又经历了一段延长期以确保连续性。作者对DNSSEC现在已得到主要解析器的广泛验证表示满意，并认可了他们对系统安全和完整性的骄傲贡献。"
  },
  {
    "id": "46030750",
    "title": "The feds want to make it illegal to even possess an anarchist zine",
    "url": "https://theintercept.com/2025/11/23/prairieland-ice-antifa-zines-criminalize-protest-journalism/",
    "summary": "The article highlights the alarming prosecution of Dallas artist Daniel \"Des\" Sanchez, who was indicted for \"corruptly concealing\" a box of zines and pamphlets, labeled \"Antifa materials,\" after a July 4 protest outside an ICE facility. Sanchez, who was not even at the protest, faces charges because these materials, some titled \"Insurrectionary Anarchy,\" are considered \"literal insurrectionist propaganda\" by federal prosecutors, despite being constitutionally protected free speech.\n\nThe author argues this case exemplifies the Trump administration's escalating efforts to criminalize left-wing activism and free expression, exploiting a loophole to punish \"transporting\" controversial literature when direct possession or publication is protected. Similar tactics have been observed in Georgia's \"Stop Cop City\" RICO charges, which included \"zine distribution,\" and investigations into journalists for reporting on sensitive information.\n\nThis prosecutorial overreach, the article warns, creates a dangerous \"slippery slope\" that chills dissent, making individuals fear engaging with any \"anti-government\" or controversial ideas. The author reminds readers that the Constitution's framers enshrined press freedom precisely to protect radical, anti-government literature akin to Sanchez's zines, not just mainstream media. The administration's actions are presented as an authoritarian threat to press freedom and a fundamental right in a free society.",
    "chinese_title": "联邦政府甚至想把持有无政府主义刊物定为非法。",
    "chinese_summary": "文章重点关注了达拉斯艺术家丹尼尔·“德斯”·桑切斯（Daniel \"Des\" Sanchez）令人震惊的起诉案，他因在7月4日ICE设施外抗议活动后，“恶意藏匿”一箱被贴有“反法西斯（Antifa）材料”标签的独立杂志和小册子而被起诉。桑切斯本人甚至没有参加抗议，但他面临指控，因为这些材料——其中一些标题为“叛乱无政府主义”（Insurrectionary Anarchy）——尽管受到宪法言论自由的保护，却被联邦检察官视为“实实在在的煽动叛乱宣传品”。\n\n作者认为，此案体现了特朗普政府将左翼激进主义和言论自由定为犯罪的日益升级的努力，借机利用漏洞，惩罚“运输”有争议的文献，而直接持有或出版却是受保护的。类似的策略也出现在佐治亚州针对“阻止警察城”（Stop Cop City）运动的RICO指控中，其中包括“独立杂志分发”，以及对报道敏感信息的记者进行的调查。\n\n文章警告，这种检察官权力滥用制造了一个危险的“滑坡效应”，压制了异议，使个人不敢接触任何“反政府”或有争议的思想。作者提醒读者，宪法制定者正是为了保护像桑切斯独立杂志那样激进的、反政府的文献，而不仅仅是主流媒体，才将新闻自由写入宪法的。政府的行动被视为对新闻自由和自由社会基本权利的威权主义威胁。"
  },
  {
    "id": "46023573",
    "title": "Demand for UK Food Bank Up 15% Year on Year",
    "url": "https://www.theguardian.com/society/2025/nov/23/food-banks-demand-prices-frontline-cost-of-living-crisis",
    "summary": "The Canterbury food bank is experiencing a drastic surge in demand, serving as a stark indicator of the UK's ongoing cost of living crisis. Its monthly food parcel distribution has escalated from 450 in 2019 to over 1,100 today, placing it among the top 5% nationally, with demand up 15% year-on-year.\n\nThe charity's monthly food expenditure has soared from virtually nothing in 2022 to £10,000, despite increased food donations. This is exacerbated by rising food prices, meaning every pound now buys 10% less food than 18 months ago. Meanwhile, monetary donations have sharply declined, and grants are less predictable, leaving the charity receiving only 60% of its expected income this year.\n\nThe article illustrates the human cost through a Kent mother of four struggling with basic necessities, relying on £1 frozen food and fearing Christmas expenses will impact food budgets. Benefits and wages are failing to keep pace with rising costs, deepening poverty, especially in areas with insecure, low-paid jobs; even students are now seeking help.\n\nA key policy concern is the two-child benefit cap, with calls for its abolition to lift hundreds of thousands of children out of poverty. Food bank staff highlight rising costs for food, fuel, and rent, coupled with unpredictable work hours, as primary reasons for increased hardship.\n\nFood banks have adapted by becoming more professional, using technology, and offering fresh food. Experts suggest they are no longer a temporary measure but have become a \"necessary part of the welfare state,\" signifying a \"new normal\" of sustained high demand.",
    "chinese_title": "英国食物银行需求同比上涨15%",
    "chinese_summary": "坎特伯雷食物银行正经历需求量激增，这清楚地表明英国正面临持续的生活成本危机。其每月分发的食物包裹数量已从2019年的450份增加到如今的1,100多份，需求量位居全国前5%，并同比增长15%。\n\n尽管食物捐赠有所增加，该慈善机构的每月食物开支已从2022年的几乎为零飙升至1万英镑。食物价格上涨使情况更加恶化，这意味着现在每英镑能购买的食物比18个月前减少了10%。与此同时，货币捐款急剧下降，拨款也变得更难以预测，导致该慈善机构今年只收到预期收入的60%。\n\n文章通过一位肯特郡有四个孩子的母亲的故事，说明了这场危机对人的影响。她正为基本生活必需品而挣扎，依赖1英镑的冷冻食品，并担心圣诞节开支会影响食物预算。福利和工资未能跟上上涨的生活成本，加剧了贫困，尤其是在那些工作不稳定、薪资低的地区；甚至连学生现在也寻求帮助。\n\n一个关键的政策担忧是“两孩福利帽”政策，人们呼吁废除该政策，以帮助数十万儿童摆脱贫困。食物银行的工作人员指出，食物、燃料和租金成本的上涨，再加上不稳定的工作时间，是导致困境加剧的主要原因。\n\n食物银行通过变得更加专业化、利用技术和提供新鲜食物来适应（变化）。专家表示，它们不再是临时措施，而是已成为“福利国家不可或缺的一部分”，这标志着持续高需求的“新常态”。"
  },
  {
    "id": "46021905",
    "title": "Parallel Threads in Racket v9.0",
    "url": "https://blog.racket-lang.org/2025/11/parallel-threads.html",
    "summary": "Racket v9.0 introduces native shared-memory parallel threads, enabling programs to fully utilize multicore hardware, a significant leap from the previous version's concurrent-only coroutine threads. Creating a parallel thread is as simple as adding `#:pool 'own` to the `thread` call, offering substantial real-time speedups where CPU time remains similar but wall-clock time can be halved for parallelized tasks.\n\nThis development follows Racket's complete rebuild on Chez Scheme (Racket CS) since 2017, which laid a robust foundation with improvements like a parallel garbage collector and memory fences. While Racket previously offered `places` for coarse-grained parallelism and `futures` for fine-grained tasks, the new parallel threads are more versatile, addressing `futures`' limitations by not blocking on operations like parameter access or mutable hash table manipulation.\n\nBenchmarks show excellent scaling for CPU-bound computations and tasks with unshared data structures. However, I/O-bound operations currently exhibit limited speedup due to coarse-grained locks in the I/O layer. Sequential programs might experience a minor performance overhead (up to 6-8% in specific fine-grained cases) due to the necessary underlying lock mechanisms.\n\nRacket's existing synchronization primitives (semaphores, channels, `box-cas!`) are fully compatible with parallel threads. Although parallel threads expose the machine's weak memory-consistency model, Racket guarantees memory safety through internal fences. The developers anticipate rare compatibility issues for existing libraries.",
    "chinese_title": "Racket v9.0 并行线程",
    "chinese_summary": "Racket v9.0 引入了原生共享内存并行线程，使程序能够充分利用多核硬件，这与先前版本仅支持并发的协程线程相比是一个重大飞跃。创建并行线程只需在 `thread` 调用中添加 `#:pool 'own`，对于并行化任务，这能提供显著的实时加速，其中CPU时间保持相似，但实际运行时间可以减半。\n\n这一发展是在Racket自2017年以来在Chez Scheme（Racket CS）上进行彻底重建之后实现的，这为Racket奠定了坚实的基础，带来了并行垃圾回收器和内存屏障等改进。尽管Racket以前提供了用于粗粒度并行性的 `places` 和用于细粒度任务的 `futures`，但新的并行线程用途更广泛，解决了 `futures` 的局限性，即在参数访问或可变哈希表操作等操作上不会阻塞。\n\n基准测试表明，对于CPU密集型计算和使用非共享数据结构的任务，扩展性表现出色。然而，由于I/O层中的粗粒度锁，I/O密集型操作目前只显示有限的加速。顺序程序可能会由于必要的底层锁机制而经历轻微的性能开销（在特定细粒度情况下高达6-8%）。\n\nRacket现有的同步原语（信号量、通道、`box-cas!`）与并行线程完全兼容。尽管并行线程暴露了机器的弱内存一致性模型，Racket仍通过内部内存屏障保证了内存安全。开发人员预计现有库的兼容性问题将很少见。"
  },
  {
    "id": "46029872",
    "title": "McMaster Carr – The Smartest Website You Haven't Heard Of (2022)",
    "url": "https://www.bedelstein.com/post/mcmaster-carr",
    "summary": "McMaster-Carr's website (mcmaster.com) is highlighted as the internet's best e-commerce site, praised for its exceptional functionality in the industrial supply sector. The author, an engineer, commends its design for doing \"what it needs to, and nothing else.\"\n\nVisually, the site is minimalist, predominantly grayscale with green and yellow accents. It deliberately avoids common web distractions like popups, animations, or marketing banners, even using grayscale product images to prevent visual clutter. This \"function over form\" approach directly serves the user's primary goal: finding specific industrial parts quickly and efficiently, rather than browsing.\n\nThe site's superior search and filtering interface is its main strength. Users can rapidly narrow down its vast catalog by starting with a general term, then utilizing subcategories and detailed left-navigation filters based on quantitative specifications (e.g., thread size, length, material). Simplified schematic illustrations and integrated explanations act as an \"engineer's handbook,\" aiding both precise searches and informed decision-making. This efficient system is contrasted with the poor filtering on sites like Amazon.\n\nA standout feature is the instant availability of CAD files for nearly every part, significantly streamlining mechanical engineers' workflow by allowing direct import into 3D models. The author suggests a minor improvement: making the homepage search bar more prominent. Ultimately, McMaster.com is celebrated as a product that deeply understands its customer, proving that a relentless focus on core functionality, divorced from typical web design trends, creates a profoundly effective user experience.",
    "chinese_title": "麦克马斯特·卡尔 – 你可能还不知道的最智能网站 (2022)",
    "chinese_summary": "McMaster-Carr的网站(mcmaster.com)被誉为互联网上最佳的电子商务网站，因其在工业用品领域的卓越功能而备受赞誉。作者作为一名工程师，称赞其设计“只做它需要做的，不多不少”。\n\n从视觉上看，该网站设计极简，以灰色调为主，辅以绿色和黄色点缀。它刻意避免了常见的网络干扰，如弹窗、动画或营销横幅，甚至使用灰度产品图片以防止视觉混乱。这种“功能优先于形式”的方法直接服务于用户的首要目标：快速高效地找到特定的工业零件，而不是漫无目的地浏览。\n\n该网站卓越的搜索和筛选界面是其主要优势。用户可以通过从一般术语开始，然后利用子类别和基于定量规格（例如螺纹尺寸、长度、材料）的详细左侧导航筛选器，快速缩小其庞大的目录范围。简化的示意图和集成解释如同“工程师手册”，有助于精确搜索和做出明智决策。这种高效系统与亚马逊等网站糟糕的筛选功能形成鲜明对比。\n\n一个突出特点是几乎每个零件都可即时获取CAD文件，通过允许直接导入3D模型，极大地简化了机械工程师的工作流程。作者建议了一个小改进：让主页搜索栏更醒目。最终，McMaster.com被誉为一款深刻理解客户的产品，它证明了不懈专注于核心功能，脱离典型的网页设计趋势，能够创造出极其有效的用户体验。"
  },
  {
    "id": "46027290",
    "title": "Meet the AI workers who tell their friends and family to stay away from AI",
    "url": "https://www.theguardian.com/technology/2025/nov/22/ai-workers-tell-family-stay-away",
    "summary": "AI workers, including raters and trainers, are actively advising their friends and family to avoid or be extremely cautious with generative AI, citing deep distrust in the models they help develop. This skepticism is rooted in a consistent industry focus on rapid turnaround times, often at the expense of quality, safety, and ethical considerations.\n\nWorkers like Krista Pawloski, who moderates content for Amazon Mechanical Turk, recounted nearly missing a racial slur, exposing the potential scale of errors. Anonymous Google raters revealed being assigned to evaluate sensitive medical or ethical content without relevant expertise, or observing biased outputs, such as models refusing to answer questions about Palestinian history while readily discussing Israel's. They criticize vague instructions, minimal training, unrealistic deadlines, and poor quality input data, echoing the \"garbage in, garbage out\" principle.\n\nExperts confirm this trend, stating that companies seem to prioritize speed and profit over careful validation, often overlooking crucial rater feedback. Audits reveal an alarming increase in AI models confidently dispensing false information while their non-response rates plummet.\n\nThese frontline workers emphasize that AI is \"fragile,\" not futuristic, built by a vast, often invisible human workforce. They are taking it upon themselves to raise awareness about AI's unreliability, inherent biases, human labor, and environmental impact. They draw parallels to the textile industry's past, urging the public to demand transparency regarding data sourcing, copyright, and fair worker compensation to drive ethical advancements in AI.",
    "chinese_title": "认识那些劝说亲友远离AI的AI从业者",
    "chinese_summary": "AI工作者，包括标注员和训练师，正在积极建议他们的亲友避开生成式AI，或对其保持高度警惕，理由是他们对所参与开发的模型深感不信任。这种怀疑根源于行业长期以来对快速周转的执着，常常牺牲了质量、安全和伦理考量。\n\n像为亚马逊Mechanical Turk审核内容的克里斯塔·帕夫洛斯基（Krista Pawloski）这样的工作者，曾差点漏掉一句种族歧视性言论，暴露出潜在的错误规模。匿名的谷歌标注员透露，他们被指派评估敏感的医疗或伦理内容，却缺乏相关专业知识；或者观察到有偏见的输出，例如模型拒绝回答有关巴勒斯坦历史的问题，却乐于讨论以色列的历史。他们批评指令模糊、培训不足、截止日期不切实际以及输入数据质量差，这印证了“垃圾进，垃圾出”的原则。\n\n专家证实了这一趋势，称公司似乎将速度和利润置于仔细验证之上，常常忽视了关键的标注员反馈。审计显示，AI模型自信地散布虚假信息的案例惊人地增加，而它们的不回应率却大幅下降。\n\n这些一线工作者强调，AI是“脆弱”的，而非充满未来感的，它是由庞大而常常“隐形”的人力大军构建的。他们主动承担起责任，提高公众对AI不可靠性、固有偏见、人力劳动投入及其环境影响的认知。他们将其与纺织业的过去相比较，敦促公众要求数据来源、版权和公平工人报酬方面的透明度，以推动AI领域的伦理进步。"
  },
  {
    "id": "46023143",
    "title": "X.com is gonna snitch you out to the public if you use a VPN",
    "url": "https://www.vice.com/en/article/x-show-vpn-warning/",
    "summary": "X.com is reportedly set to implement a new feature that will flag users who access the platform via Virtual Private Networks (VPNs). VPNs are vital for online privacy, protecting individuals from cyber threats, and enabling anonymity for activists, journalists, and those in oppressive countries.\n\nThe initiative was first hinted at by X's Head of Product, Nikita Bier, on October 14, 2025, who stated X was experimenting with displaying an account's country of origin to help users verify content authenticity. Although Bier mentioned \"privacy toggles,\" he indicated that configuring these might also be highlighted on a user's profile.\n\nOnline security advocates quickly criticized the move as an attempt to \"out\" individuals relying on VPNs for anonymity. This was further corroborated on November 15, 2025, by analyst Aaron Perris, who revealed X will display a warning if a VPN is used to obscure an account's true location.\n\nLeaked code indicates the warning text will read: \"'One of our partners has indicated that you may be connecting via a proxy—such as a VPN—which may change the country or region that is displayed on your profile.'\" Subsequently, other users will see \"Country or region may not be accurate\" on such profiles. The article criticizes X for this action, suggesting the platform should focus on tackling misinformation rather than undermining user privacy.",
    "chinese_title": "X.com is gonna snitch you out to the public if you use a VPN",
    "chinese_summary": "X.com is reportedly set to implement a new feature that will flag users who access the platform via Virtual Private Networks (VPNs). VPNs are vital for online privacy, protecting individuals from cyber threats, and enabling anonymity for activists, journalists, and those in oppressive countries.\n\nThe initiative was first hinted at by X's Head of Product, Nikita Bier, on October 14, 2025, who stated X was experimenting with displaying an account's country of origin to help users verify content authenticity. Although Bier mentioned \"privacy toggles,\" he indicated that configuring these might also be highlighted on a user's profile.\n\nOnline security advocates quickly criticized the move as an attempt to \"out\" individuals relying on VPNs for anonymity. This was further corroborated on November 15, 2025, by analyst Aaron Perris, who revealed X will display a warning if a VPN is used to obscure an account's true location.\n\nLeaked code indicates the warning text will read: \"'One of our partners has indicated that you may be connecting via a proxy—such as a VPN—which may change the country or region that is displayed on your profile.'\" Subsequently, other users will see \"Country or region may not be accurate\" on such profiles. The article criticizes X for this action, suggesting the platform should focus on tackling misinformation rather than undermining user privacy."
  },
  {
    "id": "46037626",
    "title": "Pebble Watch software is now 100% open source",
    "url": "https://ericmigi.com/blog/pebble-watch-software-is-now-100percent-open-source",
    "summary": "生成摘要时出错",
    "chinese_title": "Pebble Watch software is now 100% open source",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46026764",
    "title": "Thiel, Karp, Ellison, Catz, Bezos, Lessin appear in newly leaked Israel emails",
    "url": "https://sfstandard.com/2025/11/23/extended-courtship-linking-jeffrey-epstein-peter-thiel-israeli-officials/",
    "summary": "生成摘要时出错",
    "chinese_title": "Thiel, Karp, Ellison, Catz, Bezos, Lessin appear in newly leaked Israel emails",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46029561",
    "title": "My Life Is a Lie: How a Broken Benchmark Broke America",
    "url": "https://www.yesigiveafig.com/p/part-1-my-life-is-a-lie",
    "summary": "生成摘要时出错",
    "chinese_title": "My Life Is a Lie: How a Broken Benchmark Broke America",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46028827",
    "title": "'Invisible' microplastics spread in skies as global pollutant",
    "url": "https://www.asahi.com/ajw/articles/16137995",
    "summary": "生成摘要时出错",
    "chinese_title": "'Invisible' microplastics spread in skies as global pollutant",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46036878",
    "title": "Andrej Karpathy on X: implications of AI to schools",
    "url": "https://twitter.com/karpathy/status/1993010584175141038",
    "summary": "生成摘要时出错",
    "chinese_title": "Andrej Karpathy on X: implications of AI to schools",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46024417",
    "title": "X begins rolling out 'About this account' location feature to users' profiles",
    "url": "https://techcrunch.com/2025/11/21/x-begins-rolling-out-the-about-this-account-feature-to-users-profiles/",
    "summary": "生成摘要时出错",
    "chinese_title": "X begins rolling out 'About this account' location feature to users' profiles",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46023364",
    "title": "Claude Status – Elevated error rates on the API",
    "url": "https://status.claude.com/incidents/538r2y9cjmhk",
    "summary": "生成摘要时出错",
    "chinese_title": "Claude Status – Elevated error rates on the API",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46024328",
    "title": "Inmates at a Mississippi jail were ordered to do the guards' bidding",
    "url": "https://www.nytimes.com/2025/11/14/us/mississippi-jail-inmates-rankin-county.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Inmates at a Mississippi jail were ordered to do the guards' bidding",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46033536",
    "title": "Trade Chaos Causes Businesses to Rethink Their Relationship with the U.S.",
    "url": "https://www.nytimes.com/2025/11/24/business/tariffs-trade-small-business.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Trade Chaos Causes Businesses to Rethink Their Relationship with the U.S.",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46028033",
    "title": "Sunsetting Supermaven",
    "url": "https://supermaven.com/blog/sunsetting-supermaven",
    "summary": "生成摘要时出错",
    "chinese_title": "Sunsetting Supermaven",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46023213",
    "title": "Maybe that's not liquid water on Mars after all",
    "url": "https://phys.org/news/2025-11-liquid-mars.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Maybe that's not liquid water on Mars after all",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46024754",
    "title": "Raycast for Windows",
    "url": "https://www.raycast.com/blog/raycast-for-windows",
    "summary": "生成摘要时出错",
    "chinese_title": "Raycast for Windows",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46024211",
    "title": "Top MAGA Influencers on X/Twitter Accidentally Unmasked as Foreign Trolls",
    "url": "https://www.thedailybeast.com/top-maga-influencers-accidentally-unmasked-as-foreign-actors/",
    "summary": "生成摘要时出错",
    "chinese_title": "Top MAGA Influencers on X/Twitter Accidentally Unmasked as Foreign Trolls",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46023531",
    "title": "Tosijs-schema is a super lightweight schema-first LLM-native JSON schema library",
    "url": "https://www.npmjs.com/package/tosijs-schema",
    "summary": "生成摘要时出错",
    "chinese_title": "Tosijs-schema is a super lightweight schema-first LLM-native JSON schema library",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46036139",
    "title": "Britain is one of the richest countries. So why do children live in poverty?",
    "url": "https://www.cnn.com/2025/11/24/uk/britain-child-poverty-intl-scli",
    "summary": "生成摘要时出错",
    "chinese_title": "Britain is one of the richest countries. So why do children live in poverty?",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46031196",
    "title": "A One-Minute ADHD Test",
    "url": "https://psychotechnology.substack.com/p/a-one-minute-adhd-test-2330",
    "summary": "生成摘要时出错",
    "chinese_title": "A One-Minute ADHD Test",
    "chinese_summary": "生成摘要时出错"
  }
]