[
  {
    "id": "46016249",
    "title": "The privacy nightmare of browser fingerprinting",
    "url": "https://kevinboone.me/fingerprinting.html",
    "summary": "The article identifies browser fingerprinting as a major privacy threat, superseding concerns about third-party cookies. It explains that fingerprinting works by collecting numerous discrete pieces of information from a user's browser and system – such as OS, browser version, language, time zone, installed fonts, browser extensions, unique canvas rendering data, and even window size. These elements combine to create a highly unique numerical identifier, independent of cookies and resistant to VPNs.\n\nSimple countermeasures like disabling JavaScript are often counterproductive, making users stand out and breaking websites. Similarly, attempting to spoof browser details can be detected or cause site malfunctions. The author emphasizes that fingerprinting is a statistical, rather than exact, tracking method, but still highly effective.\n\nTo mitigate risk, the article recommends using a VPN, preventing long-lived cookies, and striving to be \"unremarkable\" – using popular browser/OS combinations, maintaining a stock computer configuration, avoiding extensions, and default settings. Browsers like Brave, Mullvad, and Librewolf offer built-in resistance. However, even these measures only reduce trackability from approximately 99% to 50%, and come with downsides like increased CAPTCHA challenges and potential website functionality issues.\n\nThe legality of browser fingerprinting is unclear, though it likely violates the spirit of GDPR. The author concludes that effectively combating this pervasive privacy threat will ultimately require new, specific legislation, as it primarily supports the intrusive online advertising industry.",
    "chinese_title": "浏览器指纹的隐私噩梦",
    "chinese_summary": "本文指出，浏览器指纹识别是一种主要的隐私威胁，其重要性已超越了对第三方cookie的担忧。它解释说，指纹识别通过收集用户浏览器和系统的众多离散信息片段来工作——例如操作系统、浏览器版本、语言、时区、已安装字体、浏览器扩展、独特的Canvas渲染数据，甚至窗口大小。这些元素结合起来创建一个高度独特的数字标识符，它独立于cookie，并且能抵抗VPN。\n\n简单的对策，如禁用JavaScript，往往适得其反，反而使用户更显眼并导致网站功能失效。同样，尝试伪造浏览器详情也可能被检测出来或导致网站故障。作者强调，指纹识别是一种统计性的而非精确的追踪方法，但仍然非常有效。\n\n为了降低风险，文章建议使用VPN，防止持久性cookie，并努力做到“不引人注目”——即使用流行的浏览器/操作系统组合，保持标准的计算机配置，避免使用扩展程序和默认设置。像Brave、Mullvad和Librewolf这样的浏览器提供了内置的抵抗功能。然而，即使是这些措施也只能将可追踪性从大约99%降低到50%，并且伴随着增加CAPTCHA挑战和潜在的网站功能问题等缺点。\n\n浏览器指纹识别的合法性尚不明确，尽管它可能违反了GDPR的精神。作者总结说，要有效打击这种普遍存在的隐私威胁，最终将需要新的、具体的立法，因为它主要服务于侵扰性在线广告行业。"
  },
  {
    "id": "46009894",
    "title": "Personal blogs are back, should niche blogs be next?",
    "url": "https://disassociated.com/personal-blogs-back-niche-blogs-next/",
    "summary": "The article explores the evolution of blogging, arguing that a resurgence of niche blogs should follow the current revival of personal blogs. It reminisces about the \"golden age\" of blogging, where specialized sites like Darren Rowse's Problogger demonstrated how a singular focus could lead to success, often with monetary returns. While niche blogging was considered a core tenet for expertise and search engine visibility, the author notes that not all successful blogs adhered to this, with personal blogs often covering diverse topics.\n\nThe piece highlights how social media and influencers largely eclipsed traditional blogs. However, a recent backlash against these platforms, coupled with the growth of the IndieWeb/SmallWeb community, has sparked a significant revival in *personal* blogs, primarily non-commercial.\n\nBuilding on this momentum, the author advocates for a return of \"well-written, quality, topic-focused resources\" from independent writers. This is presented as a crucial step to combat the \"misinformation morass\" of social media and the proliferation of AI-generated \"slop.\" The ideal model for these new niche blogs involves content from passionate, independent creators, compensated without resorting to intrusive ads or pop-ups, thereby prioritizing reader experience. The author concludes that while personal blogs are rebuilding a vibrant web, restoring accessible and trusted information through quality niche blogs is the next vital step.",
    "chinese_title": "个人博客回来了，小众博客会是下一个吗？",
    "chinese_summary": "文章探讨了博客的演变，认为在个人博客当前复兴之后，小众博客也应随之复兴。文章回顾了博客的“黄金时代”，那时像达伦·罗斯的Problogger这样的专业网站展示了单一焦点如何带来成功，并且常常伴随着经济回报。尽管小众博客被认为是专业知识和搜索引擎可见度的核心原则，作者指出并非所有成功的博客都遵循这一点，个人博客常常涵盖多样化的话题。\n\n文章强调了社交媒体和网红是如何在很大程度上使传统博客黯然失色的。然而，近期对这些平台的不满，加上独立网络/小型网络社区的发展，引发了*个人*博客的显著复兴，这些博客主要以非商业为主。\n\n借此势头，作者倡导独立作者创作的“文笔精良、高质量、主题明确的资源”能够回归。这被视为对抗社交媒体“信息泥沼”和人工智能生成“糟粕”泛滥的关键一步。这些新型小众博客的理想模式是：内容由充满热情的独立创作者提供，报酬不依赖侵入性广告或弹窗，从而优先考虑读者体验。作者总结道，尽管个人博客正在重建一个充满活力的网络，但通过高质量的小众博客恢复可访问和可信赖的信息是下一个至关重要的步骤。"
  },
  {
    "id": "46021825",
    "title": "After my dad died, we found the love letters",
    "url": "https://www.jenn.site/after-my-dad-died-we-found-the-love-letters/",
    "summary": "After her father's death, the narrator and family discovered hidden love letters, revealing a secret life. Her parents had an unhappy, arranged marriage, with the father often absent. The narrator had a distant relationship with him, remembering only one instance of paternal care from childhood.\n\nThe letters led to Edward, her father's lover of three years. Edward recounted their intense relationship: they met in Hong Kong, fell deeply in love, and Edward moved to Canada to be with him, selling his business and house. They lived together, planned to buy a house, and her father intended to divorce his wife and live openly with Edward. Edward's photos showed a father beaming with joy, a stark contrast to the grim man the narrator knew.\n\nThe father had been closeted for 40 years, knowing he liked men since university. The narrator realized her father's understanding reaction when she came out was deeply poignant, given his own secret. Edward's grief was profound and isolating, as he couldn't publicly mourn. The narrator facilitated a private farewell, allowing Edward to hold the father's ashes, showing a raw emotional connection that surpassed his biological family's.\n\nHowever, the narrator also acknowledges her father's \"cowardice.\" He had refused his wife's requests for divorce for decades, using her as a shield to avoid societal scrutiny, despite multiple affairs. The mother felt both their lives were wasted. The narrator reflects on her father's 57 years, mostly miserable and suffocating, with only the last three years \"shot through with so much joy,\" lamenting the tragedy of his unlived, authentic life.",
    "chinese_title": "爸爸去世后，我们发现了那些情书。",
    "chinese_summary": "父亲去世后，叙述者和家人发现了藏起来的情书，揭示了一个秘密的生活。她的父母是一桩不幸福的包办婚姻，父亲经常不在家。叙述者与他关系疏远，童年记忆中，父亲对她的关爱只发生过一次。\n\n这些信引出了爱德华，她父亲三年的爱人。爱德华讲述了他们热烈的感情：他们在香港相遇，坠入爱河，爱德华为他卖掉了生意和房子，搬到了加拿大。他们住在一起，计划买房，她父亲打算和妻子离婚，与爱德华公开生活。爱德华的照片中，父亲笑容灿烂，与叙述者记忆中那个阴沉的男人形成鲜明对比。\n\n父亲隐瞒了性取向40年，从大学时就知道自己喜欢男人。叙述者意识到，鉴于父亲自身的秘密，她出柜时父亲的理解反应是多么令人心酸。爱德华的悲痛深沉而孤独，因为他无法公开哀悼。叙述者促成了一场私人告别，让爱德华捧着父亲的骨灰，这展现了一种超越其血缘家庭的原始情感连结。\n\n然而，叙述者也承认父亲的“懦弱”。几十年来，他拒绝了妻子的离婚请求，利用她作为盾牌来避免社会审视，尽管他有多次婚外情。母亲觉得他们两人的生命都被浪费了。叙述者回想父亲57年的人生，大部分时间都是痛苦而令人窒息的，只有最后三年“充满了如此多的喜悦”，她哀叹父亲未能活出真实自我的悲剧。"
  },
  {
    "id": "46008332",
    "title": "We Induced Smells With Ultrasound",
    "url": "https://writetobrain.com/olfactory",
    "summary": "Researchers successfully induced specific smell sensations in two individuals by targeting the olfactory bulb with focused ultrasound. Using a low-frequency (300 kHz) ultrasound probe mounted on a makeshift headset and aimed through the forehead, they bypassed the challenging nasal anatomy to stimulate the scent-processing region of the brain.\n\nThey achieved four distinct sensations: fresh air/oxygen, garbage (fruit peels), an ozone-like smell, and campfire smoke. These sensations were consistently replicated and validated in a blind trial. Safety was a primary concern, with output field measurements confirming parameters were well within established limits for mechanical index and thermal dose, and steering angles avoiding the optic nerve.\n\nThe project’s significance extends beyond \"VR for smells.\" The olfactory system, with its numerous receptor types, is proposed as a high-dimensional, underutilized channel for non-invasive neuromodulation. Unlike visual or auditory systems, the olfactory pathway offers a more direct interface with core brain regions like the hippocampus (memory) and amygdala (emotion), potentially allowing for direct encoding of complex information or even \"smelling meaning.\" The ability to induce varied scents with minimal steering suggests a surprisingly high resolution for neurostimulation, paving the way for future improvements in controlling this unique brain-computer interface.",
    "chinese_title": "我们利用超声波诱导了气味。",
    "chinese_summary": "研究人员通过使用聚焦超声波靶向嗅球，成功在两名受试者身上诱导出了特定的嗅觉感受。他们使用一个固定在临时头戴设备上、并通过前额对准的低频（300 kHz）超声探头，绕过了复杂的鼻腔解剖结构，直接刺激大脑中处理气味的区域。\n\n他们实现了四种不同的嗅觉感受：新鲜空气/氧气、垃圾（果皮）、臭氧味以及篝火烟味。这些感受在盲法试验中得到了一致的复现和验证。安全是首要考虑因素，场输出测量结果证实各项参数远低于机械指数和热剂量的既定限制，并且转向角度避开了视神经。\n\n该项目的意义远不止于“嗅觉VR”。嗅觉系统拥有多种受体类型，被认为是一种高维的、未充分利用的非侵入性神经调节通道。与视觉或听觉系统不同，嗅觉通路与海马体（记忆）和杏仁核（情感）等核心大脑区域提供更直接的连接，这可能实现复杂信息的直接编码，甚至“嗅出意义”。仅需微小调整即可诱导各种气味的能力，表明神经刺激具有惊人的高分辨率，这为未来改进这种独特的脑机接口的控制方法铺平了道路。"
  },
  {
    "id": "46019817",
    "title": "Meta buried 'causal' evidence of social media harm, US court filings allege",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/meta-buried-causal-evidence-social-media-harm-us-court-filings-allege-2025-11-23/",
    "summary": "Unable to access the article link.",
    "chinese_title": "美国法院文件指控Meta掩盖了社交媒体危害的“因果”证据。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46019685",
    "title": "A monopoly ISP refuses to fix upstream infrastructure",
    "url": "https://sacbear.com/xfinity-wont-fix-internet/",
    "summary": "The Sacramento Bear reports a chronic internet outage problem with Xfinity, a monopoly ISP, that the company refuses to fix despite documented evidence. The author, an Xfinity subscriber since June 2024, experiences daily connection drops, typically 6-7 times a day, each lasting around 125 seconds. A neighbor, with a separate line, experiences identical outages at the same times, confirming the issue is not user-equipment related.\n\nUsing an OPNSense uptime monitor logging pings to 8.8.8.8, the author compiled 17 months of data, showing over 3,387 outage incidents and more than 117 cumulative hours of downtime. The data reveals a consistent, predictable, and automated pattern: precise 123-127 second durations, minute marker clustering at :29 and :44 (suggesting cron-based scheduling), and peak occurrences at noon, early morning, and late night.\n\nTechnical logs from the modem further corroborate the issue, displaying critical DOCSIS errors such as \"UCD invalid or channel unusable\" and \"SYNC Timing Synchronization failure,\" which point to problems with the upstream infrastructure. Despite this detailed evidence and consistent pattern indicating an automated system failure on the ISP's end, Xfinity has reportedly refused to investigate or resolve the problem.",
    "chinese_title": "垄断互联网服务提供商拒绝修复上游基础设施",
    "chinese_summary": "《萨克拉门托熊报》报道，垄断性互联网服务提供商Xfinity存在一个长期存在的互联网中断问题，尽管有书面证据，该公司仍拒绝修复。作者自2024年6月起成为Xfinity用户，每天都会遇到连接中断，通常每天6-7次，每次持续约125秒。一位邻居使用独立线路，在相同时间经历相同的服务中断，证实该问题与用户设备无关。\n\n作者使用OPNSense运行时间监控器记录对8.8.8.8的ping测试，编译了17个月的数据，显示超过3,387次中断事件以及累计超过117小时的停机时间。数据揭示了一个一致、可预测且自动化的模式：中断持续时间精确为123-127秒，分钟标记集中在:29和:44（暗示基于cron的调度），并在中午、清晨和深夜达到峰值。\n\n调制解调器的技术日志进一步证实了该问题，显示了关键的DOCSIS错误，例如“UCD invalid or channel unusable”和“SYNC Timing Synchronization failure”，这些错误指向了上游基础设施的问题。尽管有这些详细的证据和一致的模式表明是ISP方面的自动化系统故障，据报道，Xfinity一直拒绝调查或解决该问题。"
  },
  {
    "id": "46013935",
    "title": "Agent design is still hard",
    "url": "https://lucumr.pocoo.org/2025/11/21/agents-are-hard/",
    "summary": "Armin Ronacher discusses the persistent challenges in AI agent design. He advises against high-level SDKs like Vercel AI, recommending direct use of platform-specific SDKs (e.g., Anthropic, OpenAI) for better control over model differences, tool integration, and cache management.\n\nExplicit cache management, particularly Anthropic's approach, is preferred for its cost predictability and ability to facilitate advanced strategies like context editing. Reinforcement within the agent loop is crucial, providing continuous feedback on objectives, task status, and tool failure hints. Failures should be isolated, often within subagents that report only successful outcomes, while context editing can help prune irrelevant failures, though it invalidates caches.\n\nA shared, file-system-like layer (virtual file system) is vital for code-generating agents, allowing tools to seamlessly share data and avoid operational \"dead ends.\" Communicating with users via a dedicated \"output tool\" is surprisingly tricky, posing challenges in steering tone and ensuring the tool is consistently invoked.\n\nFor model selection, Haiku and Sonnet are favored as excellent tool callers for the main agent loop. Gemini models are suitable for sub-tasks like document summarization or image analysis, where other models might encounter safety filters. The article emphasizes that efficient tool calling, rather than just low token cost, determines an agent's true expense. Finally, testing and evaluation remain the hardest problem, with no satisfying solutions identified yet, though new agent designs like Amp are being explored.",
    "chinese_title": "智能体设计仍然很难",
    "chinese_summary": "Armin Ronacher 探讨了 AI 智能体设计中持续存在的挑战。他建议不使用 Vercel AI 等高级 SDK，而是推荐直接使用特定平台（如 Anthropic、OpenAI）的 SDK，以便更好地控制模型差异、工具集成和缓存管理。\n\n明确的缓存管理，特别是 Anthropic 的方法，因其成本可预测性以及能够促进上下文编辑等高级策略而受到青睐。智能体循环内的强化至关重要，它能提供关于目标、任务状态和工具失败提示的持续反馈。故障应被隔离，通常由仅报告成功结果的子智能体处理，而上下文编辑有助于清除不相关的故障，尽管这会使缓存失效。\n\n对于代码生成智能体而言，一个共享的、类似文件系统的层（虚拟文件系统）至关重要，它能让工具无缝共享数据并避免操作上的“死胡同”。通过专用的“输出工具”与用户交流出人意料地棘手，在引导语气和确保工具持续被调用方面带来了挑战。\n\n在模型选择方面，Haiku 和 Sonnet 因其作为主智能体循环的优秀工具调用器而受到青睐。Gemini 模型适用于文档摘要或图像分析等子任务，这些任务中其他模型可能会触发安全过滤器。文章强调，高效的工具调用，而非仅仅是低廉的 token 成本，才决定了一个智能体的真实开销。最后，测试和评估仍然是最困难的问题，目前尚未找到令人满意的解决方案，尽管正在探索 Amp 等新的智能体设计。"
  },
  {
    "id": "46017175",
    "title": "Show HN: Forty.News – Daily news, but on a 40-year delay",
    "url": "https://forty.news",
    "summary": "Forty.News is a unique project, launched as a \"Show HN\" on Hacker News, that delivers daily news content with a distinctive twist: all the news presented is from exactly 40 years prior to the current day.\n\nThe service's core concept is to offer users a historical perspective, presenting headlines, stories, and cultural events that were relevant four decades ago instead of today's immediate news cycle. This approach aims to provide several benefits: it fosters nostalgia for past eras, offers context for understanding the long-term impact of events, and allows observation of how society, technology, and global affairs have evolved over time. Forty.News essentially transforms daily news consumption into a journey through recent history, making the past feel current and offering a refreshing alternative to contemporary headlines.",
    "chinese_title": "HN展示：Forty.News – 每日新闻，但延迟四十年",
    "chinese_summary": "Forty.News 是一个独特的项目，最初在 Hacker News 上以 \"Show HN\" 的形式推出，它提供每日新闻内容，带有一个鲜明的特色：所有呈现的新闻都精确地来自当前日期的四十年前。\n\n该服务的核心理念是为用户提供一个历史视角，呈现四十年前相关的头条新闻、故事和文化事件，而非今日的即时新闻周期。这种方法旨在提供多项益处：它能唤起人们对过去时代的怀旧情感，为理解事件的长期影响提供背景，并能让人观察社会、科技和全球事务如何随着时间演变。Forty.News 本质上将日常新闻消费转化为一段穿越近代历史的旅程，让过去拥有当下感，并为当代头条新闻提供了一个耳目一新的替代选择。"
  },
  {
    "id": "46016639",
    "title": "China reaches energy milestone by \"breeding\" uranium from thorium",
    "url": "https://www.scmp.com/news/china/science/article/3331312/china-reaches-energy-independence-milestone-breeding-uranium-thorium",
    "summary": "China has achieved a major energy milestone by successfully converting thorium to uranium fuel in an experimental 2-megawatt liquid-fuelled thorium-based molten salt reactor (TMSR). Located in the Gobi Desert and developed by the Chinese Academy of Sciences’ Shanghai Institute of Applied Physics, this reactor is the world's first operating example of the technology to successfully load and use thorium fuel.\n\nThe achievement, officially confirmed by China's Science and Technology Daily, provides initial proof of the technical feasibility of utilizing thorium resources in molten salt reactor systems, promising an almost endless supply of clean, sustainable nuclear energy. Scientists have also acquired the world's first experimental data on thorium operations from inside such a reactor.\n\nLi Qingnuan, a deputy director at the Shanghai Institute of Applied Physics, stated that the reactor achieved \"first criticality\" on October 11, 2023, and has been steadily generating heat through nuclear fission since then. This breakthrough represents a significant leap forward in nuclear power technology.",
    "chinese_title": "中国通过钍增殖铀实现能源里程碑",
    "chinese_summary": "中国通过在实验性的2兆瓦液态燃料钍基熔盐堆（TMSR）中成功将钍转化为铀燃料，实现了一个重要的能源里程碑。该反应堆位于戈壁沙漠，由中国科学院上海应用物理研究所开发，是世界上首个成功装载和使用钍燃料的该类技术的运行实例。\n\n这一成就已获得中国《科技日报》的官方证实，为在熔盐堆系统中利用钍资源提供了初步的技术可行性证明，有望提供几乎取之不尽的清洁、可持续核能。科学家们也从该反应堆内部获得了世界上首批钍运行实验数据。\n\n上海应用物理研究所副所长李青暖表示，该反应堆于2023年10月11日达到“首次临界”，此后一直通过核裂变稳定产生热量。这一突破标志着核电技术向前迈出了重要一步。"
  },
  {
    "id": "46012328",
    "title": "Original Superman comic becomes the highest-priced comic book ever sold",
    "url": "https://www.bbc.com/news/articles/c8e9rp0knj6o",
    "summary": "An original copy of Superman #1, the June 1939 first edition, has become the highest-priced comic book ever sold, fetching $9.12 million (£7m) at a Heritage Auctions sale. The comic was discovered last Christmas by three brothers while cleaning their late mother's California loft.\n\nFound in remarkably pristine condition under old newspapers in a cardboard box, the comic received an exceptional 9.0 rating on a 10-point scale from CGC, a leading grading service, the highest ever for this title. This surpassed the previous record-holder, Action Comics No. 1 (1938), which sold for $6 million last year.\n\nThe brothers' mother had purchased the comic, along with five others, between the Great Depression and World War Two, always hinting at an expensive collection. The cool northern California climate was credited with preserving the paper's excellent condition. The discovery, which the youngest brother called a \"testament to memory, family and the unexpected ways the past finds its way back to us,\" marks a significant moment in comic collecting history.",
    "chinese_title": "《超人》初版漫画成为史上最贵的漫画书",
    "chinese_summary": "1939年6月初版的《超人 #1》一本原版漫画，在遗产拍卖行（Heritage Auctions）的一次拍卖中以912万美元（700万英镑）成交，已成为有史以来售价最高的漫画书。这本漫画是去年圣诞节由三兄弟在清理他们已故母亲位于加利福尼亚的阁楼时发现的。\n\n这本漫画在一个纸板箱里，旧报纸下面被发现，状况极其完好，获得了领先的漫画评级服务机构CGC十分制9.0的卓越评分，这是该刊物有史以来的最高评分。这超越了此前的记录保持者——去年以600万美元售出的《动作漫画 #1》（1938年）。\n\n兄弟们的母亲在大萧条和二战之间购买了这本漫画以及另外五本，她总是暗示着自己拥有一个昂贵的收藏。加利福尼亚北部凉爽的气候被认为是保存漫画纸张良好状况的原因。这一发现标志着漫画收藏史上一个重要的时刻，最年轻的兄弟称其为“对记忆、家庭以及过去以意想不到的方式重回我们身边的证明”。"
  },
  {
    "id": "46015763",
    "title": "In a U.S. First, New Mexico Opens Doors to Free Child Care for All",
    "url": "https://www.wsj.com/us-news/in-a-u-s-first-new-mexico-opens-doors-to-free-child-care-for-all-2dfdea96",
    "summary": "Unable to access the article link.",
    "chinese_title": "新墨西哥州创全美先例，向全民开放免费儿童保育",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46016613",
    "title": "The realities of being a pop star",
    "url": "https://itscharlibb.substack.com/p/the-realities-of-being-a-pop-star",
    "summary": "In her article \"The realities of being a pop star,\" Charli XCX candidly discusses the arduous and often unglamorous nature of life as a musician, contrasting it sharply with public perception. She emphasizes that the job demands relentless hard work, often without the desired recognition or financial stability. Many artists struggle for years, facing the mental toll of constant touring, the pressures of social media, and the difficulty of maintaining a personal life while under intense scrutiny.\n\nCharli highlights the financial realities, noting that despite visible success, many artists, even those with large fanbases, aren't making substantial income, especially after label cuts and expenses. She recounts her own experiences of feeling like a product, performing through exhaustion and grief, and the struggle to balance artistic integrity with commercial demands. The article underlines the prevalence of burnout, mental health challenges, and the constant need to prove oneself in a highly competitive and often exploitative industry. Ultimately, Charli portrays pop stardom not as a dream job, but as a challenging, demanding career requiring immense resilience and sacrifice.",
    "chinese_title": "流行歌星的现实",
    "chinese_summary": "Charli XCX 在她的文章《成为流行歌星的现实》中，坦率地讨论了作为一名音乐人的生活是多么艰辛且常常不光鲜，这与公众的看法大相径庭。她强调这份工作需要不懈的努力，却常常得不到应有的认可或财务上的稳定。许多艺人奋斗多年，面临着持续巡演带来的精神损耗、社交媒体的压力以及在严密审视下维持个人生活的困难。\n\nCharli 强调了财务方面的现实，指出尽管取得了显而易见的成功，许多艺人，甚至拥有庞大粉丝群的艺人，收入并不丰厚，尤其是在唱片公司分成和各种开销之后。她讲述了自己感觉像一件商品、在精疲力尽和悲痛中表演，以及在艺术完整性与商业需求之间寻求平衡的挣扎。文章强调了倦怠、心理健康问题的普遍性，以及在高度竞争且常常剥削性的行业中不断证明自己的必要性。归根结底，Charli 将流行歌星的身份描绘成并非梦想中的工作，而是一项充满挑战、要求严苛的职业，需要巨大的韧性和牺牲。"
  },
  {
    "id": "46009994",
    "title": "California DMV approves map increase in Waymo driverless operations",
    "url": "https://www.dmv.ca.gov/portal/vehicle-industry-services/autonomous-vehicles/autonomous-vehicle-testing-permit-holders/waymo-approved-areas-of-operation-for-driverless-testing-and-deployment/",
    "summary": "The California DMV has granted Waymo significantly expanded approval for its driverless autonomous vehicle testing and deployment operations. This approval allows Waymo to operate its autonomous vehicle platforms, including specific model years of the Jaguar I-Pace (2021, 2024) and Zeekr RT (2022, 2025), at all times of day and night.\n\nOperational conditions are broad, covering all rain, fog, and other environmental conditions, and permitting operations at all speeds.\n\nCrucially, the approved operational design domain (ODD) maps now encompass a vast geographical expansion, covering numerous cities across 18 California counties. These counties include: Alameda, Contra Costa, Los Angeles, Marin, Napa, Orange, Riverside, Sacramento, San Bernardino, San Diego, San Francisco, San Mateo, Santa Clara, Santa Cruz, Solano, Sonoma, Ventura, and Yolo. This marks a substantial increase in Waymo's authorized operational footprint across the state.",
    "chinese_title": "加州DMV批准Waymo无人驾驶运营的地图范围扩大",
    "chinese_summary": "加州DMV已大幅扩大对Waymo无人驾驶自动驾驶汽车测试和部署运营的批准。该批准允许Waymo全天候运营其自动驾驶汽车平台，包括特定年份款式的捷豹I-Pace（2021、2024）和极氪RT（2022、2025）。\n\n运营条件十分广泛，涵盖所有雨、雾及其他环境条件，并允许在任何速度下运行。\n\n至关重要的是，获批的运营设计域（ODD）地图现已实现地理范围的大幅扩张，覆盖加州18个县的众多城市。这些县包括：阿拉米达、康特拉科斯塔、洛杉矶、马林、纳帕、奥兰治、河滨、萨克拉门托、圣贝纳迪诺、圣迭戈、旧金山、圣马特奥、圣克拉拉、圣克鲁斯、索拉诺、索诺玛、文图拉和优洛。这标志着Waymo在全州范围内的获批运营足迹大幅增加。"
  },
  {
    "id": "46009591",
    "title": "LAPD helicopter tracker with real-time operating costs",
    "url": "https://lapdhelicoptertracker.com/",
    "summary": "This article introduces the \"LAPD Helicopter Tracker,\" a tool designed for real-time monitoring of police aviation in Los Angeles. Its primary function is to track LAPD helicopters as they operate. A significant feature of this system is its integrated \"Cost Calculator,\" which provides users with real-time operating costs associated with these police air patrols. Essentially, it offers a dual function: tracking helicopter movements and simultaneously displaying the financial expenditure of these operations.",
    "chinese_title": "LAPD直升机追踪器（含实时运营成本）",
    "chinese_summary": "本文介绍了“LAPD直升机追踪器”，这是一款旨在实时监测洛杉矶警用航空的工具。其主要功能是在LAPD直升机运行时对其进行追踪。该系统的一个显著特点是其集成的“成本计算器”，该计算器能为用户提供这些警用空中巡逻的实时运行成本。实质上，它提供双重功能：追踪直升机动向，并同时显示这些行动的财务支出。"
  },
  {
    "id": "46023013",
    "title": "Shaders: How to draw high fidelity graphics with just x and y coordinates",
    "url": "https://www.makingsoftware.com/chapters/shaders",
    "summary": "Shaders are small programs executed directly on the Graphics Processing Unit (GPU), revolutionizing how high-fidelity graphics are rendered. The article \"Shaders: How to draw high fidelity graphics with just x and y coordinates\" explains they moved modern graphics beyond rigid \"fixed-function pipelines\" to a programmable system, offering immense control over every pixel and vertex.\n\nThere are two main types:\n1.  **Vertex Shaders:** These process individual vertices (points in 3D space), transforming their positions from the virtual world into 2D screen coordinates. They also prepare other data like colors and normals for later stages.\n2.  **Fragment Shaders (Pixel Shaders):** After geometry is projected and rasterized into potential pixels (fragments), fragment shaders determine the final color of each pixel. This is where the magic of high fidelity happens: complex lighting, textures, shadows, reflections, and other visual effects are calculated at this stage, giving objects their realistic appearance.\n\nBy running these programs in parallel across potentially millions of vertices and pixels, shaders efficiently create intricate visual detail. They allow developers to precisely define how every element contributes to the final image, translating raw coordinate data into stunning, dynamic, and realistic graphics displayed on a 2D screen.",
    "chinese_title": "着色器：如何仅用x和y坐标绘制高保真图形",
    "chinese_summary": "着色器是直接在图形处理器（GPU）上执行的小型程序，它们彻底改变了高保真图形的渲染方式。文章《着色器：如何仅用x和y坐标绘制高保真图形》解释道，它们将现代图形从僵化的“固定功能管线”推进到可编程系统，从而对每个像素和顶点都提供了巨大的控制力。\n\n主要有两种类型：\n1.  **顶点着色器：** 它们处理单个顶点（三维空间中的点），将它们的位置从虚拟世界转换为2D屏幕坐标。它们还为后续阶段准备颜色和法线等其他数据。\n2.  **片段着色器（像素着色器）：** 在几何体被投影并光栅化成潜在的像素（片段）后，片段着色器决定每个像素的最终颜色。这正是高保真奇迹发生的地方：复杂的照明、纹理、阴影、反射和其他视觉效果在此阶段计算，赋予物体逼真的外观。\n\n通过并行运行这些程序，跨越可能数百万个顶点和像素，着色器有效地创造出复杂的视觉细节。它们允许开发者精确定义每个元素如何贡献最终图像，将原始坐标数据转换为在2D屏幕上显示的、令人惊叹、动态且逼真的图形。"
  },
  {
    "id": "46018380",
    "title": "WorldGen – Text to Immersive 3D Worlds",
    "url": "https://www.meta.com/en-gb/blog/worldgen-3d-world-generation-reality-labs-generative-ai-research/",
    "summary": "Meta Reality Labs has introduced WorldGen, a research project designed to generate immersive 3D worlds from simple text prompts. WorldGen aims to overcome the significant challenges and time commitment involved in manually creating virtual environments for VR/AR experiences, which often requires specialized skills and extensive labor.\n\nUnlike existing text-to-3D tools that typically create individual objects, WorldGen focuses on generating entire, high-quality, explorable 3D environments, including terrain, objects, and textures, all from a natural language description. The system leverages generative AI to interpret user prompts like \"a lush jungle with ancient ruins\" and translate them into a coherent, interactive virtual space. This allows creators, even those without extensive 3D modeling expertise, to rapidly prototype and iterate on virtual worlds.\n\nA key innovation of WorldGen is its ability to create expansive, explorable environments that can be navigated in real-time within VR/AR headsets. This research represents a significant step towards democratizing 3D content creation, making it faster and more accessible for a wider range of users, from developers to casual creators, to build their own metaverse experiences. WorldGen promises to accelerate the development of rich, dynamic virtual worlds by simplifying the initial creation process.",
    "chinese_title": "WorldGen – 文本到沉浸式3D世界",
    "chinese_summary": "Meta Reality Labs 推出了一项名为 WorldGen 的研究项目，旨在通过简单的文本提示生成沉浸式3D世界。WorldGen 旨在克服为 VR/AR 体验手动创建虚拟环境所面临的巨大挑战和时间投入，因为这项工作通常需要专业技能和大量劳力。\n\n与现有通常创建单个物体的文本转3D工具不同，WorldGen 专注于通过自然语言描述，生成完整、高质量、可探索的3D环境，包括地形、物体和纹理。该系统利用生成式AI来解释“一片郁郁葱葱、带有古老废墟的丛林”等用户提示，并将其转化为一个连贯的交互式虚拟空间。这使得创作者，即使没有丰富的3D建模专业知识，也能快速地对虚拟世界进行原型设计和迭代。\n\nWorldGen 的一项关键创新是它能够创建广阔、可探索的环境，并能在 VR/AR 头显中进行实时导航。这项研究代表着在普及3D内容创作方面迈出了重要一步，使从开发者到普通创作者在内的更广泛用户能够更快、更便捷地构建自己的元宇宙体验。WorldGen 有望通过简化初始创建过程，加速丰富、动态虚拟世界的开发。"
  },
  {
    "id": "46018292",
    "title": "Kids who own smartphones before age 13 have worse mental health outcomes: Study",
    "url": "https://abcnews.go.com/GMA/Family/kids-smartphones-age-13-worse-mental-health-outcomes/story?id=123961082",
    "summary": "A new study suggests children who own smartphones before age 13 face worse mental health outcomes as young adults. Analyzing self-reported data from over 100,000 individuals aged 18-24, the research found earlier smartphone ownership correlated with increased mental health symptoms like aggression, detachment, and suicidal thoughts, with impacts compounding for every year of early ownership.\n\nBoth boys and girls reported lower self-image and self-worth. Girls showed reduced emotional resilience and confidence, while boys felt less calm, stable, and empathetic. Alarmingly, 48% of young women with smartphones by ages 5-6 reported severe suicidal thoughts, compared to 28% of those receiving phones at 13 or older. For young men, these figures were 31% and 20% respectively.\n\nStudy authors attribute these issues, particularly gender differences, to social media use, cyberbullying, poor sleep, and family relationships. Experts recommend restricting smartphone and social media access for children under 13-14, promoting digital literacy, and encouraging corporate accountability. Specific recommendations include delaying smartphones until high school, no social media before age 16, establishing phone-free schools, and encouraging parents to model responsible phone use and discuss internet safety. Alternatives like flip phones are also suggested. The American Academy of Pediatrics further recommends families follow the \"5 C's\" for media use: Child, Content, Calm, Crowding out, and Communication.",
    "chinese_title": "13岁前拥有智能手机的儿童心理健康状况更差：研究表明",
    "chinese_summary": "一项新研究表明，在13岁前拥有智能手机的儿童，在成年早期面临更糟糕的心理健康状况。该研究分析了逾10万名18-24岁个体自我报告的数据，发现更早拥有智能手机与攻击性、疏离感和自杀念头等心理健康症状的增加存在关联，且每提前一年拥有，其负面影响就会加剧。\n\n男孩和女孩都报告称自我形象和自我价值感较低。女孩的情绪韧性和自信心下降，而男孩则感到更不安、不稳定，且缺乏同理心。令人警觉的是，5-6岁时拥有智能手机的年轻女性中，有48%报告有严重的自杀念头，相比之下，13岁或更晚才获得手机的女性中这一比例为28%。对于年轻男性，这些数字分别为31%和20%。\n\n研究作者将这些问题，尤其是性别差异，归因于社交媒体使用、网络欺凌、睡眠不足和家庭关系。专家建议限制13-14岁以下儿童使用智能手机和社交媒体，提升数字素养，并鼓励企业承担责任。具体建议包括将智能手机推迟到高中阶段使用，16岁前不使用社交媒体，建立无手机学校，并鼓励家长以身作则，负责任地使用手机，并讨论互联网安全。还建议使用翻盖手机等替代品。美国儿科学会进一步建议家庭遵循媒体使用的“5 C”原则：即儿童（Child）、内容（Content）、平静（Calm）、挤占（Crowding out）和沟通（Communication）。"
  },
  {
    "id": "46008156",
    "title": "Discontinuation of ARM Notebook with Snapdragon X Elite SoC",
    "url": "https://www.tuxedocomputers.com/en/Discontinuation-of-ARM-notebooks-with-Snapdragon-X-Elite-SoC.tuxedo",
    "summary": "The provided content, despite its title \"Discontinuation of ARM Notebook with Snapdragon X Elite SoC,\" does not address the topic of product discontinuation or mention ARM notebooks or Snapdragon X Elite SoCs.\n\nInstead, the text outlines general features and benefits related to a store or its products. Key information includes a prerequisite for using the store: users must activate JavaScript and deactivate script blockers. Product-related highlights emphasize Linux compatibility, an extensive warranty of up to 5 years, immediate readiness for use, and a guarantee of quality with \"Assembled in Germany.\" Furthermore, the company promotes strong customer focus with \"German Data Privacy\" and \"German Tech Support.\"",
    "chinese_title": "搭载骁龙 X Elite SoC 的 ARM 笔记本停产",
    "chinese_summary": "所提供的内容，尽管其标题为“搭载骁龙X Elite SoC的ARM笔记本停产”，但并未涉及产品停产的话题，也未提及ARM笔记本或骁龙X Elite SoC。\n\n相反，该文本概述了与商店或其产品相关的通用功能和优势。关键信息包括使用商店的先决条件：用户必须启用JavaScript并禁用脚本拦截器。产品相关亮点强调Linux兼容性、最长5年的保修、即买即用，以及“德国组装”的品质保证。此外，该公司通过“德国数据隐私”和“德国技术支持”来体现其强大的客户关注。"
  },
  {
    "id": "46020151",
    "title": "GCC SC approves inclusion of Algol 68 Front End",
    "url": "https://gcc.gnu.org/pipermail/gcc/2025-November/247020.html",
    "summary": "The GCC Steering Committee has approved the inclusion of the Algol 68 Front End into the GCC `trunk`, designating it as experimental. This approval comes with several stipulations: Algol 68 will not be built by default with all languages, it is not part of the GCC release criteria, other developers can decline to work on its issues, and it will be removed if it becomes unmaintained or \"bit rots.\"\n\nTo ensure its development continues, Jose E. Marchesi has been appointed as the Algol 68 front end maintainer. The committee also invited Algol 68 developers to propose concrete changes that would facilitate maintaining front ends in a separate branch of the GCC repository, should development within the `trunk` prove difficult. The announcement was made by David Edelsohn.",
    "chinese_title": "GCC 指导委员会批准纳入 Algol 68 前端",
    "chinese_summary": "GCC指导委员会已批准将Algol 68前端纳入GCC主干（`trunk`），并将其指定为实验性项目。此项批准附带多项条件：Algol 68将不会默认随所有语言一起构建，它不属于GCC发布标准的一部分，其他开发者可以拒绝处理其问题，并且如果它无人维护或代码腐烂，它将被移除。为确保其持续发展，Jose E. Marchesi已被任命为Algol 68前端的维护者。委员会还邀请Algol 68开发者提出具体的修改建议，这些修改将有助于在GCC代码库的独立分支中维护前端，以防在主干中开发遇到困难。此项声明由David Edelsohn发布。"
  },
  {
    "id": "46024184",
    "title": "Court filings allege Meta downplayed risks to children and misled the public",
    "url": "https://time.com/7336204/meta-lawsuit-files-child-safety/",
    "summary": "A recent court filing, unsealed as part of a major lawsuit against social media companies, alleges Meta knowingly downplayed risks to children and misled the public about harm on its platforms. The plaintiffs' brief, drawing on internal documents and executive testimonies, paints a damning picture of Meta's priorities.\n\nKey allegations against Meta include:\n*   **High Tolerance for Trafficking:** Instagram's former head of safety, Vaishnavi Jayakumar, testified Meta had a \"17x\" strike policy for accounts engaging in \"trafficking of humans for sex,\" meaning 16 violations were tolerated before suspension. The platform also lacked a simple way to report child sexual abuse content.\n*   **Misleading Congress on Mental Health:** Meta allegedly knew its products exacerbated teen anxiety and depression, even halting a study that showed reduced distress when users deactivated accounts. The company then reportedly told Congress it couldn't determine a correlation.\n*   **Ignoring Stranger Danger:** Meta was aware millions of adult strangers contacted minors. Despite recommendations to default teen accounts to private settings to prevent this, the company's growth team resisted, fearing reduced engagement. This feature wasn't fully implemented until 2024, leading to billions of \"inappropriate interactions with children.\"\n*   **Aggressive Targeting of Youth:** The brief claims Meta aggressively pursued young users, including \"tweens\" and children as young as 5-10, and knew millions under 13 used its platforms despite federal law and its own policies.\n\nMeta disputes the allegations, calling them \"cherry-picked\" and \"misinformed.\" The company highlights recent safety features like Instagram Teen Accounts, which default users under 18 to private settings, as evidence of its commitment to protecting young users. However, plaintiffs argue Meta resisted such crucial safety changes for years.",
    "chinese_title": "法庭文件指控Meta淡化了对儿童的风险并误导了公众。",
    "chinese_summary": "最近一份作为针对社交媒体公司的一项重大诉讼一部分而解封的法庭文件指控，Meta公司明知故犯地淡化了其平台对儿童的风险，并就其危害误导公众。原告援引内部文件和高管证词提交的简报，描绘了一幅Meta在优先事项上令人不安的图景。\n\n针对Meta的主要指控包括：\n*   **对贩运行为的高度容忍：** Instagram前安全主管瓦伊什纳维·贾亚库玛作证称，Meta对从事“人口性贩运”的账户实行“17次违规”政策，这意味着在账户被暂停之前，平台会容忍16次违规行为。该平台还缺乏举报儿童性虐待内容的简便方法。\n*   **在心理健康问题上误导国会：** 据称，Meta明知其产品会加剧青少年的焦虑和抑郁，甚至叫停了一项显示用户停用账户后痛苦减轻的研究。随后，该公司据报道告知国会，它无法确定相关性。\n*   **忽视陌生人风险：** Meta知晓数百万成年陌生人曾联系未成年人。尽管有建议将青少年账户默认设置为私密模式以防止此类情况，但该公司的增长团队因担心用户参与度下降而予以抵制。此功能直到2024年才完全实施，导致了数十亿次“不当儿童互动”。\n*   **积极锁定年轻用户：** 简报称，Meta积极争取年轻用户，包括青少年早期用户以及5至10岁的儿童，并且明知数百万13岁以下儿童在使用其平台，尽管这违反了联邦法律和其自身政策。\n\nMeta否认了这些指控，称其为“断章取义”和“误导性信息”。该公司强调了最近的安全功能，例如将18岁以下用户默认设置为私密模式的Instagram青少年账户，以此作为其致力于保护年轻用户的证据。然而，原告辩称Meta多年来一直抵制这些关键的安全变革。"
  },
  {
    "id": "46024644",
    "title": "73% of AI startups are just prompt engineering",
    "url": "https://pub.towardsai.net/i-reverse-engineered-200-ai-startups-73-are-lying-a8610acab0d3",
    "summary": "An AI engineer's three-month reverse-engineering study of 200 \"AI\" startups revealed a significant discrepancy between market claims and actual technical depth. The author found that a staggering 73% of these companies were primarily relying on prompt engineering with existing Large Language Models (LLMs) like GPT-4. They were essentially building user interfaces and integrations on top of readily available APIs rather than developing novel artificial intelligence.\n\nThe research categorized startups into three groups:\n*   **Prompt Engineers (73%):** Focused on UI/UX, branding, and integrations around existing LLMs, offering minimal unique AI/ML innovation.\n*   **Fine-tuners (17%):** Engaged in training or fine-tuning open-source models (e.g., Llama 2, Mistral) with proprietary data.\n*   **Innovators (10%):** Developing genuinely new AI/ML models, architectures, or algorithms, requiring extensive R&D.\n\nThe article cautions investors and customers to scrutinize claims of \"proprietary AI,\" as many startups lack unique underlying technology. For the majority (prompt engineers), competitive advantage stems from user experience, specific integrations, or marketing, not groundbreaking AI. The author suggests that these prompt-engineering-centric businesses may face long-term challenges in defensibility and value creation, as their core offering could be easily replicated or superseded by advancements from major LLM providers. The study underscores the prevalence of \"AI washing\" and the need for a realistic assessment of the burgeoning AI startup landscape.",
    "chinese_title": "73% 的 AI 初创公司仅仅是提示工程",
    "chinese_summary": "一位AI工程师对200家“AI”初创公司进行了为期三个月的逆向工程研究，揭示了市场宣传与实际技术深度之间的巨大差异。作者发现，高达73%的公司主要依赖于使用GPT-4等现有大型语言模型（LLM）进行提示工程。他们本质上是在现成的API之上构建用户界面和集成，而非开发新颖的人工智能技术。\n\n该研究将初创公司分为三类：\n*   **提示工程师（73%）：** 专注于围绕现有LLM的用户界面/用户体验（UI/UX）、品牌建设和集成，提供的独特AI/ML创新极少。\n*   **微调者（17%）：** 使用专有数据训练或微调开源模型（例如Llama 2、Mistral）。\n*   **创新者（10%）：** 开发真正新颖的AI/ML模型、架构或算法，需要大量的研发投入。\n\n文章提醒投资者和客户仔细审查“专有AI”的声明，因为许多初创公司缺乏独特的基础技术。对于大多数公司（提示工程师）而言，其竞争优势来源于用户体验、特定的集成或市场营销，而非突破性的AI技术。作者指出，这些以提示工程为核心的企业可能在长期防御性和价值创造方面面临挑战，因为它们的核心产品很容易被复制，或被主要LLM提供商的进步所取代。该研究强调了“AI洗白”（AI washing）现象的普遍性，以及对新兴AI初创企业格局进行现实评估的必要性。"
  },
  {
    "id": "46020543",
    "title": "Unusual circuits in the Intel 386's standard cell logic",
    "url": "https://www.righto.com/2025/11/unusual-386-standard-cell-circuits.html",
    "summary": "The Intel 386, launched in 1985 with 285,000 transistors, adopted standard cell logic—an automated layout technique using standardized circuit blocks—to manage its complexity and meet design schedules. While effective, studying its circuitry reveals several unexpected design choices.\n\nThe register control logic, which handles the intricate selection of source and destination registers for instructions (e.g., distinguishing EAX from AX/AH/AL, managing direction bits across 17 cases), employs giant multiplexers. These are implemented using CMOS switches and inverters within standard cells, efficiently combining numerous control signals to select specific registers.\n\nA peculiar finding is a single \"misplaced\" PMOS transistor, sitting unconventionally between two columns of standard cells. This anomaly is hypothesized to be a manual \"bug fix.\" Rather than undertaking the costly and time-consuming process of regenerating the entire cell layout, designers likely inserted this transistor into an available routing channel and wired it manually, saving development time.\n\nMost intriguingly, the author discovered \"fake inverters.\" These cells, physically resembling standard inverters, initially caused confusion due to seemingly shorted inputs and conflicting outputs with multiplexers. However, it was realized they were not inverters at all, but rather independent NMOS and PMOS transistors with separate inputs. This allowed them to act as additional, independent switching elements for multiplexers, pulling the output high, low, or remaining off, thereby expanding the multiplexer's functionality using an existing cell layout.",
    "chinese_title": "Intel 386标准单元逻辑中的异常电路",
    "chinese_summary": "英特尔386于1985年推出，拥有28.5万个晶体管，采用了标准单元逻辑——一种利用标准化电路模块的自动化布局技术——以管理其复杂性并满足设计进度。尽管有效，但对其电路的研究揭示了几种出人意料的设计选择。\n\n寄存器控制逻辑负责指令源寄存器和目标寄存器（例如，区分EAX与AX/AH/AL，处理17种情况下的方向位）的复杂选择，采用了巨型多路复用器。这些多路复用器在标准单元内利用CMOS开关和反相器实现，有效地组合大量控制信号来选择特定寄存器。\n\n一个奇特的发现是一个“错位”的PMOS晶体管，它不寻常地位于两列标准单元之间。这种异常被推测为一个手动“bug修复”。设计师没有采取重新生成整个单元布局这种昂贵且耗时的过程，而是可能将这个晶体管插入到可用的布线通道中并手动布线，从而节省了开发时间。\n\n最有趣的是，作者发现了“假反相器”。这些单元在物理上类似于标准反相器，最初因为输入看似短路以及与多路复用器输出冲突而引起困惑。然而，后来人们意识到它们根本不是反相器，而是具有独立输入的独立NMOS和PMOS晶体管。这使得它们能够作为多路复用器的额外独立开关元件，将输出拉高、拉低或保持关闭，从而利用现有的单元布局扩展了多路复用器的功能。"
  },
  {
    "id": "46017782",
    "title": "Markdown is holding you back",
    "url": "https://newsletter.bphogan.com/archive/issue-45-markdown-is-holding-you-back/",
    "summary": "The article \"Markdown is Holding You Back\" argues that while Markdown is popular and easy to use, its lack of semantic structure makes it insufficient for serious technical documentation projects. Despite its ubiquity, Markdown acts as \"implicit typing\" for content, offering no schema, consistency enforcement, or machine-readable distinctions between elements. Its multiple inconsistent flavors and the need for extensions like MDX highlight its limitations for complex content.\n\nThe author emphasizes the importance of \"semantic markup,\" which describes *what* content is (e.g., a step, a concept) rather than just how it looks. This approach enables robust content transformation and reuse across various formats (HTML, PDF, ePub) and facilitates better machine consumption by LLMs and AI agents, which rely on clear structure.\n\nThe article introduces several alternative formats:\n1.  **reStructuredText:** From the Python ecosystem, offering directives, roles, and structural semantics, used by Sphinx.\n2.  **AsciiDoc:** Human-readable yet semantically expressive, supporting attributes, conditional content, admonitions, and specific markup for UI elements. The AsciiDoctor toolchain allows transformation to multiple formats.\n3.  **DocBook (XML):** An XML-based model designed for technical publishing, providing a rich set of predefined, meaningful tags for hierarchical and semantic structure, ensuring validation and industrial-grade transformations.\n4.  **DITA (XML):** An open standard XML architecture for topic-based content, emphasizing reuse, specialization, and modular design, with capabilities for content filtering and multi-channel publishing via the DITA Open Toolkit.\n\nWhile acknowledging the verbosity and learning curve of XML-based formats, the author contends that if teams are already \"bolting semantics\" onto Markdown, they are incurring complexity without the benefits of standardization and portability.\n\nThe key takeaway is to choose the richest format manageable for a project, using Markdown as an output format rather than the source of truth, to ensure context and structure are preserved for reuse and machine consumption. For quick documents, Markdown is fine; for structured developer docs, reStructuredText or AsciiDoc are better; and for large, multi-channel publishing, DocBook or DITA are recommended.",
    "chinese_title": "Markdown 拖了你的后腿",
    "chinese_summary": "文章《Markdown正在拖你的后腿》指出，尽管Markdown流行且易于使用，但其缺乏语义结构使其不足以胜任严肃的技术文档项目。尽管它无处不在，Markdown却充当了内容的“隐式类型”，不提供架构、一致性强制或元素之间的机器可读区分。其多种不一致的“方言”以及对MDX等扩展的需求，都突显了其处理复杂内容的局限性。\n\n作者强调了“语义标记”的重要性，它描述的是内容*是什么*（例如，一个步骤、一个概念），而不仅仅是它*看起来*如何。这种方法能够实现跨多种格式（HTML、PDF、ePub）的健壮内容转换和重用，并通过清晰的结构促进大型语言模型（LLM）和人工智能代理更好地消费内容。\n\n文章介绍了以下几种替代格式：\n1.  **reStructuredText：** 源自Python生态系统，提供指令（directives）、角色（roles）和结构化语义，被Sphinx广泛使用。\n2.  **AsciiDoc：** 人类可读但语义表达力强，支持属性（attributes）、条件内容（conditional content）、警示（admonitions）以及UI元素的特定标记。AsciiDoctor工具链可将其转换为多种格式。\n3.  **DocBook (XML)：** 一种基于XML的模型，专为技术出版设计，提供丰富的预定义且有意义的标签，用于构建层次化和语义结构，确保验证和工业级的转换。\n4.  **DITA (XML)：** 一种用于基于主题内容的开放标准XML架构，强调重用、专业化和模块化设计，并通过DITA Open Toolkit实现内容过滤和多渠道发布功能。\n\n作者承认基于XML的格式冗长且学习曲线较长，但他认为，如果团队已经在Markdown上“硬塞语义”，那么他们只是在增加复杂性，却无法获得标准化和可移植性的好处。\n\n核心要点是为项目选择最丰富且易于管理的格式，将Markdown用作输出格式而非真理之源，以确保上下文和结构得以保留，便于重用和机器消费。对于快速文档，Markdown足够；对于结构化的开发者文档，reStructuredText或AsciiDoc更佳；而对于大型、多渠道出版，推荐DocBook或DITA。"
  },
  {
    "id": "46015379",
    "title": "'The French people want to save us': help pours in for glassmaker Duralex",
    "url": "https://www.theguardian.com/world/2025/nov/22/french-people-want-to-save-us-help-pours-glassmaker-duralex",
    "summary": "French glassmaker Duralex, famous for its durable Picardie glasses and a symbol of national nostalgia, successfully raised €5 million in emergency public funding in just five hours and 40 minutes. The appeal saw pledges soar to nearly €20 million, but as a staff cooperative, Duralex could only accept the €5 million maximum.\n\nDirector General François Marciano noted the overwhelming response reflected the French people's desire to save a national brand and counter factory closures. The company, a staff cooperative since a buyout 18 months ago, saw this public outpouring trigger a \"tsunami of orders,\" making it challenging to keep up with demand.\n\nThe factory operates a gas-fired oven at 1,400C, producing iconic, robust glassware that is microwave, freezer, and dishwasher-safe, and shatters safely into small pieces. The Picardie glass, first appearing in 1954, is lauded for its timeless design.\n\nThe €5 million raised will modernize the factory and develop new products, including a partnership with the Élysée presidential palace shop and plans for pint glasses targeting UK and US markets. While domestic interest is high, Duralex aims to increase international sales and hopes to break even by 2027.",
    "chinese_title": "“法国人民想要拯救我们”：玻璃制造商杜拉莱克斯援助如潮涌来",
    "chinese_summary": "法国玻璃制造商Duralex，以其耐用的Picardie系列玻璃杯而闻名，是国家怀旧情结的象征，在短短5小时40分钟内成功筹集了500万欧元紧急公共资金。尽管这次募捐呼吁收到了近2000万欧元的认捐，但作为一家员工合作社，Duralex只能接受最高500万欧元的款项。\n\n总经理弗朗索瓦·马尔恰诺指出，压倒性的响应反映了法国人民拯救民族品牌、阻止工厂倒闭的愿望。该公司自18个月前被员工收购以来一直是员工合作社，此次公众的热情引发了“订单海啸”，使其难以满足市场需求。\n\n工厂使用一台1400摄氏度的燃气烤炉，生产标志性的坚固玻璃器皿，这些器皿可用于微波炉、冰箱和洗碗机，并且碎裂时能安全地碎成小块。Picardie玻璃杯于1954年首次亮相，因其永恒的设计而备受赞誉。\n\n筹集的500万欧元将用于工厂现代化改造和新产品开发，其中包括与爱丽舍宫总统商店的合作，以及针对英国和美国市场推出品脱杯的计划。尽管国内关注度很高，Duralex旨在增加国际销售，并希望到2027年实现收支平衡。"
  },
  {
    "id": "46010329",
    "title": "How I learned Vulkan and wrote a small game engine with it (2024)",
    "url": "https://edw.is/learning-vulkan/",
    "summary": "The author, a self-taught graphics programmer with OpenGL experience, details his three-month journey of learning Vulkan and building a small game engine, EDBR, with two accompanying game demos. He advocates starting with OpenGL (recommending `learnopengl.com` and related resources) to grasp graphics fundamentals before tackling Vulkan's complexity.\n\nA core piece of advice is to avoid \"bike-shedding\" and over-engineering; instead, focus on immediate needs, build a specific game first, and extract reusable engine components later. The author chose Vulkan for desktop platforms due to its open-source nature and future potential, noting OpenGL's deprecation and WebGPU's current limitations despite its benefits as a learning step. He acknowledges Vulkan's initial intimidation but asserts it's more approachable now, thanks to features like dynamic rendering, useful libraries, and excellent resources like `vkguide.dev`.\n\nThe EDBR engine, initially a learning project, is designed for smaller, level-based games. Its rendering pipeline involves compute shader skinning, Cascaded Shadow Mapping (CSM), PBR shading into a multi-sampled texture, manual depth resolve, post-processing (depth fog, with future bloom/tone-mapping), and efficient UI rendering. He highly recommends `vk-bootstrap` for simplifying Vulkan's boilerplate. The article concludes by encouraging others that if he could learn and build with Vulkan, they can too.",
    "chinese_title": "我如何学习Vulkan并用它编写小型游戏引擎 (2024)",
    "chinese_summary": "作者是一位自学成才、拥有OpenGL经验的图形程序员，他详细介绍了自己学习Vulkan并在三个月内构建小型游戏引擎EDBR的历程，同时附带了两个游戏Demo。他主张在应对Vulkan的复杂性之前，应先从OpenGL入手（推荐`learnopengl.com`及相关资源）以掌握图形学基础。\n\n一个核心建议是避免“琐碎争论”（bike-shedding）和过度工程化；相反，应专注于当前需求，先构建一个具体的游戏，然后再提取可复用的引擎组件。作者选择Vulkan用于桌面平台，原因在于其开源特性和未来潜力，并指出OpenGL已被弃用，而WebGPU尽管在学习方面有益，但目前仍有局限。他承认Vulkan最初令人望而生畏，但坚称如今由于动态渲染等特性、实用的库以及`vkguide.dev`等优秀资源，Vulkan已变得更易上手。\n\nEDBR引擎最初是一个学习项目，专为小型、基于关卡的游戏设计。其渲染管线包括计算着色器蒙皮、级联阴影贴图（CSM）、PBR着色到多采样纹理、手动深度解析、后处理（深度雾，未来将加入泛光/色调映射）以及高效的UI渲染。他强烈推荐使用`vk-bootstrap`来简化Vulkan的样板代码。文章最后鼓励其他人，如果他能学会并用Vulkan进行构建，那么他们也能做到。"
  },
  {
    "id": "46017910",
    "title": "The Mozilla Cycle, Part III: Mozilla Dies in Ignominy",
    "url": "https://taggart-tech.com/mozilla-cycle-pt3/",
    "summary": "In \"The Mozilla Cycle, Part III: Mozilla Dies in Ignominy,\" the author fiercely criticizes Mozilla's strategic pivot towards Artificial Intelligence, arguing it betrays their core mission and alienates their community. The immediate catalyst is Firefox's \"AI Window\" feature, which replaces traditional search with a language model prompt, drawing widespread negative feedback from users.\n\nMozilla's new Strategic Plan outlines a future where generative AI is a \"transformative technology,\" necessitating Mozilla's development of \"open source\" AI alternatives. Key goals include all Mozilla organizations having a flagship AI product by 2028, significantly diversifying revenue away from search, growing community, and increasing investment returns.\n\nThe author systematically dissects and refutes these claims. They argue generative AI has not proven transformative, trustworthy, or user-centered in practice. The concept of \"open source AI\" is challenged, particularly regarding the ethical and legal issues of copyrighted and scraped training data for large language models. The author finds Mozilla's financial and community growth targets delusional, especially given declining traditional revenue and negative user reactions.\n\nUltimately, the article concludes that Mozilla's desperate AI pivot is an \"existential mandate\" driven by the impending decline of search revenue, its primary income stream. The author believes Mozilla is sacrificing its principles for survival, leading to a \"schism of purpose\" between its AI-converted leadership and its alienated core audience, foretelling its \"ignominy.\"",
    "chinese_title": "莫兹拉循环，第三篇：莫兹拉蒙羞陨落",
    "chinese_summary": "在《Mozilla周期，第三部分：Mozilla耻辱消亡》一文中，作者猛烈抨击Mozilla向人工智能的战略转型，认为这背叛了其核心使命并疏远了其社区。直接导火索是Firefox的“AI窗口”功能，该功能用语言模型提示取代了传统搜索，引发了用户的广泛负面反馈。\n\nMozilla的新战略计划描绘了一个未来，其中生成式AI是一种“颠覆性技术”，这使得Mozilla有必要开发“开源”AI替代方案。主要目标包括到2028年所有Mozilla组织拥有一款旗舰AI产品，大幅实现收入来源多元化以摆脱对搜索的依赖，发展社区，以及提高投资回报。\n\n作者系统地剖析并反驳了这些主张。他们认为，生成式AI在实践中并未证明具有颠覆性、值得信赖或以用户为中心。“开源AI”的概念受到质疑，尤其是在大型语言模型中，其受版权保护和抓取的训练数据所涉及的伦理和法律问题方面。作者认为，考虑到传统收入的下降和用户的负面反应，Mozilla的财务和社区增长目标是痴心妄想。\n\n最终，文章得出结论，Mozilla孤注一掷的AI转型是其“生存的必然要求”，缘于其主要收入来源——搜索收入即将衰落。作者认为，Mozilla正在牺牲其原则以求生存，这将导致其转向AI的领导层和疏远的核心受众之间出现“目的分裂”，预示着其“耻辱的结局”。"
  },
  {
    "id": "46023460",
    "title": "Racket v9.0",
    "url": "https://blog.racket-lang.org/2025/11/racket-v9-0.html",
    "summary": "Racket v9.0 has been released on November 22, 2025, announced by Stephen De Gabrielle and John Clements. This major update is now available for download.\n\nThe headline feature of Racket 9.0 is the introduction of Parallel Threads, significantly enhancing the language's concurrency capabilities beyond existing green threads, futures, and places. Users can create parallel threads using the `#:pool` argument, and `#:keep 'results` with `thread-wait` allows for result retrieval.\n\nOther notable additions include:\n*   The `black-box` wrapper to prevent compiler optimization, aiding benchmark accuracy.\n*   The `decompile-linklet` function for mapping linklets back to s-expressions.\n*   `processor-count` in BC Racket now consistently returns the parallel count.\n*   Distribution of \"natipkg\" packages for AArch64, supporting package infrastructure.\n*   Improved Check Syntax with deeper identifier tracking.\n*   Weibull distributions added to the math library.\n*   Numerous other repairs and documentation enhancements.\n\nThe release acknowledges contributions from a long list of developers. Racket, an open-source project, encourages new contributors to join its community. Feedback and discussions are welcomed on Discourse or Discord, and users are encouraged to help spread the word about Racket 9.0. The full release announcement and highlights are available on the Racket blog.",
    "chinese_title": "Racket 9.0",
    "chinese_summary": "Racket v9.0 已于2025年11月22日发布，由Stephen De Gabrielle和John Clements宣布。此次重大更新现已开放下载。\n\nRacket 9.0 的主要亮点是引入了并行线程（Parallel Threads），这显著增强了该语言的并发能力，超越了现有的绿色线程、futures 和 places。用户可以使用 `#:pool` 参数创建并行线程，并且结合 `thread-wait` 使用 `#:keep 'results` 可以检索结果。\n\n其他值得注意的补充包括：\n*   `black-box` 包装器，用于阻止编译器优化，从而提高基准测试的准确性。\n*   `decompile-linklet` 函数，用于将 linklet 映射回 s-表达式。\n*   BC Racket 中的 `processor-count` 现在始终返回并行计数。\n*   为 AArch64 分发 \"natipkg\" 包，以支持包基础设施。\n*   改进了的“检查语法”（Check Syntax），具有更深层次的标识符跟踪功能。\n*   数学库中添加了威布尔分布（Weibull distributions）。\n*   其他大量的修复和文档增强。\n\n本次发布感谢众多开发者的贡献。Racket 作为一个开源项目，鼓励新的贡献者加入其社区。欢迎在 Discourse 或 Discord 上提出反馈和进行讨论，并鼓励用户帮助传播 Racket 9.0 的消息。完整的发布公告和亮点可在 Racket 博客上查看。"
  },
  {
    "id": "46011978",
    "title": "Moss Survives 9 Months in Space Vacuum",
    "url": "https://scienceclock.com/moss-survives-9-months-in-space-vacuum/",
    "summary": "Scientists exposed spore capsules of spreading earthmoss (Physcomitrium patens) to the extreme conditions of open space on the International Space Station for nine months. Mounted externally, the moss spores endured direct solar radiation, vacuum, and significant temperature fluctuations.\n\nContrary to expectations of near-zero survival, researchers were surprised to find that over 80 percent of the spores successfully germinated once back on Earth. The spores showed normal growth in follow-up tests, with only a minor decrease in chlorophyll a, indicating no major stress from their time in orbit.\n\nThis exceptional resilience is attributed to the evolutionary history of bryophytes, which were among the first plants to move from water to land about 500 million years ago. Their ancient adaptation to withstand drying and direct sunlight before soils existed likely contributed to their robust protective structures.\n\nThe survival of these moss spores places them alongside other known extremophiles like tardigrades and certain microbes that can tolerate direct space exposure. This discovery has significant implications for future extraterrestrial colonization efforts. Mosses require minimal soil and can extract nutrients directly from rock, making them prime candidates for establishing early ecosystems on the Moon or Mars. Researchers anticipate this work will open new possibilities for constructing self-sustaining environments beyond Earth. The findings were published in iScience.",
    "chinese_title": "苔藓太空真空存活9个月",
    "chinese_summary": "科学家将匍匐土藓（Physcomitrium patens）的孢子囊暴露在国际空间站的开放空间极端条件下长达九个月。这些苔藓孢子被安装在外部，经受了直接太阳辐射、真空和剧烈的温度波动。\n\n与预期的接近零存活率相反，研究人员惊讶地发现，一旦返回地球，超过80%的孢子成功发芽。在后续测试中，这些孢子表现出正常生长，叶绿素a含量仅略有下降，这表明它们在轨道期间没有承受重大的压力。\n\n这种卓越的韧性归因于苔藓植物的进化史，它们是大约5亿年前首批从水生环境迁移到陆地的植物之一。它们在土壤形成之前就已经适应了抵御干燥和阳光直射，这可能造就了它们强大的保护结构。\n\n这些苔藓孢子的存活使其与缓步动物和某些能够耐受直接空间暴露的微生物等其他已知极端生物并列。这一发现对未来的地外殖民努力具有重要意义。苔藓植物所需土壤极少，可以直接从岩石中提取养分，这使它们成为在月球或火星上建立早期生态系统的首选。研究人员预计这项工作将为在地球以外构建自我维持的环境开辟新的可能性。相关发现发表在《iScience》杂志上。"
  },
  {
    "id": "46008769",
    "title": "Pixar: The Early Days A never-before-seen 1996 interview",
    "url": "https://stevejobsarchive.com/stories/pixar-early-days",
    "summary": "This article previews a never-before-seen 1996 interview with Steve Jobs, released to mark *Toy Story*'s 30th anniversary. Conducted exactly one year after its 1995 debut, the interview captures Pixar at a pivotal moment.\n\n*Toy Story*, the world's first entirely computer-animated feature, was an instant critical and commercial success. It transformed Pixar, which went public the week after the film's premiere, achieving a $1.5 billion valuation and the largest IPO of 1995. Following its Special Achievement Oscar win, Pixar shifted focus, closing its TV-commercial unit to concentrate on feature films. By the 1996 interview, the team had grown 70%, *A Bug’s Life* was in production, and Jobs was renegotiating Pixar's partnership with Disney, leveraging its newfound success.\n\nIn the footage, Jobs discusses the strategic \"long game\" behind Pixar's success, detailing a business model that gives artists and engineers a stake in their creations. He reflects on lessons learned from Disney about focus and discipline, the challenges of leading a uniquely talented team, and the incentives that inspire loyalty. Jobs emphasizes Pixar's deeper purpose: to tell lasting stories and contribute enduring value to culture.\n\nJobs's experience at Pixar, collaborating closely with Ed Catmull and refining a management approach centered on talent, profoundly influenced his subsequent return to Apple as CEO. He applied these insights to build Apple on timeless ideas made new through technology.",
    "chinese_title": "皮克斯早期：1996年前所未见的访谈",
    "chinese_summary": "本文预告了一段从未公开过的1996年史蒂夫·乔布斯访谈，该访谈为纪念《玩具总动员》上映30周年而发布。这段访谈在电影1995年首次亮相整整一年后进行，捕捉了皮克斯的一个关键时刻。\n\n作为全球首部全电脑动画长片，《玩具总动员》立刻获得了评论界和商业上的巨大成功。它改变了皮克斯，该片首映后一周，皮克斯便上市了，估值达到15亿美元，成为1995年最大的IPO。在赢得奥斯卡特别成就奖后，皮克斯转移了重心，关闭了其电视广告部门，专注于长片制作。到了1996年访谈时，团队规模已增长70%，《虫虫危机》正在制作中，乔布斯正利用皮克斯新取得的成功，重新谈判与迪士尼的合作关系。\n\n在这段影像中，乔布斯讨论了皮克斯成功背后的战略性“长远布局”，详细阐述了一种让艺术家和工程师在作品中拥有股份的商业模式。他反思了从迪士尼学到的关于专注和纪律的经验，领导一支天赋异禀团队所面临的挑战，以及激发忠诚的激励机制。乔布斯强调了皮克斯更深层次的宗旨：讲述经久不衰的故事，并为文化贡献持久的价值。\n\n乔布斯在皮克斯的经历——与埃德·卡特穆尔（Ed Catmull）紧密合作并完善以人才为中心的管理方法——深刻影响了他后来重返苹果担任CEO。他将这些见解应用于苹果公司的建设，通过技术使那些永恒的理念焕然一新。"
  },
  {
    "id": "46019636",
    "title": "NTSB report: Decryption of images from the Titan submersible camera [pdf] (2024)",
    "url": "https://data.ntsb.gov/Docket/Document/docBLOB?ID=18741602&FileExtension=pdf&FileName=Underwater%20Camera%20-%20Specialist%27s%20Factual%20Report-Rel.pdf",
    "summary": "The provided \"content\" is raw, compressed PDF file data, not a human-readable article. As an AI, I cannot directly parse or interpret this binary information to extract its textual or visual content. Therefore, I am unable to provide a summary of the NTSB report's findings or the decrypted images themselves.\n\nHowever, based solely on the title, \"NTSB report: Decryption of images from the Titan submersible camera [pdf] (2024)\", the article is an official NTSB (National Transportation Safety Board) report, likely published in 2024. Its central focus is the decryption of images obtained from the camera of the ill-fated Titan submersible. This indicates an ongoing investigation into the Titan incident, with efforts concentrated on recovering and analyzing visual data to understand the events that led to its loss.",
    "chinese_title": "NTSB报告：泰坦号潜水器摄像头图像解密 [pdf] (2024)",
    "chinese_summary": "提供的内容是原始的、压缩的PDF文件数据，而不是人类可读的文章。作为人工智能，我无法直接解析或解释这些二进制信息以提取其文本或视觉内容。因此，我无法提供NTSB报告的调查结果摘要或解密后的图像本身。\n\n然而，仅根据标题“NTSB报告：泰坦号潜水器摄像头图像解密[pdf] (2024)”，这篇文章是一份官方的NTSB（美国国家运输安全委员会）报告，很可能在2024年发布。其核心焦点是对从不幸的泰坦号潜水器摄像头中获取的图像进行解密。这表明对泰坦号事件的调查仍在进行中，工作重点是恢复和分析视觉数据，以了解导致其失事的事件。"
  },
  {
    "id": "46021179",
    "title": "Google Revisits JPEG XL in Chromium After Earlier Removal",
    "url": "https://windowsreport.com/google-revisits-jpeg-xl-in-chromium-after-earlier-removal/",
    "summary": "Google is reversing its 2020 decision to remove JPEG XL support from Chrome, with a representative confirming that work has restarted to integrate the image format into Chromium. The company plans to ship it in Chrome once long-term maintenance and launch requirements are met.\n\nThe shift comes as other platforms, including Safari and Windows 11 (via an image extension), have adopted JPEG XL, and the format is also confirmed for use in PDF documents. Google also noted continuous demand from developers and users for its return.\n\nA developer has already submitted new, feature-complete code to reintroduce JPEG XL to Chromium, notably including animation support absent in earlier versions. This code passes most automated tests but remains under review and is not yet available to users. Google emphasizes the need for secure and long-term supported integration.\n\nJPEG XL is a modern image format designed to replace traditional JPEGs, capable of reducing file sizes without visual quality loss, which can lead to faster web page loading and reduced data usage. While development has resumed after years, Google has not provided a specific timeline for its availability in Chrome.",
    "chinese_title": "谷歌在Chromium中重新审视JPEG XL (此前曾移除)",
    "chinese_summary": "谷歌正在撤销其2020年从Chrome中移除对JPEG XL支持的决定，一位代表证实，将该图片格式集成到Chromium的工作已重新启动。该公司计划在满足长期维护和发布要求后，将其在Chrome中发布。\n\n这一转变发生之际，其他平台，包括Safari和Windows 11（通过图像扩展），都已经采用了JPEG XL，并且该格式也已确认可用于PDF文档。谷歌还指出，开发者和用户对其回归的需求持续不断。\n\n一位开发者已提交了新的、功能完整的代码，以重新将JPEG XL引入Chromium，值得注意的是，其中包含了早期版本所没有的动画支持。这些代码通过了大多数自动化测试，但仍在审核中，尚未向用户提供。谷歌强调需要安全且能长期支持的集成。\n\nJPEG XL是一种现代图像格式，旨在取代传统的JPEG，它能够在不损失视觉质量的情况下减小文件大小，从而带来更快的网页加载速度和更少的数据使用量。尽管在中断多年后开发已恢复，但谷歌尚未提供其在Chrome中可用的具体时间表。"
  },
  {
    "id": "46008628",
    "title": "Boom, bubble, bust, boom. Why should AI be different?",
    "url": "https://crazystupidtech.com/2025/11/21/boom-bubble-bust-boom-why-should-ai-be-different/",
    "summary": "The article argues that the artificial intelligence revolution, though only three years old, is experiencing one of the biggest technology bubbles in modern times, highly reminiscent of the 1999 internet bubble. Authors Fred Vogelstein and Om Malik, having witnessed the dot-com era, point to similar conversations about \"AI dog years\" and massive, rapidly inflating spending.\n\nGlobal AI capital expenditures and venture investments already exceed $600 billion this year, with total AI-related spending potentially reaching $1.5 trillion in 2025—far surpassing the 1999 internet bubble's $360 billion (in 2025 dollars) and inflating in two-thirds the time. Despite strong NVIDIA earnings, major AI-exposed stocks like Microsoft, Amazon, Meta, and Oracle have seen significant declines, reflecting investor concern over excessive spending.\n\nThe authors contend that humans are poor at predicting short-term tech impacts, leading to over-investment. They deem this AI bubble potentially scarier than the dot-com bust due to greater, more concentrated capital at risk among major tech giants, who are spending tens of billions annually without fully proven AI business models. OpenAI, valued at $500 billion, is highlighted for its massive cash burn ($8 billion in 2025, $17 billion in 2026) and projected positive cash flow only by 2029, with anticipated spending 16 times that of early Amazon.\n\nFour key vulnerabilities are identified: too much spending, too much leverage, crazy deals, and geopolitical risks with China. The broader US economic instability and AI's national security implications further compound the risk. While committed capital may extend the \"mania\" into 2026, a rapid shift in investor sentiment could quickly drive down valuations.",
    "chinese_title": "繁荣，泡沫，破灭，繁荣。AI 又有什么不同呢？",
    "chinese_summary": "文章指出，尽管人工智能革命只有三年历史，却正在经历现代史上最大的科技泡沫之一，极大地让人联想到1999年的互联网泡沫。曾亲历互联网泡沫时代的作者弗雷德·沃格尔斯坦和奥姆·马利克，指出当前关于“AI狗年”的讨论以及巨额、快速膨胀的支出与当年如出一辙。\n\n全球AI资本支出和风险投资今年已超过6000亿美元，预计到2025年，与AI相关的总支出可能达到1.5万亿美元——远超1999年互联网泡沫时期的3600亿美元（按2025年美元计算），且仅用三分之二的时间就达到此规模。尽管英伟达盈利强劲，微软、亚马逊、Meta和甲骨文等主要受AI影响的股票均出现显著下跌，反映出投资者对过度支出的担忧。\n\n作者认为，人类不擅长预测短期科技影响，导致过度投资。他们认为，此次AI泡沫可能比互联网泡沫破裂更可怕，因为主要科技巨头面临着更大、更集中的资本风险，它们每年花费数百亿美元，而AI商业模式尚未完全得到验证。估值5000亿美元的OpenAI因其巨大的烧钱速度而受到关注（2025年80亿美元，2026年170亿美元），预计到2029年才能实现正现金流，其预期支出是早期亚马逊的16倍。\n\n文章指出了四个主要脆弱点：过度支出、过高杠杆、疯狂交易以及与中国的地缘政治风险。美国更广泛的经济不稳定和AI的国家安全影响进一步加剧了风险。尽管已投入的资本可能会将这种“狂热”延续到2026年，但投资者情绪的快速转变可能会迅速压低估值。"
  },
  {
    "id": "46010806",
    "title": "Sharper MRI scans may be on horizon thanks to new physics-based model",
    "url": "https://news.rice.edu/news/2025/sharper-mri-scans-may-be-horizon-thanks-new-physics-based-model",
    "summary": "Sharper MRI scans may be on the horizon thanks to a new physics-based model developed by Rice University engineers. Traditional MRI often suffers from image distortion, particularly in areas like the abdomen and heart, due to the body's varying magnetic properties that cause the main magnetic field to bend. This necessitates time-consuming calibrations and can lead to blurry images, limiting diagnostic accuracy and the technique's use for certain organs.\n\nThe new computational model addresses this challenge by accurately predicting how the magnetic field will distort within a patient's body. By leveraging the known physics of how magnetic fields interact with different tissues, the model can compensate for these distortions, effectively straightening the \"bent\" magnetic field. This allows for significantly sharper images, faster scan times, and potentially opens up MRI applications to areas previously difficult to image, such as the liver, kidneys, and pancreas. The researchers have successfully tested the model on 3D abdominal scans, demonstrating its ability to deliver clear, undistorted images, paving the way for improved medical diagnostics.",
    "chinese_title": "得益于新的基于物理学模型，更清晰的核磁共振扫描指日可待。",
    "chinese_summary": "更清晰的MRI扫描可能即将实现，这得益于莱斯大学工程师开发的一种新的基于物理学的模型。传统的MRI常受图像失真困扰，尤其是在腹部和心脏等区域，这是因为人体磁性特性的差异导致主磁场弯曲。这需要耗时的校准，并可能导致图像模糊，从而限制了诊断准确性以及该技术在某些器官上的应用。\n\n这种新的计算模型通过准确预测磁场在患者体内如何失真来解决这一挑战。通过利用磁场与不同组织相互作用的已知物理原理，该模型可以补偿这些失真，有效地“拉直”弯曲的磁场。这使得图像明显更清晰、扫描时间更快，并可能将MRI应用扩展到以前难以成像的区域，例如肝脏、肾脏和胰腺。研究人员已成功地在3D腹部扫描中测试了该模型，证明其能够提供清晰、无失真的图像，为改进医学诊断铺平了道路。"
  },
  {
    "id": "46009660",
    "title": "Is Matrix Multiplication Ugly?",
    "url": "https://mathenchant.wordpress.com/2025/11/21/is-matrix-multiplication-ugly/",
    "summary": "The author, James Propp, strongly refutes Stephen Witt's claim in *The New Yorker* that matrix multiplication is \"ugly\" and lacks beauty or symmetry because A x B is not always equal to B x A. Witt compared it to \"hammering a nail\" and misapplied G.H. Hardy's critique of \"ugly mathematics.\"\n\nPropp argues that matrices are fundamentally about **transformations**, not just static arrays of numbers. The non-commutativity (AB ≠ BA) is a natural and essential characteristic of composing sequential transformations, much like the order of operations in daily life (e.g., preparing a salad). This is not a flaw but reflects the differing outcomes when transformations are applied in different orders.\n\nHe highlights that matrix algebra is actually the \"language of symmetry and transformation,\" dating back two millennia, and is highly regarded for its elegance. Propp suggests Witt confuses the conceptual beauty of matrix theory with the **tedium of repetitive calculation** involved in multiplying large matrices. While performing these calculations can be boring and feel \"ugly,\" this \"soul-crushing part\" is now outsourced to computers. The repetitive nature of such computations, ironically, can stem from excessive symmetry. The author contrasts standard matrix multiplication with the simpler, more symmetrical Hadamard product, noting that the latter is less versatile, implying that the \"ugliness\" perceived by Witt is a misunderstanding of what makes matrix multiplication so powerful and widely applicable.",
    "chinese_title": "矩阵乘法是否丑陋？",
    "chinese_summary": "作者詹姆斯·普罗普（James Propp）强烈驳斥了斯蒂芬·维特（Stephen Witt）在《纽约客》杂志中的说法，即矩阵乘法是“丑陋的”，缺乏美感或对称性，因为它 A x B 并非总是等于 B x A。维特将其比作“敲钉子”，并误用了G.H.哈代（G.H. Hardy）对“丑陋数学”的批判。\n\n普罗普认为，矩阵本质上是关于**变换**的，而不仅仅是静态的数字数组。不可交换性（AB ≠ BA）是组合序列变换的自然且本质的特征，就像日常生活中操作的顺序一样（例如，准备沙拉）。这并非缺陷，而是反映了当变换以不同顺序应用时所产生的不同结果。\n\n他强调，矩阵代数实际上是“对称与变换的语言”，其历史可追溯到两千年前，并因其优雅性而备受推崇。普罗普认为维特混淆了矩阵理论的概念美与大矩阵乘法中涉及的**重复计算的繁琐**。尽管执行这些计算可能很无聊，让人觉得“丑陋”，但这个“令人崩溃的部分”现在已外包给计算机。讽刺的是，这种计算的重复性可能源于过度的对称性。作者将标准矩阵乘法与更简单、更对称的阿达马积进行对比，并指出后者用途较少，暗示维特所感知的“丑陋”是对矩阵乘法为何如此强大且应用广泛的误解。"
  },
  {
    "id": "46025721",
    "title": "Native Secure Enclave backed SSH keys on macOS",
    "url": "https://gist.github.com/arianvp/5f59f1783e3eaf1a2d4cd8e952bb4acf",
    "summary": "The article highlights that macOS Tahoe (implying Ventura 13.x+) now offers native support for Secure Enclave (SE) backed SSH keys, superseding third-party solutions. This functionality leverages `/usr/lib/ssh-keychain.dylib`, which has been updated to implement the `SecurityKeyProvider` interface, typically used for FIDO2 devices.\n\nTo create a biometric-protected, SE-generated SSH key, users can execute `sc_auth create-ctk-identity -l ssh -k p-256-ne -t bio`. Key details can be verified with `sc_auth list-ctk-identities` and keys deleted using `delete-ctk-identity`.\n\nFor SSH integration, the public/private keypair (where the \"private\" key is a non-secret reference to the FIDO credential) can be \"downloaded\" to a file using `ssh-keygen -w /usr/lib/ssh-keychain.dylib -K -N \"\"`. This allows standard `ssh-copy-id` and direct `ssh` commands, explicitly setting `SecurityKeyProvider=/usr/lib/ssh-keychain.dylib`.\n\nAlternatively, keys can be added directly to `ssh-agent` with `ssh-add -K -S /usr/lib/ssh-keychain.dylib`. To make the `SecurityKeyProvider` default for all SSH operations, it's recommended to set `export SSH_SK_PROVIDER=/usr/lib/ssh-keychain.dylib` in your `.zprofile`.\n\nThe article also describes an \"exportable\" key type (`-k p-256`) where the private key is encrypted *by* the SE for backup convenience, though this method is considered less secure. These keys can be exported with `sc_auth export-ctk-identity` and imported elsewhere.",
    "chinese_title": "macOS 原生安全隔离区支持的 SSH 密钥",
    "chinese_summary": "该文章强调，macOS Tahoe（指Ventura 13.x及更高版本）现已原生支持由Secure Enclave（SE）支持的SSH密钥，取代了第三方解决方案。此功能利用了`/usr/lib/ssh-keychain.dylib`，该文件已更新以实现通常用于FIDO2设备的`SecurityKeyProvider`接口。\n\n要创建受生物识别保护、由SE生成的SSH密钥，用户可以执行`sc_auth create-ctk-identity -l ssh -k p-256-ne -t bio`。密钥详情可通过`sc_auth list-ctk-identities`验证，并使用`delete-ctk-identity`删除密钥。\n\n对于SSH集成，公钥/私钥对（其中“私钥”是对FIDO凭据的非秘密引用）可以通过`ssh-keygen -w /usr/lib/ssh-keychain.dylib -K -N \"\"`“下载”到文件。这允许使用标准的`ssh-copy-id`和直接的`ssh`命令，并明确设置`SecurityKeyProvider=/usr/lib/ssh-keychain.dylib`。\n\n或者，密钥可以直接通过`ssh-add -K -S /usr/lib/ssh-keychain.dylib`添加到`ssh-agent`。为了使`SecurityKeyProvider`成为所有SSH操作的默认设置，建议在`.zprofile`中设置`export SSH_SK_PROVIDER=/usr/lib/ssh-keychain.dylib`。\n\n文章还描述了一种“可导出”的密钥类型（`-k p-256`），其中私钥由SE加密以方便备份，尽管这种方法被认为安全性较低。这些密钥可以使用`sc_auth export-ctk-identity`导出并导入到其他地方。"
  },
  {
    "id": "46022704",
    "title": "Silicon Valley startups: being evil, again and again",
    "url": "https://notesfrombelow.org/article/silicon-valley-startups-doing-evil-again-and-again",
    "summary": "Ian Wright argues that Silicon Valley, despite its progressive image and claims of \"changing the world,\" is fundamentally \"evil\" due to its institutionalization of \"theft\" on a global scale. While the Valley offers technological benefits and presents an image of humane workplaces, it simultaneously represses awareness of severe social ills, poverty, and exploitation in its own backyard, which the author links to its underlying structure and business models (e.g., surveillance, military tech).\n\nThe core problem, Wright explains, lies in the capitalist firm's property relations, specifically the use of *equity capital*. He asserts that workers are the actual creators of a company's value and profit. While investors providing *loan capital* deserve repayment and a risk premium, *equity investors* demand outright ownership of the firm. Once the initial investment is recouped, these owners continue to appropriate profits indefinitely, without contributing further labor or capital. This appropriation of value created by workers, without equivalent exchange, is termed \"economic exploitation\" or \"theft.\"\n\nThis fundamental flaw, baked into the startup model from inception, scales globally with successful companies. Wright challenges aspiring high-tech workers to rethink this exploitative structure, urging them to consider alternatives like profit-sharing worker cooperatives to build genuinely ethical firms that do not rely on institutionalized theft.",
    "chinese_title": "硅谷初创公司：一再作恶",
    "chinese_summary": "伊恩·怀特认为，尽管硅谷有着进步的形象并声称“改变世界”，但由于其在全球范围内将“盗窃”制度化，它本质上是“邪恶”的。尽管硅谷提供了技术优势并塑造了人性化工作场所的形象，但它同时抑制了人们对其自身内部存在的严重社会弊病、贫困和剥削的认识，作者将其归因于其底层结构和商业模式（例如，监控、军事技术）。\n\n怀特解释说，核心问题在于资本主义企业的产权关系，特别是股权资本的使用。他断言，工人才是公司价值和利润的真正创造者。提供贷款资本的投资者理应获得偿还和风险溢价，但股权投资者却要求对公司拥有完全所有权。一旦初始投资收回，这些所有者便无限期地继续侵占利润，而无需再贡献劳动或资本。这种在没有等价交换的情况下侵占由工人创造的价值的行为，被称为“经济剥削”或“盗窃”。\n\n这一从一开始就植根于创业模式中的根本缺陷，随着公司的成功在全球范围内扩大。怀特挑战那些有抱负的高科技工作者重新思考这种剥削性结构，敦促他们考虑利润分享型工人合作社等替代方案，以建立真正道德、不依赖制度化盗窃的公司。"
  },
  {
    "id": "46020502",
    "title": "MCP Apps just dropped (OpenAI and Anthropic collab) and I think this is huge",
    "url": "http://blog.modelcontextprotocol.io/posts/2025-11-21-mcp-apps/",
    "summary": "OpenAI and Anthropic, in collaboration with MCP-UI creators and maintainers, have introduced the MCP Apps Extension (SEP-1865). This significant proposal aims to standardize support for interactive user interfaces within the Model Context Protocol (MCP), addressing a key limitation where MCP servers are restricted to text and structured data exchanges.\n\nCurrently, this text-only constraint creates friction for displaying visual information, gathering complex user input, and leads to ecosystem fragmentation as different solutions emerge. The new extension builds on the success of MCP-UI and OpenAI Apps SDK, which demonstrated the demand for rich UI experiences in conversational AI.\n\nKey features of the MCP Apps Extension include:\n*   **Standardized UI Resource Declaration:** UI templates are declared as `ui://` URI resources and referenced in tool metadata, allowing hosts to prefetch and review them for performance and security.\n*   **MCP Transport for Communication:** UI components communicate with hosts using the existing MCP JSON-RPC base protocol over `postMessage`, ensuring structured, auditable interactions.\n*   **HTML Support:** Initial support for HTML content rendered in sandboxed iframes, providing universal browser compatibility and a strong security model.\n*   **Security-First Design:** Features like iframe sandboxing, predeclared templates, auditable messages, and user consent for UI-initiated tool calls create robust defense.\n*   **Backward Compatibility:** It's an optional extension, allowing gradual adoption while requiring servers to provide text-only fallbacks.\n\nThe MCP Apps Extension is envisioned as more than just schema changes; it's a foundational \"agentic app runtime\" that will enable novel interactions between AI models, users, and applications. The community is invited to review the specification and contribute to its development.",
    "chinese_title": "MCP Apps 刚刚上线了 (OpenAI 与 Anthropic 合作)，我觉得这意义重大。",
    "chinese_summary": "OpenAI和Anthropic与MCP-UI的创建者和维护者合作，推出了MCP应用扩展（SEP-1865）。这一重要提案旨在标准化模型上下文协议（MCP）中对交互式用户界面的支持，解决了MCP服务器仅限于文本和结构化数据交换的关键局限。\n\n目前，这种仅限文本的限制在显示视觉信息、收集复杂用户输入方面造成了障碍，并导致随着不同解决方案的出现而生态系统碎片化。新的扩展借鉴了MCP-UI和OpenAI应用SDK的成功经验，这表明了对话式AI中对丰富UI体验的需求。\n\nMCP应用扩展的关键特性包括：\n*   **标准化UI资源声明：** UI模板被声明为`ui://` URI资源并在工具元数据中引用，允许宿主预取和审查它们以提高性能和安全性。\n*   **用于通信的MCP传输：** UI组件使用现有MCP JSON-RPC基础协议通过`postMessage`与宿主通信，确保结构化、可审计的交互。\n*   **HTML支持：** 初步支持在沙盒iframe中渲染HTML内容，提供通用浏览器兼容性和强大的安全模型。\n*   **安全优先设计：** iframe沙盒、预声明模板、可审计消息以及用户对UI发起的工具调用的同意等特性构建了强大的防御。\n*   **向后兼容性：** 这是一个可选扩展，允许逐步采用，同时要求服务器提供仅限文本的备用方案。\n\nMCP应用扩展被设想为不仅仅是模式更改；它是一个基础性的“智能体应用运行时”，将实现AI模型、用户和应用之间的新颖交互。社区受邀审查该规范并为其开发做出贡献。"
  },
  {
    "id": "46025196",
    "title": "Are consumers just tech debt to Microsoft?",
    "url": "https://birchtree.me/blog/are-consumers-just-tech-debt-to-microsoft/",
    "summary": "The author anticipates a gradual but significant shift in Windows' consumer market share, driven by three key factors.\n\nFirstly, Microsoft appears to have deprioritized consumers, focusing instead on AI, web services, and enterprise. Recent offerings like Copilot are unpopular, and Windows 11 changes have been poorly received, suggesting a disinterest in the average user.\n\nSecondly, a rumored affordable MacBook, expected in 2026, could attract new users. This meaningfully cheaper Apple device, combined with Apple's consumer-first approach, would compete at price points currently dominated by many Windows computers.\n\nFinally, the gaming community, which uses Windows largely out of necessity, could migrate. Valve's Steam Machine, set for release in early 2026 after the successful Steam Deck, will run Windows games efficiently on Linux. The author suggests many PC gamers would switch to an optimized Linux gaming OS if available.\n\nWhile acknowledging the slow pace of market change, the author believes these converging elements could meaningfully impact the consumer PC landscape.",
    "chinese_title": "消费者对微软而言只是技术债吗？",
    "chinese_summary": "作者预计，在三个关键因素的推动下，Windows的消费者市场份额将发生渐进但显著的转变。\n\n首先，微软似乎已将消费者放在次要位置，转而专注于人工智能、网络服务和企业领域。最近推出的Copilot等产品不受欢迎，Windows 11的改动反响不佳，这表明微软对普通用户缺乏兴趣。\n\n其次，传闻中预计将于2026年推出的平价MacBook有望吸引新用户。这款价格显著更低的苹果设备，再加上苹果以消费者为先的策略，将在目前由众多Windows电脑占据主导地位的价格区间内展开竞争。\n\n最后，基本上出于必要才使用Windows的玩家群体可能会迁移。Valve的Steam Machine在Steam Deck成功之后，定于2026年初发布，它将能在Linux上高效运行Windows游戏。作者指出，如果能提供优化过的Linux游戏操作系统，许多PC玩家将会转向。\n\n尽管作者承认市场变化速度缓慢，但他认为这些汇聚的因素可能会对消费级PC市场格局产生显著影响。"
  },
  {
    "id": "46019760",
    "title": "Germany to classify date rape drugs as weapons to ensure justice for survivors",
    "url": "https://www.theguardian.com/society/2025/nov/21/germany-to-classify-date-drugs-as-weapons-in-attempt-to-ensure-justice-for-survivors",
    "summary": "Germany plans to classify date rape drugs as weapons, a move intended to enable \"significantly stricter\" prosecutions and ensure justice for survivors of domestic violence and sexual assault. Interior Minister Alexander Dobrindt stated this classification creates the basis for enhanced legal action, aiming to make women feel safe and able to move freely.\n\nThe announcement comes as Germany faces increasing figures in related crimes. In 2024, nearly 54,000 women and girls were victims of sexual offenses, a 2.1% increase from the previous year, with 36% experiencing rape or sexual assault. Police also registered a record almost 266,000 domestic violence victims in 2023, a 3.8% rise, although the head of the federal criminal police office, Holger Münch, noted a high number of unreported cases.\n\nIn response, the German government is implementing several measures. A parliamentary debate on a bill proposing a mandatory five-year minimum prison sentence for date rape drug use in sexual assaults was recently postponed. However, a draft law allowing electronic ankle monitors to track domestic violence perpetrators and a device to warn victims of their proximity has been approved. Furthermore, funding is secured for a national app allowing domestic abuse victims to secretly document incidents for court use. These efforts aim to improve victim protection, support, and encourage more victims to report crimes.",
    "chinese_title": "德国将迷奸药定性为武器，以确保受害者获得公正。",
    "chinese_summary": "德国计划将约会强奸药物归类为武器，此举旨在实现“显著更严厉”的起诉，并确保家庭暴力和性侵幸存者获得正义。内政部长亚历山大·多布林特表示，此项分类为加强法律行动奠定了基础，旨在让女性感到安全并能自由行动。\n\n这一宣布的背景是德国面临相关犯罪案件数量的不断增加。2024年，近5.4万名妇女和女孩成为性犯罪的受害者，比上一年增加了2.1%，其中36%遭遇了强奸或性侵犯。警方在2023年还登记了创纪录的近26.6万名家庭暴力受害者，增长了3.8%，尽管联邦刑事警察局局长霍尔格·明希指出，仍有大量案件未被报告。\n\n作为回应，德国政府正在实施多项措施。一项提议对性侵中使用约会强奸药物的行为处以至少五年监禁的法案的议会辩论最近被推迟。然而，一项允许使用电子脚踝监测器追踪家庭暴力肇事者并配备警示受害者其靠近的设备的法案草案已获批准。此外，一项国家应用程序的资金已获保障，该程序允许家庭虐待受害者秘密记录事件以供法庭使用。这些努力旨在改善对受害者的保护、支持，并鼓励更多受害者报案。"
  },
  {
    "id": "46018158",
    "title": "A Reverse Engineer's Anatomy of the macOS Boot Chain and Security Architecture",
    "url": "https://stack.int.mov/a-reverse-engineers-anatomy-of-the-macos-boot-chain-security-architecture/",
    "summary": "The macOS boot chain on Apple Silicon begins with an immutable \"Silicon Root of Trust\" established by the Boot ROM (SecureROM), mask-programmed during fabrication. This highest-privilege, one-shot code executes at reset, initializing hardware (MMU, caches, stack) within internal SRAM before DRAM is available.\n\nThe Boot ROM's primary role is to securely load and verify the Low-Level Bootloader (LLB). Confidentiality is ensured by the hardware-fused GID Key, a 256-bit AES key never exposed to software. This GID Key decrypts a Keybag (KBAG) within the LLB's Image4 container, which in turn provides the per-image key to decrypt the LLB payload. Integrity is verified using a hardware Public Key Accelerator (PKA) that validates the LLB's cryptographic signature against an embedded Apple Root CA public key, with built-in fault injection hardening.\n\nFor reverse engineers, differentiating Development (Dev-fused) from Production (Prod) silicon is crucial. This distinction, encoded by the CPFM fuse field, dictates debug capabilities (JTAG/SWD), signature enforcement policies, and GID key variants. Prod devices enforce strict security, while Dev-fused units allow more debug visibility and relaxed boot policies. After its execution, the Boot ROM unmaps itself, making its contents inaccessible from later stages.\n\nBeyond boot, Apple extends Armv8-A with proprietary ISA features like Pointer Authentication (PAC). PAC cryptographically signs pointers using dedicated hardware keys (APIA/B for instruction, APDA/B for data, APGA for generic) in unused address bits, protecting control flow and data integrity from corruption. Failed PAC authentication results in a non-canonical pointer, preventing exploits.",
    "chinese_title": "逆向工程师剖析 macOS 启动链和安全架构",
    "chinese_summary": "苹果芯片上的 macOS 启动链始于由启动 ROM (SecureROM) 建立的不可变“硅信任根”，该 ROM 在制造过程中通过掩膜编程写入。这段具有最高权限的一次性代码在复位时执行，在 DRAM 可用之前，在内部 SRAM 中初始化硬件（MMU、缓存、栈）。\n\n启动 ROM 的主要作用是安全地加载和验证低级启动加载器 (LLB)。保密性通过硬件熔断的 GID 密钥来确保，这是一个永不暴露给软件的 256 位 AES 密钥。该 GID 密钥解密 LLB 的 Image4 容器中的密钥包 (KBAG)，密钥包再提供每映像密钥来解密 LLB 有效载荷。完整性通过硬件公钥加速器 (PKA) 进行验证，该加速器将 LLB 的加密签名与嵌入式苹果根 CA 公钥进行比对，并内置故障注入强化功能。\n\n对于逆向工程师来说，区分开发版（Dev-fused）和生产版（Prod）硅片至关重要。这种由 CPFM 熔断字段编码的区别决定了调试能力 (JTAG/SWD)、签名强制策略和 GID 密钥变体。生产设备强制执行严格的安全措施，而开发版熔断单元则允许更多的调试可见性和宽松的启动策略。执行后，启动 ROM 会解除映射自身，使其内容在后期阶段无法访问。\n\n除了启动，苹果还通过指针认证 (PAC) 等专有 ISA 功能扩展了 Armv8-A。PAC 使用专用硬件密钥（指令用 APIA/B，数据用 APDA/B，通用用 APGA）在未使用的地址位中对指针进行加密签名，保护控制流和数据完整性免受损坏。PAC 认证失败会导致非规范指针，从而阻止漏洞利用。"
  },
  {
    "id": "46013960",
    "title": "ADHD and monotropism (2023)",
    "url": "https://monotropism.org/adhd/",
    "summary": "The article explores the proposition that Attention Deficit Hyperactivity Disorder (ADHD) and autism, or a \"Kinetic Cognitive Style\" (KCS), may share an underlying root in monotropism. Monotropism, originally a theory of autism, describes a cognitive style where attention and resources are highly concentrated on a few interests, leaving little for other things.\n\nDespite distinct diagnostic criteria—ADHD as attentional, autism as social—many individuals with ADHD identify strongly with monotropic traits. The high comorbidity (30-80%) and familial links between ADHD and autism suggest they are not entirely separate conditions. The author argues that apparently contradictory traits, like autistic rigidity versus ADHD impulsivity, can be reconciled under a monotropic lens, just as autism itself presents with seemingly opposite characteristics (e.g., hyperlexia vs. language difficulties).\n\nADHD traits like impulsivity could stem from losing awareness when attention shifts, and inattention from profound difficulty disengaging from current interests. Hyperfocus is common to both. While a need to move (hyperactivity) resembles autistic stimming, the perceived \"attention-hopping\" aspect of hyperactivity seems to be in tension with monotropism's difficulty shifting focus. This tension is addressed by suggesting KCS might involve monotropic processing combined with factors like difficulty accessing \"flow states,\" or that apparent hopping occurs within a deeper attention tunnel.\n\nThe article concludes that while more research is needed, preliminary findings show a strong correlation between monotropism and both ADHD and autism, especially in combination. Monotropism offers an internal perspective, challenging diagnoses based solely on outward presentation.",
    "chinese_title": "ADHD 和单一性注意力 (2023)",
    "chinese_summary": "本文探讨了注意缺陷多动障碍（ADHD）和自闭症，或“动能认知风格”（KCS），可能在单向注意（monotropism）中共享一个潜在根源的论点。单向注意最初是关于自闭症的一种理论，它描述了一种认知风格，即注意力与资源高度集中于少数兴趣，而对其他事物则关注甚少。\n\n尽管诊断标准不同——ADHD主要表现为注意力问题，自闭症则主要表现为社交问题——许多ADHD患者强烈认同单向注意的特质。ADHD和自闭症之间的高度共病率（30-80%）及家族联系表明，它们并非完全独立的病症。作者认为，看似矛盾的特质，如自闭症的刻板僵化与ADHD的冲动，可以在单向注意的视角下得到调和，就像自闭症本身也表现出看似对立的特征一样（例如，阅读超常与语言障碍）。\n\nADHD的冲动等特质可能源于注意力转移时意识的丧失，而注意力不集中则源于极难脱离当前的兴趣。超度专注是两者共有的特点。虽然对运动的需求（多动）类似于自闭症的刻板重复行为，但多动症中被感知到的“注意力跳跃”方面似乎与单向注意难以转移焦点的特性相矛盾。这种矛盾可以通过以下观点来解决：KCS可能涉及单向注意处理与诸如难以进入“心流状态”等因素的结合，或者表面上的跳跃发生在更深层的注意力隧道内。\n\n文章总结道，尽管需要更多研究，但初步发现表明，单向注意与ADHD和自闭症（特别是两者结合时）之间存在强烈的关联。单向注意提供了一种内在视角，挑战了仅基于外在表现的诊断方式。"
  },
  {
    "id": "46009056",
    "title": "Arduino Terms of Service and Privacy Policy update: setting the record straight",
    "url": "https://blog.arduino.cc/2025/11/21/the-arduino-terms-of-service-and-privacy-policy-update-setting-the-record-straight/",
    "summary": "Arduino has released a statement to address community concerns regarding its recent Terms of Service (ToS) and Privacy Policy updates. The company firmly reiterates its unwavering 20-year commitment to open-source principles, clarifying that the Qualcomm acquisition does not change how user data is handled or how they apply open-source.\n\nThese periodic updates reflect new features, evolving regulations, and best practices. Key elements remaining unchanged include the open-source nature of all hardware, software, and services (like Arduino IDE and schematics), with reverse-engineering restrictions only applying to Software-as-a-Service cloud applications. Users retain ownership of their creations published on the Arduino platform. Privacy disclosures for minors have been strengthened, and data retention policies updated, including deactivation of inactive accounts after 24 months (with forum usernames preserved unless full deletion is requested).\n\nThe updates primarily aim for clarity, compliance, and fostering innovation. They encompass enhanced transparency regarding data practices, provisions for new optional AI-powered features in products like Arduino UNO Q and App Lab, more precise commercial terms for Premium Services (billing, payments, refunds), and compliance with US privacy laws, export controls, and global standards.\n\nArduino encourages users to read the full documents, consult their FAQ, or contact `privacy@arduino.cc` for further questions, concluding with a reaffirmation: \"We are Arduino. We are open. We’re not going anywhere.\"",
    "chinese_title": "Arduino 服务条款和隐私政策更新：以正视听",
    "chinese_summary": "Arduino 发布了一份声明，以回应社区对其近期服务条款（ToS）和隐私政策更新的担忧。该公司坚定重申其20年来对开源原则的坚定承诺，澄清高通的收购不会改变用户数据处理方式或其应用开源的方式。\n\n这些定期更新反映了新功能、不断变化的法规和最佳实践。保持不变的关键要素包括所有硬件、软件和服务（如Arduino IDE和原理图）的开源性质，逆向工程限制仅适用于软件即服务云应用程序。用户保留其在Arduino平台上发布作品的所有权。未成年人的隐私披露已得到加强，数据保留政策也已更新，其中包括在24个月不活跃后停用账户（论坛用户名将保留，除非请求完全删除）。\n\n此次更新主要旨在提高透明度、合规性并促进创新。它们包括：加强数据实践的透明度；为Arduino UNO Q和App Lab等产品中新增的可选AI功能提供条款；更精确的Premium Services商业条款（计费、支付、退款）；以及遵守美国隐私法、出口管制和全球标准。\n\nArduino鼓励用户阅读完整文档、查阅其常见问题解答，或通过 `privacy@arduino.cc` 联系以获取更多问题解答，并以一句重申作为结尾：“我们是Arduino。我们是开源的。我们不会离开。”"
  },
  {
    "id": "46022279",
    "title": "Signal knows who you're talking to (2023)",
    "url": "https://sanesecurityguy.com/articles/signal-knows-who-youre-talking-to/",
    "summary": "The article, \"Signal knows who you're talking to,\" debunks Signal's claims of user anonymity, particularly concerning its \"Sealed Sender\" feature. The author initially believed Signal only knew *that* two phone numbers were communicating, not *what* they were saying, due to end-to-end encryption. However, a friend introduced \"Sealed Sender,\" which supposedly prevents Signal from knowing the sender's identity.\n\nThe author argues that \"Sealed Sender\" is \"totally useless.\" While it offers \"one-way anonymity\" by only identifying the recipient for a single message, this anonymity collapses in two-way conversations. Signal still collects critical metadata: the recipient's phone number and the sender's IP address. IP addresses are far more specific than post offices in the snail mail analogy. Even with a VPN or Tor, Signal can deduce that the same IP is repeatedly contacting the same phone number. When the recipient replies, their IP and the sender's phone number are known, completing the link.\n\nThe article further reveals that Signal's mandatory, unturnoffable \"delivery receipts\" automatically create a two-way communication channel. Even if \"Sealed Sender\" protected the initial message, the automatic delivery receipt acts as a reply, immediately exposing the communication link. The author questions why Signal, an internet-based service, requires phone numbers (global identifiers often tied to real identity) when they are unnecessary for internet communication.\n\nAs alternatives, the author suggests Proton Mail/Tuta for text, and highlights SimpleX as a promising, open-source, end-to-end encrypted platform that avoids global identifiers like phone numbers or emails and supports Tor, though it is still in development.",
    "chinese_title": "Signal 知道你在和谁说话 (2023)",
    "chinese_summary": "文章《Signal 知道你在和谁说话》驳斥了 Signal 关于用户匿名性的主张，特别是其“密封发件人”功能。作者最初认为，由于端到端加密，Signal 只知道两个电话号码正在通信，而不知道他们具体说了什么。然而，一位朋友介绍了“密封发件人”功能，该功能据称能阻止 Signal 获知发件人身份。\n\n作者认为“密封发件人”是“完全无用的”。尽管它通过仅识别单个消息的接收者来提供“单向匿名”，但这种匿名性在双向对话中就会崩溃。Signal 仍然收集关键元数据：接收者的电话号码和发送者的 IP 地址。IP 地址比蜗牛邮件类比中的邮局具体得多。即使使用 VPN 或 Tor，Signal 也能推断出同一个 IP 地址反复联系同一个电话号码。当接收者回复时，他们的 IP 地址和发送者的电话号码就会被知晓，从而完成通信链接。\n\n文章进一步揭示，Signal 强制且不可关闭的“送达回执”会自动创建一个双向通信通道。即使“密封发件人”保护了初始消息，自动送达回执也相当于一个回复，立即暴露了通信链接。作者质疑，Signal 作为一个基于互联网的服务，为何需要电话号码（这些全球标识符通常与真实身份绑定），因为它们对于互联网通信来说并非必需。\n\n作为替代方案，作者建议文本通信使用 Proton Mail/Tuta，并重点推荐 SimpleX 作为一个有前景的、开源的、端到端加密平台，它避免使用电话号码或电子邮件等全球标识符，并支持 Tor，尽管该平台仍在开发中。"
  },
  {
    "id": "46013477",
    "title": "Roblox CEO Makes a Fool of Himself in Car-Crash Interview",
    "url": "https://kotaku.com/roblox-new-york-times-interview-baszucki-2000646174",
    "summary": "The article describes a \"car-crash\" interview with Roblox CEO David Baszucki on the New York Times podcast \"Hard Fork,\" where he disastrously addressed severe child safety issues on the platform. Roblox is facing intense scrutiny, including multiple lawsuits from states like Louisiana, Kentucky, and Texas, and 35 other legal actions, after being labeled a \"pedophile hellscape.\"\n\nBaszucki's responses were widely criticized as tone-deaf and incoherent. He referred to the problem of predators as an \"opportunity,\" struggled to explain the efficacy of new facial recognition age verification, and dismissed questions about the company's long-standing failure to implement safety measures. He became defensive and immature when pressed on his confidence in existing filters and the Hindenburg Research report, even demanding \"high-fives\" from the interviewer for agreeing with him on AI safety.\n\nThe CEO repeatedly fixated on Roblox's user numbers and financial opportunities rather than the safety concerns. Shockingly, he proposed integrating Polymarket, a crypto-based prediction market, into Roblox for children to engage in \"legal\" and \"educational\" gambling, a suggestion openly mocked by the hosts. The article concludes that Baszucki demonstrated a profound lack of understanding and preparedness for the critical issues facing his company.",
    "chinese_title": "罗布乐思CEO灾难采访中丑态百出",
    "chinese_summary": "本文描述了Roblox首席执行官David Baszucki在《纽约时报》播客“Hard Fork”节目中进行的一次“翻车”式采访，他在采访中灾难性地回应了平台上的严重儿童安全问题。在被贴上“恋童癖地狱”的标签后，Roblox正面临着严峻的审视，包括来自路易斯安那州、肯塔基州和德克萨斯州等多个州的诉讼，以及其他35起法律诉讼。\n\nBaszucki的回应受到广泛批评，被指责为麻木不仁、语无伦次。他将掠食者问题称为“机遇”，难以解释新人脸识别年龄验证措施的有效性，并对有关该公司长期未能实施安全措施的问题敷衍了事。当被追问他对现有过滤器以及兴登堡研究报告的信心时，他变得充满戒备且不成熟，甚至因为采访者同意他关于AI安全的观点而要求对方与他“击掌”。\n\n这位首席执行官反复强调Roblox的用户数量和财务机遇，而非安全担忧。令人震惊的是，他提议将基于加密货币的预测市场Polymarket整合到Roblox中，让儿童参与“合法”和“教育性”的赌博，这一提议遭到主持人公开嘲讽。文章总结指出，Baszucki对公司面临的关键问题表现出深刻的缺乏理解和准备。"
  },
  {
    "id": "46009962",
    "title": "A time-travelling door bug in Half Life 2",
    "url": "https://mastodon.gamedev.place/@TomF/115589875974658415",
    "summary": "The provided text, titled \"A time-travelling door bug in Half Life 2,\" includes a fragment of a Gamedev Mastodon post by Tom Forsyth. Forsyth references a \"Recent discussion about the perils of doors in ga...\" (implying \"games\"). While the title suggests a specific technical glitch in Half-Life 2 involving doors and an unusual \"time-travelling\" effect, the given content *does not describe the bug itself*. It only indicates that a discussion on challenging or problematic door mechanics in games is ongoing. The second line of the provided text is a generic Mastodon instruction regarding JavaScript enablement or app usage, unrelated to the bug discussion. Therefore, the specific details of the \"time-travelling door bug\" are not contained within this excerpt.",
    "chinese_title": "半条命2的时空穿梭门漏洞",
    "chinese_summary": "所提供的文本，标题为“《半衰期2》中的一个时间旅行门漏洞”，包含了一段Tom Forsyth在Gamedev Mastodon上发布的帖子片段。Forsyth提到了“最近关于游戏中门的危险性讨论…”（暗示“游戏”）。尽管标题暗示了《半衰期2》中一个涉及门和一种不同寻常的“时间旅行”效应的特定技术故障，但所提供的内容*并未描述该漏洞本身*。它仅表明，关于游戏中具有挑战性或有问题的门机制的讨论正在进行中。所提供文本的第二行是关于启用JavaScript或使用应用程序的通用Mastodon说明，与漏洞讨论无关。因此，“时间旅行门漏洞”的具体细节不包含在此摘录中。"
  },
  {
    "id": "46018165",
    "title": "Show HN: Build the habit of writing meaningful commit messages",
    "url": "https://github.com/arpxspace/smartcommit",
    "summary": "`smartcommit` is an intelligent, AI-powered CLI tool designed to help developers effortlessly write semantic, Conventional Commits messages. It analyzes staged Git changes, then asks interactive, clarifying questions to understand the \"why\" and intent behind the code, generating a structured commit message.\n\nKey features include AI-powered analysis of `git diff`, an interactive Q&A process, and multi-provider support for both OpenAI (GPT-4o) and local Ollama (Llama 3.1). It strictly enforces the Conventional Commits specification (e.g., `feat`, `fix`) and boasts a responsive Terminal User Interface (TUI) built with Bubble Tea.\n\nInstallation requires Go (1.21+) and Git, achievable via `go install` or building from source. Users can alias `git commit` to `smartcommit` (e.g., `git ci`) for convenience. To use, simply stage changes (`git add .`), run `smartcommit`, and follow the TUI prompts to configure the AI provider, answer contextual questions, and review or confirm the generated message. A manual mode is also available. Configuration is stored locally, with optional `OPENAI_API_KEY` environment variable support. Contributions are welcome under the MIT License.",
    "chinese_title": "Show HN: 养成写有意义的提交信息的习惯",
    "chinese_summary": "`smartcommit` 是一个智能的、AI驱动的命令行工具，旨在帮助开发者轻松编写语义化的Conventional Commits提交信息。它分析暂存的Git更改，然后提出交互式、澄清性的问题，以理解代码背后的“原因”和意图，从而生成结构化的提交信息。\n\n主要功能包括对 `git diff` 的AI驱动分析、交互式问答流程，以及对OpenAI (GPT-4o) 和本地Ollama (Llama 3.1) 的多提供商支持。它严格遵循Conventional Commits规范（例如 `feat`、`fix`），并拥有一个使用Bubble Tea构建的响应式终端用户界面 (TUI)。\n\n安装需要Go (1.21+) 和Git，可通过 `go install` 或从源代码构建实现。用户可以将 `git commit` 别名为 `smartcommit`（例如 `git ci`）以方便使用。使用时，只需暂存更改 (`git add .`)，运行 `smartcommit`，并按照TUI提示配置AI提供商、回答上下文问题，以及查看或确认生成的提交信息。也提供手动模式。配置本地存储，并支持可选的 `OPENAI_API_KEY` 环境变量。欢迎在MIT许可证下贡献。"
  },
  {
    "id": "46024894",
    "title": "Dark Mode Sucks",
    "url": "https://www.tomechangosubanana.com/2025/dark-mode-sucks/",
    "summary": "The author criticizes the pervasive \"dark mode\" trend and the hyperbolic language users employ to advocate for it, such as \"blasts my eyeballs\" or \"the light of a thousand suns.\" They argue that if \"normal mode\" (light mode) is genuinely uncomfortable, it indicates a problem with the user's ambient lighting, not the display itself. The author contends that poor ambient lighting is detrimental to eyesight, and dark mode offers no solution. Instead, users should focus on improving their environment's lighting rather than pressuring the internet into what the author perceives as \"eyesight-damaging practices.\"",
    "chinese_title": "深色模式烂透了",
    "chinese_summary": "作者批评了普遍存在的“暗模式”趋势，以及用户在为其辩护时使用的夸张语言，例如“亮瞎我的眼”或“千阳之光”。作者认为，如果“普通模式”（亮模式）确实令人不适，那表明是用户环境照明有问题，而非显示器本身。作者坚称，糟糕的环境照明有害视力，而暗模式并不能提供解决方案。相反，用户应该专注于改善自身环境的照明，而不是迫使互联网采纳作者所认为的“损害视力的做法”。"
  },
  {
    "id": "46024773",
    "title": "Calculus for Mathematicians, Computer Scientists, and Physicists [pdf]",
    "url": "https://mathcs.holycross.edu/~ahwang/print/calc.pdf",
    "summary": "This document appears to be a table of contents for a textbook titled \"Calculus for Mathematicians, Computer Scientists, and Physicists.\"\n\nThe book offers a comprehensive treatment of calculus, starting with foundational mathematical concepts before delving into core calculus topics. It begins with \"The Language of Mathematics,\" covering sets, logic, and the nature of mathematics, followed by a detailed exploration of \"Numbers\" (natural, integers, rational, real, complex). The text then introduces \"Functions,\" their basic definitions, classes, and operations.\n\nKey calculus concepts are systematically presented, including \"Limits and Continuity,\" \"Continuity on Intervals,\" \"Integration,\" and \"Differentiation.\" Important theorems like \"The Mean Value Theorem\" and \"The Fundamental Theorems\" are dedicated chapters. Advanced topics such as \"Sequences of Functions,\" \"Series of Functions,\" and \"Power Series\" are also covered. The book further explores specific function types, including \"Log and Exp,\" \"The Trigonometric Functions,\" and \"Elementary Functions,\" alongside \"Taylor Approximation.\" Appendices include a postscript, bibliography, and index. The content indicates a rigorous approach suitable for the specified technical audiences.",
    "chinese_title": "《面向数学家、计算机科学家和物理学家的微积分》[pdf]",
    "chinese_summary": "本文档似乎是一本名为《适用于数学家、计算机科学家与物理学家的微积分》的教科书的目录。\n\n该书对微积分进行了全面阐述，从基础数学概念入手，随后深入探讨核心微积分主题。它从《数学语言》开始，涵盖集合、逻辑和数学的本质，接着详细探讨了《数》（自然数、整数、有理数、实数、复数）。该书随后介绍了《函数》，包括它们的基本定义、类别和运算。\n\n核心微积分概念被系统地呈现，包括《极限与连续性》、《区间上的连续性》、《积分》和《微分》。《中值定理》和《基本定理》等重要定理均设专章讲解。《函数序列》、《函数级数》和《幂级数》等高级主题也涵盖在内。该书还进一步探讨了特定函数类型，包括《对数与指数函数》、《三角函数》和《初等函数》，并介绍了《泰勒逼近》。附录包括后记、参考文献和索引。其内容表明该书采用严谨的方法，适合上述特定技术受众。"
  },
  {
    "id": "46008788",
    "title": "We remain alive also in a dead internet",
    "url": "https://slavoj.substack.com/p/why-we-remain-alive-also-in-a-dead-954",
    "summary": "In \"We remain alive also in a dead internet,\" Slavoj Žižek argues that the internet, despite its pervasive influence, has not fundamentally altered the human condition or our subjective experience. He begins by referencing philosopher Bernard Stiegler, who saw digital technologies as potentially destructive to attention and individual symbolic power, leading to a \"dead internet\" where algorithms dominate. While acknowledging the dangers of algorithmic control and the simulation of human interaction, Žižek rejects the idea that this signifies a total loss of humanity.\n\nHe contends that even in a highly mediated, algorithmically driven environment, the core of human subjectivity – characterized by our capacity for desire, anxiety, and the \"living voice\" that embodies a unique, irreducible perspective – persists. The internet might alter the *form* of our interactions and the *medium* of our anxieties, but it does not erase the underlying human reality. He uses the example of AI-generated content still deriving its meaning from human input and interpretation.\n\nŽižek concludes that the \"dead internet\" is less about the internet's literal demise and more about a warning against passively succumbing to its dehumanizing potential. Our task is to find ways to assert our living subjectivity and critical agency *within* this new landscape, rather than merely lamenting a lost past. The challenge is to remain truly alive and thinking, even amidst the digital \"death\" that threatens to envelop genuine human experience.",
    "chinese_title": "我们在一个死去的互联网中也依然活着。",
    "chinese_summary": "在《在“死去的互联网”中我们依然活着》一书中，斯拉沃热·齐泽克认为，互联网尽管其影响力深远，但并未从根本上改变人类境况或我们的主体性体验。他首先援引了哲学家贝尔纳·斯蒂格勒的观点，斯蒂格勒认为数字技术可能破坏注意力并削弱个体的符号力量，从而导致一个由算法主导的“死去的互联网”。齐泽克在承认算法控制和人类互动模拟所带来的危险的同时，拒绝接受这标志着人类彻底丧失的观点。\n\n他主张，即使在一个高度中介化、算法驱动的环境中，人类主体性的核心——即我们产生欲望、焦虑的能力，以及体现独特、不可化约视角的“活生生的声音”——依然持续存在。互联网或许改变了我们互动和焦虑的*形式*与*媒介*，但它并未抹去其潜在的人类实在。他以人工智能生成的内容为例，指出即使这类内容，其意义也依然来源于人类的输入和解读。\n\n齐泽克总结道，“死去的互联网”与其说是指互联网的字面消亡，不如说是一种警示，旨在告诫我们不要被动地屈服于其去人性化的潜能。我们的任务是在这一新图景中，找到维护我们活生生的主体性和批判性能动性的方式，而非仅仅哀叹逝去的过往。挑战在于保持真正的生机与思考，即使在威胁要吞噬真正人类体验的数字“死亡”之中。"
  },
  {
    "id": "46016074",
    "title": "Our babies were taken after 'biased' parenting test",
    "url": "https://www.bbc.co.uk/news/articles/c1wlw2qj113o",
    "summary": "The article highlights the distressing experiences of Greenlandic families in Denmark whose children have been forcibly removed by social services following \"parental competency tests\" (FKUs), which many deem culturally biased. Keira, 39, tearfully describes having her newborn daughter, Zammi, taken after just two hours, a repeat of a previous experience with her older children.\n\nCritics argue these FKU tests, administered in Danish, are rooted in Danish cultural norms, leading to misunderstandings and flawed assessments for Greenlandic parents. Questions about general knowledge or personality assessments like Rorschach tests (where one mother's answer about gutting a seal led to her being called a \"barbarian\") are cited as examples of cultural insensitivity. Psychologist Isak Nellemann notes that poor FKU results typically lead to children being removed in 90% of cases.\n\nGreenlandic parents in Denmark are 5.6 times more likely to have children taken into care than Danish parents. In May, the Danish government banned FKUs for Greenlandic families, acknowledging decades of criticism, though the tests continue for others. The government pledged to review around 300 cases but has only reviewed 10, with no children returned so far. Cases involving adopted children, like Johanne and Ulrik's son, will not be reviewed, causing further anguish.\n\nWhile a rare case like Pilinguaq's shows reunification is possible, families like Keira's continue to fight for their children's return, underscoring the deep emotional toll and ongoing struggle for justice.",
    "chinese_title": "我们的宝宝因“偏颇育儿测试”被带走",
    "chinese_summary": "本文重点介绍了在丹麦的格陵兰家庭的痛苦经历，他们的孩子在“父母能力测试”（FKU）后被社会服务机构强行带走，许多人认为这些测试带有文化偏见。39岁的凯拉泪流满面地描述说，她的新生女儿扎米在出生仅两小时后就被带走了，这与她之前大孩子被带走的经历如出一辙。\n\n批评者认为，这些以丹麦语进行的FKU测试植根于丹麦文化规范，导致格陵兰父母产生误解和评估失误。例如，有关常识的问题或罗夏克测试等性格评估（其中一位母亲对解剖海豹的回答导致她被称作“野蛮人”）被视为文化不敏感的例子。心理学家伊萨克·内勒曼指出，FKU测试结果不佳通常会导致90%的儿童被带走。\n\n在丹麦，格陵兰父母的孩子被带走照护的可能性是丹麦父母的5.6倍。5月，丹麦政府禁止对格陵兰家庭使用FKU测试，承认了数十年的批评，尽管这些测试对其他人群仍然继续。政府承诺审查约300个案例，但目前只审查了10个，并且尚未有任何儿童被送回。涉及领养儿童的案例，例如约翰娜和乌尔里克夫妇的儿子，将不予审查，这导致了进一步的痛苦。\n\n尽管像皮林瓜克这样的罕见案例表明亲子团聚是可能的，但像凯拉这样的家庭仍在为争取孩子们的回归而奋斗，这凸显了巨大的情感创伤和持续不断的争取正义的斗争。"
  },
  {
    "id": "46011521",
    "title": "The death of tech idealism and rise of the homeless in Northern California",
    "url": "https://lithub.com/on-the-death-of-tech-idealism-and-rise-of-the-homeless-in-northern-california/",
    "summary": "This article explores the stark contrast between Silicon Valley's foundational tech idealism and its current reality, marked by widespread homelessness and the cynicism of its elite. The author, returning after 12 years, observes a dramatic rise in visible homelessness, particularly in Santa Cruz. He recounts an encounter with a venture capitalist, once \"charming and progressive,\" who now embodies a hardline libertarian stance, dismissing public sector efforts and NGOs as ineffective, believing only profit-driven \"innovators\" can solve the housing crisis.\n\nHistorically, early tech figures like Steve Jobs and Stewart Brand blended countercultural ideals—communalism, personal liberation—with technological innovation. However, this idealism warped, exemplified by Brand's evolution from \"Merry Prankster\" to \"post-libertarian,\" building a 10,000-year clock for Jeff Bezos. The Valley's landscape transformed from the \"Valley of Heart's Delight\" (orchards) to a corporate expanse, with environmental issues like the Bay's \"ass cloud\" reflecting its industrialization. The article reveals the military-industrial complex, specifically DARPA, as the \"patron saint\" of Valley venture capitalists, embedding \"defense-industry DNA\" in modern tech giants. Ultimately, the author posits that the rise of homelessness is a direct consequence of the Valley's evolving values and military-industrial origins.",
    "chinese_title": "科技理想主义的陨落与北加州无家可归者的崛起",
    "chinese_summary": "本文探讨了硅谷奠基性的科技理想主义与其当前现实之间的鲜明对比，后者以普遍的无家可归现象及其精英阶层的犬儒主义为特征。作者阔别12年归来，观察到可见的无家可归现象急剧增加，尤其是在圣克鲁斯。他讲述了与一位风险投资家的相遇，此人曾一度“迷人且进步”，如今却秉持强硬的自由意志主义立场，认为公共部门的努力和非政府组织都效率低下，坚信只有以利润为导向的“创新者”才能解决住房危机。\n\n历史上，史蒂夫·乔布斯和斯图尔特·布兰德等早期的科技人物将反文化理想——社群主义、个人解放——与技术创新相结合。然而，这种理想主义发生了扭曲，布兰德从“快活恶作剧者”演变为“后自由意志主义者”，并为杰夫·贝佐斯建造了一个万年钟，便是例证。硅谷的景观从“心之喜悦谷”（果园）转变为一片公司企业区，海湾的“屁云”等环境问题反映了其工业化进程。文章揭示，军工联合体，特别是DARPA，是硅谷风险投资家的“守护神”，将“国防工业DNA”嵌入了现代科技巨头之中。最终，作者认为无家可归现象的兴起是硅谷不断演变的价值观及其军工起源的直接后果。"
  },
  {
    "id": "46008983",
    "title": "The senior population is booming. Caregiving is struggling to keep up",
    "url": "https://www.cnbc.com/2025/11/21/senior-caregiving-labor.html",
    "summary": "The U.S. senior population is booming, growing from 12.4% in 2004 to 18% in 2024, creating immense pressure on the caregiving sector which is struggling to keep pace. Demand for senior care services is soaring, with prices rising faster than inflation (over 4% annually), yet the labor force is experiencing a critical shortage.\n\nThis struggle is primarily due to low wages (e.g., home health aides averaging $16.82/hour, barely more than fast-food workers), poor job quality, and a lack of career advancement opportunities, despite the strenuous and often complex nature of the work. Experts project 4.6 million unfulfilled home care jobs by 2032, and the labor gap in long-term care is more severe than any other health sector. This shortage manifests in declining quality of care, as exemplified by nursing home residents being left to wait for hours due to insufficient staff, and facilities lacking essential medical personnel like doctors and registered nurses.\n\nThis \"unseen crisis\" burdens families, particularly the \"sandwich generation\" caring for both children and aging parents, and acts as a drag on economic growth.\n\nSolutions proposed include increasing caregiver wages, allowing more immigration to fill roles, and establishing better career ladders and training programs within the sector. Companies like Care.com are recognizing this demand, making senior care their fastest-growing segment and developing tools to help families navigate these complex, often sudden, caregiving situations.",
    "chinese_title": "老年人口激增，照护体系不堪重负。",
    "chinese_summary": "美国老年人口正在激增，从2004年的12.4%增长到2024年的18%，这给难以跟上步伐的照护行业带来了巨大压力。对老年照护服务的需求正在飙升，价格上涨速度超过通货膨胀（每年超过4%），但劳动力却出现严重短缺。\n\n这种困境主要源于低工资（例如，居家护理员平均时薪16.82美元，仅略高于快餐店员工）、较差的工作质量以及缺乏职业发展机会，尽管这项工作强度大且性质复杂。专家预测，到2032年，将有460万个居家护理职位空缺，而长期护理领域的劳动力缺口比其他任何医疗领域都更严重。这种短缺体现在护理质量下降上，例如养老院居民因人手不足被长时间晾置，以及机构缺乏医生和注册护士等必要的医护人员。\n\n这场“隐形危机”给家庭带来了负担，尤其是那些既要照顾子女又要照顾年迈父母的“夹心一代”，并拖累了经济增长。\n\n提出的解决方案包括提高护理人员工资、允许更多移民填补空缺，以及在该行业内建立更好的职业晋升阶梯和培训项目。像Care.com这样的公司正在认识到这一需求，将老年护理业务打造成其增长最快的细分市场，并开发工具帮助家庭应对这些复杂且往往突发的照护情况。"
  },
  {
    "id": "46009209",
    "title": "The Untold History of Arduino (2016)",
    "url": "https://arduinohistory.github.io/",
    "summary": "Hernando Barragán's 2016 article clarifies the origins of Wiring and Arduino, asserting his role amid \"distorted information.\" He developed Wiring in 2003 as his Master's thesis at Interaction Design Institute Ivrea (IDII), supervised by Massimo Banzi and Casey Reas. The goal was to simplify electronics for artists and designers, leading to a distinction for Barragán.\n\nWiring featured a simple IDE based on Processing, a user-friendly programming language (e.g., `pinMode()`, `digitalWrite()`), open-source software, and hardware designs. Barragán detailed the hardware evolution from Parallax Javelin Stamp to Atmel AT91R40008, settling on the ATmega128 with FTDI for USB. His work, drawing on Brian Dean's \"avrdude,\" culminated in the first Wiring board design in early 2004.\n\nWiring saw significant success, particularly with IDII's \"Strangely Familiar\" project in late 2004, and its global adoption by 2005.\n\nArduino emerged in 2005 when Massimo Banzi, David Mellis, and David Cuartielles forked Wiring's source code to support a cheaper ATmega8 microcontroller. Gianluca Martino later joined for manufacturing. Barragán states he was never asked to join the Arduino team and found the fork puzzling, given his ongoing plans for Wiring and willingness to collaborate. Despite the separate project, many of Barragán's and other contributors' improvements to Wiring were subsequently merged into Arduino's codebase, highlighting what he perceived as redundancy.",
    "chinese_title": "鲜为人知的Arduino历史 (2016)",
    "chinese_summary": "埃尔南多·巴拉甘（Hernando Barragán）2016年发表的一篇文章澄清了Wiring和Arduino的起源，并在“扭曲的信息”中重申了自己的角色。2003年，他在伊夫雷亚互动设计学院（IDII）攻读硕士学位时，在马西莫·班齐（Massimo Banzi）和凯西·里亚斯（Casey Reas）的指导下，开发了Wiring作为其硕士论文。其目标是为艺术家和设计师简化电子技术，这使巴拉甘获得了显著的认可。\n\nWiring的特点包括一个基于Processing的简单集成开发环境（IDE），一种用户友好的编程语言（例如`pinMode()`、`digitalWrite()`），以及开源软件和硬件设计。巴拉甘详细阐述了硬件的演变过程，从Parallax Javelin Stamp到Atmel AT91R40008，最终确定使用带FTDI USB接口的ATmega128。他的工作借鉴了布莱恩·迪恩（Brian Dean）的“avrdude”，并在2004年初最终形成了第一个Wiring开发板设计。\n\nWiring取得了显著的成功，尤其是在2004年末IDII的“Strangely Familiar”项目中表现突出，并于2005年实现了全球范围内的应用。\n\nArduino于2005年问世，当时马西莫·班齐（Massimo Banzi）、大卫·梅利斯（David Mellis）和大卫·夸蒂列斯（David Cuartielles）分叉了Wiring的源代码，以支持更便宜的ATmega8微控制器。詹卢卡·马蒂诺（Gianluca Martino）后来也加入团队负责制造。巴拉甘表示，他从未被邀请加入Arduino团队，鉴于他当时对Wiring的持续规划和合作意愿，他对这次代码分叉感到费解。尽管项目各自独立，巴拉甘和其他贡献者对Wiring的许多改进随后被合并到Arduino的代码库中，这凸显了他所认为的重复工作。"
  },
  {
    "id": "46015578",
    "title": "New Apple Study Shows LLMs Can Tell What You're Doing from Audio and Motion Data",
    "url": "https://9to5mac.com/2025/11/21/apple-research-llm-study-audio-motion-activity/",
    "summary": "A new Apple study, \"Using LLMs for Late Multimodal Sensor Fusion for Activity Recognition,\" reveals that Large Language Models (LLMs) can effectively identify user activities by analyzing text descriptions derived from audio and motion data. This research indicates a potential path for Apple to enhance activity analysis, even when traditional sensor data is insufficient.\n\nThe study employed a curated subset of the Ego4D dataset, focusing on 12 common activities such as cooking, playing basketball, and using a computer. Crucially, the LLMs (like Gemini-2.5-pro and Qwen-32B) were not fed raw audio or motion data. Instead, smaller, specialized models first processed the raw sensor inputs to generate short text captions from audio and predictions from IMU-based motion data. These textual outputs were then fed to the LLMs.\n\nThe LLMs demonstrated significant accuracy, achieving F1-scores well above chance for both zero-shot (no prior examples) and one-shot (single example) classification. Accuracy further improved with one-shot learning. This \"late fusion\" approach enables precise multimodal activity recognition without requiring extensive task-specific training or significant additional memory/computation for new application-specific models. The researchers suggest this method holds great promise for improving activity and health data insights, with Apple providing supplemental materials for reproducibility.",
    "chinese_title": "苹果新研究：LLM可根据音频和运动数据判断你在做什么",
    "chinese_summary": "苹果一项新研究《利用大型语言模型进行后期多模态传感器融合以识别活动》揭示，大型语言模型（LLM）能够通过分析源自音频和运动数据的文本描述，有效识别用户活动。这项研究表明，即使传统传感器数据不足，苹果也能通过此路径增强活动分析。\n\n该研究采用了Ego4D数据集的精选子集，重点关注烹饪、打篮球和使用电脑等12种常见活动。关键在于，大型语言模型（如Gemini-2.5-pro和Qwen-32B）并未直接接收原始音频或运动数据。相反，更小、更专业的模型首先处理原始传感器输入，从音频生成简短的文本描述，并从基于IMU的运动数据生成预测。随后，这些文本输出被馈送给大型语言模型。\n\n大型语言模型展现出显著的准确性，在零样本（无先前示例）和单样本（单个示例）分类中，F1分数远超随机水平。采用单样本学习后，准确性进一步提高。这种“后期融合”方法能够实现精确的多模态活动识别，而无需大量任务特定训练，也无需为新的特定应用模型额外投入大量内存/计算资源。研究人员认为，此方法在改进活动和健康数据洞察方面具有巨大潜力，苹果为此提供了补充材料以供复现。"
  },
  {
    "id": "46020096",
    "title": "An Economy of AI Agents",
    "url": "https://arxiv.org/abs/2509.01063",
    "summary": "This arXiv paper, \"An Economy of AI Agents,\" authored by Gillian K. Hadfield and Andrew Koh, was submitted on September 1, 2025. It explores the anticipated economic impact of advanced artificial intelligence agents.\n\nThe core premise is that within the coming decade, AI agents capable of planning and executing complex, long-term tasks with minimal human oversight will become prevalent across various sectors of the economy. The paper aims to survey current developments and identify critical open questions for economists concerning this transformative shift.\n\nSpecifically, it highlights three main areas of inquiry:\n1.  **Interactions:** How these AI agents will interact with human economic actors and with other AI agents.\n2.  **Market and Organizational Impact:** The ways in which AI agents will reshape existing markets and organizational structures.\n3.  **Institutional Requirements:** What new institutional frameworks and regulations might be necessary to ensure the efficient and well-functioning operation of markets populated by these autonomous agents.\n\nThe research falls under General Economics, with significant interdisciplinary relevance to Artificial Intelligence and Multiagent Systems.",
    "chinese_title": "AI代理经济",
    "chinese_summary": "这篇arXiv论文《AI代理经济》（作者Gillian K. Hadfield和Andrew Koh）于2025年9月1日提交。该论文探讨了先进人工智能代理可能带来的预期经济影响。\n\n该论文的核心前提是，在未来十年内，能够以最少的人工监督规划和执行复杂、长期任务的AI代理将在经济的各个部门普及。论文旨在调查当前发展，并确定经济学家们在应对这一转型变革时面临的关键待解问题。\n\n具体而言，该论文重点关注以下三个主要研究领域：\n1.  **互动：** 这些AI代理将如何与人类经济主体以及其他AI代理进行互动。\n2.  **市场与组织影响：** AI代理将如何重塑现有市场和组织结构。\n3.  **制度\n\n该研究属于普通经济学范畴，并与人工智能和多代理系统具有重要的跨学科相关性。"
  },
  {
    "id": "46020596",
    "title": "A cryptography research body held an election and they can't decrypt the results",
    "url": "https://www.nytimes.com/2025/11/21/world/cryptography-group-lost-election-results.html",
    "summary": "Unable to access the article link.",
    "chinese_title": "一个密码学研究机构举行了一场选举，但他们无法解密选举结果。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46018664",
    "title": "Windows ARM64 Internals: Deconstructing Pointer Authentication",
    "url": "https://www.preludesecurity.com/blog/windows-arm64-internals-deconstructing-pointer-authentication",
    "summary": "Pointer Authentication Code (PAC) is an anti-exploit feature on Armv8.3-A and Armv9.0-A architectures that cryptographically signs pointers, validating their integrity at runtime. On 64-bit Windows ARM64, PAC leverages the typically unused bits 48-63 of a 64-bit address (where bit 47 denotes user/kernel mode) to store this signature.\n\nWindows enables PAC in both kernel and user modes. Kernel-mode PAC initialization starts at `ntoskrnl.exe`'s `KiSystemStartup`, which determines PAC support from the `LOADER_PARAMETER_BLOCK` and receives an initial kernel signing key (`PointerAuthKernelIpKey`). Windows exclusively uses \"key B\" for instruction pointer signing, loading it into the `APIBKeyLo_EL1` and `APIBKeyHi_EL1` system registers to form a 128-bit key. `KiDetectPointerAuthSupport` further configures CPU-specific PAC features. PAC enablement is controlled by the `Feature_Pointer_Auth_User__private_featureState` flag and registry overrides. Critical PAC-related variables are made read-only by HVCI.\n\nFor user-mode, PAC is enabled on a per-process basis during process creation (`PspAllocateProcess`), with all non-idle user processes unconditionally opted-in. Each user-mode process receives its own randomly generated signing key (if not inherited), distinct from the global kernel key. The active signing key in the system registers is updated during kernel-to-user and user-to-kernel transitions. Although the Windows SDK defines policies to manage user-mode PAC, current implementations unconditionally enable it, making runtime or creation-time disabling impossible. Similarly, audit-mode policies via ImageFileExecutionOptions (IFEO) are overridden.\n\nWindows currently employs PAC primarily for signing \"instruction pointers,\" specifically targeting return addresses, a mechanism controllable via the `/guard:signret` compiler flag.",
    "chinese_title": "Windows ARM64 内部原理：拆解指针认证",
    "chinese_summary": "指针认证码（PAC）是Armv8.3-A和Armv9.0-A架构上的一项反漏洞利用功能，它通过密码学方式对指针进行签名，并在运行时验证其完整性。在64位Windows ARM64上，PAC利用64位地址中通常未使用的48-63位（其中第47位指示用户/内核模式）来存储此签名。\n\nWindows在内核模式和用户模式下都启用了PAC。内核模式PAC的初始化始于`ntoskrnl.exe`的`KiSystemStartup`函数，该函数从`LOADER_PARAMETER_BLOCK`确定PAC支持情况，并接收一个初始内核签名密钥（`PointerAuthKernelIpKey`）。Windows专门使用“密钥B”进行指令指针签名，将其加载到`APIBKeyLo_EL1`和`APIBKeyHi_EL1`系统寄存器中以形成一个128位密钥。`KiDetectPointerAuthSupport`进一步配置CPU特定的PAC功能。PAC的启用由`Feature_Pointer_Auth_User__private_featureState`标志和注册表覆盖项控制。关键的PAC相关变量由HVCI设为只读。\n\n对于用户模式，PAC在进程创建（`PspAllocateProcess`）期间以每进程为基础启用，所有非空闲用户进程都无条件地选择启用。每个用户模式进程（如果未继承）都会接收一个自己随机生成的签名密钥，该密钥与全局内核密钥不同。系统寄存器中的活动签名密钥在内核到用户和用户到内核的转换期间进行更新。尽管Windows SDK定义了管理用户模式PAC的策略，但当前的实现是无条件启用它，使得在运行时或创建时禁用成为不可能。类似地，通过ImageFileExecutionOptions (IFEO)实现的审计模式策略也被覆盖。\n\nWindows目前主要使用PAC来签名“指令指针”，特别是针对返回地址，这一机制可以通过`/guard:signret`编译器标志进行控制。"
  },
  {
    "id": "46019714",
    "title": "A year without caffeine (2013)",
    "url": "https://bryanalexander.org/personal/a-year-without-caffeine/",
    "summary": "In his 2013 article, \"A year without caffeine,\" Bryan Alexander recounts his decision to quit caffeine for a year, a challenge prompted by a friend and influenced by a desire to understand its true impact on his life.\n\nThe initial phase was difficult, marked by significant withdrawal symptoms like headaches, irritability, and extreme tiredness, which lasted for several weeks. He describes a pervasive \"brain fog\" that made cognitive tasks challenging.\n\nHowever, after enduring this initial period, Alexander began to experience positive changes. He noted improved sleep quality, a more stable mood, and a gradual return to clear thinking without the artificial peaks and troughs of caffeine. He observed that his energy levels became more consistent throughout the day, and he no longer felt dependent on a substance to kickstart his mornings or overcome afternoon slumps.\n\nUltimately, Alexander concludes that while the withdrawal was tough, the experience provided valuable insight into his body's natural rhythms and an appreciation for a life free from caffeine dependency, suggesting it was a worthwhile endeavor.",
    "chinese_title": "戒除咖啡因的一年 (2013)",
    "chinese_summary": "在他2013年的文章《戒咖啡因一年》中，布莱恩·亚历山大讲述了他决定戒掉咖啡因一年的经历。这个挑战由一位朋友提出，并受到他想了解咖啡因对其生活真正影响的愿望所影响。\n\n最初阶段很艰难，表现出严重的戒断症状，如头痛、易怒和极度疲劳，持续了数周。他形容这是一种普遍存在的“脑雾”，让认知任务变得困难。\n\n然而，在熬过了最初的这段时期后，亚历山大开始经历积极的变化。他发现睡眠质量提高了，情绪更稳定了，思维也逐渐清晰起来，没有了咖啡因带来的那种人为的起伏。他观察到自己全天的精力水平变得更加稳定，不再需要依赖某种物质来开启早晨或摆脱午后倦怠。\n\n最终，亚历山大总结道，尽管戒断过程很艰难，但这段经历让他对身体的自然节律有了宝贵的认识，并让他体会到摆脱咖啡因依赖的生活是多么美好，这表明这是一次值得的尝试。"
  },
  {
    "id": "46013816",
    "title": "My private information is worth $30",
    "url": "https://blog.melashri.net/micro/privacy-price/",
    "summary": "The author details receiving notification about a class-action settlement against the University of Minnesota following a 2021 data breach that exposed personal information, including their own as an alumnus. While the university settled for $5 million without admitting wrongdoing, it offered affected individuals a \"mere $30\" compensation along with identity protection services.\n\nThis offer deeply angers the author, who feels insulted by the low valuation of their private information and the university's refusal to issue a formal apology. They critique this as a common tactic by institutions to avoid responsibility and minimize the impact of breaches. As a result, the author refuses to claim the $30, preferring genuine accountability and an apology.\n\nThe article expands into a broader criticism of weak data protection regulations and insufficient penalties, arguing that current laws fail to hold institutions accountable. The author contends that higher fines and compensation are necessary to incentivize universities and companies to invest more in data security, rather than diverting funds to administrative costs. They also point to universities' high tuition fees and significant indirect costs on research grants, questioning their priorities. The author concludes by demanding greater accountability and respect from universities for their alumni and students.",
    "chinese_title": "我的个人信息值30美元。",
    "chinese_summary": "作者详细描述了自己收到明尼苏达大学集体诉讼和解的通知。该诉讼源于2021年一次数据泄露事件，泄露了包括作者作为校友在内的个人信息。尽管大学以500万美元达成和解但未承认任何不当行为，它向受影响的个人提供了“区区30美元”的赔偿以及身份保护服务。\n\n这一提议让作者深感愤怒，他们认为自己的私人信息被如此低估是一种侮辱，且大学拒绝发出正式道歉。作者批评这是机构逃避责任、最小化泄露事件影响的常见策略。因此，作者拒绝领取这30美元，更倾向于获得真正的问责和道歉。\n\n文章进一步扩展，对薄弱的数据保护法规和不足的惩罚提出了更广泛的批评，指出现有法律未能让机构承担责任。作者认为，需要更高的罚款和赔偿，以激励大学和公司更多地投资于数据安全，而不是将资金转用于行政开支。他们还提到了大学的高额学费以及研究拨款中巨大的间接成本，质疑大学的优先事项。作者最后要求大学对其校友和学生承担更大的责任并给予更多尊重。"
  },
  {
    "id": "46024062",
    "title": "UK minister ducks cost questions on nationwide digital ID scheme",
    "url": "https://www.theregister.com/2025/11/21/uk_digital_id_costs_uncertain/",
    "summary": "UK Minister for Digital Government and Data, Ian Murray, has avoided providing a cost estimate for the government's planned nationwide digital ID scheme during a House of Commons select committee hearing. The government intends to issue digital identities to all legal residents by August 2029, initially for proving eligibility to work, a plan Prime Minister Keir Starmer calls an \"enormous opportunity.\"\n\nMurray stated that the budget is \"to be determined\" and will depend on the final system design, following public consultation. While initial costs will come from the Department for Science, Innovation and Technology (DSIT), other departments are expected to contribute as use cases develop. Conservative MP Kit Malthouse raised concerns that departments might be reluctant to fund the scheme, prioritizing existing budgets over potential future savings.\n\nMurray countered that the digital ID is a \"prime ministerial priority,\" with technical delivery managed by the Government Digital Service (GDS) under Cabinet Office oversight. The scheme aims to offer significant efficiencies and savings.\n\nIn related developments, the department will not appoint a new Chief Digital Officer, transferring those responsibilities to the permanent secretary. Additionally, the government's AI roadmap has been delayed due to a recent change in the technology minister.",
    "chinese_title": "英国部长回避全国数字身份计划成本问题",
    "chinese_summary": "英国数字政府与数据部长伊恩·穆雷在下议院专门委员会听证会上，避开就政府计划中的全国数字身份识别（ID）系统提供成本估算。政府计划在2029年8月前向所有合法居民发放数字身份，初期将用于证明工作资格。首相基尔·斯塔默称此计划为“巨大机遇”。\n\n穆雷表示，预算“尚未确定”，并将取决于公众咨询后的最终系统设计。虽然初步成本将由科学、创新和技术部（DSIT）承担，但随着用例的扩展，预计其他部门也将分摊费用。保守党议员基特·马尔豪斯对此表示担忧，认为各部门可能不愿为该系统出资，会优先考虑现有预算而非潜在的未来节省。\n\n穆雷反驳称，数字身份是“首相的首要任务”，其技术交付由内阁办公厅监管下的政府数字服务局（GDS）负责。该系统旨在大幅提高效率并节省开支。\n\n在相关进展方面，该部门将不再任命新的首席数字官，相关职责将移交给常任秘书。此外，政府的人工智能路线图因近期技术部长的变动而推迟。"
  },
  {
    "id": "46019168",
    "title": "How to Spot a Counterfeit Lithium-Ion Battery",
    "url": "https://spectrum.ieee.org/counterfeit-lithium-ion-batteries",
    "summary": "This EnergyNews article, published on November 22, 2025, and authored by Andrew Moseman, highlights the growing problem of counterfeit lithium-ion batteries. Titled \"How to Spot a Counterfeit Lithium-Ion Battery,\" the piece emphasizes that \"fire-prone fakes are infiltrating the market.\" The article specifically points out that cylindrical lithium-ion batteries, particularly those used in small and inexpensive devices, are increasingly being found as counterfeits.",
    "chinese_title": "如何识别假冒锂离子电池",
    "chinese_summary": "能源新闻网（EnergyNews）于2025年11月22日刊登了由Andrew Moseman撰写的一篇文章，文章强调了假冒锂离子电池日益严重的问题。这篇题为《如何识别假冒锂离子电池》的文章指出，“易燃假冒品正渗透市场”。文中特别提到，圆柱形锂离子电池，尤其是用于小型廉价设备的电池，正越来越多地被发现为假冒产品。"
  },
  {
    "id": "46010230",
    "title": "Apple's Problem with Bodies",
    "url": "https://drobinin.com/posts/apples-problem-with-bodies/",
    "summary": "Apple's App Store struggles to classify apps dealing with private, contextual aspects of human experience, particularly \"relational wellbeing\" or intimacy. The author uses \"Silk,\" a private, on-device intimacy journal, as an example; it received a 16+ \"mature themes\" rating (like gambling apps) due to the lack of a suitable category.\n\nThis issue stems from the App Store's legacy classification system, which evolved from media ratings and focuses on \"content\" (images, sound) rather than user-generated personal data or contextual app functions. While current age ratings are precise for violence and gambling, the system remains \"content-centric,\" evaluating apps via metadata and screenshots, not their actual use.\n\nThis creates a \"grey zone.\" HealthKit, Apple's health framework, also conspicuously avoids modeling intimacy. Developers face challenges: using specific terms triggers stricter reviews and higher age ratings, while soft language hinders discoverability. Search algorithms struggle to connect natural language queries with these apps.\n\nThe author attributes this to technical conservatism, which prioritizes preventing malware and managing liability, slowing the introduction of new categories. Until Apple's taxonomy evolves, similar to how sleep and cycle tracking apps eventually gained formal recognition, developers must build for these missing categories and operate within this \"grey zone.\"",
    "chinese_title": "苹果的身体问题",
    "chinese_summary": "苹果的App Store难以对处理人类经验中私密、情境化方面的应用进行分类，特别是“关系福祉”或亲密关系。作者以“Silk”为例，这是一款私密的、在设备上运行的亲密关系日记应用；由于缺乏合适的类别，它获得了16+的“成熟主题”评级（与赌博应用相同）。\n\n这个问题源于App Store的传统分类系统，该系统从媒体评级演变而来，侧重于“内容”（图像、声音），而非用户生成的个人数据或应用的情境功能。虽然当前的年龄评级对暴力和赌博方面很精确，但该系统仍然“以内容为中心”，通过元数据和截图来评估应用，而非其实际用途。\n\n这造成了一个“灰色地带”。苹果的健康框架HealthKit也明显避免对亲密关系进行建模。开发者面临挑战：使用特定术语会触发更严格的审核和更高的年龄评级，而使用模糊语言则会阻碍应用的发现。搜索算法难以将自然语言查询与这些应用关联起来。\n\n作者将此归因于技术保守主义，这种保守主义优先考虑预防恶意软件和管理责任，从而减缓了新类别的引入。在苹果的分类法演进之前（就像睡眠和生理周期追踪应用最终获得正式认可一样），开发者必须为这些缺失的类别进行开发，并在这一“灰色地带”中运作。"
  },
  {
    "id": "46007294",
    "title": "Brazil charges 31 people in major carbon credit fraud investigation",
    "url": "https://news.mongabay.com/short-article/2025/11/brazil-charges-31-people-in-major-carbon-credit-fraud-investigation/",
    "summary": "Brazil’s Federal Police have indicted 31 suspects for fraud and land-grabbing in the nation’s largest known carbon credit fraud scheme in the Amazon. Dubbed Operation Greenwashing, the investigation revealed that two REDD+ projects, Unitor and Fortaleza Ituxi, covering over 140,000 hectares in Amazonas state, were simultaneously generating carbon credits while being used to launder illegally harvested timber from other deforested areas.\n\nThe probe was initiated following a Mongabay investigation and analysis by the Netherlands-based Center for Climate Crime Analysis, which identified discrepancies between declared and satellite-estimated timber volumes in these projects.\n\nThree interconnected groups allegedly orchestrated the fraud. One was led by Ricardo Stoppe Júnior, known as Brazil’s largest individual carbon credit seller, who sold millions in credits to major corporations including Nestlé, Spotify, and Boeing. The other groups were led by Élcio Aparecido Moço, previously sentenced for timber laundering and indicted for bribery, and José Luiz Capelasso, who had been sentenced for illegally trading forest product certificates.\n\nThe scheme was facilitated by corrupt public servants within Brazil’s land reform agency (Incra), registrar offices, and the Amazonas state environmental protection institute (Ipaam). Both Incra and Ipaam have expressed their support for and collaboration with the police investigation.",
    "chinese_title": "巴西在重大碳信用欺诈调查中指控31人。",
    "chinese_summary": "巴西联邦警察在该国亚马逊地区最大的已知碳信用欺诈案中，起诉了31名涉嫌欺诈和土地侵占的嫌疑人。这项被称为“洗绿行动”的调查揭示，亚马逊州内覆盖超过14万公顷土地的Unitor和Fortaleza Ituxi两个REDD+项目，在生成碳信用的同时，也被用于洗白来自其他砍伐区域的非法采伐木材。\n\n此项调查是在蒙加贝（Mongabay）的一项调查以及总部位于荷兰的气候犯罪分析中心（Center for Climate Crime Analysis）的分析之后启动的，该分析发现这些项目申报的木材量与卫星估算的木材量之间存在差异。\n\n据称有三个相互关联的团伙策划了这起欺诈案。其中一个团伙由里卡多·斯托普·儒尼奥尔（Ricardo Stoppe Júnior）领导，他被称为巴西最大的个人碳信用卖家，曾向雀巢（Nestlé）、Spotify和波音（Boeing）等大公司出售了数百万的碳信用。其他团伙则由埃尔西奥·阿帕雷西多·莫索（Élcio Aparecido Moço）和何塞·路易斯·卡佩拉索（José Luiz Capelasso）领导；前者此前曾因洗白木材而被判刑并因贿赂罪被起诉，后者曾因非法交易林产品证书而被判刑。\n\n该计划得到了巴西土地改革机构（Incra）、登记处以及亚马逊州环境保护研究所（Ipaam）内部腐败公务员的协助。Incra和Ipaam都已表示支持并配合警方调查。"
  },
  {
    "id": "46010173",
    "title": "3D printing with unconventional vase mode",
    "url": "https://vorpal.se/posts/2025/jun/23/3d-printing-with-unconventional-vase-mode/",
    "summary": "This article targets advanced 3D printing users, focusing on \"unconventional vase mode\" techniques to optimize prints for speed and material usage.\n\nVase mode typically prints a single-perimeter spiral path with no seams, infill, top layers, or supports, ideal for hollow objects like vases. The core idea is that the slicer only considers the model's outline above the solid base.\n\nThe first trick is creating **internal geometry via slits**. By inserting extremely thin slits (e.g., 0.0001 mm) into a solid model, the slicer interprets these as external perimeters, forming internal supports. Crucially, the \"Slice gap closing radius\" in PrusaSlicer (and similar settings in other slicers) must be set to 0.0 to prevent merging these tiny gaps.\n\nBuilding on this, **double walls** can be achieved by making a slit through into the hollow inside, ensuring the part's width matches exactly two perimeters (a value found in slicer settings). This allows for stronger parts or anchoring internal slits without poking through the outer surface.\n\nAnother technique is increasing **extrusion width**, potentially up to 2x the nozzle diameter, for stronger vase mode prints without significant quality loss.\n\nFinally, **\"fake vase mode\"** offers most vase mode benefits without the continuous spiral path. This involves manually adjusting slicer settings like using a single perimeter, no top layers, no infill, and no supports, but enabling features like \"ensure vertical shell thickness\" and adding a single top layer when needed. The author's case study of spheres on sticks demonstrates how fake vase mode allows for specific features (like smooth tops) while still saving material. It's often combined with scarf seams to hide the visible seam lines, offering a balance of strength, weight, and aesthetics.\n\nThe author concludes that while true vase mode can be useful, fake vase mode, especially with scarf seams, provides more flexibility and benefits, making it an underused method for functional parts. Key settings to remember are the \"Slice gap closing radius\" for slits, precise double wall width, and adjusting extrusion width.",
    "chinese_title": "非传统花瓶模式3D打印",
    "chinese_summary": "本文面向高级3D打印用户，重点介绍“非常规花瓶模式”技术，以优化打印速度和材料使用。\n\n花瓶模式通常以单层螺旋路径打印，无接缝、无填充、无顶层、无支撑，非常适合花瓶等中空物体。其核心思想是切片软件只考虑实体基座以上的模型轮廓。\n\n第一个技巧是通过**狭缝创建内部几何结构**。通过在实体模型中插入极薄的狭缝（例如0.0001毫米），切片软件会将其解释为外部周长，从而形成内部支撑。关键在于，PrusaSlicer（以及其他切片软件中的类似设置）中的“切片间隙闭合半径”必须设置为0.0，以防止合并这些微小间隙。\n\n在此基础上，通过在内部中空处开辟一条狭缝，并确保部件宽度恰好与两个周长匹配（此值可在切片设置中找到），可以实现**双层壁**。这使得部件更坚固，或者能够锚定内部狭缝而不会穿透外表面。\n\n另一种技术是增加**挤出宽度**，可能达到喷嘴直径的2倍，以获得更坚固的花瓶模式打印件，且不造成显著的质量损失。\n\n最后，**“伪花瓶模式”**提供了花瓶模式的大部分优点，但没有连续的螺旋路径。这需要手动调整切片设置，例如使用单层周长、无顶层、无填充、无支撑，但启用“确保垂直外壳厚度”等功能，并在需要时添加单个顶层。作者对棒状球体的案例研究表明，伪花瓶模式如何在节省材料的同时实现特定功能（如光滑的顶部）。它通常与围巾接缝结合使用，以隐藏可见的接缝线，从而在强度、重量和美观之间取得平衡。\n\n作者总结道，虽然真实花瓶模式可能有用，但伪花瓶模式，特别是结合围巾接缝使用时，提供了更大的灵活性和优势，使其成为功能性部件中被低估的方法。需要记住的关键设置包括狭缝的“切片间隙闭合半径”、精确的双层壁宽度以及调整挤出宽度。"
  },
  {
    "id": "46019205",
    "title": "TSA to charge $18 fee for travelers without Real ID or passport",
    "url": "https://www.washingtonpost.com/travel/2025/11/21/tsa-security-fee-wrong-id/",
    "summary": "Unable to access the article link.",
    "chinese_title": "TSA将对没有真实身份证件或护照的旅客收取18美元费用。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46018229",
    "title": "Show HN: I built a wizard to turn ideas into AI coding agent-ready specs",
    "url": "https://vibescaffold.dev/",
    "summary": "This \"Show HN\" post introduces an \"AI-Powered Spec Generator,\" a wizard designed to transform initial ideas into comprehensive, AI coding agent-ready technical specifications. Its primary goal is to eliminate vague prompt iterations by generating detailed technical specs, architecture diagrams, and agent directives from a single structured conversation.\n\nThe tool produces several outputs, including a high-level ONE_PAGER, detailed DEV_SPEC, a PROMPT_PLAN for development, and AGENTS.md files with directives for autonomous coding agents.\n\nIts key capabilities include:\n1.  **Product Definition:** Converts abstract ideas into concrete MVP requirements and user stories.\n2.  **Tech Architecture:** Drafts complete schema designs, API routes, and security protocols.\n3.  **Development Plan:** Breaks down complexity into sequential, LLM-testable prompt chains.\n4.  **Agent Directives:** Generates system prompts essential for autonomous AI coding agents.\n\nThe generator aims to streamline the initial phase of AI development, providing clear, actionable plans to help users \"Start Building Now.\"",
    "chinese_title": "Show HN: 我构建了一个向导，可将想法转化为 AI 编程智能体即用规范",
    "chinese_summary": "这篇“Show HN”帖子介绍了一个“AI驱动的规格生成器”，它是一个旨在将初步构想转化为全面、可供AI编码代理使用的技术规格的向导工具。其主要目标是通过从单一结构化对话中生成详细的技术规格、架构图和代理指令，从而消除模糊的提示迭代。\n\n该工具产生多种输出，包括一个高层次的“ONE_PAGER”（一页概览）、详细的“DEV_SPEC”（开发规格）、一个用于开发的“PROMPT_PLAN”（提示计划），以及包含自主编码代理指令的“AGENTS.md”文件。\n\n其主要功能包括：\n1.  **产品定义：** 将抽象想法转化为具体的MVP（最小可行产品）要求和用户故事。\n2.  **技术架构：** 起草完整的模式设计、API路由和安全协议。\n3.  **开发计划：** 将复杂性分解为顺序的、可供LLM（大型语言模型）测试的提示链。\n4.  **代理指令：** 生成自主AI编码代理所需的核心系统提示。\n\n该生成器旨在简化AI开发的初始阶段，提供清晰、可执行的计划，以帮助用户“立即开始构建”。"
  },
  {
    "id": "46024032",
    "title": "Editing Code in Emacs",
    "url": "https://redpenguin101.github.io/html/posts/2025_11_23_emacs_for_code_editing.html",
    "summary": "The article \"Editing Code in Emacs\" details an efficient, muscle-memory driven Emacs setup for code editing, aimed at users already familiar with Emacs basics. It advocates for a \"no mouse, no arrows\" approach, emphasizing modal editing where a \"command\" mode is default for movement and manipulation, and an \"insert\" mode is for typing. The author uses a custom lightweight modal system, though alternatives like Evil or Meow are mentioned.\n\nKey recommendations include sticking to Emacs's conventions (e.g., `f` for forward, `n` for next) and utilizing \"leader\" keys for common actions (e.g., `v` for file/buffer, `k` for kill, `s` for search). Important setup commands include relative line numbers and `global-hl-line-mode`.\n\nFor navigation, the article promotes:\n*   **Vertical Movement:** `n`/`p` for lines (often with numeric prefixes), `r`/`t` for half-page scrolling, and `.`/`,` for jumping between code \"defuns.\"\n*   **Horizontal Movement:** `f`/`b` for words (with `global-subword-mode`), but strongly discourages single-character movement in favor of larger units.\n*   **Expression-based Movement (Sexps):** `j`/`h` to jump over/back syntactic blocks (like parentheses or curly braces), and `d`/`u` to move into/out of them, preferred over word-based movement.\n*   **Search:** `C-s`/`C-r` for incremental search, and `so` for `occur` mode, which lists and allows editing of all search term instances.\n*   **Registers and Mark:** Using `v SPC a` to set temporary \"bookmarks\" and `vja` to return, or `gg`/`C-x C-x` for the more transient \"mark.\"\n\nFind and replace is handled by `sq` (query-replace) and `vpq` for project-wide operations. The author prioritizes movement above cut/copy/paste (called \"killing\" in Emacs) and typing.",
    "chinese_title": "Emacs 代码编辑",
    "chinese_summary": "文章“在Emacs中编辑代码”详细介绍了一种高效的、基于肌肉记忆的Emacs代码编辑设置，目标用户是已熟悉Emacs基础的用户。它倡导“无鼠标、无方向键”的方法，强调模态编辑，其中“命令”模式默认为移动和操作，而“插入”模式用于输入。作者使用一个自定义的轻量级模态系统，尽管提到了Evil或Meow等替代方案。\n\n主要建议包括遵循Emacs的约定（例如，`f` 用于前进，`n` 用于下一个）以及利用“leader”键执行常见操作（例如，`v` 用于文件/缓冲区，`k` 用于剪切，`s` 用于搜索）。重要的设置命令包括相对行号和 `global-hl-line-mode`。\n\n对于导航，文章提倡：\n*   **垂直移动：** `n`/`p` 用于行（常与数字前缀结合），`r`/`t` 用于半页滚动，`．`/`,` 用于在代码“defuns”之间跳转。\n*   **水平移动：** `f`/`b` 用于单词（结合 `global-subword-mode`），但强烈不鼓励单字符移动，倾向于使用更大的单位。\n*   **基于表达式的移动（Sexps）：** `j`/`h` 用于跳过/跳回语法块（如括号或花括号），`d`/`u` 用于进入/移出这些块，这比基于单词的移动更受青睐。\n*   **搜索：** `C-s`/`C-r` 用于增量搜索，`so` 用于 `occur` 模式，该模式列出并允许编辑所有搜索词实例。\n*   **寄存器和标记：** 使用 `v SPC a` 设置临时“书签”，`vja` 返回，或使用 `gg`/`C-x C-x` 进行更临时的“标记”。\n\n查找和替换由 `sq` (query-replace) 处理，项目范围的操作由 `vpq` 处理。作者将移动置于剪切/复制/粘贴（在Emacs中称为“killing”）和输入之上。"
  },
  {
    "id": "46023573",
    "title": "Demand for UK Food Bank Up 15% Year on Year",
    "url": "https://www.theguardian.com/society/2025/nov/23/food-banks-demand-prices-frontline-cost-of-living-crisis",
    "summary": "The article reveals the escalating impact of the UK's cost of living crisis, causing a dramatic 15% year-on-year increase in demand for food banks. The Canterbury food bank, serving Canterbury, Whitstable, and Herne Bay, illustrates this trend starkly, with monthly parcel distribution soaring from 450 in 2019 to over 1,100 today.\n\nInitially dependent on donations, the charity's monthly food bill has surged from virtually nothing in February 2022 to £10,000, despite rising food donations. This financial strain is worsened by declining monetary donations and competitive grants. Simultaneously, UK food and drink prices have risen by 4.9% annually, meaning the food bank's purchasing power has decreased by about 10% in 18 months.\n\nPersonal accounts, like that of a Kent mother struggling to feed her four children, highlight the severe human cost. Contributing factors include stagnant wages and benefits, insecure employment, and policies like the two-child benefit cap, which experts argue pushes more children into poverty.\n\nLiam Waghorn, the operations manager, states they now actively \"have to go and find donations rather than expect them.\" Experts like Peter Taylor-Gooby note that poverty is becoming \"deeper and more concentrated.\" Once envisioned as temporary, food banks have evolved into a \"necessary part of the welfare state,\" indicating that this crisis is no longer an emergency spike but \"the new normal.\"",
    "chinese_title": "英国食物银行需求同比增长15%",
    "chinese_summary": "文章揭示了英国生活成本危机日益加剧的影响，导致对食物银行的需求同比急剧增加了15%。为坎特伯雷、惠茨特布尔和赫恩湾提供服务的坎特伯雷食物银行，清晰地说明了这一趋势，其每月包裹分发量从2019年的450份飙升至如今的1,100多份。\n\n该慈善机构最初依赖捐赠，尽管食物捐赠有所增加，但其每月食物账单已从2022年2月几乎为零飙升至10,000英镑。货币捐赠的减少和竞争激烈的拨款进一步加剧了这种财政压力。与此同时，英国食品和饮料价格每年上涨4.9%，这意味着食物银行的购买力在18个月内下降了约10%。\n\n个人案例，例如肯特郡一位母亲努力养活她的四个孩子的故事，凸显了这场危机带来的沉重人文代价。导致因素包括工资和福利停滞不前、就业不稳定以及“两孩福利上限”等政策，专家认为这些政策使更多儿童陷入贫困。\n\n运营经理利亚姆·瓦格霍恩表示，他们现在不得不积极“出去寻找捐赠，而不是坐等它们上门”。彼得·泰勒-古比等专家指出，贫困正变得“更深更集中”。食物银行曾被设想为临时性的存在，但现在已演变为“福利国家不可或缺的一部分”，这表明这场危机不再是紧急情况下的暂时高峰，而是“新常态”。"
  },
  {
    "id": "46016630",
    "title": "Gwern's \"Stem Humor\" Directory",
    "url": "https://gwern.net/doc/math/humor/index",
    "summary": "Gwern's \"Stem Humor\" directory is a curated collection of humorous content rooted in science, technology, engineering, and mathematics. The directory is split into two primary sections: \"See Also,\" featuring Gwern's own contributions, and \"Links,\" compiling a vast array of similar pieces from other authors.\n\nGwern's own works include titles like \"Human Cannibalism Alignment Chart,\" \"The Carcinisation of Satan,\" and \"Estimated Cost of DMT Machine Elf Prime Factorization Experiment,\" often presenting absurd thought experiments or parodies of academic papers within scientific or AI contexts.\n\nThe \"Links\" section showcases a wide range of external humorous articles, research, and concepts. Examples include \"NeuRaLaTeX: A Machine Learning Library Written in Pure LaTeX,\" \"Regex Chess: A 2-Ply Minimax Chess Engine in 84,688 Regular Expressions,\" \"A Stress Analysis of a Strapless Evening Gown,\" and \"How to Install Linux on a Dead Badger.\" These entries frequently play with scientific rigor, technical jargon, and philosophical or computational paradoxes for comedic effect.\n\nOverall, the directory highlights a specific niche of intellectual humor that finds amusement in the intersection of serious academic pursuit and whimsical, often high-concept, absurdity, reflecting a unique subculture within the STEM community.",
    "chinese_title": "Gwern的“STEM幽默”目录",
    "chinese_summary": "Gwern的“STEM幽默”目录是一个精选的幽默内容合集，其根植于科学、技术、工程和数学领域。该目录分为两个主要部分：“参阅”（See Also），收录了Gwern自己的作品；以及“链接”（Links），汇集了其他作者的大量类似作品。\n\nGwern自己的作品包括《人类食人对齐图》（Human Cannibalism Alignment Chart）、《撒旦的癌化》（The Carcinisation of Satan）和《DMT机器精灵素数分解实验估算成本》（Estimated Cost of DMT Machine Elf Prime Factorization Experiment）等，这些作品常以科学或AI为背景，呈现荒谬的思想实验或学术论文的戏仿。\n\n“链接”部分展示了大量外部幽默文章、研究和概念。示例包括《NeuRaLaTeX：一个纯LaTeX编写的机器学习库》（NeuRaLaTeX: A Machine Learning Library Written in Pure LaTeX）、《正则国际象棋：一个用84,688个正则表达式实现的2层Minimax国际象棋引擎》（Regex Chess: A 2-Ply Minimax Chess Engine in 84,688 Regular Expressions）、《无肩带晚礼服的应力分析》（A Stress Analysis of a Strapless Evening Gown）和《如何在死獾上安装Linux》（How to Install Linux on a Dead Badger）。这些条目经常巧妙运用科学严谨性、技术术语以及哲学或计算悖论来制造喜剧效果。\n\n总的来说，该目录突显了一种特定的智性幽默，这种幽默在严肃的学术追求与异想天开、常是高概念的荒谬之间找到乐趣，反映了STEM社区内一种独特的亚文化。"
  },
  {
    "id": "46021905",
    "title": "Parallel Threads in Racket v9.0",
    "url": "https://blog.racket-lang.org/2025/11/parallel-threads.html",
    "summary": "Racket v9.0, released November 23, 2025, introduces native shared-memory parallel threads, allowing Racket programs to leverage multicore hardware for the first time, moving beyond mere concurrency. Creating a parallel thread is as simple as adding `#:pool 'own` to a `thread` call, or using `make-parallel-thread-pool` for shared resources. A new `#:keep 'result` argument also allows retrieving a thread's return value with `thread-wait`.\n\nThis significant update was enabled by Racket's 2017 rebuild on Chez Scheme, which improved its foundation for parallelism, including parallel garbage collection and refined thread scheduling. While earlier versions offered `places` for coarse-grained and `futures` for fine-grained parallelism, shared-memory threads simplify parallel task integration.\n\nPerformance benchmarks on an M2 Mac show substantial speedups for numerical and unshared data computations (e.g., `fib`, `strfib`, `hash-nums`), with up to ~4x speedup on 4 cores. However, parallelism can be limited by I/O operations due to coarse-grained locks, as demonstrated by `hash-digs` and `hash-dir` examples.\n\nBackward compatibility is largely maintained; existing synchronization mechanisms like semaphores and channels work with parallel threads. While parallel threads expose the underlying machine's weaker memory consistency model (unlike coroutine threads' sequential consistency), Racket guarantees memory safety through Chez Scheme's fences. A small performance overhead (up to 6-8%) may be observed in certain non-parallel programs due to necessary internal locks. Coroutine threads remain the default and are still optimal for many concurrency-focused tasks like GUI interactions.",
    "chinese_title": "Racket v9.0 并行线程",
    "chinese_summary": "Racket v9.0于2025年11月23日发布，引入了原生的共享内存并行线程，使Racket程序首次能够利用多核硬件，超越了单纯的并发。创建并行线程很简单，只需在 `thread` 调用中添加 `#:pool 'own`，或者使用 `make-parallel-thread-pool` 来处理共享资源。新增的 `#:keep 'result` 参数也允许通过 `thread-wait` 获取线程的返回值。\n\n这项重大更新得益于Racket在2017年基于Chez Scheme的重建，该重建改善了其并行化基础，包括并行垃圾回收和更精细的线程调度。虽然早期版本提供了用于粗粒度并行的 `places` 和用于细粒度并行的 `futures`，但共享内存线程简化了并行任务的集成。\n\nM2 Mac上的性能基准测试显示，对于数值和非共享数据计算（例如 `fib`、`strfib`、`hash-nums`）有显著的加速，在4核上最高可达约4倍。然而，由于粗粒度锁，并行性可能会受到I/O操作的限制，正如 `hash-digs` 和 `hash-dir` 示例所示。\n\n向后兼容性基本保持不变；现有的同步机制，如信号量和通道，可与并行线程配合使用。虽然并行线程暴露了底层机器较弱的内存一致性模型（与协程线程的顺序一致性不同），但Racket通过Chez Scheme的内存屏障（fences）保证了内存安全。由于必要的内部锁，某些非并行程序可能会出现少量性能开销（最高达6-8%）。协程线程仍然是默认设置，并且对于许多以并发为重点的任务，如GUI交互，仍然是最佳选择。"
  },
  {
    "id": "46024023",
    "title": "Gnome is better macOS than macOS",
    "url": "https://andreyor.st/posts/2025-11-23-gnome-is-better-macos-than-macos/",
    "summary": "The author, a long-time Linux user with extensive experience primarily with GNOME, recently acquired a MacBook Pro and contends that GNOME provides a better user experience than macOS in several key areas. After years of experimenting with various Linux desktop environments, including Unity and KDE Plasma, the author has settled on GNOME 42, appreciating its refined vision and workflow suitability.\n\nThe purchase of a MacBook was driven by frustrations with Windows 11's intrusive ads and forced updates, alongside Linux's significant limitations for professional media production, particularly audio. macOS, being Unix-based with robust media support, appeared to be the ideal solution.\n\nHowever, despite praising the MacBook's hardware, the author finds macOS to be \"counter-intuitive\" and \"user-unfriendly.\" Key criticisms include:\n1.  **Virtual Desktops (Spaces):** Slower gesture-based switching, absence of automatic desktop creation, and the disruptive behavior of fullscreen applications being moved to the far right of the desktop list, unlike GNOME's more intuitive adjacent placement.\n2.  **Mission Control:** Considered \"far less useful\" than GNOME's Overview, as it only permits moving windows and desktops, lacking functionalities like closing applications, searching, or displaying the applications menu.\n3.  **The Dock:** Criticized for constantly occupying screen space and retaining icons of closed applications, a stark contrast to GNOME's context-aware dock that appears only when needed.\n\nThe author concludes that GNOME's design choices align better with their personal workflow and preferences.",
    "chinese_title": "Gnome 比 macOS 更 macOS",
    "chinese_summary": "作者是一位资深的Linux用户，主要拥有丰富的GNOME使用经验，他最近购买了一台MacBook Pro，并认为在几个关键领域，GNOME比macOS提供了更好的用户体验。经过多年对各种Linux桌面环境（包括Unity和KDE Plasma）的尝试后，作者最终选择了GNOME 42，赞赏其精致的愿景和对工作流程的适用性。\n\n购买MacBook的动机是对Windows 11侵入性广告和强制更新的不满，以及Linux在专业媒体制作（尤其是音频方面）的显著局限性。macOS作为基于Unix且具有强大媒体支持的系统，似乎是理想的解决方案。\n\n然而，尽管作者称赞了MacBook的硬件，他却发现macOS“反直觉”且“不友好”。主要批评包括：\n1.  **虚拟桌面 (Spaces)**：基于手势的切换速度较慢，缺乏自动创建桌面功能，以及全屏应用程序被移到桌面列表最右侧的干扰行为，这与GNOME更直观的相邻放置方式不同。\n2.  **调度中心 (Mission Control)**：被认为“远不如”GNOME的Overview实用，因为它只允许移动窗口和桌面，缺乏关闭应用程序、搜索或显示应用程序菜单等功能。\n3.  **程序坞 (The Dock)**：被批评持续占用屏幕空间并保留已关闭应用程序的图标，这与GNOME仅在需要时才出现的上下文感知程序坞形成鲜明对比。\n\n作者总结说，GNOME的设计选择更符合其个人工作流程和偏好。"
  },
  {
    "id": "46013633",
    "title": "Jack Ma's family shifted wealth to UK after years-long 'disappearance'",
    "url": "https://www.source-material.org/jack-ma-bought-uk-home-after-years-long-disappearance/",
    "summary": "Jack Ma's wife, Cathy Ying Zhang, purchased a £19.5 million mansion in London's Belgravia in October 2024, the family's first known UK property. This acquisition comes after Ma's return to public life following years of \"disappearance\" and scrutiny by Chinese authorities, which began after his 2020 criticism of China's financial system.\n\nExperts view the London property as a \"precautionary diversification\" and \"hedging against regime risk,\" a trend among wealthy Chinese families moving assets to \"rule of law societies\" due to fears of asset freezes or capital controls. Ma, Alibaba Group's founder with an estimated $30 billion fortune, reportedly faced a nearly $3 billion fine and the halt of Ant Group's IPO during his political exile.\n\nHis wife, a Singaporean citizen, has also acquired a French château and commercial properties in Singapore, highlighting a broader movement of high-net-worth Chinese individuals emigrating and moving money abroad. Although Ma resurfaced in China in 2023 and was seen with President Xi Jinping in February 2025, state media silence on his public remarks suggests incomplete rehabilitation. The London property purchase was reportedly rushed to pre-empt a UK stamp duty hike for overseas buyers.",
    "chinese_title": "马云家族在多年“消失”后将财富转移至英国",
    "chinese_summary": "马云的妻子张瑛于2024年10月在伦敦贝尔格莱维亚区以1950万英镑购入一处豪宅，这是该家族在英国首次被公开的房产。此次收购发生在马云回归公众视野之后，此前他曾“消失”多年，并受到中国当局的审查，这始于2020年他对中国金融体系的批评。\n\n专家认为，这处伦敦房产是“预防性多元化”和“对冲政权风险”的举措，是富裕中国家庭将资产转移到“法治社会”的一种趋势，因为他们担心资产被冻结或实施资本管制。阿里巴巴集团创始人马云估计拥有300亿美元财富，据报道，他在政治流亡期间面临近30亿美元的罚款，以及蚂蚁集团首次公开募股（IPO）的叫停。\n\n他的妻子是新加坡公民，她还在新加坡收购了一座法国城堡和商业地产，这凸显了中国高净值人士移民和向海外转移资金的更广泛趋势。尽管马云于2023年在中国重新露面，并于2025年2月与习近平主席会面，但官媒对其公开言论的沉默表明其尚未完全“平反”。据报道，这处伦敦房产的购买被仓促完成，旨在抢在英国提高针对海外买家的印花税之前。"
  },
  {
    "id": "46013463",
    "title": "Google tells employees it must double capacity every 6 months to meet AI demand",
    "url": "https://arstechnica.com/ai/2025/11/google-tells-employees-it-must-double-capacity-every-6-months-to-meet-ai-demand/",
    "summary": "Google is under immense pressure to rapidly expand its AI infrastructure, with AI infrastructure head Amin Vahdat informing employees the company must double its serving capacity every six months to meet demand. He outlined an ambitious goal to scale compute capacity \"1000x in 4-5 years,\" stressing this must occur without proportional increases in cost or power consumption.\n\nThis aggressive expansion is fueled by both increasing user adoption and the integration of AI features into Google's core services. The company faces significant challenges, including a severe shortage of Nvidia GPUs, which are critical for AI computations, leading to \"compute constraints\" that limit the broader rollout of new features like Google's Veo video generation tool, as noted by CEO Sundar Pichai.\n\nTo address these hurdles and outpace competitors like OpenAI (which plans a $400 billion data center buildout), Google's strategy focuses on three pillars: constructing physical infrastructure, developing more efficient AI models, and designing custom silicon chips, such as its power-efficient Tensor Processing Units (TPUs) like the seventh-generation Ironwood.\n\nDespite widespread discussion about a potential \"AI bubble,\" Pichai emphasized that Google perceives the risk of underinvesting in AI infrastructure as greater than that of overcapacity. He anticipates an \"intense\" 2026, highlighting the company's firm commitment to an aggressive bet on sustained AI growth and competition.",
    "chinese_title": "谷歌告诉员工，为满足AI需求，公司必须每半年将产能翻倍。",
    "chinese_summary": "谷歌正面临巨大压力，需要迅速扩建其人工智能基础设施。人工智能基础设施负责人阿明·瓦赫达特告知员工，公司必须每六个月将其服务能力翻一番，以满足需求。他提出了一个雄心勃勃的目标，即在“四到五年内将计算能力提升1000倍”，并强调这必须在不按比例增加成本或功耗的情况下实现。\n\n这种积极的扩张得益于用户采纳度的提高以及人工智能功能融入谷歌的核心服务。公司面临重大挑战，包括英伟达GPU的严重短缺，而GPU对于AI计算至关重要。正如首席执行官桑达尔·皮查伊所指出的，这导致了“计算限制”，从而限制了谷歌Veo视频生成工具等新功能的广泛推出。\n\n为了应对这些障碍并超越OpenAI等竞争对手（OpenAI计划斥资4000亿美元建设数据中心），谷歌的战略聚焦于三大支柱：建设物理基础设施、开发更高效的AI模型以及设计定制化芯片，例如其节能型张量处理单元（TPU），如第七代“铁木”（Ironwood）。\n\n尽管关于潜在“AI泡沫”的讨论甚嚣尘上，皮查伊强调，谷歌认为对AI基础设施投资不足的风险大于产能过剩的风险。他预计2026年将是“激烈”的一年，凸显了公司对AI持续增长和竞争进行积极押注的坚定承诺。"
  },
  {
    "id": "46023143",
    "title": "X.com Is Gonna Snitch You Out to the Public If You Use a VPN",
    "url": "https://www.vice.com/en/article/x-show-vpn-warning/",
    "summary": "X.com is reportedly implementing a new policy that will publicly identify users who connect to the platform using Virtual Private Networks (VPNs). VPNs are crucial for many, offering protection against hackers and snoops, safeguarding individuals in oppressive regimes, and ensuring anonymity for journalists and activists.\n\nAccording to Nikita Bier, X's Head of Product, X is \"experimenting with displaying new information on profiles, including which country an account is based\" to verify content authenticity. While \"privacy toggles\" will be available, Bier indicated that choosing to hide VPN use would likely be highlighted on the user's profile.\n\nFurther details, revealed by analyst Aaron Perris, confirm that X will display a warning if a VPN is detected. This will manifest as text on the user's profile, visible to others, stating, \"'One of our partners has indicated that you may be connecting via a proxy—such as a VPN—which may change the country or region that is displayed on your profile.'\" Consequently, profiles will display \"Country or region may not be accurate.\"\n\nOnline security advocates have strongly criticized this move, deeming it a thinly veiled attempt to \"out\" VPN users, raising significant privacy concerns. The article labels X's action as a \"shitty move,\" suggesting it prioritizes monetization over genuine user safety and addressing misinformation.",
    "chinese_title": "X.com 如果你使用 VPN，就会把你抖出去。",
    "chinese_summary": "据报道，X.com正在实施一项新政策，该政策将公开识别使用虚拟私人网络（VPN）连接到该平台的用户。VPN对许多人来说至关重要，它们可以抵御黑客和窥探者，保护压迫性政权下的个人，并确保记者和活动家的匿名性。\n\n据X的产品负责人Nikita Bier称，X正在“尝试在个人资料上显示新信息，包括账户所在的国家/地区”，以验证内容的真实性。虽然将提供“隐私开关”，但Bier表示，选择隐藏VPN使用情况很可能会在用户个人资料上被突出显示。\n\n分析师Aaron Perris透露的更多细节证实，如果检测到VPN，X将显示警告。这将在用户个人资料上以文本形式显示，供他人查看，内容为：“我们的一位合作伙伴已指出，您可能正在通过代理（例如VPN）连接，这可能会改变您个人资料上显示的国家或地区。”因此，个人资料将显示“国家或地区可能不准确”。\n\n在线安全倡导者强烈批评此举，认为这是“揭露”VPN用户的拙劣尝试，引发了严重的隐私担忧。文章将X的行动标记为“恶劣行径”，暗示它将盈利置于真正的用户安全和打击虚假信息之上。"
  },
  {
    "id": "46017972",
    "title": "Terence Tao: At the Erdos problem website, AI assistance now becoming routine",
    "url": "https://mathstodon.xyz/@tao/115591487350860999",
    "summary": "The article reports a statement by renowned mathematician Terence Tao, shared on Mathstodon. Tao observed that \"AI assistance\" is now becoming a routine feature at the Erdos problem website. This highlights the growing integration and commonplace use of artificial intelligence within advanced mathematical problem-solving contexts, specifically concerning Erdos problems. The accompanying text is a technical note about enabling JavaScript for the Mastodon web application, unrelated to Tao's specific observation about AI.",
    "chinese_title": "陶哲轩：在埃尔德什问题网站，AI辅助正在成为常态",
    "chinese_summary": "这篇文章报道了著名数学家陶哲轩在Mathstodon上分享的一项声明。陶哲轩观察到，“AI辅助”现在正成为Erdos问题网站的一项常规功能。这突显了人工智能在高级数学问题解决环境（特别是Erdos问题）中日益增长的融合和普遍使用。随附的文字是一项关于为Mastodon网络应用程序启用JavaScript的技术说明，与陶哲轩关于AI的特定观察无关。"
  },
  {
    "id": "46015262",
    "title": "A looming 'insect apocalypse' could endanger global food supplies",
    "url": "https://www.livescience.com/animals/insects/a-looming-insect-apocalypse-could-endanger-global-food-supplies-can-we-stop-it-before-its-too-late",
    "summary": "Insect populations are plummeting worldwide, a phenomenon dubbed \"the insect apocalypse,\" which severely threatens global food supplies. This decline is evidenced by the \"windshield test\" and studies showing significant drops in bees (25%), butterflies (22%), and flying insects (76% in Germany).\n\nThree main factors drive this crisis: climate change, causing mismatches in insect life cycles and extreme weather; extensive habitat loss due to urbanization, deforestation, and sterile lawns; and widespread pesticide use, including harmful neonicotinoids and glyphosate.\n\nThe consequences are dire for the global food system. Three-quarters of the world's crops, and over a third of total crop yields, depend on insect pollination. Crucial crops like coffee and chocolate are entirely reliant, while others such as blueberries, tomatoes, and alfalfa see drastically higher yields with diverse pollinators beyond just honeybees.\n\nDespite the scale of the problem, solutions exist. Experts advocate for coordinated federal efforts to mitigate climate change, reduce industrial pesticide use, and protect wild spaces. On a local level, individuals can help by creating pollinator habitats like backyard gardens, \"bee lawns,\" buffer strips, and native plant micro-plots. Reducing pesticide use through integrated pest management or hand-weeding is also vital. Community science initiatives like pollinator counts help track progress. The overarching message is to act proactively now to restore insect biodiversity, rather than waiting for comprehensive data.",
    "chinese_title": "迫在眉睫的“昆虫末日”可能危及全球粮食供应。",
    "chinese_summary": "全球昆虫数量正在骤降，这种现象被称为“昆虫末日”，严重威胁全球粮食供应。这一衰退可由“挡风玻璃测试”以及显示蜜蜂（25%）、蝴蝶（22%）和飞行昆虫（德国地区为76%）数量大幅下降的研究数据证实。\n\n三个主要因素导致了这场危机：气候变化，造成昆虫生命周期错位和极端天气；城市化、森林砍伐和贫瘠草坪造成的广泛栖息地丧失；以及包括有害新烟碱类和草甘膦在内的农药的广泛使用。\n\n对全球粮食系统而言，后果是严重的。全世界四分之三的作物以及超过三分之一的作物总产量依赖昆虫授粉。咖啡和巧克力等重要作物完全依赖昆虫授粉，而蓝莓、番茄和苜蓿等作物，若有除蜜蜂之外的多种传粉昆虫，产量会大幅提高。\n\n尽管问题规模巨大，但解决方案确实存在。专家们倡导联邦层面协调努力，以缓解气候变化、减少工业农药使用并保护野生空间。在地方层面，个人可以通过建造传粉昆虫栖息地来提供帮助，例如后院花园、“蜜蜂草坪”、缓冲带和本地植物微型地块。通过病虫害综合防治或人工除草来减少农药使用也至关重要。传粉昆虫数量统计等社区科学项目有助于追踪进展。核心信息是现在就采取积极行动恢复昆虫生物多样性，而不是等待全面的数据。"
  },
  {
    "id": "46011115",
    "title": "Cryptographers cancel election results after losing decryption key",
    "url": "https://arstechnica.com/security/2025/11/cryptography-group-cancels-election-results-after-official-loses-secret-key/",
    "summary": "The International Association of Cryptologic Research (IACR) has canceled the results of its annual leadership election after one of its officials lost an encryption key essential for decrypting the votes. The election utilized Helios, an open-source system designed for verifiable, confidential, and privacy-preserving voting.\n\nAccording to IACR bylaws, three independent trustees each held one-third of the cryptographic key material needed to decrypt the results. However, one trustee, Moti Yung, \"irretrievably lost their private key,\" preventing the completion of the decryption process and rendering the election outcome unobtainable or unverifiable. The IACR called this an \"honest but unfortunate human mistake.\"\n\nTo prevent future incidents, the IACR will adopt a new key management mechanism, requiring only two out of three key chunks for decryption. Moti Yung has resigned and been replaced by Michel Abdalla. The IACR, a nonprofit scientific organization focused on cryptology, has commenced a new election, running through December 20.",
    "chinese_title": "密码学家丢失解密密钥后取消选举结果",
    "chinese_summary": "国际密码学研究协会（IACR）取消了其年度领导层选举结果，原因是其一名官员丢失了解密选票所必需的加密密钥。本次选举采用了Helios，这是一个旨在实现可验证、保密和隐私保护投票的开源系统。\n\n根据IACR章程，三名独立的受托人每人持有一份用于解密结果的三分之一加密密钥材料。然而，一名受托人Moti Yung“不可挽回地丢失了他们的私钥”，阻止了解密过程的完成，并导致选举结果无法获得或无法验证。IACR称此为“一个真诚但令人遗憾的人为错误”。\n\n为了防止未来再次发生此类事件，IACR将采用一种新的密钥管理机制，解密时只需三份密钥中的任意两份即可。Moti Yung已辞职，由Michel Abdalla接替。IACR，一个专注于密码学的非营利科学组织，已启动一项新的选举，投票将持续到12月20日。"
  },
  {
    "id": "46024328",
    "title": "Inmates at a Mississippi jail were ordered to do the guards' bidding",
    "url": "https://www.nytimes.com/2025/11/14/us/mississippi-jail-inmates-rankin-county.html",
    "summary": "Unable to access the article link.",
    "chinese_title": "密西西比州一所监狱的囚犯奉命听从狱警的差遣。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46023364",
    "title": "Claude Code Is Down",
    "url": "https://status.claude.com/incidents/538r2y9cjmhk",
    "summary": "On November 23, 2025, the Claude API (api.anthropic.com) experienced an incident marked by elevated error rates and higher-than-normal failure rates. Investigations began around 13:05 UTC to identify the root cause. By 13:53 UTC, a fix had been implemented, and the team was monitoring its effectiveness. The incident was officially resolved at 14:11 UTC.",
    "chinese_title": "Claude Code 宕机",
    "chinese_summary": "2025年11月23日，Claude API (api.anthropic.com) 发生了一起事件，表现为错误率升高和故障率高于正常水平。调查于世界标准时间13:05左右开始，以查明根本原因。到世界标准时间13:53，已实施修复措施，团队正在监测其有效性。该事件于世界标准时间14:11正式解决。"
  },
  {
    "id": "46007267",
    "title": "How/why to sweep async tasks under a Postgres table",
    "url": "https://taylor.town/pg-task",
    "summary": "The article advocates for \"sweeping\" asynchronous task complexity under a PostgreSQL table, promoting slim, fast servers that offload non-critical operations from immediate user requests. The core philosophy centers on leveraging the database's transactional guarantees as the single, consistent source of truth, thereby circumventing the complexities and pitfalls of hand-rolling two-phase commits with external message queues.\n\nThe author argues for centralizing all task-related state within Postgres, enabling it to act as a consolidated queue, pipeline, and async processing system—reducing the need for disparate services like Kafka, Celery, or Redis. This \"TODO-Driven Development\" approach features a continuous worker loop that processes tasks.\n\nKey implementation details include:\n*   A `task` table storing `task_type` and `jsonb params`.\n*   A worker that uses `DELETE ... FOR UPDATE SKIP LOCKED LIMIT 1` within a database transaction to atomically fetch and claim tasks.\n*   Automatic task retry upon failure, as the transaction rollback restores the task to the queue.\n*   Support for concurrent workers without contention, thanks to `SKIP LOCKED`.\n*   Randomized task ordering for resilience, preventing single task types from monopolizing the queue.\n\nThis strategy aims to deliver immediate customer feedback, enhance system reliability, and improve human fault tolerance by automating error handling.",
    "chinese_title": "如何以及为何将异步任务整合进Postgres表",
    "chinese_summary": "这篇文章提倡将异步任务的复杂性封装在一个PostgreSQL表中，从而推广轻量、快速的服务器，将非关键操作从即时用户请求中卸载。其核心理念是利用数据库的事务保证作为单一可信来源，从而避免了手动实现带有外部消息队列的两阶段提交的复杂性和陷阱。\n\n作者主张将所有任务相关的状态集中存储在Postgres中，使其能够充当一个整合的队列、管道和异步处理系统——减少了对Kafka、Celery或Redis等独立服务的需求。这种“TODO驱动开发”方法采用一个持续运行的工作者循环来处理任务。\n\n关键实现细节包括：\n*   一个存储 `task_type` 和 `jsonb params` 的 `task` 表。\n*   一个工作者，它在数据库事务中使用 `DELETE ... FOR UPDATE SKIP LOCKED LIMIT 1` 来原子地获取并认领任务。\n*   任务失败时自动重试，因为事务回滚会将任务恢复到队列中。\n*   由于 `SKIP LOCKED`，支持并发工作者而无资源竞争。\n*   随机化任务排序以提高弹性，防止单一任务类型垄断队列。\n\n这一策略旨在提供即时客户反馈，增强系统可靠性，并通过自动化错误处理提高人类容错能力。"
  },
  {
    "id": "46023213",
    "title": "Maybe that's not liquid water on Mars after all",
    "url": "https://phys.org/news/2025-11-liquid-mars.html",
    "summary": "Unable to access the article link.",
    "chinese_title": "也许那毕竟不是火星上的液态水。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "46011569",
    "title": "Microsoft Will Preload Windows 11 File Explorer to Fix Bad Performance",
    "url": "https://blogs.windows.com/windows-insider/2025/11/21/announcing-windows-11-insider-preview-build-26100-7271-dev-beta-channels/",
    "summary": "Microsoft released Windows 11 Insider Preview Build 26220.7271 (KB5070307) on November 21, 2025, for Dev and Beta Channels, offering a window for Insiders to switch channels. This update introduces significant improvements across performance, gaming, recovery, and user experience.\n\nA major focus is on **File Explorer performance**, with Microsoft exploring preloading it in the background to achieve faster launch times. Users will have an option to disable this feature in Folder Options. File Explorer's context menu also receives refinements, grouping less common actions into new flyouts (like \"Manage file\") and reordering options for better accessibility.\n\nFor gamers, the **Xbox full screen experience (FSE)** expands to more Windows 11 PC form factors, offering a console-style, controller-first interface accessible via Task View, Game Bar, or Win + F11.\n\nNew recovery features include \"Point-in-time restore for Windows,\" allowing users to quickly revert their device to a previous state to minimize downtime and simplify troubleshooting. Accessibility is enhanced with \"Fluid Dictation\" for voice typing on NPU devices, which uses on-device small language models to automatically correct grammar, punctuation, and filler words, making dictation smoother.\n\nCross-device continuity is improved, enabling Vivo Android phone users to resume browsing and select Android phone users (Honor, Huawei, Oppo, Samsung, Vivo) to continue M365 Copilot online files on their PC. The Microsoft Store now allows uninstalling apps directly from its library page. The build also includes various fixes for issues related to the Taskbar, internet connectivity, and settings.",
    "chinese_title": "微软将预加载Windows 11文件资源管理器以修复性能不佳",
    "chinese_summary": "微软于2025年11月21日面向Dev和Beta渠道发布了Windows 11 Insider Preview Build 26220.7271 (KB5070307)，为Insider用户提供了切换渠道的机会。此次更新在性能、游戏、恢复和用户体验方面带来了显著改进。\n\n一个主要重点是**文件资源管理器性能**，微软正在探索在后台预加载它以实现更快的启动时间。用户将可以在“文件夹选项”中选择禁用此功能。文件资源管理器的上下文菜单也得到了优化，将不常用操作归入新的浮出菜单（如“管理文件”），并重新排列选项以提高可访问性。\n\n对于游戏玩家，**Xbox全屏体验（FSE）**扩展到更多Windows 11 PC外形尺寸，提供一种可通过任务视图、游戏栏或Win + F11访问的、以手柄为优先的、主机风格界面。\n\n新的恢复功能包括“Windows时间点恢复”，允许用户快速将设备恢复到之前的状态，以最大程度地减少停机时间并简化故障排除。通过NPU设备上的“流畅听写”功能增强了辅助功能，该功能使用设备内置的小型语言模型自动纠正语法、标点符号和冗余词语，使听写更加流畅。\n\n跨设备连续性得到改进，支持Vivo安卓手机用户恢复浏览，并支持部分安卓手机用户（荣耀、华为、OPPO、三星、Vivo）在PC上继续编辑M365 Copilot在线文件。Microsoft Store现在允许用户直接从其库页面卸载应用程序。此版本还包含了对任务栏、互联网连接和设置等相关问题的各种修复。"
  },
  {
    "id": "46013579",
    "title": "Libpng 1.6.51: Four buffer overflow vulnerabilities fixed",
    "url": "https://www.openwall.com/lists/oss-security/2025/11/22/1",
    "summary": "Libpng version 1.6.51 has been released to fix four buffer overflow and over-read vulnerabilities, identified as CVE-2025-64505, CVE-2025-64506, CVE-2025-64720, and CVE-2025-65018. These security flaws affect libpng versions 1.6.0 through 1.6.50.\n\nDiscovered through fuzzing and security research, the release addresses two high-severity (CVSS 7.1) and two moderate-severity (CVSS 6.1) issues. All vulnerabilities require user interaction, specifically processing a malicious PNG file. The potential impacts include information disclosure and denial of service. Notably, CVE-2025-65018, a heap buffer overflow in `png_combine_row`, may also enable arbitrary code execution through heap corruption in certain configurations.\n\nThe specific vulnerabilities are:\n*   **CVE-2025-64505 (Moderate):** Heap buffer over-read in `png_do_quantize` with a malformed palette index.\n*   **CVE-2025-64506 (Moderate):** Heap buffer over-read in `png_write_image_8bit`.\n*   **CVE-2025-64720 (High):** Out-of-bounds read in `png_image_read_composite` during palette premultiplication.\n*   **CVE-2025-65018 (High):** Heap buffer overflow in `png_combine_row` when processing 16-bit interlaced PNGs with 8-bit output.\n\nCredit for discovery goes to Samsung-PENTEST, weijinjinnihao, and yosiimich. Users are strongly urged to upgrade to libpng 1.6.51 immediately to mitigate these risks.",
    "chinese_title": "Libpng 1.6.51：修复了四个缓冲区溢出漏洞",
    "chinese_summary": "Libpng 1.6.51 版本已发布，旨在修复四个缓冲区溢出和越界读取漏洞，编号分别为 CVE-2025-64505、CVE-2025-64506、CVE-2025-64720 和 CVE-2025-65018。这些安全缺陷影响 Libpng 1.6.0 至 1.6.50 版本。\n\n这些漏洞通过模糊测试和安全研究被发现，本次发布解决了两个高危（CVSS 7.1）和两个中危（CVSS 6.1）问题。所有漏洞都需要用户交互，特别是处理恶意 PNG 文件。潜在影响包括信息泄露和拒绝服务。值得注意的是，CVE-2025-65018 是 `png_combine_row` 中的一个堆缓冲区溢出，在某些配置下，还可能通过堆损坏导致任意代码执行。\n\n具体漏洞如下：\n*   **CVE-2025-64505（中危）：** 在 `png_do_quantize` 中，使用格式错误的调色板索引时发生堆缓冲区越界读取。\n*   **CVE-2025-64506（中危）：** 在 `png_write_image_8bit` 中发生堆缓冲区越界读取。\n*   **CVE-2025-64720（高危）：** 在 `png_image_read_composite` 中，调色板预乘期间发生越界读取。\n*   **CVE-2025-65018（高危）：** 在 `png_combine_row` 中，处理 16 位隔行扫描 PNG 并输出 8 位数据时发生堆缓冲区溢出。\n\n发现者是 Samsung-PENTEST、weijinjinnihao 和 yosiimich。强烈建议用户立即升级到 Libpng 1.6.51 以缓解这些风险。"
  },
  {
    "id": "46024584",
    "title": "Mount Proton Drive on Linux using rclone and systemd",
    "url": "https://github.com/dadtronics/protondrive-linux",
    "summary": "This guide outlines how to automate mounting Proton Drive on Linux using `rclone` and `systemd`. The setup enables Proton Drive to be mounted automatically at user login via a systemd user service, employing `rclone` with `--vfs-cache-mode writes` for compatibility, `FUSE` for `--allow-other` mounts, and background logging.\n\nThe process involves five main steps:\n1.  **Install Dependencies:** Install `fuse3` and `rclone` (version 1.64.0 or newer is required, a precompiled binary is recommended).\n2.  **Configure Proton Drive Remote:** Run `rclone config` to set up a new remote named \"proton,\" authenticating with your Proton Drive account via a browser.\n3.  **Run Setup Script:** Execute the provided `setup-proton-mount.sh` script. This script creates the `~/ProtonDrive` mount point, generates the `rclone-proton.mount.service` systemd user unit, ensures `user_allow_other` is enabled in `/etc/fuse.conf`, and adds the user to the `fuse` group if necessary.\n4.  **Reboot or Log Out/In:** Essential if the `fuse` group was modified, for changes to take effect.\n5.  **Verify Mount:** Check `ls ~/ProtonDrive` and `systemctl --user status rclone-proton.mount.service` to confirm the mount is active.\n\nTroubleshooting uses `journalctl --user -u rclone-proton.mount.service` for logs. Uninstallation involves disabling and removing the systemd service, with an option to delete the mount point.",
    "chinese_title": "使用 rclone 和 systemd 在 Linux 上挂载 Proton Drive",
    "chinese_summary": "This guide outlines how to automate mounting Proton Drive on Linux using `rclone` and `systemd`. The setup enables Proton Drive to be mounted automatically at user login via a systemd user service, employing `rclone` with `--vfs-cache-mode writes` for compatibility, `FUSE` for `--allow-other` mounts, and background logging.\n\nThe process involves five main steps:\n1.  **Install Dependencies:** Install `fuse3` and `rclone` (version 1.64.0 or newer is required, a precompiled binary is recommended).\n2.  **Configure Proton Drive Remote:** Run `rclone config` to set up a new remote named \"proton,\" authenticating with your Proton Drive account via a browser.\n3.  **Run Setup Script:** Execute the provided `setup-proton-mount.sh` script. This script creates the `~/ProtonDrive` mount point, generates the `rclone-proton.mount.service` systemd user unit, ensures `user_allow_other` is enabled in `/etc/fuse.conf`, and adds the user to the `fuse` group if necessary.\n4.  **Reboot or Log Out/In:** Essential if the `fuse` group was modified, for changes to take effect.\n5.  **Verify Mount:** Check `ls ~/ProtonDrive` and `systemctl --user status rclone-proton.mount.service` to confirm the mount is active.\n\nTroubleshooting uses `journalctl --user -u rclone-proton.mount.service` for logs. Uninstallation involves disabling and removing the systemd service, with an option to delete the mount point."
  },
  {
    "id": "46012119",
    "title": "Microsoft's head of AI doesn't understand why people don't like AI",
    "url": "https://www.pcgamer.com/software/ai/microsofts-head-of-ai-doesnt-understand-why-people-dont-like-ai-and-i-dont-understand-why-he-doesnt-understand-because-its-pretty-obvious/",
    "summary": "生成摘要时出错",
    "chinese_title": "Microsoft's head of AI doesn't understand why people don't like AI",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46024983",
    "title": "'Suddenly exposed' DOGE employees fear prosecution after Musk abandoned them",
    "url": "https://www.rawstory.com/doge-employees/",
    "summary": "生成摘要时出错",
    "chinese_title": "'Suddenly exposed' DOGE employees fear prosecution after Musk abandoned them",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46024754",
    "title": "Raycast for Windows Is Here",
    "url": "https://www.raycast.com/blog/raycast-for-windows",
    "summary": "生成摘要时出错",
    "chinese_title": "Raycast for Windows Is Here",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46023531",
    "title": "Tosijs-schema is a super lightweight schema-first LLM-native JSON schema library",
    "url": "https://www.npmjs.com/package/tosijs-schema",
    "summary": "生成摘要时出错",
    "chinese_title": "Tosijs-schema is a super lightweight schema-first LLM-native JSON schema library",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46011158",
    "title": "Lawmakers Are Rolling Back Food Safety Rules",
    "url": "https://jacobin.com/2025/11/listeria-food-labeling-shutdown-deal",
    "summary": "生成摘要时出错",
    "chinese_title": "Lawmakers Are Rolling Back Food Safety Rules",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46010021",
    "title": "The Algorithm That Detected a $610B Fraud",
    "url": "https://substack.com/inbox/post/179453867",
    "summary": "生成摘要时出错",
    "chinese_title": "The Algorithm That Detected a $610B Fraud",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46009504",
    "title": "Trump's Devastating Plan for Ukraine",
    "url": "https://www.theatlantic.com/ideas/2025/11/trump-sell-out-ukraine/684996/",
    "summary": "生成摘要时出错",
    "chinese_title": "Trump's Devastating Plan for Ukraine",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46025477",
    "title": "SVG.js v3.2",
    "url": "https://svgjs.dev/docs/3.2/",
    "summary": "生成摘要时出错",
    "chinese_title": "SVG.js v3.2",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46025942",
    "title": "Fran Sans – font inspired by San Francisco light rail displays",
    "url": "https://emilysneddon.com/fran-sans-essay",
    "summary": "生成摘要时出错",
    "chinese_title": "Fran Sans – font inspired by San Francisco light rail displays",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46009162",
    "title": "Gitlogue – A cinematic Git commit replay tool for the terminal",
    "url": "https://github.com/unhappychoice/gitlogue",
    "summary": "生成摘要时出错",
    "chinese_title": "Gitlogue – A cinematic Git commit replay tool for the terminal",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46015860",
    "title": "The Uncertain Origins of Aspirin",
    "url": "https://press.asimov.com/articles/aspirin",
    "summary": "生成摘要时出错",
    "chinese_title": "The Uncertain Origins of Aspirin",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46015417",
    "title": "The Pentagon Can't Trust GPS Anymore",
    "url": "https://www.wsj.com/tech/the-pentagon-cant-trust-gps-anymore-is-quantum-physics-the-answer-d7b2d4e6",
    "summary": "生成摘要时出错",
    "chinese_title": "The Pentagon Can't Trust GPS Anymore",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46021577",
    "title": "Surprisingly, Emacs on Android is pretty good",
    "url": "https://kristofferbalintona.me/posts/202505291438/",
    "summary": "生成摘要时出错",
    "chinese_title": "Surprisingly, Emacs on Android is pretty good",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46011962",
    "title": "mRNA flu vaccine is up to 34.5% more effective than current flu vaccines",
    "url": "https://www.scimex.org/newsfeed/expert-reaction-mrna-flu-vaccine-is-up-to-34-5-percent-more-effective-than-current-flu-vaccines",
    "summary": "生成摘要时出错",
    "chinese_title": "mRNA flu vaccine is up to 34.5% more effective than current flu vaccines",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46017833",
    "title": "The Censorship Network: Regulation and Repression in Germany Today",
    "url": "https://liber-net.org/germany/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Censorship Network: Regulation and Repression in Germany Today",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "46014535",
    "title": "Brazil's ex-president Bolsonaro arrested to prevent 'escape' court says",
    "url": "https://www.cnn.com/2025/11/22/americas/brazil-jair-bolsonaro-arrested-intl",
    "summary": "生成摘要时出错",
    "chinese_title": "Brazil's ex-president Bolsonaro arrested to prevent 'escape' court says",
    "chinese_summary": "生成摘要时出错"
  }
]