[
  {
    "id": "45816853",
    "title": "Mr TIFF",
    "url": "https://inventingthefuture.ghost.io/mr-tiff/",
    "summary": "John Buck, author of \"Inventing the Future,\" details his painstaking quest to identify and credit the individual behind the Tag Image File Format (TIFF). He emphasizes his commitment to uncovering the true inventors of hardware and software, often spending thousands of hours researching and interviewing individuals involved.\n\nHis search for the \"Mr. TIFF\" initially stalled. While he easily traced the creator of the Interchange File Format (IFF), Jerry Morrison, the common attribution of TIFF solely to Aldus, the company, proved a dead end. Misspellings of names, and the eventual fading of Aldus and its products, further complicated the search.\n\nAfter a long effort, he found Steve Carlson's name, but it was initially fruitless. However, uncovering a misspelling (\"Carlsen\") in the Aldus TIFF specifications document finally led him to Stephen E. Carlsen, a patent holder formerly with Aldus and Adobe. After contacting him, Carlsen confirmed his role in developing the initial TIFF standard. He highlighted the importance of promoting TIFF to scanner manufacturers and developers.\n\nTragically, Buck learned later that Stephen Carlsen had passed away, but had been known to his ex-wife as \"Mr TIFF\" until his last moments. Driven by this discovery, Buck updated the Wikipedia page for TIFF, ensuring Stephen Carlsen's individual contribution was properly recognized.\n",
    "chinese_title": "蒂夫先生",
    "chinese_summary": "约翰·巴克，《发明未来》的作者，详细描述了他为找出并表彰标签图像文件格式（TIFF）背后个人所作的艰苦努力。他强调自己致力于挖掘硬件和软件的真正发明者，为此经常花费数千小时进行研究和采访相关人士。\n\n他对“蒂夫先生”的寻找起初受阻。虽然他很容易地追溯到了可交换文件格式（IFF）的创建者，杰瑞·莫里森，但将TIFF完全归功于奥多比公司（Aldus）的做法，却是一条死胡同。名字拼写错误，以及奥多比及其产品的最终衰落，进一步使搜索复杂化。\n\n经过长期努力，他找到了史蒂夫·卡尔森的名字，但起初毫无进展。然而，在奥多比 TIFF 规范文件中发现的一个拼写错误（“Carlsen”）最终将他引向了斯蒂芬·E·卡尔森，一位曾任职于奥多比和Adobe的专利持有人。联系到卡尔森后，他确认了自己在开发最初TIFF标准中的作用。他强调了向扫描仪制造商和开发人员推广TIFF的重要性。\n\n不幸的是，巴克后来得知斯蒂芬·卡尔森已经去世，但他的前妻一直称他为“蒂夫先生”，直到他生命的最后一刻。在这一发现的推动下，巴克更新了维基百科上TIFF的页面，确保斯蒂芬·卡尔森的个人贡献得到适当的认可。"
  },
  {
    "id": "45827190",
    "title": "Solarpunk is happening in Africa",
    "url": "https://climatedrift.substack.com/p/why-solarpunk-is-already-happening",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "太阳朋克正在非洲发生。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45818421",
    "title": "Zohran Mamdani wins the New York mayoral race",
    "url": "https://www.nbcnews.com/politics/elections/new-york-city-mayor-election-winner-2025-race-rcna238909",
    "summary": "Democrat Zohran Mamdani, a 34-year-old democratic socialist, won the 2025 New York mayoral race, defeating former Governor Andrew Cuomo and Republican nominee Curtis Sliwa. His victory represents a meteoric rise from relative obscurity to leading America's largest city. Mamdani energized progressives with promises of ambitious policies like rent freezes, universal childcare, a free bus program, and city-run grocery stores.\n\nHis victory speech directly challenged Donald Trump, who endorsed Cuomo, framing New York as a \"light\" against political darkness and promising to counter oligarchy and authoritarianism. He quoted socialist Eugene Debs and pledged the most ambitious agenda for addressing costs in New York City since Mayor LaGuardia.\n\nMamdani's win is expected to have national implications. Democrats will analyze his campaign for successful messaging on affordability and social media, while Republicans aim to use his left-wing platform as a wedge issue. Exit polling showed Mamdani won across racial demographics and overwhelmingly among younger voters. However, he faced opposition from Jewish voters due to his pro-Palestinian activism.\n\nCuomo conceded, thanking his supporters and claiming his campaign was a necessary fight to contest the philosophies shaping the Democratic Party. Mamdani's victory marks a historic moment, making him the first Muslim mayor of New York City. He now faces the challenges of uniting leaders to enact his agenda and navigating the complexities of running a large municipal bureaucracy, while also influencing national politics.\n",
    "chinese_title": "佐赫兰·马姆达尼赢得纽约市长选举",
    "chinese_summary": "民主党人佐赫兰·马姆达尼，一位34岁的民主社会主义者，赢得了2025年纽约市长选举，击败了前州长安德鲁·科莫和共和党候选人柯蒂斯·斯利瓦。他的胜利代表着他从相对默默无闻到领导美国最大城市的迅速崛起。马姆达尼以雄心勃勃的政策承诺，如租金冻结、普及托儿服务、免费公交项目和市营杂货店，激励了进步人士。\n\n他的胜选演说直接挑战了支持科莫的唐纳德·特朗普，将纽约定位为对抗政治黑暗的“光芒”，并承诺对抗寡头统治和威权主义。他引用了社会主义者尤金·德布斯的话，并承诺制定自拉瓜迪亚市长以来最雄心勃勃的解决纽约市各项成本的议程。\n\n马姆达尼的获胜预计将产生全国性影响。民主党人将分析他的竞选活动，从中学习在可负担性和社交媒体方面成功的宣传策略，而共和党人则计划利用他的左翼纲领作为分化议题。出口民调显示，马姆达尼赢得了所有种族人口的支持，并在年轻选民中获得了压倒性的支持。然而，由于他亲巴勒斯坦的行动主义，他面临着犹太选民的反对。\n\n科莫承认败选，感谢他的支持者，并声称他的竞选是争夺塑造民主党理念的必要斗争。马姆达尼的胜利标志着一个历史性时刻，使他成为纽约市第一位穆斯林市长。他现在面临着团结领导人以实施其议程，驾驭大型市政官僚机构的复杂性，同时影响国家政治的挑战。"
  },
  {
    "id": "45830770",
    "title": "End of Japanese community",
    "url": "https://support.mozilla.org/en-US/forums/contributors/717446",
    "summary": "This \"article\" is actually a screenshot of an error message encountered on a website. It's not an article about the end of a Japanese community. The user is facing a technical issue that prevents them from accessing the site's content.\n\nThe error message indicates that:\n\n*   **JavaScript is disabled in the user's browser:** The website requires JavaScript to function correctly, and the user's browser has it turned off.\n*   **A required part of the site couldn't load:** This could be due to several reasons.\n*   **Possible causes are suggested:** The message points to possible problems, including browser extensions (like ad blockers), network issues, or specific browser settings.\n\nThe troubleshooting steps recommended by the error message are:\n\n*   **Check the network connection:** Ensuring a stable internet connection.\n*   **Disable ad blockers:** Ad blockers can sometimes interfere with website functionality.\n*   **Try a different browser:** Using a different browser can help determine if the issue is specific to the current browser.\n\nIn summary, the \"article\" isn't an article at all; it's an error message related to JavaScript and potentially network or browser configuration issues hindering access to a website.\n",
    "chinese_title": "日本社区的终结",
    "chinese_summary": "这篇所谓的“文章”实际上是一个网站上遇到的错误信息的截图。它不是一篇关于日本社区终结的文章。用户正面临一个阻止他们访问网站内容的技术问题。\n\n错误信息表明：\n\n*   **用户的浏览器中禁用了JavaScript：** 网站需要JavaScript才能正常运行，而用户的浏览器已将其关闭。\n*   **网站的必要部分无法加载：** 这可能是由多种原因造成的。\n*   **建议可能的起因：** 该信息指向可能的问题，包括浏览器扩展程序（如广告拦截器）、网络问题或特定的浏览器设置。\n\n错误信息推荐的故障排除步骤是：\n\n*   **检查网络连接：** 确保稳定的互联网连接。\n*   **禁用广告拦截器：** 广告拦截器有时会干扰网站功能。\n*   **尝试使用不同的浏览器：** 使用不同的浏览器可以帮助确定问题是否特定于当前浏览器。\n\n总而言之，这篇所谓的“文章”根本不是文章；它是一个与JavaScript相关，并可能与网络或浏览器配置问题相关的错误信息，这些问题阻碍了对网站的访问。"
  },
  {
    "id": "45826995",
    "title": "New gel restores dental enamel and could revolutionise tooth repair",
    "url": "https://www.nottingham.ac.uk/news/new-gel-restores-dental-enamel-and-could-revolutionise-tooth-repair",
    "summary": "A new gel developed by the University of Nottingham promises to revolutionise tooth repair by restoring dental enamel. This innovative gel works by promoting the regeneration of enamel, the protective outer layer of teeth that is often damaged by acids and decay.\n\nThe gel utilizes a novel peptide-based technology that guides the deposition of minerals onto the tooth surface. This process effectively rebuilds the enamel structure, repairing microscopic defects and strengthening the overall tooth. Unlike existing treatments that simply fill cavities or cover damage, this gel actively regenerates the natural tooth material.\n\nResearchers believe this breakthrough could lead to a significant reduction in the need for traditional fillings, crowns, and other invasive dental procedures. By stimulating the natural regeneration of enamel, the gel offers a less invasive and potentially more durable solution for treating tooth decay and damage.\n\nThe gel is easy to apply and can be administered in a dentist's office. Clinical trials are underway to further assess the effectiveness and long-term benefits of the gel, with the potential for it to become a widely available treatment option in the future. The implications of this technology are far-reaching, offering a potential paradigm shift in how dental professionals approach tooth repair and preservation.\n",
    "chinese_title": "新型凝胶修复牙釉质，或将彻底改变牙齿修复方式",
    "chinese_summary": "诺丁汉大学开发的新型凝胶有望通过修复牙釉质来彻底改变牙齿修复技术。这种创新凝胶通过促进牙釉质的再生来发挥作用，牙釉质是牙齿的保护性外层，经常受到酸和腐蚀的损害。\n\n该凝胶利用一种新型的基于肽的技术，引导矿物质沉积到牙齿表面。这个过程有效地重建了牙釉质结构，修复了微观缺陷，并增强了牙齿的整体强度。与简单地填充蛀牙或覆盖损伤的现有治疗方法不同，这种凝胶可以主动再生天然牙齿材料。\n\n研究人员认为，这一突破可能会大大减少对传统填充物、牙冠和其他侵入性牙科手术的需求。通过刺激牙釉质的自然再生，该凝胶为治疗蛀牙和牙齿损伤提供了一种侵入性更小且可能更耐用的解决方案。\n\n该凝胶易于使用，可在牙科诊所进行管理。目前正在进行临床试验，以进一步评估该凝胶的有效性和长期益处，并有可能在未来成为一种广泛使用的治疗选择。这项技术的意义深远，为牙科专业人员修复和保护牙齿的方式提供了一种潜在的范式转变。"
  },
  {
    "id": "45816041",
    "title": "I took all my projects off the cloud, saving thousands of dollars",
    "url": "https://rameerez.com/send-this-article-to-your-friend-who-still-thinks-the-cloud-is-a-good-idea/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "我把所有项目都从云端撤了下来，省下了数千美元。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45815419",
    "title": "I was right about dishwasher pods and now I can prove it [video]",
    "url": "https://www.youtube.com/watch?v=DAX2_mPr9W8",
    "summary": "The article described is simply a YouTube title: \"I was right about dishwasher pods and now I can prove it [video]\". The content provided is the standard footer information found at the bottom of a YouTube page.\n\nTherefore, the main points are:\n\n* **The existence of a YouTube video:** The title strongly suggests a video exists.\n* **The topic:** The video is about the creator's stance on dishwasher pods, specifically that they were \"right\" about something related to them.\n* **Intention to Prove:** The creator intends to demonstrate the validity of their opinion about dishwasher pods in the video.\n* **Standard YouTube Information:** The rest of the provided content is just boilerplate legal and policy information common to YouTube pages. It provides no additional content about the video itself.\n\nIn short, the article is an advertisement for a video where someone claims they were correct about something related to dishwasher pods and intend to prove it.\n",
    "chinese_title": "我早就说洗碗机清洁球有问题，现在我能证明了[视频]",
    "chinese_summary": "文章描述的仅仅是一个YouTube标题：“洗碗机凝珠我早就说过了，现在我可以证明[视频]”。提供的内容是YouTube页面底部的标准页脚信息。\n\n因此，要点如下：\n\n* **YouTube视频的存在：** 标题强烈暗示存在一个视频。\n* **主题：** 该视频是关于创作者对洗碗机凝珠的立场，特别是他们对与凝珠相关的某件事是“正确”的。\n* **证明意图：** 创作者打算在视频中证明他们关于洗碗机凝珠的观点的有效性。\n* **标准的YouTube信息：** 其余提供的内容只是YouTube页面常见的样板法律和政策信息。它没有提供关于视频本身的额外内容。\n\n简而言之，这篇文章是关于一个视频的广告，视频中有人声称他们对与洗碗机凝珠相关的事情是正确的，并打算证明这一点。"
  },
  {
    "id": "45820872",
    "title": "I’m worried that they put co-pilot in Excel",
    "url": "https://simonwillison.net/2025/Nov/5/brenda/",
    "summary": "This humorous TikTok post by Ada James (@belligerentbarbies) expresses concerns about the integration of Microsoft's Copilot AI into Excel. The central argument is that Excel is a critical tool driving the economy, mastered by skilled mid-level employees, personified as \"Brenda,\" in finance departments nationwide. Brenda is seen as the vital, human link in understanding and accurately manipulating Excel.\n\nJames fears that Copilot will disrupt this workflow. Instead of seeking Brenda's expertise to modify financial reports, higher-ups might rely on AI, which James believes is prone to errors (hallucinations) that they won't be able to detect due to their own lack of Excel proficiency. The underlying fear is that replacing Brenda's human understanding with potentially flawed AI could negatively impact the accuracy and reliability of financial reporting, and ultimately, the economy. The post emphasizes the irreplaceable value of human expertise, particularly Brenda's deep understanding of Excel, over the perceived capabilities of AI. It satirizes the over-reliance on AI and highlights the potential pitfalls of assuming its superiority over human skill and experience.\n",
    "chinese_title": "我担心他们在Excel中加入Copilot。",
    "chinese_summary": "Ada James (@belligerentbarbies) 在 TikTok 上发布了一则幽默帖子，表达了对微软 Copilot AI 集成到 Excel 中的担忧。核心论点是 Excel 作为驱动经济的关键工具，被全国各地财务部门中掌握熟练技能的中层员工（化身为“Brenda”）所精通。Brenda 被视为理解和准确操作 Excel 的重要的人工环节。\n\nJames 担心 Copilot 会扰乱这种工作流程。高层可能会依赖 AI 而不是寻求 Brenda 的专业知识来修改财务报告，James 认为 AI 容易出错（产生幻觉），而他们由于自身缺乏 Excel 技能而无法发现这些错误。潜在的担忧是，用可能存在缺陷的 AI 取代 Brenda 的人类理解，可能会对财务报告的准确性和可靠性产生负面影响，并最终影响经济。该帖子强调了人类专业知识（特别是 Brenda 对 Excel 的深刻理解）相对于 AI 的感知能力而言，具有不可替代的价值。它讽刺了对 AI 的过度依赖，并突出了假设 AI 优于人类技能和经验的潜在陷阱。"
  },
  {
    "id": "45812024",
    "title": "This week in 1988, Robert Morris unleashed his eponymous worm",
    "url": "https://www.tomshardware.com/tech-industry/cyber-security/on-this-day-in-1988-the-morris-worm-slithered-out-and-sparked-a-new-era-in-cybersecurity-10-percent-of-the-internet-was-infected-within-24-hours",
    "summary": "In November 1988, Cornell graduate student Robert Tappan Morris unintentionally released a worm onto the internet, impacting roughly 10% of systems within 24 hours. This event, a landmark in cybersecurity history, occurred when the internet was still in its early stages, primarily used by academic and research institutions via the NSFNET.\n\nThe Morris worm, written in C, targeted BSD UNIX systems and exploited vulnerabilities in email systems and the 'finger' program. Unlike viruses, it was self-replicating and autonomous, causing widespread slowdowns, messaging delays, and system crashes. Though not designed to damage files, its impact was significant, leading institutions to wipe systems and unplug networks to eradicate the worm.\n\nInstitutions like Berkeley, Harvard, Princeton, and NASA were among the casualties. The FBI investigated, eventually identifying Morris, who was indicted under the Computer Fraud and Abuse Act of 1986. He received a fine, probation, and community service.\n\nWhile the incident caused considerable disruption, it also served as a wake-up call, highlighting the internet's vulnerabilities and prompting security improvements. It also demonstrated a shift away from the naive sense of trust pervading the early internet community. Contemporary estimates put the cost of the worm between $100,000 to millions of dollars. The article concludes by mentioning the recent emergence of AI worms.\n",
    "chinese_title": "1988年的本周，罗伯特·莫里斯发布了他的同名蠕虫病毒。",
    "chinese_summary": "1988年11月，康奈尔大学研究生罗伯特·塔潘·莫里斯意外地将蠕虫病毒释放到互联网上，在24小时内影响了大约10%的系统。这一事件是网络安全历史上的一个里程碑，发生在互联网的早期阶段，当时互联网主要通过NSFNET供学术和研究机构使用。\n\n莫里斯蠕虫病毒用C语言编写，针对BSD UNIX系统，并利用电子邮件系统和“finger”程序的漏洞。与病毒不同，它是自我复制和自主运行的，导致广泛的系统减速、消息传递延迟和系统崩溃。虽然并非旨在破坏文件，但其影响是巨大的，导致各机构擦除系统并拔掉网络插头以清除蠕虫病毒。\n\n伯克利、哈佛、普林斯顿和NASA等机构都是受害者。联邦调查局介入调查，最终确认了莫里斯，他因违反1986年的《计算机欺诈和滥用法案》而被起诉。他被处以罚款、缓刑和社区服务。\n\n虽然该事件造成了相当大的混乱，但也敲响了警钟，凸显了互联网的脆弱性，并促使人们改进安全措施。它也表明早期互联网社区普遍存在的幼稚信任感正在逐渐消失。目前的估计显示，该蠕虫造成的损失在10万美元到数百万美元之间。文章最后提到了人工智能蠕虫的最新出现。"
  },
  {
    "id": "45822018",
    "title": "YouTube erased more than 700 videos documenting Israeli human rights violations",
    "url": "https://theintercept.com/2025/11/04/youtube-google-israel-palestine-human-rights-censorship/",
    "summary": "The Intercept reports that YouTube deleted over 700 videos documenting alleged Israeli human rights violations against Palestinians. The videos, posted by three prominent Palestinian human rights groups (Al-Haq, Al Mezan Center for Human Rights, and the Palestinian Centre for Human Rights), were removed in early October when YouTube terminated their accounts. The move is attributed to U.S. government sanctions levied during the Trump administration against these organizations for their work with the International Criminal Court (ICC), which is investigating alleged Israeli war crimes.\n\nCritics argue that YouTube is censoring crucial information and furthering an agenda to shield Israel from accountability. They highlight that the deleted videos contained evidence of alleged violations of international law, including the killing of Palestinian civilians and destruction of homes. Concerns are raised about the precedent this sets for other tech companies and the potential for further suppression of Palestinian voices.\n\nYouTube cited its compliance with U.S. sanctions laws as the reason for the account terminations. While some videos are archived or available on other platforms, many are lost. The groups are now exploring alternatives to U.S.-based services to host their content. The article also mentions past instances of YouTube allegedly censoring Palestinian voices and coordinating with campaigns to remove content critical of Israel.\n",
    "chinese_title": "YouTube删除了700多条记录以色列侵犯人权行为的视频。",
    "chinese_summary": "The Intercept 报道称，YouTube 删除了 700 多个记录据称以色列侵犯巴勒斯坦人人权的视频。这些视频由三个著名的巴勒斯坦人权组织（Al-Haq、Al Mezan 人权中心和巴勒斯坦人权中心）发布，在 10 月初 YouTube 终止了他们的账户时被删除。此举归因于特朗普政府时期美国政府对这些组织实施的制裁，原因是他们与国际刑事法院（ICC）合作，该法院正在调查据称以色列的战争罪行。\n\n批评人士认为，YouTube 正在审查关键信息，并进一步推进一项旨在保护以色列免受问责的议程。他们强调，被删除的视频包含据称违反国际法的证据，包括杀害巴勒斯坦平民和摧毁房屋。人们对这为其他科技公司树立的先例以及进一步压制巴勒斯坦声音的可能性表示担忧。\n\nYouTube 将遵守美国制裁法作为终止账户的原因。虽然一些视频已被存档或可在其他平台上找到，但许多视频已丢失。这些组织目前正在探索替代美国的服务来托管他们的内容。该文章还提到 YouTube 过去据称审查巴勒斯坦声音并与旨在删除批评以色列内容的活动协调的事件。"
  },
  {
    "id": "45830829",
    "title": "Ratatui – App Showcase",
    "url": "https://ratatui.rs/showcase/apps/",
    "summary": "This article showcases a collection of terminal-based applications, highlighting the power and versatility of TUI (Terminal User Interface) tools. It presents a diverse range of utilities, from system monitors like `bottom` to file explorers like `joshuto`, `xplr`, and `yazi`. The collection also includes network tools such as `bandwhich` and `trippy`, and command-line enhancements like `atuin`.\n\nSeveral tools offer unique functionalities: `openapi-tui` for viewing OpenAPI documentation, `steer` as an AI coding agent, `oatmeal` as an LLM chat application, `binsider` for binary analysis, `dua` for disk space analysis, and `television` as a fuzzy finder TUI. Data processing and management are addressed by tools like `csvlens` and `yozefu` for Kafka cluster data exploration.\n\nThe article emphasizes the practicality of TUIs for various tasks, presenting alternatives to traditional GUI applications and demonstrating their efficiency and suitability for command-line workflows. The showcase covers a broad spectrum of use cases, proving the continued relevance and innovation within the TUI space, particularly those written in Rust, which is mentioned frequently among the applications.\n",
    "chinese_title": "Ratatui – 应用展示",
    "chinese_summary": "本文展示了一系列基于终端的应用程序，突显了 TUI（终端用户界面）工具的强大功能和多功能性。它介绍了各种各样的实用程序，从诸如`bottom`的系统监视器到诸如`joshuto`、`xplr`和`yazi`的文件管理器。该系列还包括诸如`bandwhich`和`trippy`的网络工具，以及诸如`atuin`的命令行增强工具。\n\n一些工具提供独特的功能：`openapi-tui`用于查看 OpenAPI 文档，`steer`作为 AI 编码代理，`oatmeal`作为 LLM 聊天应用程序，`binsider`用于二进制分析，`dua`用于磁盘空间分析，`television`作为模糊查找 TUI。数据处理和管理由诸如`csvlens`和`yozefu`的工具处理，用于 Kafka 集群数据探索。\n\n本文强调了 TUI 在各种任务中的实用性，提出了传统 GUI 应用程序的替代方案，并展示了它们在命令行工作流程中的效率和适用性。该展示涵盖了广泛的用例，证明了 TUI 领域的持续相关性和创新，特别是那些用 Rust 编写的应用程序，Rust 在这些应用程序中经常被提及。"
  },
  {
    "id": "45816963",
    "title": "UPS plane crashes near Louisville airport",
    "url": "https://avherald.com/h?article=52f5748f&opt=0",
    "summary": "On November 4th, 2025, a UPS MD-11 (flight 5X-2976, registration N259UP) crashed during takeoff from Louisville International Airport en route to Honolulu. The aircraft impacted the ground just past the runway, bursting into flames. All three crew members perished, along with four fatalities on the ground, and eleven others were injured.\n\nPreliminary information suggests engine #1 (left engine) separated from the aircraft during the takeoff run, potentially causing the failure of the center engine #2. The plane never became airborne according to ADS-B data. Ground observers reported that engine #1 separated during takeoff, the center engine emitted flames, and the aircraft hit a warehouse and other facilities.\n\nThe FAA and NTSB are investigating. The NTSB has recovered the cockpit voice recorder and flight data recorder, though they sustained some fire damage. CCTV footage shows the left engine separating during takeoff and the aircraft clearing the perimeter fence before impacting a building. The debris field stretches for about half a mile. The NTSB is also examining the aircraft's maintenance history.\n\nThe article includes links to CCTV footage of the crash and the NTSB's initial media briefing. Reader comments speculate on potential causes, including maintenance issues and similarities to the AA191 crash. There were reports the plane was delayed before takeoff due to work on the left engine.\n",
    "chinese_title": "联合包裹货机在路易斯维尔机场附近坠毁",
    "chinese_summary": "2025年11月4日，一架UPS MD-11型货机（航班号5X-2976，注册号N259UP）在路易斯维尔国际机场起飞前往檀香山时坠毁。飞机在跑道尽头不远处坠地，随即起火。机上三名机组人员全部遇难，地面另有四人死亡，十一人受伤。\n\n初步信息显示，起飞过程中1号引擎（左侧引擎）从飞机上脱落，可能导致2号中央引擎故障。根据ADS-B数据，飞机从未起飞。地面观察员报告称，1号引擎在起飞时脱落，中央引擎冒出火焰，飞机撞上了一座仓库和其他设施。\n\n美国联邦航空管理局（FAA）和国家运输安全委员会（NTSB）正在调查。NTSB已寻回驾驶舱语音记录器和飞行数据记录器，但都遭受了一些火灾损坏。闭路电视录像显示，左侧引擎在起飞时脱落，飞机在撞击建筑物之前穿过了围栏。残骸散布约半英里。NTSB还在检查飞机的维护记录。\n\n文章包含坠机闭路电视录像和NTSB初步媒体简报的链接。读者评论推测了潜在原因，包括维护问题以及与AA191空难的相似之处。有报道称，由于对左侧引擎进行检修，该飞机在起飞前曾延误。"
  },
  {
    "id": "45813343",
    "title": "NoLongerEvil-Thermostat – Nest Generation 1 and 2 Firmware",
    "url": "https://github.com/codykociemba/NoLongerEvil-Thermostat",
    "summary": "This document outlines the process of flashing custom firmware onto first and second-generation Nest Thermostats, allowing them to operate independently from Google/Nest servers and connect to the \"NoLongerEvil\" platform. This project is experimental and carries the risk of bricking the device.\n\nThe custom firmware intercepts network traffic, redirecting it from Nest's servers to a NoLongerEvil server that replicates Nest's API, giving users control over their thermostat data and settings. The process involves putting the Nest into DFU mode via USB connection and a reboot sequence, then using the provided `omap_loader` tool (built from source) to flash modified bootloader (`x-load.bin`, `u-boot.bin`) and kernel (`uImage`) images.\n\nThe instructions include prerequisites for Linux and macOS, a build script, and an installer script. Once flashed, the device needs to be registered on the NoLongerEvil website using an entry code generated by the thermostat.\n\nThe document emphasizes security considerations, cautioning users about the risks involved and stressing the importance of responsible use. It also acknowledges the contributions of researchers who discovered the Nest DFU attack, paving the way for custom firmware development. The project is committed to open-sourcing the firmware images and backend API server code in the future.\n",
    "chinese_title": "NoLongerEvil-Thermostat – Nest 第 1 代和第 2 代固件",
    "chinese_summary": "将自定义固件刷入第一代和第二代 Nest 恒温器，使其能够独立于 Google/Nest 服务器运行并连接到“NoLongerEvil”平台的流程。该项目是实验性的，存在设备变砖的风险。\n\n该自定义固件拦截网络流量，将其从 Nest 服务器重定向到复制 Nest API 的 NoLongerEvil 服务器，从而使用户能够控制其恒温器数据和设置。该过程包括通过 USB 连接和重启序列将 Nest 置于 DFU 模式，然后使用提供的 `omap_loader` 工具（从源代码构建）来刷入修改后的引导加载程序（`x-load.bin`，`u-boot.bin`）和内核（`uImage`）镜像。\n\n这些说明包括 Linux 和 macOS 的先决条件、构建脚本和安装程序脚本。刷入后，设备需要使用恒温器生成的条目代码在 NoLongerEvil 网站上注册。\n\n本文档强调了安全注意事项，告诫用户所涉及的风险，并强调负责任的使用的重要性。它还承认了发现 Nest DFU 攻击的研究人员的贡献，为自定义固件的开发铺平了道路。该项目致力于在未来开源固件镜像和后端 API 服务器代码。"
  },
  {
    "id": "45816968",
    "title": "Google Removed 749M Anna's Archive URLs from Its Search Results",
    "url": "https://torrentfreak.com/google-removed-749-million-annas-archive-urls-from-its-search-results/",
    "summary": "Anna's Archive, a meta-search engine for pirated books and articles launched after the Z-Library crackdown, has become a major target for copyright holders. Google has removed a staggering 749 million URLs associated with Anna's Archive from its search results following DMCA takedown requests, representing 5% of all takedowns Google has ever processed.\n\nPublishers like Penguin Random House and John Wiley & Sons, along with over 1,000 other authors and publishers, are actively reporting URLs at a rate of roughly 10 million per week. These efforts aim to make it harder for users to find books on the site through Google by delisting or demoting infringing links.\n\nWhile Anna's Archive domains (.org, .li, and .se) remain operational, the substantial volume of takedowns demonstrates the copyright holders' attempts to limit the site's discoverability through Google's search engine. Despite these efforts, searching directly for \"Anna's Archive\" still yields the main domain as the top result.\n",
    "chinese_title": "谷歌从搜索结果中删除了7.49亿个Anna's Archive的URL",
    "chinese_summary": "安娜檔案，Z-Library取締後出現的盜版書籍和文章元搜索引擎，已成為版權持有者的主要目標。在收到《數字千年版權法案》（DMCA）的刪除請求後，谷歌已從其搜索結果中移除了與安娜檔案相關的7.49億個URL，佔谷歌處理的所有刪除請求的5%。\n\n企鵝蘭登書屋和約翰威立父子出版公司等出版商，以及1000多名其他作者和出版商，正以大約每周1000萬個的速度積極舉報URL。這些努力旨在通過取消或降低侵權鏈接的排名，使用戶更難通過谷歌找到該網站上的書籍。\n\n雖然安娜檔案的域名（.org、.li 和 .se）仍然可以使用，但大量的刪除請求表明版權持有者試圖通過谷歌搜索引擎限制該網站的可發現性。儘管如此，直接搜索“安娜檔案”仍然會將其主域名列為首要結果。"
  },
  {
    "id": "45824864",
    "title": "Why aren't smart people happier?",
    "url": "https://www.theseedsofscience.pub/p/why-arent-smart-people-happier",
    "summary": "Adam Mastroianni's article explores the counterintuitive disconnect between intelligence and happiness. He argues that despite the common assumption that smarter individuals should lead happier lives due to their superior problem-solving abilities, research suggests little to no correlation between intelligence (as measured by IQ tests) and happiness.\n\nThe article attributes this paradox to Charles Spearman's theory of \"general intelligence,\" which posits a single underlying mental ability applicable to all problem-solving. Mastroianni argues that intelligence tests primarily measure the ability to solve \"well-defined\" problems – those with clear rules, boundaries, and solutions (e.g., math problems, vocabulary tests). However, life's most important problems are often \"poorly defined\" – lacking clear rules, boundaries, or solutions (e.g., finding love, choosing a career, dealing with aging parents).\n\nThe author suggests that excelling at well-defined problems doesn't necessarily translate to success in solving poorly defined problems, which are crucial for happiness. He highlights examples of highly intelligent individuals making poor life choices, further illustrating this point. Mastroianni also notes that societal progress in solving well-defined problems hasn't demonstrably increased overall happiness. He suggests focusing on the poorly defined problem of \"living a good life,\" drawing inspiration from ancient philosophers and advocating for continued exploration of what truly contributes to lasting happiness.\n",
    "chinese_title": "聪明人为什么不快乐？",
    "chinese_summary": "亚当·马斯特罗亚尼的文章探讨了智力与幸福之间违反直觉的脱节。他认为，尽管人们普遍认为，更聪明的人应该因其卓越的问题解决能力而拥有更幸福的生活，但研究表明，智力（以智商测试衡量）与幸福之间几乎没有相关性。\n\n文章将这一悖论归因于查尔斯·斯皮尔曼的“一般智力”理论，该理论认为存在一种适用于所有问题解决的单一潜在心理能力。 马斯特罗亚尼认为，智力测试主要衡量解决“定义明确”问题的能力——即那些具有明确规则、边界和解决方案的问题（例如，数学问题、词汇测试）。然而，生活中最重要的问题往往是“定义不明确”的——缺乏明确的规则、边界或解决方案（例如，寻找爱情、选择职业、照顾年迈的父母）。\n\n作者认为，擅长解决定义明确的问题并不一定转化为成功解决定义不明确的问题，而这些问题对于幸福至关重要。 他强调了高智商人士做出糟糕人生选择的例子，进一步说明了这一点。 马斯特罗亚尼还指出，社会在解决定义明确的问题方面的进步并没有明显提高整体幸福感。 他建议关注“过上美好生活”这一定义不明确的问题，从古代哲学家那里汲取灵感，并倡导继续探索什么才是真正有助于持久幸福的因素。"
  },
  {
    "id": "45812606",
    "title": "Pg_lake: Postgres with Iceberg and data lake access",
    "url": "https://github.com/Snowflake-Labs/pg_lake",
    "summary": "Pg_lake brings data lake capabilities to PostgreSQL, allowing users to seamlessly integrate Iceberg tables and other data lake files directly into their Postgres environment. This enables users to leverage Postgres as a standalone lakehouse system, supporting transactions and fast queries on Iceberg data stored in object stores like S3.\n\nKey features include creating and modifying Iceberg tables directly from PostgreSQL, querying data files in Parquet, CSV, JSON, and Iceberg formats, and exporting query results back to object storage. Pg_lake can also read geospatial formats and utilizes a built-in map type for semi-structured data. It combines different data sources (heap, Iceberg, external files) in SQL queries with full transactional guarantees. Column types are automatically inferred from data sources like Iceberg, Parquet, JSON, and CSV.\n\nThe architecture involves PostgreSQL with pg_lake extensions and pgduck_server, which uses DuckDB for query execution. Pgduck_server handles the communication with DuckDB, improving performance by delegating data scanning and computation to DuckDB's engine.\n\nPg_lake is modular, built around extensions like pg_lake_iceberg, pg_lake_table, pg_lake_copy, and pg_lake_engine. Pgduck_server and duckdb_pglake (a DuckDB extension) are also crucial components.\n\nOriginally developed at Crunchy Data as \"Crunchy Data Warehouse,\" the project was open-sourced by Snowflake as pg_lake after their acquisition of Crunchy Data. The project is released under the Apache 2.0 license.\n",
    "chinese_title": "Pg_lake：具备 Iceberg 和数据湖访问能力的 Postgres",
    "chinese_summary": "Pg_lake为PostgreSQL带来数据湖能力，使用户能够将Iceberg表和其他数据湖文件无缝集成到Postgres环境中。这使得用户能够将Postgres用作独立的湖仓一体系统，支持事务以及对存储在S3等对象存储中的Iceberg数据的快速查询。\n\n主要功能包括直接从PostgreSQL创建和修改Iceberg表，查询Parquet、CSV、JSON和Iceberg格式的数据文件，以及将查询结果导出回对象存储。Pg_lake还可以读取地理空间格式，并利用内置的地图类型处理半结构化数据。它在SQL查询中结合不同的数据源（堆、Iceberg、外部文件），并提供完整的事务保证。列类型可以自动从Iceberg、Parquet、JSON和CSV等数据源推断。\n\n该架构涉及带有pg_lake扩展和pgduck_server的PostgreSQL，其中pgduck_server使用DuckDB进行查询执行。Pgduck_server处理与DuckDB的通信，通过将数据扫描和计算委托给DuckDB的引擎来提高性能。\n\nPg_lake是模块化的，围绕pg_lake_iceberg、pg_lake_table、pg_lake_copy和pg_lake_engine等扩展构建。Pgduck_server和duckdb_pglake（一个DuckDB扩展）也是关键组件。\n\n该项目最初由Crunchy Data开发，名为“Crunchy Data Warehouse”，在Snowflake收购Crunchy Data后，被Snowflake开源为pg_lake。该项目以Apache 2.0许可证发布。"
  },
  {
    "id": "45824658",
    "title": "Norway reviews cybersecurity after remote-access feature found in Chinese buses",
    "url": "https://scandasia.com/norway-reviews-cybersecurity-after-hidden-remote-access-feature-found-in-chinese-buses/",
    "summary": "Norway has initiated a cybersecurity review after Ruter, a public transport operator, found hidden SIM cards in electric buses from Chinese manufacturer Yutong. These SIM cards, discovered during internal tests, could potentially allow Yutong to remotely control the buses, raising concerns about security and potential interference.\n\nWhile Ruter CEO Bernt Reitan Jenssen stated the likelihood of misuse is low, the discovery prompted the removal of the SIM cards and a strengthening of cybersecurity measures, including stricter procurement rules, internal firewalls, and cloud security protocols. These measures aim to ensure full local control over transport operations.\n\nNorway's Minister of Transport, Jon-Ivar Nygård, highlighted the government's assessment of supplier risks from countries outside Norway's security alliances, emphasizing the importance of protecting critical infrastructure.\n\nYutong supplies a significant portion of Norway's electric bus fleet, with around 850 of the 1,300 electric buses being Yutong models. The incident highlights the growing cybersecurity risks associated with foreign technology suppliers, particularly as Chinese electric buses become increasingly prevalent in global markets. The article also references a similar deal between Yutong and Denmark.\n",
    "chinese_title": "挪威审查网络安全，此前在中国产巴士上发现远程访问功能。",
    "chinese_summary": "挪威启动网络安全审查，此前公共交通运营商Ruter在中国宇通电动巴士上发现隐藏SIM卡。这些SIM卡在内部测试中被发现，可能允许宇通远程控制巴士，引发对安全和潜在干扰的担忧。\n\n尽管Ruter首席执行官Bernt Reitan Jenssen表示滥用的可能性很低，但这一发现促使他们移除了SIM卡，并加强了网络安全措施，包括更严格的采购规则、内部防火墙和云安全协议。这些措施旨在确保对运输运营的完全本地控制。\n\n挪威交通部长Jon-Ivar Nygård强调，政府正在评估来自挪威安全联盟以外国家的供应商风险，强调了保护关键基础设施的重要性。\n\n宇通供应了挪威电动巴士车队的大部分，在1300辆电动巴士中约有850辆是宇通车型。该事件突显了与外国技术供应商相关的日益增长的网络安全风险，尤其是在中国电动巴士在全球市场日益普及的情况下。文章还提到了宇通与丹麦的一项类似交易。"
  },
  {
    "id": "45817167",
    "title": "Uncle Sam wants to scan your iris and collect your DNA, citizen or not",
    "url": "https://www.theregister.com/2025/11/04/dhs_wants_to_collect_biometric_data/",
    "summary": "The US Department of Homeland Security (DHS) is proposing a significant expansion of biometric data collection for immigration applications. This rule change would impact not only immigrants but also US citizens connected to their cases.\n\nThe proposed rule would allow DHS to collect biometric data from a broader range of individuals, including applicants, petitioners, sponsors, derivatives, dependents, beneficiaries, and anyone associated with a benefit request. This includes US citizens, nationals, and lawful permanent residents, regardless of age. DHS also aims to collect biometric data from any alien apprehended or encountered.\n\nThe definition of \"biometrics\" would also be expanded to encompass a wider range of biological and behavioral characteristics, opening the door for the collection of ocular imagery, voice prints, and DNA. DHS wants express authority to request or accept raw DNA or DNA test results to verify biological sex or family relationships.\n\nDHS states the data will be used for identity verification, national security checks, document production, and administrative functions.\n\nConcerns have been raised about the potential for misuse and errors associated with biometric technologies like facial recognition, which has shown biases against non-white individuals. Collecting and storing DNA profiles also raises privacy concerns.\n\nDHS is accepting public comments on the proposal until January 2. Initial reactions have been largely negative, with critics citing government overreach, comparisons to authoritarian regimes, and violations of Constitutional rights against unreasonable search and seizure.\n",
    "chinese_title": "山姆大叔想扫描你的虹膜并收集你的DNA，无论你是否是公民",
    "chinese_summary": "美国国土安全部(DHS) 提议大幅扩大移民申请的生物识别数据收集范围。这项规则变更不仅会影响移民，还会影响与他们案件相关的美国公民。\n\n拟议规则将允许国土安全部从更广泛的个人群体中收集生物识别数据，包括申请人、请愿人、担保人、衍生人、受抚养人、受益人以及与福利请求相关的任何人。这包括美国公民、国民和合法永久居民，无论年龄大小。 国土安全部还计划从任何被逮捕或遇到的外国人收集生物识别数据。\n\n“生物识别”的定义也将扩大，涵盖更广泛的生物和行为特征，为收集眼部图像、语音印记和DNA打开了大门。 国土安全部希望获得明确的授权，以要求或接受原始DNA或DNA测试结果，以验证生物性别或家庭关系。\n\n国土安全部表示，这些数据将用于身份验证、国家安全检查、文件制作和行政职能。\n\n人们对生物识别技术（如面部识别）可能存在的滥用和错误表示担忧，这些技术已显示出对非白人个体的偏见。 收集和存储DNA图谱也引发了隐私问题。\n\n国土安全部正在接受公众对该提案的评论，截止日期为1月2日。 最初的反应大多是负面的，批评人士认为这是政府权力过度扩张，并将其与专制政权相提并论，并违反了宪法中关于防止不合理搜查和扣押的权利。"
  },
  {
    "id": "45811093",
    "title": "Show HN: A CSS-Only Terrain Generator",
    "url": "https://terra.layoutit.com",
    "summary": "This \"Show HN\" post introduces Layoutit Terra, a CSS-only terrain generator. The generator allows users to create customizable 3D terrain using only CSS, eliminating the need for JavaScript or other scripting languages.\n\nKey features highlighted include:\n\n*   **CSS-based generation:** All terrain rendering is achieved through CSS.\n*   **Interactive interface:** Users can regenerate the terrain, undo/redo changes, and import/export data in various formats (Heightmap, CSS, VOX, TXT, PNG).\n*   **Customization options:** Users can adjust parameters like landmass coverage (small, medium, large), terrain type (pampas, hilly, alpinist), biome (temperate, arctic, desert), and camera settings (rotate x, tilt y, zoom, pan x, lift y, animate).\n*   **Export and sharing options:** The tool provides options to copy the CSS code, embed it, open the creation in CodePen, or download the code directly. Users can also export a heightmap.\n*   **Visualizations:** The tool includes minimap, heightmap, and matrix visualizations to help users understand the terrain's characteristics.\n*   **Editing features:** Users can interactively move, raise, and lower terrain features and adjust world size.\n\nThe post's purpose is to showcase this creative use of CSS and provide a tool for designers and developers to quickly generate 3D terrains for various projects.\n",
    "chinese_title": "Show HN: 纯 CSS 地形生成器",
    "chinese_summary": "这个“Show HN”帖子介绍了Layoutit Terra，一个纯CSS地形生成器。该生成器允许用户仅使用CSS创建可定制的3D地形，无需JavaScript或其他脚本语言。\n\n主要亮点包括：\n\n*   **基于CSS的生成：** 所有地形渲染均通过CSS实现。\n*   **交互式界面：** 用户可以重新生成地形、撤销/重做更改，以及导入/导出各种格式的数据（Heightmap、CSS、VOX、TXT、PNG）。\n*   **自定义选项：** 用户可以调整诸如陆地覆盖范围（小、中、大）、地形类型（潘帕斯草原、丘陵、登山型）、生物群落（温带、北极、沙漠）和相机设置（旋转x、倾斜y、缩放、平移x、提升y、动画）等参数。\n*   **导出和分享选项：** 该工具提供复制CSS代码、嵌入代码、在CodePen中打开作品或直接下载代码的选项。 用户还可以导出高度图。\n*   **可视化：** 该工具包含小地图、高度图和矩阵可视化，以帮助用户了解地形的特征。\n*   **编辑功能：** 用户可以交互式地移动、抬升和降低地形特征，并调整世界大小。\n\n该帖子的目的是展示CSS的这种创造性应用，并为设计师和开发者提供一种工具，以便快速生成用于各种项目的3D地形。"
  },
  {
    "id": "45826266",
    "title": "Dillo, a multi-platform graphical web browser",
    "url": "https://github.com/dillo-browser/dillo",
    "summary": "Dillo is a lightweight and fast multi-platform graphical web browser designed with a focus on security and privacy. It uses the FLTK 1.3 GUI toolkit. The provided text describes a repository containing the original Dillo code with minor patches, welcoming contributions in the form of additional patches or pull requests. It also references several related forks of Dillo, including dillo-plus, dilloNG, D+ browser, and Mobilized Dillo. A key warning is issued that the official dillo.org domain is no longer controlled by the Dillo developers, with copies of the old website archived on GitHub Pages and the Wayback Machine. In essence, the document introduces Dillo as a small, fast, privacy-focused browser, invites contributions to its codebase, and warns users about the current status of its official website.\n",
    "chinese_title": "Dillo，一款多平台图形化网页浏览器",
    "chinese_summary": "Dillo：轻量快速的多平台图形化网页浏览器，注重安全与隐私。使用FLTK 1.3 GUI工具包。本仓库包含带有少量补丁的原始Dillo代码，欢迎以补丁或拉取请求的形式贡献。同时提及了几个相关的Dillo分支，包括dillo-plus、dilloNG、D+浏览器和Mobilized Dillo。重要警告：官方dillo.org域名已不再由Dillo开发者控制，旧网站副本已存档于GitHub Pages和Wayback Machine。总之，本文档介绍了Dillo这款小巧、快速、注重隐私的浏览器，邀请大家为其代码库做出贡献，并警告用户关于其官方网站的现状。"
  },
  {
    "id": "45818319",
    "title": "Direct File won't happen in 2026, IRS tells states",
    "url": "https://www.nextgov.com/digital-government/2025/11/direct-file-wont-happen-2026-irs-tells-states/409309/",
    "summary": "Here's a concise summary of the article:\n\nThe IRS has informed states that the Direct File program, a free online tax filing service launched in 2024, will not be available in the 2026 filing season. The program allowed taxpayers to file directly with the IRS and received high marks from users. However, it faced opposition from tax preparation companies and Republicans.\n\nThe decision to end Direct File follows the passage of a Trump administration tax bill that directs the IRS to explore public-private partnerships as an alternative. This has led to criticism that the program was deliberately undermined in favor of tax preparation monopolies.\n\nAdvocates for Direct File, such as Adam Ruben of the Economic Security Project and Senator Elizabeth Warren, argue that its cancellation will force Americans to spend more time and money on tax preparation. They accuse tax preparation companies of lobbying against the service to protect their profits. The IRS has not yet commented on the matter.\n",
    "chinese_title": "直接报税系统2026年不会实现，美国国税局告知各州",
    "chinese_summary": "以下是文章的简要总结：\n\n美国国税局已通知各州，2024年推出的免费在线报税服务“直接申报”（Direct File）项目，将不会在2026年的报税季提供。该项目允许纳税人直接向国税局报税，并获得用户的高度评价。然而，它遭到了税务准备公司和共和党人的反对。\n\n终止“直接申报”的决定，是在特朗普政府通过一项税收法案之后做出的，该法案指示国税局探索公私合作关系作为替代方案。这引发了批评，认为该项目是故意被削弱，以利于税务准备行业的垄断。\n\n“直接申报”的支持者，如经济安全项目的亚当·鲁本和参议员伊丽莎白·沃伦认为，取消该项目将迫使美国人在税务准备上花费更多的时间和金钱。他们指责税务准备公司游说反对该服务，以保护其利润。国税局尚未对此事发表评论。"
  },
  {
    "id": "45822539",
    "title": "NY school phone ban has made lunch loud again",
    "url": "https://gothamist.com/news/ny-smartphone-ban-has-made-lunch-loud-again",
    "summary": "In November 2025, Benjamin N. Cardozo High School in Queens, and many other schools across the nation, implemented a ban on smartphones during the school day, resulting in a significant change in student behavior. Lunchtime has become noticeably louder and more social, with students engaging in board games like Jenga, checkers, and Scrabble, provided by the faculty to ease the transition.\n\nThe ban aims to encourage student interaction and reduce reliance on phones as a way to \"hide away.\" Schools have implemented various storage solutions, such as magnetic pouches or lockers, to ensure compliance. Teachers report improved classroom environments, increased student engagement, better focus, and more in-depth research when students rely less on instant answers from the internet.\n\nWhile many students and teachers appreciate the benefits of the ban, some students object, citing a loss of independence and the feeling of distrust. Some students are finding ways around the ban by using \"burner\" phones or passing notes. Despite the drawbacks, analog activities such as card games, hangman, and using Polaroid cameras have seen a resurgence. The assistant principal also noted that students struggle with reading analog clocks, suggesting a potential need to reintroduce that skill.\n",
    "chinese_title": "纽约学校手机禁令让午餐时间再次热闹起来",
    "chinese_summary": "2025年11月，位于皇后区的本杰明·N·卡多佐高中以及全国多所学校实施了校园手机禁令，学生行为发生了显著变化。午餐时间变得明显热闹和更具社交性，学生们玩着教职工提供的层层叠、跳棋和拼字游戏等棋盘游戏，以缓解过渡。\n\n该禁令旨在鼓励学生互动，减少对手机作为“躲避”方式的依赖。学校实施了各种存储方案，例如磁性袋或储物柜，以确保合规。教师报告称，当学生减少对互联网即时答案的依赖时，课堂环境得到改善，学生参与度提高，注意力更加集中，研究也更加深入。\n\n虽然许多学生和教师赞赏该禁令的好处，但一些学生反对，理由是丧失了独立性和不信任感。一些学生正在寻找绕过禁令的方法，例如使用“备用”手机或传递纸条。尽管存在缺点，但纸牌游戏、猜词游戏和使用宝丽来相机等模拟活动已出现复苏。校长助理还指出，学生们难以辨认模拟时钟，表明可能需要重新教授这项技能。"
  },
  {
    "id": "45822302",
    "title": "iOS 26.2 to allow third-party app stores in Japan ahead of regulatory deadline",
    "url": "https://www.macrumors.com/2025/11/05/ios-26-2-third-party-app-stores-japan/",
    "summary": "Apple's iOS 26.2, currently in beta, will allow users in Japan to install third-party app stores, such as AltStore PAL and Epic Games Store, ahead of a regulatory deadline. This change follows legislation passed by the Japanese parliament in June 2024 and the establishment of the Mobile Software Competition Act Guidelines by the Japan Fair Trade Commission in August 2025. These legal actions aim to curb the dominance of major tech companies like Apple and Google in the smartphone market by preventing them from blocking alternative app stores and payment systems.\n\nThe new guidelines are scheduled to take effect by December 18, 2025. Apple is expected to release the official iOS 26.2 update sometime between December 9 and December 16, 2025, bringing the functionality to Japanese users. Epic Games has already announced plans to launch Fortnite and its game store platform on iOS in Japan by the end of 2025. Currently, this feature is only available to users in the EU to comply with the Digital Markets Act. The move in Japan signifies an expansion of Apple's third-party app store policy due to regulatory pressure.\n",
    "chinese_title": "iOS 26.2 将在日本监管截止日期前允许第三方应用商店",
    "chinese_summary": "苹果iOS 26.2（目前为测试版）将允许日本用户在监管截止日期前安装第三方应用商店，例如AltStore PAL和Epic Games Store。此项变更源于日本国会于2024年6月通过的法案以及日本公平贸易委员会于2025年8月制定的《移动软件竞争法指南》。这些法律行动旨在通过防止苹果和谷歌等主要科技公司阻止替代应用商店和支付系统，来抑制它们在智能手机市场的主导地位。\n\n新指南计划于2025年12月18日生效。预计苹果将在2025年12月9日至12月16日期间发布正式的iOS 26.2更新，为日本用户带来此功能。Epic Games已宣布计划在2025年底前在日本的iOS上推出《堡垒之夜》及其游戏商店平台。目前，此功能仅适用于欧盟用户，以符合《数字市场法》。日本的这一举措标志着由于监管压力，苹果的第三方应用商店政策正在扩张。"
  },
  {
    "id": "45825965",
    "title": "ChatGPT terms disallow its use in providing legal and medical advice to others",
    "url": "https://www.ctvnews.ca/sci-tech/article/openai-updates-policies-so-chatgpt-wont-provide-medical-or-legal-advice/",
    "summary": "OpenAI has updated its policies to explicitly prohibit the use of ChatGPT and its other AI models for providing medical or legal advice to others. This change aims to prevent users from relying on AI-generated content for critical decisions in these sensitive fields, mitigating the potential risks of inaccurate, unreliable, or harmful advice. The new terms of service clearly state that the AI should not be used to diagnose or treat medical conditions, or to provide legal counsel.\n\nWhile ChatGPT can be used for tasks like summarizing legal documents or providing general information about medical topics, it cannot be used as a substitute for the professional judgment of qualified doctors or lawyers. OpenAI's updated policy is intended to protect individuals from making decisions based on potentially flawed or biased AI-generated content that might have serious consequences for their health or legal situations.\n\nThis policy shift follows growing concerns about the potential for AI to be misused in areas where professional expertise and human oversight are crucial. OpenAI is proactively addressing these concerns by establishing clearer boundaries for the appropriate use of its AI models. The company also acknowledges that the guidelines will continue to evolve as the technology matures.\n",
    "chinese_title": "ChatGPT条款禁止将其用于向他人提供法律和医疗建议。",
    "chinese_summary": "OpenAI更新政策，明确禁止使用ChatGPT及其他人工智能模型提供医疗或法律建议。此举旨在防止用户依赖人工智能生成的内容在这些敏感领域做出关键决策，从而降低因不准确、不可靠或有害建议而产生的潜在风险。新服务条款明确规定，不得使用人工智能诊断或治疗疾病，或提供法律咨询。\n\n虽然ChatGPT可用于总结法律文件或提供有关医学主题的泛泛信息等任务，但不能用其替代合格医生或律师的专业判断。OpenAI更新后的政策旨在保护个人免于根据可能存在缺陷或偏见的人工智能生成的内容做出决策，这些决策可能对其健康或法律状况产生严重后果。\n\n这项政策转变是由于人们日益关注人工智能可能在专业知识和人为监督至关重要的领域被滥用。OpenAI正在积极应对这些担忧，为人工智能模型的适当使用设定更清晰的界限。该公司还承认，随着技术的成熟，这些指导方针将继续发展。"
  },
  {
    "id": "45813767",
    "title": "Codemaps: Understand Code, Before You Vibe It",
    "url": "https://cognition.ai/blog/codemaps",
    "summary": "Cognition has launched Windsurf Codemaps, an AI-annotated structured map of code designed to enhance code understanding and engineering productivity. Powered by SWE-1.5 and Claude Sonnet 4.5, Codemaps aims to improve debugging, refactoring, and onboarding by providing engineers with a hyper-contextualized view of their codebase.\n\nThe tool addresses the problem of sprawling codebases that hinder engineers' ability to quickly grasp and navigate code, leading to wasted time and productivity losses. Unlike AI coding tools that aim to replace engineers, Codemaps is designed to augment them by turning their brains \"ON,\" not \"OFF.\" It builds on previous Cognition advancements like Ask Devin and DeepWiki, offering precise code navigation and transparent reasoning.\n\nCodemaps allows users to input a task or select from automatic suggestions, generating a map of the code related to the prompt. Users can choose between Fast (SWE-1.5) or Smart (Sonnet 4.5) models for generation. These maps can be visually displayed or viewed as a trace guide with descriptive explanations. Users can also reference a codemap within the Cascade tool to provide highly specific context to the agent.\n\nCognition emphasizes the importance of accountability in AI-assisted coding, arguing that engineers should understand the code they generate or maintain. Codemaps provides a shared understanding of the system between humans and AI, highlighting structure, data flow, and dependencies. The company plans to further integrate Codemaps with its coding agents and explore open protocols for broader use. Ultimately, Cognition believes in augmenting engineers for high-value work and relieving them of low-value tasks, fostering synergy between humans and AI.\n",
    "chinese_title": "代码地图：先理解代码，再愉快编程",
    "chinese_summary": "Cognition发布Windsurf Codemaps：一款AI注释的代码结构图，旨在增强代码理解和工程生产力。Codemaps由SWE-1.5和Claude Sonnet 4.5驱动，旨在通过为工程师提供代码库的超上下文视图来改进调试、重构和入职流程。\n\n该工具解决了代码库庞大、阻碍工程师快速掌握和浏览代码的问题，从而导致时间浪费和生产力损失。与旨在取代工程师的AI编码工具不同，Codemaps旨在通过让工程师的大脑“开启”而非“关闭”来增强他们的能力。它建立在Cognition之前的Ask Devin和DeepWiki等进步的基础上，提供精确的代码导航和透明的推理。\n\nCodemaps允许用户输入任务或从自动建议中选择，生成与提示相关的代码图。用户可以选择Fast (SWE-1.5)或Smart (Sonnet 4.5)模型进行生成。这些图可以以可视化方式显示，或以带有描述性解释的跟踪指南的形式查看。用户还可以在Cascade工具中引用代码图，以便为代理提供高度特定的上下文。\n\nCognition强调了AI辅助编码中问责制的重要性，认为工程师应该理解他们生成或维护的代码。Codemaps提供了人类和AI之间对系统的共同理解，突出了结构、数据流和依赖关系。该公司计划进一步将Codemaps与其编码代理集成，并探索开放协议以供更广泛使用。最终，Cognition相信增强工程师以进行高价值工作，并减轻他们的低价值任务，从而促进人类和AI之间的协同作用。"
  },
  {
    "id": "45823141",
    "title": "The shadows lurking in the equations",
    "url": "https://gods.art/articles/equation_shadows.html",
    "summary": "This article introduces \"FuzzyGraph,\" a new method of visualizing equations that goes beyond traditional binary graphing. Binary graphing only shows where an equation is exactly equal (error == 0), whereas FuzzyGraph visualizes equations in a non-binary mode, showing varying levels of error. This reveals \"mathematical shadows\" – regions of high or low error – that are invisible in conventional graphs.\n\nThe article uses several examples to illustrate this concept. The \"Slash Dot Equation\" and \"Quasar Equation\" demonstrate how FuzzyGraph reveals \"black hole\" features, representing areas of high error, that are absent in binary graphs. A simplified \"Black Hole Equation\" further emphasizes this, showing a mathematical topography even where no solutions exist.\n\nThe \"Shadow Line\" example shows how dividing equations can create \"shadow lines,\" revealing a more complete visualization than a conventional graph. Similarly, the \"Phi Equation\" demonstrates how FuzzyGraph uncovers a \"shadow circle\" that's hidden in a binary representation.\n\nFinally, the \"Underwater Islands\" example showcases how FuzzyGraph can reveal near-solutions to an equation, represented as \"floating dots,\" that are invisible in binary graphs. The article concludes that FuzzyGraph allows for a deeper understanding of mathematical topographies by visualizing error levels, potentially leading to new insights and discoveries. By tweaking equations slightly, hidden islands can become visible with both FuzzyGraph and conventional graphs.\n",
    "chinese_title": "潜伏在方程中的阴影",
    "chinese_summary": "本文介绍了一种新的可视化方程的方法“模糊图”(FuzzyGraph)，它超越了传统的二元图。二元图只显示方程完全相等的地方（误差 == 0），而模糊图以非二元模式可视化方程，显示不同的误差等级。这揭示了“数学阴影”——高或低误差的区域——这些区域在传统图中是不可见的。\n\n本文使用几个例子来说明这个概念。“斜线点方程”和“类星体方程”演示了模糊图如何揭示“黑洞”特征，代表高误差的区域，而这些区域在二元图中是不存在的。一个简化的“黑洞方程”进一步强调了这一点，即使在没有解的地方也显示出数学地形。\n\n“阴影线”例子展示了除法方程如何创建“阴影线”，从而揭示比传统图更完整的可视化效果。类似地，“黄金分割方程”演示了模糊图如何揭示一个隐藏在二元表示中的“阴影圆”。\n\n最后，“水下岛屿”例子展示了模糊图如何揭示方程的近似解，这些近似解以“浮动点”的形式表示，在二元图中是不可见的。文章总结说，模糊图通过可视化误差等级，可以更深入地理解数学地形，从而可能带来新的见解和发现。通过稍微调整方程，隐藏的岛屿可以通过模糊图和传统图都变得可见。"
  },
  {
    "id": "45822902",
    "title": "Microsoft Can't Keep EU Data Safe from US Authorities",
    "url": "https://www.forbes.com/sites/emmawoollacott/2025/07/22/microsoft-cant-keep-eu-data-safe-from-us-authorities/",
    "summary": "This Forbes article reports that Microsoft admitted it cannot guarantee EU data will be protected from US authorities, despite data residency within the EU. Anton Carniaux, a Microsoft France director, testified before a French Senate inquiry that the U.S. Cloud Act allows the U.S. government to compel American companies to hand over data, regardless of its location.\n\nThis admission raises concerns about European data sovereignty, particularly regarding initiatives like Project Bleu and the Health Data Hub, which rely on Microsoft Azure. Senate members are worried about potential data sharing of sensitive health information. Critics, like Civo's CEO Mark Boost, argue that the physical location of data within the EU is irrelevant under the jurisdiction of U.S. laws. He emphasizes the potential impact on national security, privacy, and business competitiveness.\n\nThe article highlights the increasing calls for \"homegrown\" cloud solutions to ensure true data sovereignty. While a European Parliament report indicates that U.S. companies dominate the European cloud infrastructure market with 69% market share, there's a growing movement towards building independent solutions. The French Senate's inquiry is seen as a precedent, with calls for similar scrutiny in the UK and across Europe to prioritize data sovereignty over data residency.\n",
    "chinese_title": "微软无法保护欧盟数据免受美国当局侵害",
    "chinese_summary": "福布斯报道：微软承认无法保证欧盟数据免受美国当局侵害，尽管数据驻留在欧盟境内。微软法国主管 Anton Carniaux 在法国参议院的调查中作证称，美国《云法案》允许美国政府强制美国公司交出数据，无论数据位于何处。\n\n这一承认引发了人们对欧洲数据主权的担忧，特别是对于依赖 Microsoft Azure 的 Project Bleu 和 Health Data Hub 等项目。 参议院成员担心敏感健康信息的潜在数据共享。Civo 首席执行官 Mark Boost 等批评人士认为，在美国法律管辖下，数据在欧盟境内的物理位置无关紧要。他强调了对国家安全、隐私和商业竞争力的潜在影响。\n\n该文章强调了越来越多要求采用“本土”云解决方案以确保真正数据主权的呼声。 虽然一份欧洲议会报告显示，美国公司以 69% 的市场份额主导着欧洲云基础设施市场，但构建独立解决方案的运动正在兴起。 法国参议院的调查被视为一个先例，呼吁英国和整个欧洲进行类似的审查，优先考虑数据主权而不是数据驻留。"
  },
  {
    "id": "45817114",
    "title": "Bluetui – A TUI for managing Bluetooth on Linux",
    "url": "https://github.com/pythops/bluetui",
    "summary": "Bluetui is a terminal user interface (TUI) application for managing Bluetooth devices on Linux systems. It requires bluez and optionally nerdfonts for icon display. Installation options include pre-built binaries, crates.io via `cargo install bluetui`, Arch Linux's extra repository (`pacman -S bluetui`), Gentoo's lamdness overlay, X-CMD, or building from source by cloning the GitHub repository and using `cargo build --release`.\n\nThe TUI provides a way to interact with Bluetooth adapters and paired/new devices. Global keybindings allow navigating sections and quitting. Specific adapter functions include toggling pairing, power, and discovery. For paired devices, actions include unpairing, connecting/disconnecting, trusting/untrusting, and renaming. New devices can be paired.\n\nKeybindings can be customized in the `config.toml` file located at `$HOME/.config/bluetui/config.toml` or a custom path specified with the `-c` flag. Customizable options include layout and window width, as well as the specific keys used for actions like toggling scanning, pairing, power, discovery, unpairing, trusting, and renaming.\n\nBluetui is licensed under GPLv3 and its logo was created by Marco Bulgarelli.\n",
    "chinese_title": "Bluetui - Linux 蓝牙管理 TUI",
    "chinese_summary": "Bluetui 是一个用于在 Linux 系统上管理蓝牙设备的终端用户界面 (TUI) 应用程序。它需要 bluez，并可选择使用 nerdfonts 来显示图标。安装选项包括预构建的二进制文件、通过 `cargo install bluetui` 从 crates.io 安装、Arch Linux 的 extra 仓库 (`pacman -S bluetui`)、Gentoo 的 lamdness overlay、X-CMD，或者通过克隆 GitHub 仓库并使用 `cargo build --release` 从源代码构建。\n\nTUI 提供了一种与蓝牙适配器和已配对/新设备交互的方式。全局快捷键允许导航各部分和退出。特定的适配器功能包括切换配对、电源和发现。对于已配对的设备，操作包括取消配对、连接/断开连接、信任/不信任和重命名。可以配对新设备。\n\n快捷键可以在位于 `$HOME/.config/bluetui/config.toml` 的 `config.toml` 文件中自定义，或者使用 `-c` 标志指定自定义路径。可自定义的选项包括布局和窗口宽度，以及用于切换扫描、配对、电源、发现、取消配对、信任和重命名等操作的特定按键。\n\nBluetui 在 GPLv3 许可下发布，其 Logo 由 Marco Bulgarelli 创建。"
  },
  {
    "id": "45823186",
    "title": "Carice TC2 – A non-digital electric car",
    "url": "https://www.caricecars.com/",
    "summary": "The Carice TC2 is a fully electric, retro-styled car designed and built in the Netherlands. It emphasizes a pure and simple driving experience, removing unnecessary complexities to focus on enjoyment. Its lightweight build (starting at 590kg) contributes to dynamic handling, low power consumption, and a comfortable ride.\n\nThe TC2 boasts a range of up to 300km with the larger battery pack and can be charged to 80% in as little as 2.7 hours. It complies with EU regulations for road use.\n\nCustomers can personalize their TC2 with various options for paint, upholstery, and rooftop colors. Key specifications include a length of 3540mm, a width of 1580mm, and a height of 1220mm.\n\nCarice aims to combine modern technology with the classic aesthetics of beloved cars from the past. The TC2 is described as a piece of art, designed to evoke a sense of escape and joy for both driver and passenger. Prices start at €44.500 excluding taxes. While the current production batch is sold out, prospective buyers can reserve a spot in the next run by placing a deposit. Interested individuals are encouraged to book a test drive or contact Carice to configure their vehicle.\n",
    "chinese_title": "Carice TC2 – 一款非数字电动汽车",
    "chinese_summary": "Carice TC2 是一款完全电动的复古风格汽车，在荷兰设计和制造。它强调纯粹而简单的驾驶体验，去除不必要的复杂性，专注于乐趣。其轻量化结构（起重590公斤）有助于实现动态操控、低功耗和舒适的驾乘体验。\n\nTC2 搭载更大的电池组，续航里程可达 300 公里，并且可以在短短 2.7 小时内充电至 80%。它符合欧盟道路使用法规。\n\n客户可以通过各种油漆、内饰和车顶颜色选项来个性化他们的 TC2。主要规格包括长 3540 毫米、宽 1580 毫米和高 1220 毫米。\n\nCarice 旨在将现代技术与过去人们喜爱的汽车的经典美学相结合。TC2 被描述为一件艺术品，旨在唤起驾驶员和乘客的逃避感和快乐感。起价为 44.500 欧元（不含税）。虽然目前的生产批次已售罄，但潜在买家可以通过支付定金来预定下一轮的生产位置。 鼓励有兴趣的人预约试驾或联系 Carice 来配置他们的车辆。"
  },
  {
    "id": "45812756",
    "title": "An eBPF Loophole: Using XDP for Egress Traffic",
    "url": "https://loopholelabs.io/blog/xdp-for-egress-traffic",
    "summary": "This article discusses a novel technique to use XDP (eXpress Data Path) for egress traffic in Linux, overcoming XDP's inherent limitation to only process ingress traffic. Loophole Labs discovered a \"loophole\" by leveraging Virtual Ethernet (veth) interfaces. By routing egress traffic through one end of a veth pair, the other end sees it as ingress traffic, triggering XDP program execution.\n\nThe motivation stems from the need for line-rate packet processing for live migration of containers and VMs. Traditional methods like Traffic Control (TC) suffer from performance bottlenecks due to late execution in the network stack. XDP, running directly in network drivers, offers zero-copy packet processing and significantly better performance.\n\nThe implementation involves attaching XDP programs to the RX queue of veth interfaces. Since the kernel's networking stack is bypassed, the XDP program becomes responsible for checksumming and ARP resolution.\n\nBenchmarks using iPerf3 in a containerized environment show native XDP achieving ~194Gbps, a 12.4x improvement over iptables and a 9.2x improvement over TC. The generic XDP driver performed worse than TC because it runs after socket buffer allocation.\n\nThis technique is immediately applicable to Docker and Kubernetes environments without requiring changes to existing container setups. It streamlines container networking by bypassing iptables and connection tracking, leading to significant performance gains.\n",
    "chinese_title": "一个 eBPF 漏洞：使用 XDP 处理出口流量",
    "chinese_summary": "利用XDP处理Linux出口流量的新技术"
  },
  {
    "id": "45818562",
    "title": "Hypothesis: Property-Based Testing for Python",
    "url": "https://hypothesis.readthedocs.io/en/latest/",
    "summary": "This article introduces Hypothesis, a property-based testing library for Python. Hypothesis allows developers to write tests that should pass for a range of inputs, which it then randomly generates, including potentially missed edge cases. The core idea is to define properties that should hold true for any input within a specified range, rather than writing specific test cases.\n\nThe example shows testing a sorting function. Instead of defining specific lists to sort, Hypothesis generates random lists containing integers and floats, ensuring the function works correctly across a variety of inputs.\n\nThe article then points the reader to resources for learning more: a tutorial for new users, a quickstart guide for a condensed introduction, how-to guides for practical applications, explanations for deeper understanding, and an API reference. In essence, Hypothesis empowers developers to write more robust and comprehensive tests by automatically generating diverse test inputs.\n",
    "chinese_title": "假设：Python 的基于属性的测试",
    "chinese_summary": "本文介绍了Hypothesis，一个基于属性的Python测试库。Hypothesis允许开发者编写针对一系列输入都应通过的测试，它会随机生成这些输入，包括可能遗漏的边界情况。其核心思想是定义对于指定范围内的任何输入都应为真的属性，而不是编写具体的测试用例。\n\n该示例展示了如何测试排序函数。 Hypothesis不定义需要排序的特定列表，而是生成包含整数和浮点数的随机列表，确保该函数在各种输入下都能正确工作。\n\n文章随后引导读者查阅更多学习资源：面向新用户的教程、用于简要介绍的快速入门指南、用于实际应用的实践指南、用于深入理解的解释说明以及API参考。 本质上，Hypothesis通过自动生成各种测试输入，使开发者能够编写更健壮和全面的测试。"
  },
  {
    "id": "45832803",
    "title": "What the hell have you built",
    "url": "https://wthhyb.sacha.house/",
    "summary": "The article \"What the hell have you built\" is extremely short and simply consists of the question, \"What the hell have you built?\" \n\nTherefore, the summary is straightforward:\n\nThe article presents a direct and potentially critical question about the nature and purpose of something that has been created. The question implies a degree of shock, disbelief, or even disapproval towards the creation, suggesting it may be unexpected, poorly conceived, or even disastrous in its outcome. Without further context, the specific \"something\" being questioned remains unknown, but the tone suggests the creator is being challenged to justify their work. The question serves as a potent and immediate inquiry into the motivations, process, and results of a particular building or endeavor.\n",
    "chinese_title": "你到底建了些什么玩意儿？",
    "chinese_summary": "文章《你究竟造了些什么鬼东西》极其简短，仅仅由问题“你究竟造了些什么鬼东西？”构成。\n\n因此，摘要很简单：\n\n文章提出了一个直接且可能带有批判性的问题，关于某件被创造之物的本质和目的。这个问题暗示着一定程度的震惊、难以置信，甚至是不赞同，暗示着这个创造可能是出乎意料的、构思不良的，甚至是灾难性的。在没有进一步背景信息的情况下，被质疑的特定“东西”仍然未知，但语气表明创作者正在被挑战去证明其作品的合理性。这个问题是对特定建筑或事业的动机、过程和结果进行的一次有力且直接的质询。"
  },
  {
    "id": "45826348",
    "title": "The state of SIMD in Rust in 2025",
    "url": "https://shnatsel.medium.com/the-state-of-simd-in-rust-in-2025-32c263e5f53d",
    "summary": "This article discusses the state of SIMD (Single Instruction, Multiple Data) in Rust as of 2025. SIMD leverages hardware parallelism by processing multiple data points with a single instruction, leading to performance improvements.\n\nThe article highlights the challenge of diverse SIMD instruction sets (SSE, AVX, NEON, etc.) and the problem of ensuring code compatibility across different CPUs, especially on x86, where not all CPUs support the latest instruction sets. Function multiversioning is presented as a solution, compiling multiple versions of a function optimized for different SIMD extensions.\n\nFour main approaches to SIMD in Rust are examined:\n\n1.  **Automatic vectorization:** Letting the compiler optimize code for SIMD.\n2.  **Fancy iterators:** Using specialized iterators for SIMD parallelization (largely abandoned).\n3.  **Portable SIMD abstractions:** Using crates like `std::simd`, `wide`, `pulp`, `macerator`, `fearless_simd`, and `simdeez` to work with SIMD through high-level abstractions. The article evaluates the pros and cons of each crate, focusing on platform support, multiversioning capabilities, and maturity.\n4.  **Raw intrinsics:** Directly using processor-specific instructions, offering the most control but requiring platform-specific code and manual multiversioning.\n\nThe conclusion emphasizes choosing the right tool based on the use case: autovectorization for simplicity, intrinsics for specific hardware or C porting, and portable SIMD abstractions for most other scenarios.\n",
    "chinese_title": "2025年 Rust 的 SIMD 现状",
    "chinese_summary": "本文探讨了截至2025年Rust中SIMD（单指令多数据）的状态。SIMD通过使用单条指令处理多个数据点来利用硬件并行性，从而提高性能。\n\n文章强调了各种SIMD指令集（SSE、AVX、NEON等）带来的挑战，以及确保代码在不同CPU上的兼容性问题，尤其是在x86平台上，并非所有CPU都支持最新的指令集。函数多版本化被提出作为一种解决方案，它会编译同一个函数的多个版本，每个版本都针对不同的SIMD扩展进行了优化。\n\n文章考察了Rust中SIMD的四种主要方法：\n\n1.  **自动向量化：** 让编译器优化代码以使用SIMD。\n2.  **高级迭代器：** 使用专门的迭代器进行SIMD并行化（已基本放弃）。\n3.  **可移植的SIMD抽象：** 使用诸如`std::simd`、`wide`、`pulp`、`macerator`、`fearless_simd`和`simdeez`之类的crate，通过高级抽象来使用SIMD。文章评估了每个crate的优缺点，重点关注平台支持、多版本化能力和成熟度。\n4.  **原始内联函数：** 直接使用处理器特定的指令，提供最大的控制权，但需要平台特定的代码和手动多版本化。\n\n结论强调应根据用例选择合适的工具：自动向量化适用于简单场景，内联函数适用于特定硬件或C语言移植，而可移植的SIMD抽象则适用于大多数其他场景。"
  },
  {
    "id": "45822559",
    "title": "Radiant Computer",
    "url": "https://radiant.computer",
    "summary": "Radiant Computer is presented as a reimagined personal computing system designed from the ground up, aiming to counteract the perceived negative trajectory of modern technology dominated by Big Tech. It seeks to return computing to its roots as a tool for empowerment, creation, and autonomy, rather than a platform for engagement and surveillance.\n\nKey features of Radiant include its clean-slate design, free from historical baggage and corporate influence; its focus on user needs over data collection; and its offline-first architecture. Radiant aims to provide a distraction-free environment for learning, creating, and playing, harking back to the simple joy of computing. The system features its own private network to avoid the pitfalls of social media and online tracking.\n\nA core principle is the accessibility of code. Radiant is designed to make programming accessible to everyone, allowing users to read, edit, and extend every application and surface. The project also explores the potential of AI-native computer systems to enhance creativity while maintaining user privacy.\n\nUltimately, Radiant envisions a more humane future for personal computing, one that encourages curiosity, experimentation, and user control. It's an ongoing research project inviting collaboration and feedback, with design principles, tenets, logs, and notes available for exploration.\n",
    "chinese_title": "光辉电脑",
    "chinese_summary": "Radiant 计算机：旨在对抗大型科技公司主导的现代科技负面趋势，Radiant 计算机被设计为一个从零开始重新构想的个人计算系统。它力求让计算回归其本源，成为赋能、创造和自主的工具，而不是参与和监控的平台。\n\nRadiant 的主要特点包括：摆脱历史包袱和企业影响的全新设计；以用户需求为中心，而非数据收集；以及离线优先的架构。Radiant 旨在提供一个无干扰的环境，用于学习、创造和娱乐，重拾计算的简单乐趣。该系统拥有自己的私有网络，以避免社交媒体和在线追踪的陷阱。\n\n一个核心原则是代码的可访问性。Radiant 的设计旨在让每个人都能访问编程，允许用户阅读、编辑和扩展每个应用程序和界面。该项目还探索了人工智能原生计算机系统在增强创造力的同时维护用户隐私的潜力。\n\n最终，Radiant 设想了一个更人性化的个人计算未来，鼓励好奇心、实验精神和用户控制。这是一个持续的研究项目，邀请合作和反馈，其设计原则、宗旨、日志和笔记均可供探索。"
  },
  {
    "id": "45823831",
    "title": "Ruby and Its Neighbors: Smalltalk",
    "url": "https://noelrappin.com/blog/2025/11/ruby-and-its-neighbors-smalltalk/",
    "summary": "This article explores the influence of Smalltalk on Ruby, highlighting its unique development environment and object model. Unlike Perl, Smalltalk's impact on Ruby is primarily conceptual rather than syntactical, particularly in how objects are handled.\n\nThe article details the history of Smalltalk, originating from Xerox PARC and its commercialization by ParcPlace. It emphasizes Smalltalk's distinct environment, functioning almost as its own operating system, separate from the Unix/C-centric world of languages like Perl, Ruby, and Python. Key components are the Workspace (similar to a REPL) and the Browser, which allows users to view and modify all code in the system, including core system code.\n\nSmalltalk's syntax is described as simple and consistent, with every element being an object and every expression a message. It lacks operator precedence and uses keyword messages heavily. Notably, Smalltalk lacks special syntax for control flow structures like loops or conditionals, instead relying on methods defined on classes like `Array` and `True/False`.\n\nThe object model shares similarities with Ruby, including a base class called `Object`, private instance variables, dynamic method lookup, and metaclasses. The article concludes by lamenting Smalltalk's decline, attributing it to the all-encompassing nature of its environment, which struggled to integrate with the growing Unix-dominated landscape. The author praises Smalltalk's fluid development environment, particularly its testing and debugging capabilities.\n",
    "chinese_title": "Ruby及其邻居：Smalltalk",
    "chinese_summary": "本文探讨了Smalltalk对Ruby的影响，重点介绍了其独特的开发环境和对象模型。与Perl不同，Smalltalk对Ruby的影响主要体现在概念层面，而非语法层面，尤其是在对象处理方面。\n\n文章详细介绍了Smalltalk的历史，它起源于Xerox PARC，并由ParcPlace将其商业化。文章强调了Smalltalk独特的环境，它几乎作为自己的操作系统运行，与以Unix/C为中心的Perl、Ruby和Python等语言的世界不同。关键组件包括Workspace（类似于REPL）和Browser，用户可以通过它们查看和修改系统中的所有代码，包括核心系统代码。\n\n文章将Smalltalk的语法描述为简单且一致，每个元素都是一个对象，每个表达式都是一个消息。它缺乏运算符优先级，并大量使用关键字消息。值得注意的是，Smalltalk缺乏用于控制流结构的特殊语法，如循环或条件语句，而是依赖于定义在`Array`和`True/False`等类上的方法。\n\n该对象模型与Ruby有相似之处，包括一个名为`Object`的基类、私有实例变量、动态方法查找和元类。文章最后感叹了Smalltalk的衰落，将其归因于其环境的包容性，这种包容性难以与日益增长的Unix主导的格局相融合。作者赞扬了Smalltalk流畅的开发环境，特别是其测试和调试能力。"
  },
  {
    "id": "45826500",
    "title": "Internet Archive's legal fights are over, but its founder mourns what was lost",
    "url": "https://arstechnica.com/tech-policy/2025/11/the-internet-archive-survived-major-copyright-losses-whats-next/",
    "summary": "This article chronicles the Internet Archive's recent legal battles and their impact on the organization, particularly its Open Library project. Despite celebrating milestones like archiving its trillionth webpage and being designated a federal depository library, the Internet Archive has emerged from copyright lawsuits that forced the removal of over 500,000 books from its Open Library.\n\nFounder Brewster Kahle laments the gutting of the Open Library, arguing that these legal challenges, primarily from large media companies, aimed to restrict access to information and undermine the traditional role of libraries. The lawsuits stemmed from the Open Library's e-book lending model, which publishers argued harmed the e-book market. While the Archive avoided bankruptcy through confidential settlements, the outcomes have curtailed its ability to operate the Open Library as before.\n\nExperts argue that the lawsuits highlight the tension between copyright holders' interests and libraries' missions to preserve culture and provide equal access to knowledge, especially in the digital age. Concerns are raised that libraries may face future funding challenges and delay digitization projects due to fear of costly litigation.\n\nLooking ahead, the Internet Archive plans to focus on projects like Democracy's Library, aiming to provide open access to government research and publications. Kahle remains determined to preserve knowledge and promote a future where authors, publishers, and libraries can thrive, advocating for a re-architecting of copyright laws. He also expresses concern about the growing power of corporations and governments in controlling information, particularly in the context of artificial intelligence.\n",
    "chinese_title": "互联网档案馆的法律战结束，但其创始人哀悼失去之物",
    "chinese_summary": "本文记录了互联网档案馆近期的法律诉讼及其对该组织的影响，特别是对其开放图书馆项目的影响。尽管庆祝了诸如存档了一万亿个网页以及被指定为联邦寄存图书馆等里程碑，但互联网档案馆还是经历了版权诉讼，被迫从其开放图书馆中删除了超过50万本书籍。\n\n创始人布鲁斯特·卡勒感叹开放图书馆遭到破坏，认为这些主要来自大型媒体公司的法律挑战，旨在限制信息获取并破坏图书馆的传统角色。这些诉讼源于开放图书馆的电子书借阅模式，出版商认为这损害了电子书市场。虽然互联网档案馆通过保密和解协议避免了破产，但结果限制了其像以前一样运营开放图书馆的能力。\n\n专家认为，这些诉讼突显了版权所有者的利益与图书馆保存文化和提供平等知识获取的使命之间的紧张关系，尤其是在数字时代。人们担心，由于害怕代价高昂的诉讼，图书馆未来可能会面临资金挑战，并推迟数字化项目。\n\n展望未来，互联网档案馆计划专注于“民主图书馆”等项目，旨在提供对政府研究和出版物的开放访问。卡勒仍然决心保存知识，并促进一个作者、出版商和图书馆都能蓬勃发展的未来，主张重新构建版权法。他还对公司和政府在控制信息方面日益增长的力量表示担忧，尤其是在人工智能的背景下。"
  },
  {
    "id": "45813734",
    "title": "Michael Burry a.k.a. \"Big Short\",discloses $1.1B bet against Nvidia&Palantir",
    "url": "https://sherwood.news/markets/michael-burry-big-short-discloses-1-1-billion-options-bet-against-nvidia-palantir-puts/",
    "summary": "Michael Burry, known for predicting the 2008 housing crash, has made a $1.1 billion bet against Nvidia and Palantir through put options, according to a recent regulatory filing for the quarter ending September 30th. His fund, Scion Asset Management, bought put options on approximately 5 million Palantir shares (worth $912 million) and 1 million Nvidia shares (worth $187 million), representing 80% of Scion's disclosed US equity holdings.\n\nBurry's move comes after a significant surge in both stocks, fueled by AI enthusiasm and rising tech valuations. Nvidia jumped 50% this year and briefly reached a $5 trillion market cap, while Palantir is up 176% year-to-date.\n\nThe news of Burry's bet, combined with existing concerns about the companies' valuations, has impacted their stock prices. Palantir's stock fell 6.86%, while Nvidia declined by 1.8% as of Tuesday morning.\n\nPrior to this disclosure, Burry warned of market \"bubbles\" on social media. Scion also revealed call options on Pfizer and Halliburton, as well as holdings in other companies like Lululemon and Sallie Mae.\n",
    "chinese_title": "迈克尔·布里（“大空头”）披露做空英伟达和帕兰提尔，金额达11亿美元。",
    "chinese_summary": "因成功预测2008年房地产崩盘而闻名的迈克尔·布里，根据截至9月30日的季度监管文件显示，他通过认沽期权押注11亿美元做空英伟达和Palantir。他的基金Scion资产管理公司购买了约500万股Palantir股票（价值9.12亿美元）和100万股英伟达股票（价值1.87亿美元）的认沽期权，这占Scion披露的美国股票持有量的80%。\n\n在人工智能热潮和科技股估值上升的推动下，这两只股票大幅上涨后，布里采取了这一行动。英伟达今年上涨了50%，并一度达到5万亿美元的市值，而Palantir今年迄今上涨了176%。\n\n布里押注的消息，加上对这两家公司估值的现有担忧，已经影响了它们的股价。截至周二上午，Palantir的股价下跌了6.86%，英伟达下跌了1.8%。\n\n在此披露之前，布里曾在社交媒体上警告市场存在“泡沫”。Scion还披露了辉瑞和哈利伯顿的看涨期权，以及在Lululemon和Sallie Mae等其他公司的持股。"
  },
  {
    "id": "45816673",
    "title": "Grayskull: A tiny computer vision library in C for embedded systems, etc.",
    "url": "https://github.com/zserge/grayskull",
    "summary": "Grayskull is a lightweight, dependency-free computer vision library written in C99, designed for resource-constrained environments like microcontrollers. It operates on grayscale images and provides a range of functionalities including image operations (copy, crop, resize, downsample), filtering (blur, Sobel, thresholding), morphological operations (erosion, dilation), and geometric transformations (connected components, perspective warp).\n\nThe library also includes feature detection with FAST/ORB keypoints and descriptors for object tracking, and Local Binary Pattern (LBP) cascades for object detection like faces and vehicles. Utilities for reading and writing PGM images are provided.\n\nGrayskull emphasizes simplicity with a single-header file under 1KLOC, integer-based operations, and avoids dynamic memory allocation. The API includes functions for image manipulation, filtering, blob analysis, feature extraction, and LBP cascade detection. Example usage is shown with a code snippet and an online demo is available. The library is licensed under the MIT License, allowing for broad usage in research and commercial applications.\n",
    "chinese_title": "灰骷髅：一个用于嵌入式系统等的C语言小型计算机视觉库。",
    "chinese_summary": "Grayskull 是一个轻量级、无依赖的计算机视觉库，用 C99 编写，专为微控制器等资源受限环境设计。它处理灰度图像，并提供一系列功能，包括图像操作（复制、裁剪、调整大小、降采样）、滤波（模糊、Sobel、阈值化）、形态学操作（腐蚀、膨胀）和几何变换（连通组件、透视变换）。\n\n该库还包括用于对象跟踪的 FAST/ORB 关键点和描述符的特征检测，以及用于对象检测（如面部和车辆）的局部二值模式 (LBP) 级联。 提供了用于读取和写入 PGM 图像的实用程序。\n\nGrayskull 强调简洁性，使用单个头文件（小于 1KLOC）、基于整数的操作，并避免动态内存分配。 该 API 包括图像操作、滤波、斑点分析、特征提取和 LBP 级联检测等函数。 代码片段展示了示例用法，并提供了一个在线演示。 该库在 MIT 许可证下获得许可，允许在研究和商业应用中广泛使用。"
  },
  {
    "id": "45813994",
    "title": "Deepnote, a Jupyter alternative, is going open source",
    "url": "https://deepnote.com/blog/were-open-sourcing-the-successor-of-jupyter-notebook",
    "summary": "Deepnote has open-sourced its platform, driven by the belief that existing notebook standards, primarily Jupyter (.ipynb), are outdated for modern needs like collaboration, AI integration, and cloud-native workflows. While acknowledging Jupyter's impressive legacy, Deepnote argues it was created pre-cloud, pre-collaboration, and pre-AI, leading to issues like difficult collaboration, poor project structure, lack of context in code reviews, limited extensibility, and insecure secret storage.\n\nDeepnote introduces a new format, `.deepnote`, designed to be human-readable YAML, support secure data connections and multiple notebooks per project, offer extensible block types, ensure schema integrity, and be language-agnostic. This format organizes notebooks into projects with shared integrations and environment settings, unlike Jupyter's file-centric approach.\n\nThe article addresses the question of why not .ipynb, citing the constant need to \"frankenstein\" the metadata field in Jupyter to accommodate new features, ultimately making backwards compatibility increasingly difficult.  Similarly, the decision to move away from a Python-centric format (.py) acknowledges the broader use cases of notebooks including SQL, rich text, visualization, and Typescript applications in AI.\n\nDeepnote envisions the future of notebooks as AI-native, cloud-native, and capable of supporting data apps, scheduled runs, and API endpoints, emphasizing the need for structured metadata, reproducible environments, and governance controls. They offer a conversion tool for .ipynb to .deepnote and plan to develop a standalone notebook experience powered by an AI notebook agent.\n",
    "chinese_title": "Deepnote，Jupyter替代品，即将开源",
    "chinese_summary": "Deepnote开源其平台，源于其认为现有的notebook标准，主要是Jupyter（.ipynb），已无法满足现代需求，如协作、AI集成和云原生工作流。尽管承认Jupyter的卓越贡献，Deepnote认为它诞生于云、协作和AI出现之前，导致了协作困难、项目结构不佳、代码审查缺乏上下文、可扩展性有限以及不安全的密钥存储等问题。\n\nDeepnote引入了一种新的格式`.deepnote`，旨在成为人类可读的YAML，支持安全的数据连接和每个项目的多个notebook，提供可扩展的块类型，确保模式完整性，并且是语言无关的。与Jupyter以文件为中心的模式不同，这种格式将notebook组织成具有共享集成和环境设置的项目。\n\n文章探讨了为什么不使用.ipynb的问题，指出为了适应新功能，需要不断地对Jupyter中的metadata字段进行“拼接”，最终导致向后兼容性越来越困难。同样，放弃以Python为中心的格式（.py）的决定也承认了notebook更广泛的用例，包括SQL、富文本、可视化以及AI中的Typescript应用程序。\n\nDeepnote设想未来的notebook将是AI原生、云原生，并能够支持数据应用、计划运行和API端点，强调需要结构化的metadata、可重现的环境和治理控制。他们提供了一个.ipynb到.deepnote的转换工具，并计划开发一个由AI notebook代理驱动的独立notebook体验。"
  },
  {
    "id": "45809897",
    "title": "This Month in Ladybird – October 2025",
    "url": "https://ladybird.org/newsletter/2025-10-31/",
    "summary": "The Ladybird browser saw significant progress in October 2025, with 217 pull requests merged from 43 contributors. Key highlights include welcoming new sponsors Axeptio and Gravwell, whose funding supports the open-source project.\n\nWeb Platform Tests (WPT) performance drastically improved, now passing over 90% of all subtests, a critical milestone for potential iOS alternative browser engine eligibility. This increase is largely due to the update of the Wasm core tests.\n\nDevelopment continued on a persistent HTTP disk cache to improve website loading speeds. Performance enhancements were made in JavaScript string and object property handling, and optimized calculations.\n\nTrusted Types support was extended to several DOM APIs, while initial support for XPath evaluations was added, enabling the htmx library to function. Audio/Video synchronization was overhauled for improved media playback, including multi-track support.\n\nOther notable updates include pinch-to-zoom support on macOS, reimplementation of accessibility tree inspection in DevTools, ongoing progress on the CSS Typed OM API, implementation of `sibling-count()` and `sibling-index()` CSS functions, and improvements to CSS/SVG gradients and CanvasPattern rendering. WebGL2 buffer support was also improved, along with fixes for Google Maps Globe View.\n\nCommunity efforts continue to advance Windows support, showcasing Ladybird running on the platform.\n",
    "chinese_title": "瓢虫月刊 – 2025年10月",
    "chinese_summary": "瓢虫浏览器在 2025 年 10 月取得了显著进展，合并了来自 43 位贡献者的 217 个拉取请求。主要亮点包括欢迎新的赞助商 Axeptio 和 Gravwell，他们的资金支持该开源项目。\n\nWeb 平台测试 (WPT) 性能大幅提升，目前已通过超过 90% 的所有子测试，这是成为潜在 iOS 替代浏览器引擎的关键里程碑。此项增长主要归功于 Wasm 核心测试的更新。\n\n持续开发持久性 HTTP 磁盘缓存以提高网站加载速度。JavaScript 字符串和对象属性处理以及优化计算方面均进行了性能增强。\n\nTrusted Types 支持已扩展到多个 DOM API，同时添加了对 XPath 评估的初步支持，从而使 htmx 库能够运行。音频/视频同步已得到全面改进，以改善媒体播放效果，包括多轨支持。\n\n其他值得注意的更新包括 macOS 上的双指缩放支持、DevTools 中辅助功能树检查的重新实现、CSS Typed OM API 的持续进展、`sibling-count()` 和 `sibling-index()` CSS 函数的实现，以及对 CSS/SVG 渐变和 CanvasPattern 渲染的改进。WebGL2 缓冲区支持也得到了改进，并修复了 Google Maps 地球视图的问题。\n\n社区持续努力推进 Windows 支持，展示了瓢虫浏览器在该平台上运行。"
  },
  {
    "id": "45823059",
    "title": "Removing XSLT for a more secure browser",
    "url": "https://developer.chrome.com/docs/web-platform/deprecating-xslt",
    "summary": "This article discusses Chrome's plan to deprecate and remove XSLT (Extensible Stylesheet Language Transformations) from the browser by the end of 2026, citing security risks associated with its legacy codebase. XSLT, used to transform XML data into other formats like HTML, relies on complex C/C++ libraries prone to memory safety vulnerabilities. These libraries are not as actively maintained as modern JavaScript engines, posing a significant security risk.\n\nThe article highlights that XSLT's original purpose is now better served by more secure and ergonomic JavaScript APIs like Fetch, DOMParser, and frameworks like React, Vue, and Svelte. Only a tiny fraction of webpages now use XSLT. Other browser engines, including WebKit and Gecko, also plan to remove XSLT.\n\nThe planned timeline includes:\n\n*   **Chrome 155 (Nov 2026):** XSLT stops working in stable Chrome.\n*   **Chrome 164 (Aug 2027):** Origin Trial and Enterprise Policy support ends; XSLT fully disabled.\n\nThe article provides migration options, including:\n\n*   Migrating XSLT processing to the server-side.\n*   Switching to JSON-based APIs with client-side rendering using JavaScript.\n*   Using JavaScript-based XSLT libraries.\n*   Employing a polyfill to maintain existing functionality.\n\nSpecific use cases like RSS/Atom feeds and embedded device API outputs are addressed with tailored migration strategies, including the polyfill or server-side solutions. The article also briefly mentions the intention to replace the libxml2 library with a safer Rust-based alternative for XML parsing, while reassuring developers that XML itself is not being removed.\n",
    "chinese_title": "为了更安全的浏览器，移除 XSLT",
    "chinese_summary": "本文探讨了 Chrome 计划在 2026 年底之前弃用并从浏览器中移除 XSLT (可扩展样式表语言转换) 的决定，理由是其遗留代码库存在安全风险。 XSLT 用于将 XML 数据转换为 HTML 等其他格式，它依赖于复杂的 C/C++ 库，这些库容易出现内存安全漏洞。 这些库的维护活跃度不如现代 JavaScript 引擎，构成重大安全风险。\n\n文章强调，XSLT 的最初用途现在可以通过更安全、更符合人体工程学的 JavaScript API（如 Fetch、DOMParser）以及 React、Vue 和 Svelte 等框架更好地实现。 只有极少一部分网页现在使用 XSLT。 包括 WebKit 和 Gecko 在内的其他浏览器引擎也计划移除 XSLT。\n\n计划的时间表包括：\n\n*   **Chrome 155（2026 年 11 月）：** XSLT 在稳定版 Chrome 中停止工作。\n*   **Chrome 164（2027 年 8 月）：** Origin Trial 和企业策略支持结束； XSLT 完全禁用。\n\n文章提供了迁移选项，包括：\n\n*   将 XSLT 处理迁移到服务器端。\n*   切换到基于 JSON 的 API，并使用 JavaScript 进行客户端渲染。\n*   使用基于 JavaScript 的 XSLT 库。\n*   使用 polyfill 来维持现有功能。\n\n针对 RSS/Atom 订阅源和嵌入式设备 API 输出等特定用例，提供了量身定制的迁移策略，包括 polyfill 或服务器端解决方案。 文章还简要提及了计划用更安全的基于 Rust 的替代方案替换 libxml2 库来进行 XML 解析，同时让开发者放心，XML 本身不会被移除。"
  },
  {
    "id": "45817308",
    "title": "FDA described as a \"clown show\" amid latest scandal; top drug regulator is out",
    "url": "https://arstechnica.com/health/2025/11/fda-described-as-a-clown-show-amid-latest-scandal-top-drug-regulator-is-out/",
    "summary": "This article reports on two separate, seemingly unrelated news items.\n\nThe first, highlighted in the title, describes a scandal within the FDA leading to the departure of a top drug regulator. The FDA is characterized as a \"clown show,\" suggesting significant dysfunction and disrepute associated with the scandal. The article focuses on the negative consequences surrounding the unnamed scandal, and the impact this has on the reputation of the FDA.\n\nThe second part of the article details a medical mystery. An 83-year-old man in a 50-year monogamous marriage presented with a sexually transmitted infection (STI). This unexpected finding has puzzled doctors, casting doubt on the man's claim of marital fidelity, or suggesting other possible (though less likely) explanations for the STI. It appears to be a news tidbit or anecdotal piece shared by Beth Mole on November 5, 2025, with 48 reader comments.\n",
    "chinese_title": "最新丑闻缠身，FDA被批“小丑闹剧”；顶级药品监管者离职",
    "chinese_summary": "本文报道了两件看似无关的新闻。\n\n第一件事，如标题所示，描述了FDA内部的一起丑闻，导致一位高级药物监管人员离职。 FDA被形容为一场“小丑闹剧”，暗示着与该丑闻相关的严重功能失调和声誉扫地。 文章重点关注了围绕这起未具名丑闻的负面后果，以及此事对FDA声誉的影响。\n\n文章的第二部分详细描述了一个医学谜团。 一位83岁、已保持50年一夫一妻制婚姻的男性，被查出患有性传播感染（STI）。 这一意外发现令医生们感到困惑，让人怀疑该男子对婚姻忠诚的说法，或者暗示了STI的其他可能（尽管可能性较小）的解释。 这似乎是Beth Mole于2025年11月5日分享的一条新闻花絮或轶事，有48条读者评论。"
  },
  {
    "id": "45812499",
    "title": "The 512KB Club",
    "url": "https://512kb.club/",
    "summary": "The 512KB Club champions a return to efficient web design, contrasting today's bloated websites with leaner alternatives. It highlights the problem of excessive JavaScript, complex frameworks, and unoptimized assets contributing to unnecessarily large page sizes, citing The New York Times as an example. The club encourages web developers to optimize their sites by questioning the necessity of JavaScript libraries, complex WordPress themes, custom fonts, and unoptimized images.\n\nTo join the 512KB Club, a website must be a functional site with substantial content and have total UNCOMPRESSED web resources under 512KB. The club is maintained by volunteers and accepts support through donations.\n\nThe site is categorized into three tiers based on size: Green Team (<100KB), Orange Team (<250KB), and Blue Team (<512KB). The article then lists numerous websites within the Green Team (<100KB) and Orange Team (<250KB) with their respective sizes, showcasing examples of performance-focused web pages.\n",
    "chinese_title": "512KB俱乐部",
    "chinese_summary": "512KB俱乐部倡导回归高效的网页设计，与当今臃肿的网站形成对比，推崇更精简的替代方案。它强调了过多的JavaScript、复杂的框架以及未优化的资源导致页面尺寸不必要地增大的问题，并以《纽约时报》为例。该俱乐部鼓励Web开发者通过质疑JavaScript库、复杂的WordPress主题、自定义字体和未优化的图像的必要性来优化他们的网站。\n\n要加入512KB俱乐部，网站必须是一个具有实质性内容的实用网站，且所有未压缩的Web资源总和必须小于512KB。该俱乐部由志愿者维护，并通过捐款接受支持。\n\n该网站根据大小分为三个等级：绿队（<100KB）、橙队（<250KB）和蓝队（<512KB）。文章随后列出了许多属于绿队（<100KB）和橙队（<250KB）的网站及其各自的大小，展示了以性能为中心的网页示例。"
  },
  {
    "id": "45812403",
    "title": "Server DRAM prices surge 50% as AI-induced memory shortage hits hyperscalers",
    "url": "https://www.tomshardware.com/pc-components/storage/server-dram-prices-surge-50-percent",
    "summary": "The article reports a significant surge in server DRAM prices, driven by increased demand from hyperscalers due to the AI boom. Major U.S. and Chinese hyperscalers are only receiving 70% of their server DRAM orders despite agreeing to price increases of up to 50% for Q4. This is because DRAM manufacturers like Samsung and SK hynix are diverting capacity to meet the higher demand for HBM and other memory types used in AI acceleration.\n\nThis shortage is causing spot prices to rise sharply, with DDR5 16GB modules jumping from $7-$8 to around $13. Some suppliers are even refusing to quote for October allocations, and module makers anticipate out-of-stock situations by the end of the quarter. Smaller OEMs and channel players face even greater difficulties, with fulfillment rates closer to 35-40%.\n\nMicron and TrendForce have warned that DRAM supply will lag demand into 2026. The price increases are beginning to impact retail DDR5 prices, while DDR4 production is being de-prioritized. Overall, the article highlights a DRAM shortage primarily driven by AI-related demand, impacting server memory availability and prices across the market, with limited relief expected before 2026.\n",
    "chinese_title": "服务器DRAM价格飙升50%，人工智能引发的内存短缺冲击超大规模企业。",
    "chinese_summary": "受人工智能热潮推动，超大规模数据中心需求激增，服务器DRAM价格大幅上涨。尽管美国和中国的主要超大规模数据中心同意第四季度DRAM价格上涨高达50%，但仍仅收到70%的订单。这是因为三星和SK海力士等DRAM制造商正在转移产能，以满足人工智能加速所需的高带宽存储器（HBM）和其他存储类型的更高需求。\n\n这种短缺导致现货价格急剧上涨，DDR5 16GB模组的价格从7-8美元跃升至约13美元。一些供应商甚至拒绝报出10月份的配额，模块制造商预计到本季度末将出现缺货情况。小型OEM和渠道厂商面临更大的困难，交付率接近35-40%。\n\n美光和TrendForce警告称，DRAM供应将持续滞后于需求至2026年。价格上涨已开始影响零售DDR5价格，而DDR4的生产优先级正在降低。总体而言，本文强调了主要由人工智能相关需求驱动的DRAM短缺，影响了整个市场的服务器内存可用性和价格，预计在2026年之前难以缓解。"
  },
  {
    "id": "45818123",
    "title": "Munich's surfers left stunned after famed river wave vanishes",
    "url": "https://www.theguardian.com/world/2025/nov/04/munichs-surfers-left-stunned-after-famed-river-wave-vanishes",
    "summary": "The famed Eisbach river wave in Munich, often called the \"mother of all river waves\" and a birthplace of freshwater surfing, has mysteriously disappeared after a recent cleanup. The wave, a major tourist attraction, is artificially created by currents flowing over a concrete slab and wooden planks. After an annual cleanup involving draining the canal, the wave failed to reform, leaving surfers and authorities baffled.\n\nSurfers are \"at a loss\" and the city is investigating the cause, stating that no structural changes were made during the cleanup and no damage was found. They are considering if a lack of water is the issue. Mayor Dieter Reiter has assured that the city is working to restore the wave. Officials plan to divert more water into the canal. The wave's disappearance is particularly concerning given its history and status as a major destination for river surfing enthusiasts. The Eisbach had been temporarily closed earlier in the year after a fatal accident, and new rules now prohibit night surfing.\n",
    "chinese_title": "慕尼黑冲浪者震惊：著名河浪消失",
    "chinese_summary": "慕尼黑著名埃斯巴赫河浪神秘消失：河道清理后浪涛不再"
  },
  {
    "id": "45820715",
    "title": "The Hacker’s Manifesto (1986)",
    "url": "https://phrack.org/issues/7/3",
    "summary": "\"The Hacker's Manifesto,\" written by The Mentor in 1986, is a passionate defense of the hacker identity in response to societal condemnation. The author, writing shortly after his arrest, argues that hackers are intelligent individuals stifled by a rigid, unchallenging educational system. They are drawn to computers because they offer a space where their abilities are recognized and rewarded based on merit, not social conformity.\n\nThe manifesto criticizes a society that labels hackers as criminals for exploring networks and seeking knowledge, while simultaneously engaging in morally questionable actions like building bombs and waging wars. It asserts that hackers are driven by curiosity and a desire to understand, transcending superficial boundaries like race, nationality, and religion.\n\nThe core message is that hackers are not malicious criminals, but rather individuals who are intellectually curious and find value in the pursuit of knowledge and the mastery of technology. The author suggests that their actions, though sometimes outside legal boundaries, stem from a desire to learn and explore, not to cause harm. The manifesto ends with a defiant declaration of identity, suggesting that while individual hackers may be stopped, the collective spirit of hacking is indomitable.\n",
    "chinese_title": "黑客宣言 (1986)",
    "chinese_summary": "《黑客宣言》，由导师于1986年撰写，是对社会谴责的回应，充满激情地捍卫了黑客身份。作者在被捕后不久写道，认为黑客是聪明的人，却被僵化、缺乏挑战性的教育体系所扼杀。他们被电脑吸引，因为电脑提供了一个空间，他们的能力得到认可，并根据功绩而不是社会顺从得到奖励。\n\n该宣言批评社会将探索网络和寻求知识的黑客贴上罪犯的标签，同时又从事制造炸弹和发动战争等在道德上令人质疑的行为。它断言，黑客是出于好奇心和理解的渴望而驱动，超越了种族、国籍和宗教等肤浅的界限。\n\n核心信息是，黑客不是恶意的罪犯，而是对知识充满好奇心，并发现追求知识和掌握技术的价值的个体。作者认为，他们的行为，虽然有时超出法律界限，但源于学习和探索的渴望，而不是为了造成伤害。宣言以对身份的蔑视性宣告结束，表明虽然个别黑客可能被阻止，但黑客的集体精神是不可征服的。"
  },
  {
    "id": "45830380",
    "title": "OpenAI asks U.S. for loan guarantees to fund $1T AI expansion",
    "url": "https://investinglive.com/stock-market-update/icymi-openai-asks-us-for-loan-guarantees-to-fund-1-trillion-ai-expansion-20251105/",
    "summary": "OpenAI is seeking U.S. government loan guarantees to help finance a massive, potentially over $1 trillion, AI infrastructure expansion. CFO Sarah Friar stated this move aims to attract diverse funding sources, including banks, private equity, and government participation. Government backing would lower borrowing costs and provide access to broader credit markets by protecting lenders against default.\n\nThis request is unusual for a Silicon Valley tech firm and places OpenAI alongside sectors like energy and infrastructure that commonly utilize government support. The financing need stems from large capital commitments, including a $300 billion deal with Oracle and a potential $500 billion data center project (\"Stargate\") with Oracle and SoftBank. While OpenAI projects billions in revenue, these expenses significantly outweigh its income.\n\nFriar dismissed speculation about an imminent IPO, stating it's \"not on the cards right now.\" Instead, OpenAI is focused on scaling its AI capabilities and securing the necessary financing for its long-term ambitions.\n",
    "chinese_title": "OpenAI寻求美国贷款担保，以资助1万亿美元的AI扩张计划。",
    "chinese_summary": "OpenAI寻求美国政府贷款担保，以资助大规模、可能超过1万亿美元的人工智能基础设施扩张。首席财务官莎拉·弗赖尔表示，此举旨在吸引多元化的资金来源，包括银行、私募股权和政府参与。政府支持将降低借贷成本，并通过保护贷款人免受违约影响，提供进入更广泛信贷市场的机会。\n\n对于硅谷科技公司来说，这一要求实属罕见，使OpenAI与能源和基础设施等通常利用政府支持的行业并列。资金需求源于大量的资本承诺，包括与甲骨文达成的3000亿美元协议以及与甲骨文和软银可能合作的5000亿美元数据中心项目（“星际之门”）。虽然OpenAI预计收入将达数十亿美元，但这些支出远远超过其收入。\n\n弗赖尔驳斥了关于即将进行首次公开募股的猜测，称“目前不在考虑之列”。相反，OpenAI专注于扩大其人工智能能力，并为其长期目标获得必要的融资。"
  },
  {
    "id": "45830797",
    "title": "FAA to cut flights by 10% at 40 major airports due to government shutdown",
    "url": "https://www.cnbc.com/2025/11/05/faa-cuts-flight-capacity-shutdown.html",
    "summary": "Due to the government shutdown and unpaid air traffic controllers, the FAA will cut flight capacity by 10% at 40 major airports, starting Friday morning. This reduction, announced by Transportation Secretary Sean Duffy, is a proactive measure that could affect roughly 3,500 to 4,000 flights daily. The specific airports impacted are not yet known.\n\nFAA Administrator Bryan Bedford stated the reduction is necessary to maintain the safety of the airline system, citing increasing pressures related to staffing shortages. The administration plans to collaborate with the airline community to implement the changes. Bedford also said additional measures could be taken after the initial reduction.\n\nThe government shutdown, now the longest in U.S. history, has already caused concerns about staffing levels at FAA facilities. The FAA has disrupted some flights since Oct. 1 because of insufficient staffing at some FAA facilities, further prompting the decision to reduce flight capacity. Duffy anticipates more cancellations as a result of the reduction, which has no defined end date.\n",
    "chinese_title": "因政府关门，FAA将削减40个主要机场10%的航班。",
    "chinese_summary": "由于政府停摆和空中交通管制员无薪工作，美国联邦航空管理局（FAA）将于周五早上开始，在40个主要机场削减10%的航班运力。交通部长肖恩·达菲宣布，此举是一项预防性措施，可能影响每日约3500至4000个航班。具体受影响的机场尚未可知。\n\n美国联邦航空管理局局长布莱恩·贝德福德表示，此次削减对于维持航空系统的安全是必要的，并指出人员短缺带来的压力日益增加。政府计划与航空公司合作实施这些调整。贝德福德还表示，在初步削减之后，可能会采取进一步的措施。\n\n政府停摆目前是美国历史上持续时间最长的一次，已经引起了对美国联邦航空管理局设施人员配置水平的担忧。自10月1日以来，由于一些美国联邦航空管理局设施人员不足，该局已经扰乱了一些航班，这也进一步促使了减少航班运力的决定。达菲预计，削减航班运力将导致更多航班取消，且此次削减没有明确的结束日期。"
  },
  {
    "id": "45811447",
    "title": "Optimizing Datalog for the GPU",
    "url": "https://danglingpointers.substack.com/p/optimizing-datalog-for-the-gpu",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "优化GPU上的Datalog",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45831541",
    "title": "I may have found a way to spot U.S. at-sea strikes before they're announced",
    "url": "https://old.reddit.com/r/OSINT/comments/1opjjyv/i_may_have_found_a_way_to_spot_us_atsea_strikes/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "我可能找到了一种方法，可以在美国海上打击行动宣布前发现它们。",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45812901",
    "title": "YouTube AI error costs creator his channel over alleged link to Japanese account",
    "url": "https://piunikaweb.com/2025/11/04/youtube-ai-error-terminates-enderman-channel/",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "YouTube AI错误导致创作者频道被封，疑因与日本账号存在关联",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45818973",
    "title": "Epic vs. Google settlement: Opening up Android",
    "url": "https://twitter.com/TimSweeneyEpic/status/1985920786545123613",
    "summary": "The article, titled \"Epic vs. Google settlement: Opening up Android,\" appears to be inaccessible. The provided content is a JavaScript error message from X (formerly Twitter) indicating that the user needs to enable JavaScript or switch to a supported browser to view the page.\n\nTherefore, **no summary is possible** as the actual content of the article regarding the Epic vs. Google settlement and its impact on Android's openness is unavailable. I can only state that the article *likely* discusses the settlement reached between Epic Games and Google, stemming from Epic's antitrust lawsuit against Google regarding the Google Play Store. It *probably* explores how the settlement terms might influence Android's ecosystem, potentially making it more open to alternative app stores and payment systems. However, without the full article, this is speculative.\n",
    "chinese_title": "Epic诉谷歌和解：开放安卓",
    "chinese_summary": "名为“Epic诉谷歌案和解：开放安卓”的文章似乎无法访问。所提供的内容是X（前身为Twitter）的JavaScript错误信息，表明用户需要启用JavaScript或切换到受支持的浏览器才能查看该页面。\n\n因此，**无法进行摘要**，因为关于Epic诉谷歌案和解及其对安卓开放性的影响的文章实际内容不可用。我只能说该文章*可能*讨论了Epic Games与谷歌达成的和解协议，该协议源于Epic针对谷歌Play商店的反垄断诉讼。它*可能*探讨了和解条款如何影响安卓生态系统，可能使其对替代应用商店和支付系统更加开放。然而，在没有全文的情况下，这只是推测。"
  },
  {
    "id": "45818483",
    "title": "What Happened to Piracy? Copyright Enforcement Fades as AI Giants Rise",
    "url": "https://www.leefang.com/p/what-happened-to-piracy-copyright",
    "summary": "Lee Fang's article \"What Happened to Piracy? Copyright Enforcement Fades as AI Giants Rise\" argues that copyright enforcement has diminished due to the rise of AI, specifically because AI companies are now the primary beneficiaries of mass-scale copyright infringement.\n\nThe article contrasts the aggressive copyright enforcement era of the late 90s and early 2000s, led by companies like Microsoft, with the current situation. Back then, software piracy was a major concern, prompting lobbying for stricter laws and government crackdowns.\n\nNow, AI giants like Meta, Anthropic, Microsoft, Google, xAI, and OpenAI are accused of using vast quantities of copyrighted material (books, articles) to train their AI models, often obtained through piracy. This includes using platforms like Library Genesis. The article highlights a perceived hypocrisy, noting Microsoft's prior zealous anti-piracy stance versus its current alleged involvement in similar activities to fuel its AI development.\n\nLawsuits filed by authors allege these companies are exploiting their works without permission or compensation. Evidence from the Kadrey et al. v. Meta Platforms case revealed that Meta employees were aware their practices could be seen as inappropriate and that the decision to use pirated content was approved at the highest levels.\n",
    "chinese_title": "盗版怎么了？ 随着人工智能巨头的崛起，版权执法逐渐式微",
    "chinese_summary": "李方文章《盗版去哪儿了？随着人工智能巨头的崛起，版权执法逐渐消退》认为，由于人工智能的兴起，版权执法力度有所减弱，尤其是因为人工智能公司现在是大规模侵犯版权的主要受益者。\n\n该文章将微软等公司主导的90年代末和2000年代初积极的版权执法时代与当前的情况进行了对比。当时，软件盗版是一个主要问题，促使游说制定更严格的法律和政府打击。\n\n现在，Meta、Anthropic、微软、谷歌、xAI 和 OpenAI 等人工智能巨头被指控使用大量受版权保护的材料（书籍、文章）来训练他们的人工智能模型，这些材料通常是通过盗版获得的。这包括使用像 Library Genesis 这样的平台。该文章强调了一种被认为的虚伪，指出微软过去狂热的反盗版立场与目前据称参与类似活动以推动其人工智能发展的行为形成了鲜明对比。\n\n作者们提起的诉讼声称，这些公司未经许可或补偿就利用了他们的作品。Kadrey et al. v. Meta Platforms 案的证据显示，Meta 的员工意识到他们的行为可能被认为是不恰当的，并且使用盗版内容的决定是在最高层批准的。"
  },
  {
    "id": "45818471",
    "title": "The Microsoft SoftCard for the Apple II: Getting two processors to share memory",
    "url": "https://devblogs.microsoft.com/oldnewthing/20251104-00/?p=111758",
    "summary": "The Microsoft SoftCard allowed Apple II users to run CP/M software by adding a Zilog Z80 processor, which ran CP/M, alongside the Apple II's existing 6502. The challenge was coordinating the two processors and sharing memory effectively.\n\nThe SoftCard cleverly used the Z80's REFRESH line to allow the 6502 brief execution windows, preventing register degradation while the Z80 was primarily in control. This enabled a cooperative multitasking system where the Z80 could signal the 6502 to perform specific tasks and then wait for a response.\n\nA significant hurdle was the different memory expectations of the Z80, 6502, and CP/M. The first 256 bytes of memory, along with other ranges used for system functions and I/O on the Apple II, clashed with the memory needs of the Z80 and CP/M. The SoftCard solved this with address translation circuitry, remapping the Z80's logical memory space. This moved Apple II specific memory ranges to the end of the Z80's memory map and provided CP/M programs with a continuous address space of RAM beginning at $0000. The SoftCard manual explained how to use this architecture and write cross-processor code.\n",
    "chinese_title": "Apple II 上的 Microsoft SoftCard：使两个处理器共享内存",
    "chinese_summary": "微软SoftCard通过添加Zilog Z80处理器，使Apple II用户能够运行CP/M软件。该处理器运行CP/M，与Apple II原有的6502处理器并行工作。挑战在于协调两个处理器并有效共享内存。\n\nSoftCard巧妙地利用Z80的REFRESH线，让6502拥有短暂的执行窗口，从而防止在Z80主要控制期间寄存器发生退化。这实现了一种协作式多任务系统，其中Z80可以向6502发出信号以执行特定任务，然后等待响应。\n\n一个重要的障碍是Z80、6502和CP/M对内存的不同需求。内存的前256个字节，以及Apple II上用于系统功能和I/O的其他范围，与Z80和CP/M的内存需求相冲突。SoftCard通过地址转换电路解决了这个问题，重新映射了Z80的逻辑内存空间。这使Apple II特定的内存范围移动到Z80内存映射的末尾，并为CP/M程序提供了从$0000开始的连续RAM地址空间。SoftCard手册解释了如何使用这种架构以及编写跨处理器代码。"
  },
  {
    "id": "45822513",
    "title": "Optimism associated with exceptional longevity (2019)",
    "url": "https://www.pnas.org/doi/10.1073/pnas.1900712116",
    "summary": "The article \"Optimism associated with exceptional longevity\" (2019) published in PNAS investigates the relationship between optimism and lifespan, specifically focusing on whether higher levels of optimism are associated with greater longevity and a higher likelihood of achieving \"exceptional longevity\" (living to age 85 or older).\n\nUsing data from two large, ongoing cohort studies – the Nurses’ Health Study and the Veterans Affairs Normative Aging Study – the researchers followed thousands of participants for decades, assessing their levels of optimism through self-reported questionnaires. After controlling for a range of potential confounders, including sociodemographic factors, health behaviors (diet, exercise, smoking, alcohol consumption), chronic conditions (diabetes, hypertension), and depression, the study found a significant positive association between optimism and lifespan.\n\nIndividuals with higher levels of optimism had, on average, an 11–15% longer lifespan and a significantly greater likelihood of achieving exceptional longevity compared to those with lower levels of optimism. This association held true even after accounting for various factors that could potentially influence both optimism and longevity.\n\nThe authors suggest that optimism may influence health and longevity through various mechanisms. Optimistic individuals may be more likely to engage in proactive health behaviors, have better coping mechanisms for stress, and maintain healthier social connections. While the study doesn't establish causation, it provides strong evidence for a positive correlation between optimism and exceptional longevity, highlighting the potential importance of psychological factors in promoting healthy aging and lifespan extension. The findings underscore the potential for interventions aimed at increasing optimism to improve health outcomes and promote longevity.\n",
    "chinese_title": "与长寿相关的乐观心态 (2019)",
    "chinese_summary": "乐观与长寿的关联\n        \n《美国国家科学院院刊》(PNAS) 发表的论文《乐观与长寿的关联》(2019) 探讨了乐观与寿命之间的关系，特别关注更高水平的乐观是否与更长的寿命以及实现“超常寿命”（活到85岁或以上）的更高可能性相关。\n\n研究人员利用两项大型、持续队列研究——护士健康研究和退伍军人事务部规范性衰老研究的数据，对数千名参与者进行了数十年的跟踪调查，并通过自我报告的问卷评估了他们的乐观程度。 在控制了一系列潜在的混杂因素后，包括社会人口统计因素、健康行为（饮食、运动、吸烟、饮酒）、慢性疾病（糖尿病、高血压）和抑郁症，该研究发现乐观与寿命之间存在显著的正相关关系。\n\n与乐观程度较低的个体相比，乐观程度较高的个体平均寿命延长了11-15%，并且达到超常寿命的可能性显著更高。 即使在考虑了可能影响乐观和寿命的各种因素之后，这种关联仍然成立。\n\n作者认为，乐观可能通过多种机制影响健康和寿命。 乐观的人可能更倾向于采取积极的健康行为，拥有更好的应对压力的机制，并保持更健康的社会关系。 虽然该研究并未建立因果关系，但它为乐观与超常寿命之间的正相关关系提供了强有力的证据，突出了心理因素在促进健康衰老和延长寿命方面的潜在重要性。 研究结果强调了旨在提高乐观情绪的干预措施在改善健康结果和促进长寿方面的潜力。"
  },
  {
    "id": "45812000",
    "title": "How devtools map minified JS code back to your TypeScript source code",
    "url": "https://www.polarsignals.com/blog/posts/2025/11/04/javascript-source-maps-internals",
    "summary": "This article explains how source maps enable developers to debug minified JavaScript code by mapping it back to the original TypeScript source.  It details the TypeScript build pipeline (transpilation, bundling, and minification) and how source maps preserve the connection to the original code at each stage.\n\nThe article then delves into the structure of a `.js.map` file, highlighting key fields like `version`, `file`, `sources`, `names`, and, most importantly, `mappings`. The `mappings` field contains compressed position data, answering the question of where each character in the minified file originated in the source code.\n\nA key component of source map compression is VLQ (Variable Length Quantity) encoding. The article explains how VLQ uses Base64 characters to represent position differences efficiently.  Each mapping segment can consist of 1, 4, or 5 values, representing the generated column, source file index, source line, source column, and optionally the original name of a variable/function. Commas separate segments on the same line, while semicolons denote line breaks in the generated file.\n\nThe core concept of VLQ is to represent numbers as deltas (differences from the previous position) and then encode them using a variable-length scheme.  The encoding process involves adding a sign bit, splitting the number into 5-bit groups, and mapping each group to a Base64 character.  This allows source maps to be significantly smaller than they would be if they stored absolute positions.\n\nIn essence, source maps are a clever and efficient way to bridge the gap between production-ready, optimized code and the developer-friendly source code, making debugging much easier.\n",
    "chinese_title": "Devtools如何将压缩后的JS代码映射回TypeScript源代码",
    "chinese_summary": "本文解释了源代码映射如何使开发者能够通过将压缩后的JavaScript代码映射回原始的TypeScript源代码来调试它。它详细介绍了TypeScript构建流程（转译、打包和压缩），以及源代码映射如何在每个阶段保持与原始代码的连接。\n\n本文然后深入探讨了`.js.map`文件的结构，重点介绍了关键字段，如`version`、`file`、`sources`、`names`，以及最重要的`mappings`。`mappings`字段包含压缩的位置数据，解答了压缩文件中每个字符在源代码中起源于何处的问题。\n\n源代码映射压缩的一个关键组成部分是VLQ（可变长度数量）编码。本文解释了VLQ如何使用Base64字符来有效地表示位置差异。每个映射段可以由1、4或5个值组成，分别代表生成的列、源文件索引、源行、源列，以及可选的变量/函数的原始名称。逗号分隔同一行上的段，而分号表示生成文件中的换行符。\n\nVLQ的核心概念是将数字表示为增量（与先前位置的差异），然后使用可变长度方案对其进行编码。编码过程包括添加符号位，将数字拆分为5位一组，并将每组映射到Base64字符。这使得源代码映射比存储绝对位置时要小得多。\n\n本质上，源代码映射是一种巧妙而有效的方式，可以弥合生产就绪、优化的代码与开发者友好的源代码之间的差距，从而使调试更加容易。"
  },
  {
    "id": "45811624",
    "title": "Google Cloud suspended customer's account 3 times, for 3 different reasons",
    "url": "https://www.theregister.com/2025/11/04/google_cloud_suspended_customers_account/",
    "summary": "Andrew Ayer, founder of SSLMate, details his frustrating experience with Google Cloud, which suspended his account three times for different reasons. SSLMate uses Google Cloud primarily for testing, experimentation, and integrations with customer accounts to manage SSL certificates. They utilize a system where a service account is created for each customer, authorized to access Cloud DNS and Cloud Domains, and impersonated by SSLMate when accessing customer Google Cloud accounts. Ayer based this on Google's documentation.\n\nThe first suspension occurred in May 2024, with Google alleging policy violations. Access was eventually restored after a difficult process, but then restricted again for a different reason. Ayer was never given the specific reasons or preventative measures. A subsequent health check was implemented, but it failed in late October due to another suspension for policy violations. This time, restoration was faster. The third suspension occurred last Friday, citing a terms of service violation, and initially resulted in a complete suspension, only reversed after Ayer shared his story on social media.\n\nAdding to the frustration, one customer integration inexplicably continued to function throughout all suspensions. Ayer is now considering abandoning Google Cloud, deeming it unreliable for production use due to the unpredictable nature of account suspensions affecting entire accounts, platforms, or individual projects. He suggests OpenID Connect (OIDC) as a potential workaround but finds its implementation overly complex, criticizing Google for not making secure alternatives easier to adopt. Ayer ultimately concludes that Google's system is unacceptable, as it inhibits the move away from long-lived credentials.\n",
    "chinese_title": "谷歌云因三个不同原因三次暂停客户账户。",
    "chinese_summary": "SSLMate创始人Andrew Ayer详述了他在谷歌云上令人沮丧的经历，他的账户因不同原因被暂停了三次。SSLMate主要使用谷歌云进行测试、实验以及与客户账户集成以管理SSL证书。他们采用一种系统，为每个客户创建一个服务账户，授权访问Cloud DNS和Cloud Domains，SSLMate在访问客户谷歌云账户时会模拟该账户。Ayer基于谷歌的文档构建了该系统。\n\n第一次暂停发生在2024年5月，谷歌声称存在违反政策的行为。经过一番艰难的过程，访问最终恢复，但随后又因其他原因受到限制。Ayer从未被告知具体原因或预防措施。后续实施了健康检查，但由于10月底再次因违反政策而被暂停而失败。这次恢复速度更快。第三次暂停发生在最近的星期五，理由是违反服务条款，最初导致完全暂停，直到Ayer在社交媒体上分享了他的故事才得以逆转。\n\n更令人沮丧的是，一个客户集成在所有暂停期间都莫名其妙地继续运行。Ayer现在正在考虑放弃谷歌云，认为由于账户暂停的不可预测性会影响整个账户、平台或单个项目，因此谷歌云不适合用于生产环境。他建议使用OpenID Connect (OIDC)作为潜在的解决方法，但发现其实现过于复杂，并批评谷歌没有让安全的替代方案更容易被采用。Ayer最终得出结论，谷歌的系统是不可接受的，因为它阻碍了从长期凭据的转变。"
  },
  {
    "id": "45810430",
    "title": "Chaining FFmpeg with a Browser Agent",
    "url": "https://100x.bot/a/chaining-ffmpeg-with-browser-agent",
    "summary": "This document describes chaining FFmpeg with a browser agent. The article, based on the title and the provided context, likely details how to integrate FFmpeg, a powerful multimedia framework, with a browser-based AI agent platform like \"100X.Bot\" (described as a \"100x All-in-One AI Agent Platform\").\n\nThe core concept revolves around combining the multimedia processing capabilities of FFmpeg with the AI-powered automation and interaction provided by a browser agent. This integration likely enables the agent to perform tasks involving multimedia content, such as:\n\n*   **Automated Media Editing/Processing:** The agent can use FFmpeg to automatically edit, transcode, or process videos, audio, and images based on AI-driven instructions or user requests.\n*   **Multimedia Analysis:** The agent could use FFmpeg to extract features from multimedia content and analyze them using AI models (e.g., object detection, speech recognition).\n*   **Dynamic Content Creation:** The agent could leverage FFmpeg to generate videos or audio dynamically based on data or user input.\n*   **Automated Publishing/Distribution:** The agent can automatically format media and upload it to various platforms using FFmpeg.\n\nEssentially, the combination enhances the browser agent's capabilities by giving it access to sophisticated multimedia manipulation tools through FFmpeg, controlled and orchestrated by AI. The \"100X.Bot\" platform likely simplifies this integration, providing a unified interface for managing both the agent and FFmpeg operations. The main benefit is increased efficiency and automation in multimedia-related workflows.\n",
    "chinese_title": "将FFmpeg与浏览器代理链接",
    "chinese_summary": "本文档描述了FFmpeg与浏览器代理的链式调用。该文章（根据标题和提供的上下文）可能详细介绍了如何将强大的多媒体框架FFmpeg与基于浏览器的AI代理平台（如“100X.Bot”，一个“100倍一体化AI代理平台”）集成。\n\n核心概念围绕着将FFmpeg的多媒体处理能力与浏览器代理提供的AI驱动的自动化和交互相结合。这种集成可能使代理能够执行涉及多媒体内容的任务，例如：\n\n*   **自动化媒体编辑/处理：** 代理可以使用FFmpeg根据AI驱动的指令或用户请求自动编辑、转码或处理视频、音频和图像。\n*   **多媒体分析：** 代理可以使用FFmpeg从多媒体内容中提取特征，并使用AI模型对其进行分析（例如，对象检测、语音识别）。\n*   **动态内容创建：** 代理可以利用FFmpeg根据数据或用户输入动态生成视频或音频。\n*   **自动化发布/分发：** 代理可以使用FFmpeg自动格式化媒体并将其上传到各种平台。\n\n本质上，这种结合通过使浏览器代理能够通过FFmpeg访问复杂的多媒体操作工具（由AI控制和编排），从而增强其能力。“100X.Bot”平台可能简化了这种集成，为管理代理和FFmpeg操作提供了一个统一的界面。主要优点是提高了多媒体相关工作流程的效率和自动化程度。"
  },
  {
    "id": "45832341",
    "title": "How I am deeply integrating Emacs",
    "url": "https://joshblais.com/blog/how-i-am-deeply-integrating-emacs/",
    "summary": "This article details the author's journey towards deeply integrating Emacs into their daily computing workflow, aiming to make it the central hub for most computer-based tasks, excluding heavy video or media work. The goal is to minimize friction between thought and action by leveraging Emacs's capabilities.\n\nThe author uses Hyprland as a window manager due to its stability and Wayland compatibility, contrasting it with GNOME where Emacs performance was an issue. They eschewed EXWM (Emacs as a window manager) due to its single-threaded nature and reliance on X11, opting instead to replicate its functionality in a Wayland environment.\n\nA key element is a Go script called \"emacs-launcher\" that allows quick access to Emacs commands from anywhere, significantly speeding up the workflow compared to previous Bash-based methods.\n\nThe author provides specific examples of their setup using Hyprland keybindings to launch various Emacs functionalities: a VTerm terminal, a universal launcher (replacing Wofi/Rofi), org-mode capture, quick access to notes, calendar/agenda, password manager, file browsing using dirvish/dired, bookmarks, email via mu4e, RSS feed reading via elfeed, and even music playback using EMMS. They also use a tool that allows them to edit text in any textbox with Emacs, then copy and paste that text to that box.\n\nThe author concludes by pondering EXWM and expressing interest in learning about other Emacs-centric workflows, inviting readers to share their setups.\n",
    "chinese_title": "我如何深度整合Emacs",
    "chinese_summary": "本文详细介绍了作者如何将 Emacs 深度集成到日常计算工作流程中，目标是使其成为大多数计算机任务的中心枢纽，但不包括繁重的视频或媒体工作。其目的是通过利用 Emacs 的功能来最大限度地减少思考和行动之间的摩擦。\n\n作者使用 Hyprland 作为窗口管理器，因为其稳定性和 Wayland 兼容性，这与 Emacs 性能存在问题的 GNOME 形成对比。他们避开了 EXWM（Emacs 作为窗口管理器），因为它具有单线程特性并依赖于 X11，而是选择在 Wayland 环境中复制其功能。\n\n一个关键元素是名为“emacs-launcher”的 Go 脚本，它可以从任何地方快速访问 Emacs 命令，与以前基于 Bash 的方法相比，大大加快了工作流程。\n\n作者提供了使用 Hyprland 键绑定的具体设置示例，以启动各种 Emacs 功能：VTerm 终端、通用启动器（取代 Wofi/Rofi）、org-mode 捕获、快速访问笔记、日历/议程、密码管理器、使用 dirvish/dired 的文件浏览、书签、通过 mu4e 的电子邮件、通过 elfeed 的 RSS 订阅阅读，甚至使用 EMMS 的音乐播放。他们还使用一个工具，允许他们在任何文本框中使用 Emacs 编辑文本，然后将该文本复制并粘贴到该框中。\n\n作者最后思考了 EXWM，并表示有兴趣了解其他以 Emacs 为中心的工作流程，邀请读者分享他们的设置。"
  },
  {
    "id": "45809876",
    "title": "Studio Ghibli, Bandai Namco, Square Enix Demand OpenAI to Stop Using Their IP",
    "url": "https://www.theverge.com/news/812545/coda-studio-ghibli-sora-2-copyright-infringement",
    "summary": "Studio Ghibli, Bandai Namco, and Square Enix, represented by the Content Overseas Distribution Association (CODA), are demanding that OpenAI cease using their copyrighted content to train its AI model, Sora 2. CODA argues that replicating content during the machine learning process constitutes copyright infringement, especially since Sora 2 has generated content featuring copyrighted characters.\n\nThe issue arose after Sora 2's launch on September 30th led to a surge of content referencing Japanese IP, prompting the Japanese government to formally request OpenAI to halt the replication of Japanese artwork. Examples include the \"Ghibli-style\" images generated by GPT-4o and even Sam Altman's X profile picture.\n\nWhile OpenAI announced changes to Sora's opt-out policy for IP holders, CODA argues that even the initial opt-out approach may have violated Japanese copyright law. They emphasize that Japanese copyright law typically requires prior permission for using copyrighted works and lacks a system for avoiding infringement through subsequent objections.\n\nCODA is now requesting that OpenAI respond to their members' copyright claims and stop using their content for machine learning without permission, encompassing both Sora's output and the use of Japanese IP as training data.\n",
    "chinese_title": "吉卜力、万代南梦宫、史克威尔艾尼克斯要求OpenAI停止使用其IP",
    "chinese_summary": "吉卜力、万代南梦宫和史克威尔艾尼克斯（由内容海外流通促进机构CODA代表）要求OpenAI停止使用其受版权保护的内容来训练其人工智能模型Sora 2。CODA认为，在机器学习过程中复制内容构成侵犯版权，尤其是在Sora 2生成了包含受版权保护角色的内容之后。\n\n该问题源于Sora 2于9月30日发布后，大量涌现的引用日本知识产权的内容，促使日本政府正式要求OpenAI停止复制日本艺术作品。例如，GPT-4o生成的“吉卜力风格”图像，甚至是山姆·奥特曼的X个人资料图片。\n\n尽管OpenAI宣布了针对知识产权持有者关于Sora选择退出的政策变更，但CODA认为，即使是最初的退出方式也可能违反了日本版权法。他们强调，日本版权法通常要求事先获得使用受版权保护作品的许可，并且缺乏通过事后反对来避免侵权的机制。\n\nCODA现在要求OpenAI回应其成员的版权主张，并停止在未经许可的情况下使用其内容进行机器学习，包括Sora的输出以及使用日本知识产权作为训练数据。"
  },
  {
    "id": "45822071",
    "title": "The grim truth behind the Pied Piper (2020)",
    "url": "https://www.bbc.com/travel/article/20200902-the-grim-truth-behind-the-pied-piper",
    "summary": "This BBC article explores the historical basis and enduring legacy of the Pied Piper legend. While popularized by the Grimm Brothers and Robert Browning, the tale likely stems from an actual event in Hamelin, Germany, in 1284 where 130 children vanished.\n\nThe article details how Hamelin embraces the legend through tourism and Piper-themed merchandise but highlights the underlying primal fear the story evokes – the loss of children. Historical records, including inscriptions and town chronicles, support the event's occurrence, adding to the mystery.\n\nSeveral theories attempt to explain the disappearance. One prominent theory suggests the children were part of a migration to Eastern Europe, with the Piper acting as a recruiter. Another links the event to a \"dancing mania\" epidemic, while more fanciful theories suggest a children's crusade or the Black Death.\n\nHowever, the article emphasizes the specific date of June 26th, linked to pagan midsummer celebrations, and a possible massacre of children by local Christians during pagan festivities to solidify conversion of the region.\n\nDespite the tragedy, the Pied Piper legend has become a global phenomenon, appearing in art, literature, and music across numerous countries and languages, connecting people through shared cultural heritage. The article concludes that while the Piper may have caused a community fracture in the past, the story now fosters a larger global community.\n",
    "chinese_title": "吹笛人背后的残酷真相 (2020)",
    "chinese_summary": "BBC文章：花衣魔笛手的历史根源与不朽遗产\n\n这篇BBC文章探讨了花衣魔笛手传说的历史依据和持久遗产。这个故事虽然由格林兄弟和罗伯特·勃朗宁普及，但很可能源于1284年德国哈默尔恩发生的真实事件，当时有130名儿童失踪。\n\n文章详细介绍了哈默尔恩如何通过旅游业和以魔笛手为主题的商品来拥抱这个传说，但同时也突出了这个故事所唤起的一种潜在的原始恐惧——失去孩子。包括铭文和城镇编年史在内的历史记录支持了这一事件的发生，增加了其神秘性。\n\n一些理论试图解释这一失踪事件。一个突出的理论认为，这些孩子是前往东欧的移民的一部分，而魔笛手充当了招募人员。另一种理论将这一事件与“舞蹈狂热”流行病联系起来，而更异想天开的理论则认为是儿童十字军东征或黑死病。\n\n然而，文章强调了与异教仲夏节庆典相关的6月26日这个特定日期，以及当地基督徒在异教节日期间可能对儿童进行的大屠杀，以巩固该地区的皈依。\n\n尽管发生了悲剧，花衣魔笛手的传说已成为一种全球现象，出现在众多国家和语言的艺术、文学和音乐中，通过共享的文化遗产将人们联系在一起。文章总结说，虽然魔笛手过去可能导致了社区分裂，但这个故事现在却促进了一个更大的全球社区。"
  },
  {
    "id": "45816879",
    "title": "Patching 68K Software – SimpleText",
    "url": "https://tinkerdifferent.com/threads/patching-68k-software-simpletext.4793/",
    "summary": "David Cook details his frustrating journey patching SimpleText to open with a smaller text window at startup. Initially expecting a simple constant overwrite, he discovered the need for a complex code injection.\n\nThe primary challenge was avoiding resizing non-text windows (pictures, video, About box).  Because directly inserting code shifts subsequent code and breaks jumps, he opted to jump out to custom code appended to the 'CODE' resource, perform the size adjustment, and then return. This involved overwriting existing code, requiring him to preserve critical functionality, such as getting MBarHeight.\n\nHe needed to patch the window resizing code in two separate locations. He stored the result of the first patch (indicating a custom window size) within the code itself as a workaround for lacking global variables or readily available registers. He then checked this stored result in the second patch to determine if the custom size should be applied.\n\nCook also shares several tricks he learned during the process: directly calling system routines to avoid library bloat, using register passing in C functions, replacing `BSR` with `JSR`, placing called routines before calling routines for short relative jumps, and the importance of understanding literal storage in 'CODE' resources. He created a custom resource to easily redefine window sizes in the future and provides a patched version of SimpleText. The article serves as a guide, offering practical insights for others attempting to patch old 68K software.\n",
    "chinese_title": "修补68K软件 – SimpleText",
    "chinese_summary": "大卫·库克详述了他修复SimpleText，使其启动时以较小文本窗口打开的令人沮丧的历程。最初他期望一个简单的常量覆盖就能解决问题，但后来发现需要进行复杂的代码注入。\n\n主要的挑战是避免调整非文本窗口（图片、视频、关于框）的大小。由于直接插入代码会移动后续代码并破坏跳转，他选择跳出到附加在 'CODE' 资源中的自定义代码，执行大小调整，然后再返回。这涉及覆盖现有代码，需要他保留关键功能，例如获取 MBarHeight。\n\n他需要在两个不同的位置修补窗口大小调整代码。他将第一个补丁的结果（指示自定义窗口大小）存储在代码本身中，作为缺乏全局变量或容易获得的寄存器的替代方案。然后，他在第二个补丁中检查这个存储的结果，以确定是否应该应用自定义大小。\n\n库克还分享了他在这个过程中学到的几个技巧：直接调用系统例程以避免库膨胀，在 C 函数中使用寄存器传递，用 `JSR` 替换 `BSR`，将被调用例程放在调用例程之前以便进行短相对跳转，以及理解 'CODE' 资源中文字存储的重要性。他创建了一个自定义资源以便将来可以轻松地重新定义窗口大小，并提供了一个已修补的 SimpleText 版本。这篇文章可作为指南，为其他试图修补旧的 68K 软件的人提供实用的见解。"
  },
  {
    "id": "45830223",
    "title": "Recursive macros in C, demystified (once the ugly crying stops)",
    "url": "https://h4x0r.org/big-mac-ro-attack/",
    "summary": "This article delves into the frustrating limitations of C macros, specifically their inability to handle recursion, and explores techniques to circumvent this restriction. The author, a seasoned C programmer, expresses a strong dislike for the macro system due to its subtleties and lack of modern features found in other languages.\n\nDespite the drawbacks, C macros remain crucial for compile-time execution, especially for tasks like adding sanity checks, type checking, and abstracting complexity. The core challenge explored is creating a macro that counts the number of variable arguments passed to it, a capability absent in standard C.\n\nThe author demonstrates a naive initial attempt using `__VA_OPT__` and macros that fails due to the preprocessor's handling of \"recursive\" macro calls. Instead of recursing, the preprocessor treats the unexpanded macro as plain text, passing it on to the C compiler which then throws seemingly unrelated errors. This disconnect between the preprocessor and compiler makes debugging macro-related issues difficult. The author emphasizes that it's critical to understand what the preprocessor is actually producing and suggests using the `-E` flag to view the expanded code. Ultimately, the article sets the stage for demonstrating more advanced techniques to achieve compile-time recursion in C macros, despite the inherent limitations.\n",
    "chinese_title": "C语言中的递归宏，解密（一旦丑陋的哭泣停止）",
    "chinese_summary": "本文深入探讨了 C 宏令人沮丧的局限性，特别是它们无法处理递归的问题，并探索了规避此限制的技巧。作者是一位经验丰富的 C 程序员，他表达了对宏系统的强烈不满，因为它过于微妙并且缺乏其他语言中的现代特性。\n\n尽管存在缺点，C 宏对于编译时执行仍然至关重要，尤其是在添加健全性检查、类型检查和抽象复杂性等任务中。本文探讨的核心挑战是创建一个宏，它可以统计传递给它的可变参数的数量，这是标准 C 中所缺乏的功能。\n\n作者展示了一个使用 `__VA_OPT__` 和宏的天真初始尝试，但由于预处理器处理“递归”宏调用的方式而失败。预处理器没有递归，而是将未扩展的宏视为纯文本，将其传递给 C 编译器，然后 C 编译器会抛出看似不相关的错误。预处理器和编译器之间的这种脱节使得调试宏相关问题变得困难。作者强调理解预处理器实际产生的内容至关重要，并建议使用 `-E` 标志来查看扩展后的代码。最终，本文为展示更高级的技术奠定了基础，以在 C 宏中实现编译时递归，尽管存在固有的局限性。"
  },
  {
    "id": "45829210",
    "title": "The Basic Laws of Human Stupidity (1987) [pdf]",
    "url": "https://gandalf.fee.urv.cat/professors/AntonioQuesada/Curs1920/Cipolla_laws.pdf",
    "summary": "I am sorry, but I cannot provide a concise summary of this article because the content is not readable. It is PDF code, and does not contain the text of the actual article.",
    "chinese_title": "人类愚蠢基本定律 (1987) [pdf]",
    "chinese_summary": "很抱歉，我无法提供本文的简洁摘要，因为内容不可读。它是PDF代码，不包含实际文章的文本。"
  },
  {
    "id": "45814461",
    "title": "Amazon Demands Perplexity Stop AI Agent from Making Purchases",
    "url": "https://www.bloomberg.com/news/articles/2025-11-04/amazon-demands-perplexity-stop-ai-agent-from-making-purchases",
    "summary": "Unable to access the article link.\n",
    "chinese_title": "亚马逊要求 Perplexity 停止 AI 代理购物",
    "chinese_summary": "无法访问文章链接。"
  },
  {
    "id": "45822982",
    "title": "A P2P Vision for QUIC (2024)",
    "url": "https://seemann.io/posts/2024-10-26---p2p-quic/",
    "summary": "This article explores how QUIC can simplify and improve NAT traversal for P2P networking, offering a comprehensive solution encompassing address discovery, hole punching, and UDP proxying. It contrasts the traditional, complex approach using STUN, ICE, and TURN with a QUIC-based alternative.\n\nThe traditional method involves STUN for address discovery, ICE for coordinating hole punching (simultaneous packet sending to open NAT firewalls), and TURN for relaying traffic when hole punching fails. This multi-protocol approach is often unreliable due to unpredictable NAT behavior and incurs relaying costs.\n\nThe proposed QUIC approach leverages QUIC's connection migration feature, designed for seamless network switching, and extends it for P2P use.  Address discovery is handled within the QUIC connection using a new `OBSERVED_ADDRESS` frame, eliminating the need for a separate STUN service.  Hole punching is coordinated through `ADD_ADDRESS` and `PUNCH_ME_NOW` frames, triggering path probing with `PATH_CHALLENGE` and `PATH_RESPONSE` frames, effectively creating NAT bindings.\n\nFor relaying, the article proposes using HTTP UDP proxying with QUIC streams and DATAGRAM frames.  While clients can initiate UDP flows through the proxy, the challenge remains of allowing other nodes to initiate contact.\n\nThe benefits of using QUIC for NAT traversal include encryption, simplified infrastructure (no separate STUN servers), and integration within a single protocol. However, it raises security concerns regarding spoofed addresses in new QUIC frames and the need for defenses. The process also is limited by the number of connection IDs available to perform parallel attemps.\n",
    "chinese_title": "QUIC的P2P愿景 (2024)",
    "chinese_summary": "本文探讨了QUIC如何简化和改进P2P网络的NAT穿越，提供了一个包含地址发现、打洞和UDP代理的综合解决方案。它将传统的、复杂的STUN、ICE和TURN方法与基于QUIC的替代方案进行了对比。\n\n传统方法涉及使用STUN进行地址发现，使用ICE协调打洞（同时发送数据包以打开NAT防火墙），以及在打洞失败时使用TURN中继流量。这种多协议方法通常由于不可预测的NAT行为而不可靠，并且会产生中继成本。\n\n所提出的QUIC方法利用QUIC的连接迁移特性（专为无缝网络切换而设计），并将其扩展到P2P使用。地址发现通过QUIC连接中使用新的`OBSERVED_ADDRESS`帧来处理，从而消除了对单独STUN服务的需求。打洞通过`ADD_ADDRESS`和`PUNCH_ME_NOW`帧进行协调，触发使用`PATH_CHALLENGE`和`PATH_RESPONSE`帧进行路径探测，从而有效地创建NAT绑定。\n\n对于中继，本文建议使用带有QUIC流和DATAGRAM帧的HTTP UDP代理。虽然客户端可以通过代理启动UDP流，但允许其他节点发起联系仍然是一个挑战。\n\n使用QUIC进行NAT穿越的优势包括加密、简化的基础设施（无需单独的STUN服务器）以及集成在单个协议中。然而，它引发了对新QUIC帧中伪造地址以及需要防御措施的安全担忧。该过程还受到可用于执行并行尝试的连接ID数量的限制。"
  },
  {
    "id": "45822650",
    "title": "Why Your Best Engineers Are Interviewing Elsewhere, CodeGood",
    "url": "https://codegood.co/writing/why-your-best-engineers-are-interviewing-elsewhere",
    "summary": "This CodeGood article argues that high engineer turnover stems from a failure of information flow within organizational hierarchies, leading executives to make ill-informed decisions and creating a culture where engineers feel undervalued and unheard. The author contends that traditional chain-of-command structures inadvertently filter out critical information, suppressing early warnings of problems and frustrations.\n\nThe article highlights three primary reasons why engineers leave: loss of agency (being forced to build systems they know will fail), unpayable technical debt (critical infrastructure needs being constantly deprioritized), and being forced to do stupid work (senior engineers wasting their skills on trivial tasks). These issues are often masked by exit interviews citing \"competitive compensation,\" which the author argues is a socially acceptable but often inaccurate explanation.\n\nThe solution proposed is to break down communication barriers through skip-level conversations, allowing executives to directly engage with engineers at all levels and gain unfiltered insights into the true state of the organization. The article provides examples of how early intervention, based on this direct feedback, can address underlying issues, boost morale, and significantly reduce attrition. By prioritizing open communication and valuing engineers' expertise, companies can retain valuable talent and avoid the costly consequences of high turnover. The author emphasizes that a few hours a week dedicated to direct conversations are far more valuable than relying on filtered reports that lead to flawed strategic decisions.\n",
    "chinese_title": "你的顶尖工程师为何在别处面试，CodeGood",
    "chinese_summary": "这篇CodeGood文章认为，工程师高流失率源于组织层级内部信息流动不畅，导致管理层做出不明智的决策，并营造出一种工程师感觉不被重视和不被倾听的文化。作者认为，传统的指挥链结构无意中过滤掉了关键信息，压制了问题的早期预警和挫折感。\n\n文章强调了工程师离职的三个主要原因：自主性丧失（被迫构建他们明知会失败的系统）、无法偿还的技术债务（关键基础设施需求不断被降低优先级），以及被迫做愚蠢的工作（资深工程师将他们的技能浪费在琐碎的任务上）。这些问题通常被离职面谈中提到的“有竞争力的薪酬”所掩盖，作者认为这是一种社会上可以接受但往往不准确的解释。\n\n文章提出的解决方案是通过越级对话打破沟通障碍，使管理层能够直接与各个级别的工程师互动，并获得对组织真实状态的未经过滤的见解。文章举例说明了基于这种直接反馈的早期干预如何解决潜在问题，提高士气，并显著降低人员流失。通过优先考虑开放式沟通和重视工程师的专业知识，公司可以留住宝贵的人才，并避免高流失率带来的高昂代价。作者强调，每周花费几个小时进行直接对话，远比依赖导致战略决策错误的经过过滤的报告更有价值。"
  },
  {
    "id": "45818499",
    "title": "Preventing Kubernetes from pulling the pause image from the internet",
    "url": "https://kyle.cascade.family/posts/preventing-kubernetes-from-pulling-the-pause-image-from-the-internet/",
    "summary": "生成摘要时出错",
    "chinese_title": "Preventing Kubernetes from pulling the pause image from the internet",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45827661",
    "title": "A Lost IBM PC/at Model? Analyzing a Newfound Old Bios",
    "url": "https://int10h.org/blog/2025/11/lost-ibm-at-model-bios-analysis/",
    "summary": "生成摘要时出错",
    "chinese_title": "A Lost IBM PC/at Model? Analyzing a Newfound Old Bios",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45809866",
    "title": "Over $70T of inherited wealth over next decade will widen inequality, economists",
    "url": "https://www.theguardian.com/inequality/2025/nov/03/more-than-70tn-of-inherited-wealth-over-next-decade-will-widen-inequality-economists-warn",
    "summary": "A report by economists and campaigners warns that over $70 trillion of inherited wealth will exacerbate global inequality over the next decade, necessitating intervention by the G20. The report, commissioned by South African President Cyril Ramaphosa, found inequality growing in over 80% of the world's countries. It highlights that high inequality correlates with democratic decline.\n\nThe expert panel recommends the G20 establish a permanent panel to monitor inequality trends, assess consequences, and evaluate policies to address the issue, similar to the UN's climate change panel. Economist Joseph Stiglitz emphasizes the link between widening inequality, weakened democratic institutions, and rising populism.\n\nThe report highlights that between 2000 and 2024, the top 1% captured 41% of new wealth, while the bottom 50% received only 1%. A study estimates that $70 trillion will be passed down as inheritance by 2035, further fueling wealth inequality due to compound interest and the absence of effective inheritance taxes, hindering social mobility and economic efficiency. The report suggests addressing inequality as a generational challenge, presenting pragmatic steps for reduction, and aligns with South Africa's G20 agenda.\n",
    "chinese_title": "Over $70T of inherited wealth over next decade will widen inequality, economists",
    "chinese_summary": "A report by economists and campaigners warns that over $70 trillion of inherited wealth will exacerbate global inequality over the next decade, necessitating intervention by the G20. The report, commissioned by South African President Cyril Ramaphosa, found inequality growing in over 80% of the world's countries. It highlights that high inequality correlates with democratic decline.\n\nThe expert panel recommends the G20 establish a permanent panel to monitor inequality trends, assess consequences, and evaluate policies to address the issue, similar to the UN's climate change panel. Economist Joseph Stiglitz emphasizes the link between widening inequality, weakened democratic institutions, and rising populism.\n\nThe report highlights that between 2000 and 2024, the top 1% captured 41% of new wealth, while the bottom 50% received only 1%. A study estimates that $70 trillion will be passed down as inheritance by 2035, further fueling wealth inequality due to compound interest and the absence of effective inheritance taxes, hindering social mobility and economic efficiency. The report suggests addressing inequality as a generational challenge, presenting pragmatic steps for reduction, and aligns with South Africa's G20 agenda.\n"
  },
  {
    "id": "45815515",
    "title": "How AGI became the most consequential conspiracy theory of our time",
    "url": "https://www.technologyreview.com/2025/10/30/1127057/agi-conspiracy-theory-artifcial-general-intelligence/",
    "summary": "生成摘要时出错",
    "chinese_title": "How AGI became the most consequential conspiracy theory of our time",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45810856",
    "title": "Show HN: I built a local-first daily planner for iOS",
    "url": "https://apps.apple.com/ca/app/to-do-list-planner-zesfy/id6479947874",
    "summary": "生成摘要时出错",
    "chinese_title": "Show HN: I built a local-first daily planner for iOS",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45816191",
    "title": "BlackRock's Larry Fink: \"Tokenization\", Digital IDs, & Social Credit",
    "url": "https://thewinepress.substack.com/p/tokenization-blackrocks-larry-fink",
    "summary": "生成摘要时出错",
    "chinese_title": "BlackRock's Larry Fink: \"Tokenization\", Digital IDs, & Social Credit",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45813310",
    "title": "Launch HN: Plexe (YC X25) – Build production-grade ML models from prompts",
    "url": "https://www.plexe.ai/",
    "summary": "生成摘要时出错",
    "chinese_title": "Launch HN: Plexe (YC X25) – Build production-grade ML models from prompts",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45811623",
    "title": "Tesla's ‘Robotaxis' Keep Crashing—Even With Human ‘Safety Monitors' Onboard",
    "url": "https://www.miamiherald.com/news/business/article312728957.html",
    "summary": "生成摘要时出错",
    "chinese_title": "Tesla's ‘Robotaxis' Keep Crashing—Even With Human ‘Safety Monitors' Onboard",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45809932",
    "title": "Former US Vice-President Cheney Dies",
    "url": "https://www.reuters.com/world/us/former-us-vp-dick-cheney-dead-84-punchbowl-news-says-2025-11-04/",
    "summary": "生成摘要时出错",
    "chinese_title": "Former US Vice-President Cheney Dies",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45816260",
    "title": "US gives local police a face-scanning app similar to one used by ICE agents",
    "url": "https://arstechnica.com/tech-policy/2025/11/us-gives-local-police-a-face-scanning-app-similar-to-one-used-by-ice-agents/",
    "summary": "生成摘要时出错",
    "chinese_title": "US gives local police a face-scanning app similar to one used by ICE agents",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45816217",
    "title": "CPUs and GPUs to Become More Expensive After TSMC Price Hike in 2026",
    "url": "https://www.guru3d.com/story/cpus-and-gpus-to-become-more-expensive-after-tsmc-price-hike-in-2026/",
    "summary": "生成摘要时出错",
    "chinese_title": "CPUs and GPUs to Become More Expensive After TSMC Price Hike in 2026",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45815279",
    "title": "Singapore to cane scammers as billions lost in financial crimes",
    "url": "https://www.freemalaysiatoday.com/category/highlight/2025/11/04/singapore-to-cane-scammers-as-billions-lost-in-financial-crimes",
    "summary": "生成摘要时出错",
    "chinese_title": "Singapore to cane scammers as billions lost in financial crimes",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45828742",
    "title": "Microsoft and Google overstate job creation at Chile data centers",
    "url": "https://restofworld.org/2025/data-centers-jobs-microsoft-google-chile/",
    "summary": "生成摘要时出错",
    "chinese_title": "Microsoft and Google overstate job creation at Chile data centers",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45816981",
    "title": "Analyzing the Performance of WebAssembly vs. Native Code",
    "url": "https://ar5iv.labs.arxiv.org/html/1901.09056",
    "summary": "生成摘要时出错",
    "chinese_title": "Analyzing the Performance of WebAssembly vs. Native Code",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45827314",
    "title": "Tesla's German car sales more than halve in October as wider EV sales jump",
    "url": "https://www.reuters.com/business/autos-transportation/teslas-german-car-sales-more-than-halved-october-2025-11-05/",
    "summary": "生成摘要时出错",
    "chinese_title": "Tesla's German car sales more than halve in October as wider EV sales jump",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45826971",
    "title": "Fiber reduces overall mortality by 23%",
    "url": "https://www.empirical.health/blog/dietary-fiber-reduces-all-cause-morality/",
    "summary": "生成摘要时出错",
    "chinese_title": "Fiber reduces overall mortality by 23%",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45818282",
    "title": "GM Deprecating In-Car App Store for Models as Recent as 2020",
    "url": "https://gmauthority.com/blog/2025/11/these-gm-vehicles-can-no-longer-download-apps-through-their-infotainment-system/",
    "summary": "生成摘要时出错",
    "chinese_title": "GM Deprecating In-Car App Store for Models as Recent as 2020",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45812806",
    "title": "USDA Threatens Stores Giving Discounts to People on Food Stamps",
    "url": "https://newrepublic.com/post/202604/usda-threatens-grocery-stores-discounts-people-food-stamps",
    "summary": "生成摘要时出错",
    "chinese_title": "USDA Threatens Stores Giving Discounts to People on Food Stamps",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45827352",
    "title": "I Stopped Being a Climate Catastrophist",
    "url": "https://www.breakthroughjournal.org/p/why-i-stopped-being-a-climate-catastrophist",
    "summary": "生成摘要时出错",
    "chinese_title": "I Stopped Being a Climate Catastrophist",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45813417",
    "title": "The Rust Foundation Maintainers Fund",
    "url": "https://rustfoundation.org/media/announcing-the-rust-foundation-maintainers-fund/",
    "summary": "生成摘要时出错",
    "chinese_title": "The Rust Foundation Maintainers Fund",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45820192",
    "title": "Zohran Mamdani wins NYC mayor's race, capping an ascent",
    "url": "https://apnews.com/article/mamdani-cuomo-sliwa-nyc-mayor-af8b9790e7cb4e023d0984a0207cbcca",
    "summary": "生成摘要时出错",
    "chinese_title": "Zohran Mamdani wins NYC mayor's race, capping an ascent",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45823313",
    "title": "Michael Burry is back with two bets against Nvidia and Palantir",
    "url": "https://www.cnn.com/2025/11/05/business/nvidia-palantir-michael-burry-stock",
    "summary": "生成摘要时出错",
    "chinese_title": "Michael Burry is back with two bets against Nvidia and Palantir",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45818089",
    "title": "Cargo plane crashes at Kentucky airport",
    "url": "https://www.bbc.com/news/live/c201kgq59qgt",
    "summary": "生成摘要时出错",
    "chinese_title": "Cargo plane crashes at Kentucky airport",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45833162",
    "title": "Mathematical Exploration and Discovery at Scale",
    "url": "https://terrytao.wordpress.com/2025/11/05/mathematical-exploration-and-discovery-at-scale/",
    "summary": "生成摘要时出错",
    "chinese_title": "Mathematical Exploration and Discovery at Scale",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45826975",
    "title": "Apple nears $1B Google deal for custom Gemini model to power Siri",
    "url": "https://9to5mac.com/2025/11/05/google-gemini-1-billion-deal-apple-siri/",
    "summary": "生成摘要时出错",
    "chinese_title": "Apple nears $1B Google deal for custom Gemini model to power Siri",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45809644",
    "title": "Building blobd: single-machine object store with sub-ms reads and 15 GB/s upload",
    "url": "https://blog.wilsonl.in/blobd/",
    "summary": "生成摘要时出错",
    "chinese_title": "Building blobd: single-machine object store with sub-ms reads and 15 GB/s upload",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45813148",
    "title": "Data breach at major Swedish software supplier impacts 1.5M",
    "url": "https://www.bleepingcomputer.com/news/security/data-breach-at-major-swedish-software-supplier-impacts-15-million/",
    "summary": "生成摘要时出错",
    "chinese_title": "Data breach at major Swedish software supplier impacts 1.5M",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45816195",
    "title": "74% of CEOs worry AI failures could cost them their jobs",
    "url": "https://cfo.economictimes.indiatimes.com/news/74-of-ceos-worry-ai-failures-could-cost-them-their-jobs-report/118923383",
    "summary": "生成摘要时出错",
    "chinese_title": "74% of CEOs worry AI failures could cost them their jobs",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45822899",
    "title": "Gov Shutdown: US Army is advising its soldiers in Germany to go to food banks",
    "url": "https://old.reddit.com/r/worldnews/comments/1oozpq5/the_us_army_is_advising_its_soldiers_in_germany/",
    "summary": "生成摘要时出错",
    "chinese_title": "Gov Shutdown: US Army is advising its soldiers in Germany to go to food banks",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45823358",
    "title": "Kosmos: An AI Scientist for Autonomous Discovery",
    "url": "https://arxiv.org/abs/2511.02824",
    "summary": "生成摘要时出错",
    "chinese_title": "Kosmos: An AI Scientist for Autonomous Discovery",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45815857",
    "title": "Paramount blacklists actors for pro-Palestinian activism",
    "url": "https://www.worldofreel.com/blog/2025/11/4/paramount-has-blacklisted-talent-deemed-overtly-antisemitic",
    "summary": "生成摘要时出错",
    "chinese_title": "Paramount blacklists actors for pro-Palestinian activism",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45828203",
    "title": "US may cut air traffic 10% by Friday without shutdown deal, sources say",
    "url": "https://www.reuters.com/business/aerospace-defense/us-may-cut-air-traffic-10-by-friday-without-shutdown-deal-sources-say-2025-11-05/",
    "summary": "生成摘要时出错",
    "chinese_title": "US may cut air traffic 10% by Friday without shutdown deal, sources say",
    "chinese_summary": "生成摘要时出错"
  },
  {
    "id": "45815010",
    "title": "Cheaper MacBook powered by iPhone chip coming in 2026, per new report",
    "url": "https://9to5mac.com/2025/11/04/cheaper-macbook-powered-by-iphone-chip-coming-in-2026-per-new-report/",
    "summary": "生成摘要时出错",
    "chinese_title": "Cheaper MacBook powered by iPhone chip coming in 2026, per new report",
    "chinese_summary": "生成摘要时出错"
  }
]